[{"id":"3264716106","userName":"Schmidty7482","userUrl":"https://itunes.apple.com/us/reviews/id32676029","version":"5.2.02","score":3,"title":"Good, but.....","text":"App & cameras are decent; my only request is to make an update that allows me to turn off notifications within the app. I do not care about notifications when someone moves in front of the camera. I’ve got 4 kids & 4 animals in my house; I would think that feature should be optional","updated":"2018-10-04T19:23:50-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"2931839844","userName":"wow10001100","userUrl":"https://itunes.apple.com/us/reviews/id575100685","version":"4.1.16","score":5,"title":"Re-review","text":"I reviewed this app and their associated hardware at a 1 star rating about 6 months ago. The company replaced one faulty camera and after the firmware patch I feel a 5 star rating is warranted.  I no longer have connectivity issues and if I reset my WiFi network the cameras automatically recognize and reconnect to the network. This company has made significant improvements to their product and if you were frustrated like I was and moved away from them, I’d try it out again and see that there is real value at this price. My only criticism is that I wish they had a viable battery operated camera that could compete with other fully wireless cameras like arlo.","updated":"2018-07-18T19:42:38-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"5926222110","userName":"Nickickk","userUrl":"https://itunes.apple.com/us/reviews/id510628438","version":"5.2.06","score":1,"title":"Horrible company","text":"I have the CHS1AWACS model WiFi camera and this specific camera does not support motion detection. It does not support push notifications. It does not support video recording. It has a memory card slot but it does not support memory card. Are you kidding me? What am I wasting my money on?? All I can do is view live and that’s it. DO NOT ask me to email you for further assistance, you already gave me assistance and this is what the results are! This company has converted all their cameras and systems to run on cloud service to make more money. Horrible app, horrible cameras, horrible company! This camera is still being sold everywhere and it doesn’t even work! This is just sad. 1 star.  Tomorrow I am returning these cameras. I am not going to purchase your updated “cloud” cameras as a solution. Good bye!! 👋","updated":"2020-05-09T21:27:01-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"5129202292","userName":"GCSLynx","userUrl":"https://itunes.apple.com/us/reviews/id862214542","version":"5.2.02","score":2,"title":"Seems things have changed","text":"This app/camera was decent enough. It did what it needed to do. But I’ve noticed I’m not getting alerts even though I know there is movement. My settings haven’t changed.  One day all my videos were there and then gone the next. Now it seems it only keeps videos for two days. Some days features won’t load even if I’m on WiFi. Had to re set up my camera. My phone and camera had to be sitting on top of the router for it to all connect. Was thinking of getting a second camera- but might go with a different company.","updated":"2019-11-12T13:54:39-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1790299016","userName":"DA. Alabama","userUrl":"https://itunes.apple.com/us/reviews/id438695984","version":"4.1.14","score":4,"title":"Good update","text":"I like the update but what devices work with lighting and the other options. For those who are complaining try updating the firmware on the devices and checking your device setting along with settings under the different modes I.e. AWAY,HOME,SLEEP,  etc...There are a lot of new features such as better sound and longer video clips. \n\nI would opt out of the cloud service. A little pricey for the service for one camera. I have a lot of cameras indoor and outdoor and it does not pay to do this","updated":"2017-09-14T17:28:59-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"6480490742","userName":"New World translation","userUrl":"https://itunes.apple.com/us/reviews/id228519287","version":"6.0.6","score":1,"title":"We’ve had nothing but problems","text":"There seems to always be a problem with the system. Less than six months after we purchased the product, we started having unexplained issues with the system and cameras. At first, two of the four cameras went out and the company sent us replacements. Then two others went out but we were out of warranty. Now only one of the four cameras is working. As was mentioned on another review, many times I’m right here at home watching from the window, movements that the camera should pick up but it doesn’t. Not good nor reliable system at all.","updated":"2020-09-29T03:35:41-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"6133195235","userName":"Bit Sniff","userUrl":"https://itunes.apple.com/us/reviews/id761713979","version":"6.0.2","score":4,"title":"Do Not Update. Delete phone app. Reinstall new copy from App Store","text":"It seems like recent update was more than just bug fixes. The whole app looks redesigned. As the title states, (1) delete app, (2) reinstall new copy of app and (3) login with original info. This has worked for me. I’m back online viewing cameras. Hope this helps. Minus a star to developer for not providing clear description of the update and step-by-step instructions.","updated":"2020-06-28T13:08:18-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"3979201362","userName":"DS Spf MO","userUrl":"https://itunes.apple.com/us/reviews/id1002146659","version":"5.2.02","score":2,"title":"Functional app but not perfect","text":"App works. Alerts work. I like the fact that playback has an orange mark showing where activity was. \n\nThings I wish it had: \nCheaper or better playback storage option. Wishlist item. \n\n-actual things that can be easily changed, be able to see live feeds or 2 and 4 cameras at once. Just split screen or 4 way the screen. Right now you can only watch one at a time. \n\n-be able to fast forward playback. Yes it has an activity mark, but I’d rather be able to scroll through a 4 hour window by fast forwarding. 2x, 4x 10x fast forward. Those two main items would make this a much better experience. I understand playback storage can be charged for it’s just that some other camera companies don’t charge for that and not necessarily the apps fault more so the camera. So mostly the watch 4 at once and fast forward feedback","updated":"2019-04-06T15:14:14-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"6137003576","userName":"Burnz442","userUrl":"https://itunes.apple.com/us/reviews/id38300138","version":"6.0.2","score":1,"title":"Absolutely the worse app ever","text":"Always having trouble with the app but could work around the issues. Until yesterday all of my cameras have disappeared from the app and it doesn’t want to recognize any of the 9 I had hooked up. It’s not the WiFi it’s not the camera it’s the app. Looks like they updated the app but in reality they made it in-op nothing works...they don’t answer the phone you can’t leave a message and the in app support is never there...it’s a joke completely a joke. Don’t buy their cameras and whatever you do don’t download the app it’s a complete waste of time!!","updated":"2020-06-29T12:01:04-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"2125797530","userName":"Bluiz99","userUrl":"https://itunes.apple.com/us/reviews/id174276622","version":"4.1.16","score":5,"title":"Seems good","text":"I see all the bad reviews but after I connected the internet to the (1) camera- the image is pretty good. It catches the action that my pets make so I’m assuming it will work for what it’s intended for. The update issue that everyone is complaining about must be fixed. I operate this from and iPhone 7. Again I only have one camera so that might limit the issues. But I’m pleased with it so far.","updated":"2018-01-25T08:18:35-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"4094552051","userName":"ourpact","userUrl":"https://itunes.apple.com/us/reviews/id310431050","version":"5.2.02","score":4,"title":"Useful for me...","text":"I love these cameras, because I can see just what is happening around, anywhere! But sometimes I get alerts in like 30 minutes. I don't really like that because say if somebody was in my house, but I would have known that in 30 minutes, so if I would probably get the alerts in at least a minute or less it would just make it so better for me and my family.","updated":"2019-05-03T06:53:39-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"2288140937","userName":"alcimedes","userUrl":"https://itunes.apple.com/us/reviews/id13616878","version":"4.1.16","score":1,"title":"App is a pile of garbage","text":"Here are the limitations and bugs you can be sure you will encounter with this app\n\n1. For some reason, it locks at 6am constantly for me when trying to review past recordings. \n\n2.  It will only consistently show recorded video up until the previous hour.  So if you’re looking for a recording from 10:30 and it’s currently 10:35, odds are you can’t see the footage you want until after 11. \n\nAny interruption kicks you out of the video you’re looking at, meaning you need to roll the dice and try and get it working again. \n\nFor some reason, if you reload the past footage 20 times or so, eventually you can get to the footage after the typical break per hour.  So in the example above, if I really needed to see the 10:35 footage, reloading the camera two dozens times will  eventually load the footage from the last hour until the current time.","updated":"2018-03-09T09:46:50-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1824690389","userName":"BOB#15","userUrl":"https://itunes.apple.com/us/reviews/id234928995","version":"4.1.16","score":5,"title":"Seems to work good...","text":"I was expecting for it to be bad from the other reviews, but I don’t see many problems with it, a few bugs here and there. Customer support is very helpful and viewing our cameras is relatively easy. Cloud service seems to be working good.","updated":"2017-10-03T06:31:20-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"5780175445","userName":"Lov3lynesh","userUrl":"https://itunes.apple.com/us/reviews/id1050708990","version":"5.2.06","score":1,"title":"won’t connect","text":"Been having cameras since 2017. Recently updated WiFi password so had to delete and reconnect all my cameras which is stupid. You should be able to just go into the settings and update password. Anyway, been trying for hours to reconnect. Tried Zink and QRC and both won’t work. I have 5 cameras and I’m at the point of just canceling subscription and getting different cameras. Firmware was updated prior to WiFi password change.","updated":"2020-04-08T03:11:44-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"5627166779","userName":"TonyDahTigerYall","userUrl":"https://itunes.apple.com/us/reviews/id12709854","version":"5.2.04","score":1,"title":"Garbage app","text":"This app worked great for the first few months. I got these cameras in 2017. Then features suddenly stopped working. Local playback doesn’t work any longer. It keeps prompting me to pay for cloud storage. Local playback and cloud storage are not the same. Defeats the entire purpose of having security if you cant review footage. Thanks Funlux The man in my back yard got away and the footage is inaccessible I will never purchase another product from this company.","updated":"2020-03-07T00:00:48-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"3441681542","userName":"BKK0313","userUrl":"https://itunes.apple.com/us/reviews/id875881055","version":"5.2.02","score":1,"title":"Started out great...","text":"So I used these cameras & app for 6 months with no issues. But as soon as I moved & had to change the WiFi modem & password they haven’t worked since! Ugh why do they make it so difficult to update the WiFi info to the app/cameras? I just tried to delete them all & start fresh but they did an update on the app so now the camera has to scan a barcode... yeah it just plain out doesn’t work! Fix the issues Funlux & I’ll change my rating.","updated":"2018-11-20T18:46:36-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1931038202","userName":"let go rep","userUrl":"https://itunes.apple.com/us/reviews/id604094036","version":"4.1.16","score":1,"title":"Please help","text":"Does not support multi channel viewing. This is the ONLY downfall but is very useless to buy a thousand dollar system and wire 8 cameras to only be able to view one camera in total? Where is the security in that? I don’t feel like my family is safe if I am unable to check on them while away! Very upset with new version. It’s not safe to download old version so what can I do? I questioning should I switch to Swann Advanced Security Made EASY? Can I get some help","updated":"2017-11-18T15:06:28-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"6132145065","userName":"ariellexvanessa","userUrl":"https://itunes.apple.com/us/reviews/id150337357","version":"6.0.0","score":1,"title":"Can’t login","text":"Ever since the update, the camera has been glitching out and now I can’t even login to my account!  It keeps saying “Request Failure”.  I’ve tried changing my password three times, and deleted and redownloaded the app. Nothing is working. I use this app to keep an eye on my cats while I’m at work.  I also pay the monthly fee for the cloud and constant recording. This needs to be fixed!!!!!","updated":"2020-06-28T07:12:32-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"2895185644","userName":"neash 202","userUrl":"https://itunes.apple.com/us/reviews/id42444416","version":"4.1.16","score":3,"title":"Wish they had a location feature","text":"It would be nice if the away and Home feature could automatically turn on and off when I leave and arrive home","updated":"2018-07-12T14:48:07-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"7506717796","userName":"GardyPR1","userUrl":"https://itunes.apple.com/us/reviews/id245051929","version":"6.1.4","score":1,"title":"No many options.","text":"A have used this system foa a year with some  issues, but as soon changed internet provider (for a better one, and $250 router) set it up again was impossible mission. Cameras don”t connect again with recorder device. Update is worst.  I’m very close to get it in my trash can. \n         \n    Updated, cams and system already in the trash. Never works again.","updated":"2021-06-25T21:21:45-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1782667952","userName":"Cactus799","userUrl":"https://itunes.apple.com/us/reviews/id622323847","version":"4.1.14","score":1,"title":"Update is Broken","text":"Previous version works well in my iPhone, but auto update to new version in wife's phone and a download to iPad don't work!  CH1=CH3, No alerts, can't slide view from one camera to next.  Now, it Only displays funlux default images, and must go back to select different channel  from the new channel page GUI. There is no excuse for an update to break the fundamental system requirements of a security system.","updated":"2017-09-09T17:35:27-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"3624694258","userName":"done2020123","userUrl":"https://itunes.apple.com/us/reviews/id772296129","version":"5.2.02","score":1,"title":"Connectivity is horrible","text":"I have two cameras both show the solid blue light one works one never stays online. I’ve had the internet company out here I’ve got plenty of power for these cameras I’m in a situation where I need my cameras to work for domestic issues and they don’t. I try support and only get automated responses wish they would replace my WiFi cameras and if he a five star review. I’m so done trying to make these cameras work","updated":"2019-01-07T18:13:52-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"6140359946","userName":"bre-bro","userUrl":"https://itunes.apple.com/us/reviews/id21387745","version":"6.0.2","score":4,"title":"Seems to work now","text":"The last update messed up logging in for users, but today’s update seems to have fixed it.","updated":"2020-06-30T08:10:22-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"6133223113","userName":"lil bit.","userUrl":"https://itunes.apple.com/us/reviews/id21033304","version":"6.0.2","score":2,"title":"Please fix the update asap!!","text":"It won’t let me or my husband log in, even after changing the password. We’ve been using this app/cameras for two years with no problems and I use it to keep an eye on my little when he sleeps so I hope the problem is fixed soon!","updated":"2020-06-28T13:19:35-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1978953680","userName":"jomafur","userUrl":"https://itunes.apple.com/us/reviews/id12676834","version":"4.1.16","score":4,"title":"I’m liking this","text":"These cameras are great for the price, good image quality. The app has icons for controlling lights and thermostat. I contacted Funlux about which parts I need for controlling lights. They said they don’t sell them anymore. \nMaybe some day, but the cameras work great, and the app does too.","updated":"2017-12-07T19:26:34-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"5700721870","userName":"michelleds1","userUrl":"https://itunes.apple.com/us/reviews/id512190682","version":"5.2.06","score":1,"title":"longtime user","text":"Today after having theses cameras and software forever it seems like I guess because of an update I can't even see my cameras, can't get ahold of any customer service, and now can't even sign in. This is crazy and irritatingmi use the cameras for my baby and my dogs. Please fix this...... Please I will update my review of this changes....i hope","updated":"2020-03-23T03:30:39-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"3235820255","userName":"HotInEER","userUrl":"https://itunes.apple.com/us/reviews/id504580591","version":"5.2.02","score":5,"title":"Latest Update Makes 5 Stars","text":"Wow!  Can't stress how much improved the app has become since the latest update.  More user friendly and loads so much quicker.","updated":"2018-09-27T05:37:17-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"3012623316","userName":"concerned son in law","userUrl":"https://itunes.apple.com/us/reviews/id704373961","version":"4.1.16","score":5,"title":"It is very helpful and easy to operate","text":"Great help to keep eye on my elderly mother in law, as she requires lot of monitoring. \nEasy installation and set up.\nGreat image quality and audio.\nLike it very much!\nEven on computer app easy to use.","updated":"2018-08-03T11:52:36-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"7869825936","userName":"chityapp","userUrl":"https://itunes.apple.com/us/reviews/id887662071","version":"6.1.6","score":1,"title":"Trash","text":"The app is trash. You can’t rewind, and if you select a motion notification it won’t show the time frame from the clip, it should be daylight and it’ll show you night. If you try to manually rewind it’ll go back much further than you want. The time zones are also off. They seriously need to stop and figure this crap out.","updated":"2021-10-02T09:06:00-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"2980440009","userName":"masterita2","userUrl":"https://itunes.apple.com/us/reviews/id5887376","version":"4.1.16","score":2,"title":"Okay for what you pay for","text":"The app works okay but you can’t group cameras. 4 cameras need to be watched 1 at a time. Configuring the camera mode times can be frustrating. Customer support is about as helpful as a magic 8 ball.  \nThey promised to fix many issues with their new update in 2020. So I am looking forward to that.","updated":"2018-07-27T20:23:28-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"3079152732","userName":"avzqz","userUrl":"https://itunes.apple.com/us/reviews/id888462206","version":"4.1.16","score":3,"title":"Connection trouble","text":"Usually works fine, had for a while now but it logged me out for some reason and now I'm having trouble logging back in. Keeps telling network not reachable","updated":"2018-08-17T15:51:05-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1785659361","userName":"Worstshitever!!!!!!!!","userUrl":"https://itunes.apple.com/us/reviews/id4510887","version":"4.1.14","score":1,"title":"Booooo","text":"New update renders all my cameras useless. Can't access them at all. App constantly tries to update, then says \"can't find a secure connection\". Tried different wifi and LTE networks... nothing works. Now I must dig up paperwork and look for a phone number to call. Outlook not good on finding the number and the results if I do. Everything was great until the update. iPhone 6, FYI.","updated":"2017-09-11T16:53:25-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"6229317163","userName":"lmnsh","userUrl":"https://itunes.apple.com/us/reviews/id30995533","version":"6.0.2","score":2,"title":"Ability to download video clips no longer available","text":"With the new update there isn’t the ability to download a video clip to your phone anymore. You can only take a still pic of part of the video.","updated":"2020-07-22T12:32:56-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"6122590362","userName":"chant2k20","userUrl":"https://itunes.apple.com/us/reviews/id1183418925","version":"5.2.06","score":5,"title":"Awesome apps","text":"This apps is ways better than the other 2 apps.  Love the updated and fast respond on detecting movement.","updated":"2020-06-25T20:54:42-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"6536569677","userName":"Chaocoling","userUrl":"https://itunes.apple.com/us/reviews/id211605638","version":"6.0.6","score":1,"title":"Go with another company is smart...","text":"Called them only told me my internet might be a problem... actually my internet is great. It’s the camera goes off itself often. I have to restart it again and again...hope they can take it seriously and so something.","updated":"2020-10-14T22:36:52-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"6436057850","userName":"mrpaddlefoot","userUrl":"https://itunes.apple.com/us/reviews/id166527435","version":"6.0.4","score":5,"title":"See all","text":"Luv Funlux\nWe get recordings of movement around the house\nAnd easy to use and place around the house.","updated":"2020-09-16T13:02:36-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1903670425","userName":"Nate's PB Pro","userUrl":"https://itunes.apple.com/us/reviews/id258811905","version":"4.1.16","score":1,"title":"Worst update ever!","text":"DO NOT BUY ANY PRODUCTS FROM FUNLUX!!\n\nMy cameras haven’t worked since the last update. I know the wrong but they won’t connect. No I can’t view anything at my business. It’s been like this over two months I don’t understand why it hasn’t been fixed, a lot of the latest reviews or seen same thing. \n\nDo NOT buy any products from Funlux.","updated":"2017-11-07T03:29:38-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1931518397","userName":"KillCarmine","userUrl":"https://itunes.apple.com/us/reviews/id13009902","version":"4.1.16","score":5,"title":"Good","text":"Works great for me so far so good. Hope i dont have the same experience as the other people on here with bad updates","updated":"2017-11-18T19:38:54-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"3231385026","userName":"swamphick","userUrl":"https://itunes.apple.com/us/reviews/id11371871","version":"5.2.02","score":1,"title":"Terrible version 5 update","text":"App no longer works in landscape mode so pictures are all much smaller.  Version 4 you could just swipe to view events and now you have to go back to the overview between events.  The home page text size is so small it’s unreadable.  Please put the version  4 app back in the App Store.","updated":"2018-09-26T01:43:24-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"7975836324","userName":"5iveMedia","userUrl":"https://itunes.apple.com/us/reviews/id280491258","version":"6.1.8","score":3,"title":"BIG MISTAKE.","text":"My wife could figure out how to get on when I set up as the primary and shared to her.\nSo, I set her as primary and shared to me.\n\nBIG MISTAKE. \n\nNow, she can play event videos, but I csn only see the thumbnail. \n\nAlso, as I try to navigate to the identifier of movement on a timeline, it is not intuitave nor user friendly and jumps around on the playhead sporadically. \n\nI used to think it was awesome because it didn't charge a monthly.","updated":"2021-10-31T19:03:21-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"6438745378","userName":"Boom12754","userUrl":"https://itunes.apple.com/us/reviews/id123661904","version":"6.0.6","score":1,"title":"Doesn’t work with ios14.","text":"This app is extremely finicky. It only detects and records when nothing is going on. But once someone does walk in front of the camera it won’t record and send a notofication the some one was there 5 minutes later. Horrible.","updated":"2020-09-17T08:41:57-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1780642296","userName":"Sandi194","userUrl":"https://itunes.apple.com/us/reviews/id450031847","version":"4.1.14","score":1,"title":"Needs fixed","text":"I used this app everyday to watch my dad's security cameras.  Now since this last update this month I cannot view my cameras.  I can only view one. I called tech support and it's a 2 hour wait to talk to someone. This is useless now and needs fixed!!  Please advise when this will be fixed.....Thank you!","updated":"2017-09-08T10:49:06-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"4862588966","userName":"Indians2003","userUrl":"https://itunes.apple.com/us/reviews/id189770789","version":"5.2.02","score":1,"title":"App no longer works","text":"So after having the cameras for 4 years, I had to reinstall everything and now I cannot connect to my cameras! So now I have 4 worthless cameras. Looks like this company went under because they don’t update anymore. Waste of money and now I have to buy new cameras else where","updated":"2019-09-29T17:50:22-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1911668327","userName":"Sifjejxj","userUrl":"https://itunes.apple.com/us/reviews/id413333518","version":"4.1.16","score":2,"title":"Slow after update","text":"After updating to the new firmware the playback option will not load of previous hours . The icon continues to spin in circles .  Otherwise product was good.  Please fix the issue...","updated":"2017-11-10T13:51:41-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1822792778","userName":"Jkkz","userUrl":"https://itunes.apple.com/us/reviews/id18909232","version":"4.1.16","score":2,"title":"New version not good","text":"I lost my ability to receive motion alerts with new app. It's also weird to get into the live video, needs to be one easy click. I hope these things get fixed as it's made the app pretty useless to me now.","updated":"2017-10-02T07:24:31-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1778000173","userName":"LadyJazz19","userUrl":"https://itunes.apple.com/us/reviews/id37036768","version":"4.1.14","score":1,"title":"Awful update - don't download","text":"The update took a good app and made it crap. What happened to swiping between cameras? What happened to seeing a photo of the last time you used the camera so you could tell which window was which camera? Horrible update. Wish I'd never downloaded it.","updated":"2017-09-06T21:09:57-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"7229472224","userName":"Boricuaprincess23","userUrl":"https://itunes.apple.com/us/reviews/id118624559","version":"6.1.4","score":1,"title":"Funlux","text":"I started to paid for the service Thou apple and now my devices or off and they are not working, tryto reboot router , but scene come on like  if I wasn’t paying for the service and apple charges every month!!! 7.99  what do I do?? Ont want to pay twice for the iCloud","updated":"2021-04-16T11:31:28-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1782076321","userName":"Mojo521","userUrl":"https://itunes.apple.com/us/reviews/id244398059","version":"4.1.14","score":1,"title":"Bad Update","text":"This has been the worst mess of an update. Just like several, I can only access one (1) camera and the alerts don't work as will. Looking for another camera option or system if this doesn't get fixed very soon & I own a security company at that !!!","updated":"2017-09-09T07:40:52-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1781276308","userName":"Yoon Ji hoo","userUrl":"https://itunes.apple.com/us/reviews/id162290071","version":"4.1.14","score":1,"title":"Bad update.","text":"Do you guys even check if your updates work? The voice feature take more than 10 seconds to load. Switching between cameras is slow. The app is slow. I have 10 of these cameras. Fix this please. Using an iPhone 6 and the newest Samsung phone.","updated":"2017-09-08T21:03:15-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"3238167981","userName":"ackibee","userUrl":"https://itunes.apple.com/us/reviews/id23858607","version":"5.2.02","score":1,"title":"Update is absolute crap","text":"Ever since the update my web cam will no longer connect to my phone. Now that I’m working long hours again it’s important to be able to keep an eye on my dog. But  thanks to Funlux, that is no longer possible. Extremely disappointed.","updated":"2018-09-27T20:58:21-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"7271924834","userName":"Pjmax190","userUrl":"https://itunes.apple.com/us/reviews/id140596858","version":"6.1.4","score":3,"title":"App desperately needs dark mode","text":"Can’t check on my kids at night without the app glaring white.  Needs dark mode support","updated":"2021-04-27T19:10:37-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1782918523","userName":"Tandev","userUrl":"https://itunes.apple.com/us/reviews/id143133248","version":"4.1.14","score":1,"title":"Worthless","text":"I spent my hard earned money on cameras to protect my family and the app updated and now I can't access any of the cameras.   If anyone is looking at buying this product I would think again. While the cameras themselves might be good the technology behind the app is useless.","updated":"2017-09-09T20:55:37-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1985975967","userName":"Bb42011","userUrl":"https://itunes.apple.com/us/reviews/id351591519","version":"4.1.16","score":1,"title":"Horrible","text":"After the update I don’t get notifications for anything. I don’t know if they did it so that people feel obligated to pay for their cloud services because before they offer that service it worked perfectly fine.","updated":"2017-12-10T09:22:31-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"3417108245","userName":"CimiLeigh","userUrl":"https://itunes.apple.com/us/reviews/id28197090","version":"5.2.02","score":3,"title":"Not iPad/tablet friendly","text":"I like these cameras and the app but the app does not rotate/flip on iPad. Have to turn iPad upright.  Please fix.","updated":"2018-11-14T05:57:53-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1780610483","userName":"Honour Hollis","userUrl":"https://itunes.apple.com/us/reviews/id343538252","version":"4.1.14","score":4,"title":"better look","text":"Finally an update.","updated":"2017-09-08T10:18:11-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1795322044","userName":"moe rider","userUrl":"https://itunes.apple.com/us/reviews/id492057752","version":"4.1.14","score":1,"title":"Can't view all cameras with new update","text":"I can't believe that the App gets an update and now I can only view my first camera. This update renders my another cameras useless. When will this issue be resolved? This is a security app that is supposed to help with protecting your property.","updated":"2017-09-17T16:26:22-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1777823175","userName":"Upsguyups","userUrl":"https://itunes.apple.com/us/reviews/id275853325","version":"4.1.14","score":5,"title":"Great improvement","text":"Finally a much needed update, and it is really good!  Thank you!!!","updated":"2017-09-06T18:56:49-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"2242870474","userName":"Jgv84","userUrl":"https://itunes.apple.com/us/reviews/id102236336","version":"4.1.16","score":4,"title":"Apple TV?","text":"Love the app for my home security system, I’d really like if you made the app for Apple TV so that the cameras can be viewed from my televisions in my home.","updated":"2018-02-24T08:23:26-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"2015851826","userName":"Colorado2014","userUrl":"https://itunes.apple.com/us/reviews/id233161914","version":"4.1.16","score":1,"title":"Won’t work","text":"I am trying to log in and it refuses to work! It says network unreachable! It’s working on the other parties phone who also has the app. This is a huge inconvenience and who wants to pay when they can’t see what they are paying for!😡","updated":"2017-12-21T15:59:56-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1781494922","userName":"SeanNoyes","userUrl":"https://itunes.apple.com/us/reviews/id41962849","version":"4.1.14","score":2,"title":"Update no good","text":"The update has made my camera not have as many alerts. UPS guy delivered a package and nothing. Before the update everything would be taken even if a bug flew by","updated":"2017-09-08T23:53:32-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"2642470400","userName":"Zer0tribe","userUrl":"https://itunes.apple.com/us/reviews/id155052605","version":"4.1.16","score":4,"title":"Good needs update","text":"Add ff to the alerts\nI know you and scrub the video to fast forward or rewind. I would still like to see a 2x 4x or 8x video playback. \n\nThe alert function works well enough for me. Video quality in app is what shows on the tv.\n\nI will change to 5 star when 2x or 4x or 8x playback is added to review","updated":"2018-06-04T15:41:07-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1778564833","userName":"Firefighter HRFD","userUrl":"https://itunes.apple.com/us/reviews/id182829200","version":"4.1.14","score":1,"title":"Ruined cams","text":"The updated app and firmware upgrade effectively made the cameras useless especially on the iPad Pro I used these cams a lot since July 2017 now they are junk!!  Fix it please...and the \"cloud\" won't work for my devices so I can no longer see captured vids.  All buttons greyed out","updated":"2017-09-07T04:49:12-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1788695025","userName":"Hbc369","userUrl":"https://itunes.apple.com/us/reviews/id416008049","version":"4.1.14","score":1,"title":"App is broken.","text":"Cameras work on my monitor but the app doesn't work at all. The only thing I get is the first image the camera saw when I plugged it in the first time which, inevitably is my silly mug. Please fix the app or I'll have to return your product.","updated":"2017-09-13T14:32:45-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"5043411439","userName":"D.wall2019","userUrl":"https://itunes.apple.com/us/reviews/id562486287","version":"5.2.02","score":2,"title":"App","text":"The app closes unexpectedly when trying to delete photos please fix the bug issue","updated":"2019-10-28T16:30:33-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"3079232938","userName":"snealy24","userUrl":"https://itunes.apple.com/us/reviews/id687705343","version":"4.1.16","score":1,"title":"Crashed","text":"Not sure what happened to server or whatever but now my login no longer works, My email is no longer recognized so now I have no way of seeing my system when away from home.","updated":"2018-08-17T16:20:37-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1779380993","userName":"Flyguywi","userUrl":"https://itunes.apple.com/us/reviews/id31415749","version":"4.1.14","score":1,"title":"Really?","text":"Did any of the developers even bother to test before release? No they are to busy posting five BS stars here in the reviews. I know the cameras were cheap so my expectation of video quality was low but I  at least wanted the app to work.","updated":"2017-09-07T17:33:45-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"6131668753","userName":"Rutchy01","userUrl":"https://itunes.apple.com/us/reviews/id359841338","version":"6.0.0","score":1,"title":"Newest Update","text":"I can no longer log in to the app. I even tried changing my password. Never had an issue until the newest update just 11hrs ago.","updated":"2020-06-28T04:43:12-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1999122737","userName":"lyric user","userUrl":"https://itunes.apple.com/us/reviews/id23470965","version":"4.1.16","score":1,"title":"Terrible","text":"Worked great when I first started using it in March... recent updates have made the app useless... out of 4 channels I can see only 1 alert.  Will most likely get a different setup of this doesn’t get resolved soon.","updated":"2017-12-15T12:27:39-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1779318785","userName":"Poyoloko","userUrl":"https://itunes.apple.com/us/reviews/id147224536","version":"4.1.14","score":2,"title":"Meh","text":"Trying to update the firmware on my cameras and it's taking forever. Over an hour now and it still shows the same camera upgrading.","updated":"2017-09-07T16:30:59-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1988583764","userName":"Smart Song","userUrl":"https://itunes.apple.com/us/reviews/id163918340","version":"4.1.16","score":2,"title":"Alert not functioning well","text":"Alert only works one time after each restarting\n\nCustomer support no response","updated":"2017-12-11T09:45:49-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1840529329","userName":"Bb121","userUrl":"https://itunes.apple.com/us/reviews/id109651837","version":"4.1.16","score":1,"title":"Bad update","text":"Second review since my first review did not show up. This update will not allow me to see but one camera I didn’t update the app on my iPad and it still works great. Please go back to the old version.","updated":"2017-10-10T18:59:09-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"3754917374","userName":"947621468","userUrl":"https://itunes.apple.com/us/reviews/id40819169","version":"5.2.02","score":1,"title":"No help","text":"I had the system for over a year and needed tech support to help reactivate system because online instructions make no sense but they never replied -much better and easier systems can be purchased","updated":"2019-02-10T09:57:33-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1779256312","userName":"Michelleo1984","userUrl":"https://itunes.apple.com/us/reviews/id393599412","version":"4.1.14","score":1,"title":"Worthless update","text":"Now I can't get any of the caught vids or pics. Says I have alerts. I get the push. But no content in alerts tab. Firmware won't update for the cameras now. Just goes around and around when updating. Awesome!","updated":"2017-09-07T15:14:50-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"6132010801","userName":"N8g88888","userUrl":"https://itunes.apple.com/us/reviews/id29975908","version":"6.0.0","score":1,"title":"Latest Update","text":"Not letting me log in put still sending push notifications. 😳 Taking them offline until a fix. Not cool","updated":"2020-06-28T06:31:52-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"3079492382","userName":"Jeanzee","userUrl":"https://itunes.apple.com/us/reviews/id122107214","version":"4.1.16","score":2,"title":"Worked fine for awhile","text":"App worked good for 6 months now it freezes and lags. Sometimes I can’t log in to view cameras","updated":"2018-08-17T18:00:27-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"4728453114","userName":"Lezned24","userUrl":"https://itunes.apple.com/us/reviews/id61326","version":"5.2.02","score":2,"title":"Not Logging In","text":"When trying to login to the acct, app keeps timing out! Will not log me into the acct. The app, instead, does a LONG pause (loading the acct), and then Times-out, and stops.","updated":"2019-09-04T19:45:16-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"6130624414","userName":"in tjdfbjf to hcd","userUrl":"https://itunes.apple.com/us/reviews/id211385674","version":"6.0.0","score":1,"title":"Update","text":"My phone auto updated and unfortunately no matter how many times I log out and back in I’m logged into some lady’s account. Sorry Linda!","updated":"2020-06-27T22:13:53-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"2015816777","userName":"midknight420","userUrl":"https://itunes.apple.com/us/reviews/id166596168","version":"4.1.16","score":1,"title":"Cant sign in","text":"Keep trying to sign in but app keeps saying Network Unreachable, before this the app worked great, dont know whats going on but haven’t been able to access my cameras for hours..","updated":"2017-12-21T15:39:01-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1786704518","userName":"Aemcjd","userUrl":"https://itunes.apple.com/us/reviews/id14252441","version":"4.1.14","score":1,"title":"Can I go back?","text":"I would like to go back to the old version if possible. One of my cameras doesn't work now. Can't swipe between cameras and I no longer can see the events log","updated":"2017-09-12T07:06:06-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"3666429641","userName":"Soto.gsc","userUrl":"https://itunes.apple.com/us/reviews/id406007170","version":"5.2.02","score":1,"title":"Never able to talk thru the app","text":"I haven’t been able to talk thru the App and be able to listen on the camera, something that is very disappointing","updated":"2019-01-18T14:22:38-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"2306651767","userName":"DoubleTLS","userUrl":"https://itunes.apple.com/us/reviews/id224085133","version":"4.1.16","score":1,"title":"WiFi - less","text":"Doesn’t work with Funlux wired cameras over WiFi like it says it will. Works on just a few cameras when not connected to WiFi. Records parts of motion activated captures regardless of sensitivity setting.","updated":"2018-03-14T16:54:12-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"3576042991","userName":"Camilo1071","userUrl":"https://itunes.apple.com/us/reviews/id201353733","version":"5.2.02","score":1,"title":"I wish i can give a negative stat","text":"Horrible set up process \nCrashing all the time just horrible experience.  I never going. Rather trash this horrible product","updated":"2018-12-26T08:58:25-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"2471833064","userName":"crap send review no name","userUrl":"https://itunes.apple.com/us/reviews/id535412075","version":"4.1.16","score":2,"title":"App had to be deleted and reinstalled stuck on sign up for payment to cloud storage","text":"See above","updated":"2018-04-26T13:43:36-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"4332632298","userName":"Omarochoa59","userUrl":"https://itunes.apple.com/us/reviews/id203020235","version":"5.2.02","score":1,"title":"No connect without WiFi","text":"I\nLiked this app a lot but suddenly if my phone isn’t connected to WiFi it won’t connect to my cameras , honestly it’s trash .","updated":"2019-06-17T19:22:59-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1777314380","userName":"jsingyy","userUrl":"https://itunes.apple.com/us/reviews/id85434544","version":"4.1.14","score":5,"title":"Awesome user friendly app","text":"I love it","updated":"2017-09-06T10:26:31-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"4834109553","userName":"Angelito 1111","userUrl":"https://itunes.apple.com/us/reviews/id102827932","version":"5.2.02","score":1,"title":"About the camera","text":"Need a lot of updates for the price\nYou can only view one camera at the time","updated":"2019-09-24T19:02:28-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"4516312605","userName":"hrminh","userUrl":"https://itunes.apple.com/us/reviews/id922045491","version":"5.2.02","score":1,"title":"iPhone 8 Plus Red cannot play back","text":"My boy’s iPhone 6 Plus and my wife iPhone 7 Plus work well . But my iPhone 8 Plus (Red ) cannot play back. I can see live camera only.","updated":"2019-07-25T11:43:57-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"6795957842","userName":"jdm_boi","userUrl":"https://itunes.apple.com/us/reviews/id147596828","version":"6.1.0","score":3,"title":"App crash","text":"App be crashing","updated":"2020-12-26T07:43:15-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1788865692","userName":"John branson","userUrl":"https://itunes.apple.com/us/reviews/id170469659","version":"4.1.14","score":2,"title":"Junk","text":"Just bought, cant view live camera. Two cameras wont work, app is terrible.","updated":"2017-09-13T17:53:54-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"4728249820","userName":"THE_SPAZZ","userUrl":"https://itunes.apple.com/us/reviews/id41566598","version":"5.2.02","score":1,"title":"If I could give zero stars I would","text":"Complete crap cameras. Don’t work half the time. Wish I could return. Oh and the app doesn’t even work now 🙄🙄","updated":"2019-09-04T18:44:05-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"4274725678","userName":"EMSsoldier","userUrl":"https://itunes.apple.com/us/reviews/id371216132","version":"5.2.02","score":1,"title":"Waste of time and money!","text":"Enough idiots in this world trying to take your hard earned money. This is another scam doing the same thing.","updated":"2019-06-06T15:56:26-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"3746330403","userName":"rool12","userUrl":"https://itunes.apple.com/us/reviews/id48868902","version":"5.2.02","score":1,"title":"No Bluetooth support zero star","text":"This app only allows audio from iPhone internal speaker. \n\nIf you have a Bluetooth speaker and want to intercom with your camera, you will only hear the sound from the iPhone speaker. \n\nI would give it zero star for the lack of such i important support. \n\nOnce Bluetooth is supported I will give it 5 star.","updated":"2019-02-08T04:01:53-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"3716718235","userName":"labugu","userUrl":"https://itunes.apple.com/us/reviews/id177395810","version":"5.2.02","score":5,"title":"Best camera apps","text":"This is fantastic.","updated":"2019-01-31T06:38:11-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"6131767372","userName":"Ray2870","userUrl":"https://itunes.apple.com/us/reviews/id286094361","version":"6.0.0","score":1,"title":"Update","text":"After I updated the app can’t use the cameras can’t log in can’t do nothing","updated":"2020-06-28T05:16:35-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1817641284","userName":"mtuleba","userUrl":"https://itunes.apple.com/us/reviews/id540722032","version":"4.1.16","score":1,"title":"Continue problem","text":"I dont know who tell for you with this system is good now and who told for you the bug is good is not true.","updated":"2017-09-29T16:51:58-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1784279483","userName":"Doeboy7177","userUrl":"https://itunes.apple.com/us/reviews/id35379613","version":"4.1.14","score":1,"title":"Does not work","text":"Way to go you updated the app but made it unuseable.  Try testing your software or beta test.  Roll it back this is crap","updated":"2017-09-10T18:06:48-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1941321750","userName":"iPhone4 userz","userUrl":"https://itunes.apple.com/us/reviews/id110076493","version":"4.1.16","score":1,"title":"Need to fix the update to see all cameras","text":"Very bad update the company must fix the update to view all cameras. Do it now or loose all customers","updated":"2017-11-22T16:15:14-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1784038962","userName":"msmoneyy","userUrl":"https://itunes.apple.com/us/reviews/id592054384","version":"4.1.14","score":1,"title":"Update doesn't work","text":"After the new update the cameras are not working at all please fix asap","updated":"2017-09-10T13:23:51-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"3904728539","userName":"elongo78","userUrl":"https://itunes.apple.com/us/reviews/id16040581","version":"5.2.02","score":1,"title":"App just frozen in loading","text":"App stopped loading can't see my camera","updated":"2019-03-20T09:51:06-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"2674333664","userName":"cc glendale","userUrl":"https://itunes.apple.com/us/reviews/id628492599","version":"4.1.16","score":1,"title":"Poor connection to Wi-Fi","text":"This camera system does not support a dual router you only can have 2.4 not 5.0 on the same router","updated":"2018-06-10T20:18:49-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1550872093","userName":"chelo lll","userUrl":"https://itunes.apple.com/us/reviews/id129490271","version":"3.1.8","score":3,"title":"app version 3.1.8 crash","text":"the app was working fine but after update to the new version 3.1.8 the app simply crash after 2 seconds. \n\nI'm no longer have access to the app after this update. \n\nplease send a fix asap, or just simply send a downgrade option of the version. thanks you","updated":"2017-02-23T07:35:19-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1782400098","userName":"Murphyk5866","userUrl":"https://itunes.apple.com/us/reviews/id373485232","version":"4.1.14","score":1,"title":"Ruined It","text":"This update ruined a good, useful app and made it worthless. Wish I could revert back to the previous version.","updated":"2017-09-09T12:33:31-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1904611984","userName":"Benavente88","userUrl":"https://itunes.apple.com/us/reviews/id316972763","version":"4.1.16","score":1,"title":"Bad update","text":"Not working after the latest update. Terrible.","updated":"2017-11-07T13:53:03-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1785883509","userName":"manfromcuraçao","userUrl":"https://itunes.apple.com/us/reviews/id168226768","version":"4.1.14","score":4,"title":"Bad bad bad","text":"Instead of advancing they are retreating, what a shame!","updated":"2017-09-11T19:47:34-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1796052847","userName":"corndogstreetpatrol","userUrl":"https://itunes.apple.com/us/reviews/id21192731","version":"4.1.14","score":1,"title":"Won't display correctly on iPad","text":"While the app works well on iPhone, it does not display correctly on iPad.","updated":"2017-09-18T02:02:50-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1784214350","userName":"Grand Okie boater","userUrl":"https://itunes.apple.com/us/reviews/id140920256","version":"4.1.14","score":1,"title":"Updates does not work","text":"Took a good app that worked fine and not doesn't work, nice job IT guys","updated":"2017-09-10T17:02:18-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"6131998390","userName":"ratedr72","userUrl":"https://itunes.apple.com/us/reviews/id1164611917","version":"6.0.0","score":1,"title":"Can’t sign in","text":"Recent update is preventing me from signing into the app","updated":"2020-06-28T06:28:07-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"3293942480","userName":"DJ DHT","userUrl":"https://itunes.apple.com/us/reviews/id43310115","version":"5.2.02","score":1,"title":"Update now!!!","text":"After latest iPhone release the app don’t work","updated":"2018-10-12T10:54:58-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"6130278130","userName":"Marcogolo7","userUrl":"https://itunes.apple.com/us/reviews/id169183509","version":"6.0.0","score":1,"title":"Security Breach","text":"I am very concerned. I just logged in with my account. And I am seeing a strangers home.","updated":"2020-06-27T20:01:06-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"6251235045","userName":"prettgflower33","userUrl":"https://itunes.apple.com/us/reviews/id777705879","version":"6.0.2","score":1,"title":"Meh","text":"Bring the old version back!!","updated":"2020-07-28T04:54:35-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1847259987","userName":"Mfitz1","userUrl":"https://itunes.apple.com/us/reviews/id130991464","version":"4.1.16","score":1,"title":"1st to worst","text":"No more swiping between cameras.  Goodbye to getting alerts. Previous version worked great, now this POS.","updated":"2017-10-13T19:21:55-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1779474996","userName":"Chaztgod","userUrl":"https://itunes.apple.com/us/reviews/id163656617","version":"4.1.14","score":1,"title":"DO NOT !! Update","text":"The update knocked out all my cams except one. Please fix I just put in another camera........","updated":"2017-09-07T18:56:30-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1782343774","userName":"ANDREWGLASCOCK","userUrl":"https://itunes.apple.com/us/reviews/id263608364","version":"4.1.14","score":1,"title":"DO NOT UPDATE!!","text":"Worked before, but now shows only one camera.","updated":"2017-09-09T11:36:25-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"4727917812","userName":"Anna Vamosi","userUrl":"https://itunes.apple.com/us/reviews/id573934008","version":"5.2.02","score":1,"title":"App","text":"App is not working right now please fix it","updated":"2019-09-04T16:59:43-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"7423391321","userName":"real person on IG","userUrl":"https://itunes.apple.com/us/reviews/id439673930","version":"6.1.4","score":2,"title":"Eh","text":"Decent camera BUT notifications / motion sensors are not good","updated":"2021-06-03T16:35:26-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1785438981","userName":"Delcious","userUrl":"https://itunes.apple.com/us/reviews/id171220277","version":"4.1.14","score":1,"title":"New Update is not working.  Do not download","text":"Update us NOT WORKING","updated":"2017-09-11T12:12:18-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1535067933","userName":"Isickoffu","userUrl":"https://itunes.apple.com/us/reviews/id202647739","version":"3.1.6","score":4,"title":"App is working fine but Cloud is bad","text":"I've 2 funlux Mini Cam installed and i use Funlux App it was working fine for me every time I click on camera live view . I really like the cameras because it show really clear during daytime but night time is good and wide screen 115 degrees that I ever use , but to view the content on the cloud is very bad , sometimes I can see the recording but a lot of times it took too long to download the videos then an errors pop up says ( no connection) then I view again to the next section and I can see the videos. What is going on. Everyday I try to view the Cloud Videos to make sure they all working before I send the camera back. This Mini  Funlux Cam also worked with Zmodo and Meshare App so now I'm confused to which is the right App for the Mini Funlux Camera. Who's fixing the Cloud \nPLEASE FIX IT OR I WILL RETURN THE CAMERAS BACK .","updated":"2017-02-01T12:22:18-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1594661083","userName":"Betchface","userUrl":"https://itunes.apple.com/us/reviews/id356793726","version":"3.1.8","score":1,"title":"Kills your bandwidth. Make an off button????? Have to cycle modes to turn off.","text":"The concept this app has is great I just wish the App was not so sticky or glitchy. Our internet service is fast but the video feed is always glitchy. \nAlso I get notifications even when I have it set to home mode. My understanding is these features are adjustable and I have done so with the same results. \nAnother bothersome issue is when we turn off the system the cameras seem to stay on appear to be recording all the time. I am also unsure how secure this app is can others view my cameras easily?\nAlso Touch ID would be a great addition and add a level of security. Also more device control. I'd like to be able to add a powered door lock and window sensors. \nI'll change my rating as this service improves.\n\nAfter the last update the app no longer connects to my cameras and nothing I try fixes the issue. I called the App support hotline and even though it said my call was first in line, I waited on hold for over 30 minutes. I eventually gave up. I will wait 7 business days then I'm returning these now non functioning cameras......\n\nEveryone, to fix the app crashing issue, you must delete all your event and motion history. Once my wife and I did this it started working again. The app is still glitchy but I can open and see my cameras now. I have an iPhone 7plus and my wife has a Samsung S7","updated":"2017-04-21T22:07:32-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1565781051","userName":"ascernas","userUrl":"https://itunes.apple.com/us/reviews/id179669580","version":"3.1.8","score":1,"title":"The camera has potential, but the apps doesn't take advantage of it","text":"Recent update of the camera firmware blocked the Port 80 for the built-in camera web pages and options that were there are not longer available in the apps. The apps is to simple and do not take fully advantage of the camera hardware. We need a more customize app so we can take full control of every single piece of hardware of the camera. I cannot longer set the quality of the recordings. Before the firmware upgrade I was able to record in full 720p, right after the update its not longer working, it seem that record in 480p or even less quality as the video and images has a very poor quality (pixeled).\n\nI was happy to buy more cameras but with this updates without letting the consumer knows or at least provide release notes, I am taking a step back on buying more cameras. Not for the hardware but for the software that controls it.\n\nThanks","updated":"2017-03-16T10:19:11-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1507148784","userName":"SteCold","userUrl":"https://itunes.apple.com/us/reviews/id273387495","version":"3.1.2","score":4,"title":"No problems","text":"I've had the cameras and app for over a month now and I've never had to uninstall/install the app. I really love the cameras I just wish there weren't so many lights on it. I have them in my kids' rooms and the lights are bright for sleeping kids. I put electrical tape over the indicator light but the other light can't be covered up or it won't work. \nAlso, if you mount it to the wall the camera doesn't just stay pointing where you put it because the cord pulls it down. So it has to be sitting and it has to have something on the back of it so it doesn't fall forward. Sounds like a nuisance but it's not. I like the quality a lot! And I like that we can set it to alert us of any movement when we aren't home.","updated":"2016-12-22T20:52:04-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1730366015","userName":"Combang","userUrl":"https://itunes.apple.com/us/reviews/id109311063","version":"3.1.8","score":5,"title":"Great  app","text":"In all honesty I have only used the camera for 1 day but I must say I hat with all the negative ratings I saw when I first saw the app, after using it for 1 day I was impressed. There must have been an update because I haven't encountered any crashes (knock on wood) the interface is great. The camera take great pictures and videos and for the price I'm thinking of purchasing three more cameras. If I encounter any difficulties I will update my ratings to reflect my experience.","updated":"2017-08-16T07:23:45-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1550753892","userName":"shathaway05","userUrl":"https://itunes.apple.com/us/reviews/id14105600","version":"3.1.8","score":2,"title":"Cameras are great, but the app? Not so much.","text":"I'm not one to write app reviews usually, but this one...man. This is by far, one of the buggiest apps I've ever used. I'm logged out at random, and it takes forever to log me back in. Sometimes I can view the cameras live, sometimes they error out. (It's about 50/50 whether they work.) Sometimes I can view the picture/video and delete them from the alerts (when motion or sound is detected), and sometimes I can't. Again, it's about 50/50. I truly am impressed by the cameras, but this software/app really needs some work.","updated":"2017-02-23T04:34:21-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1551040550","userName":"Kacuenazo","userUrl":"https://itunes.apple.com/us/reviews/id193110761","version":"3.1.8","score":1,"title":"Lots of improvements needed.","text":"The app lacks of a lot of improvements. Here are some that the developer needs to consider for customer satisfaction:\n\n1.- Home screen with real time video on all the installed cameras.\n2.- Ability to arrange the order of the cameras as the user wants/need.\n3.- Share specific camera between family, friend or security personnel.\n4.- Share photos/videos taken from the phone/tablet to the people you want.\n5.- Share the pictures taken from the alarm/motion sensor to the people that the user wants/need.\n6.- Add fast forward, reverse, pause, play to the videos you are reviewing.\n7.- Add the ability to watch recorded videos right from the phone/tablet without the need to be in the same wifi network.\n\nI hope the developer understand the importance of these improvements to the actual user and also to future users.","updated":"2017-02-23T14:30:04-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1739846862","userName":"rrigo50","userUrl":"https://itunes.apple.com/us/reviews/id108308181","version":"3.1.8","score":4,"title":"Live view","text":"I'm assuming that updates took care of most of most of the complaints addressed. One thing I'd like to see in live view is have all 8 cameras on the screen at the same time. And if I select the camera to be on HD view, have it stay in that mode...instead of pressing it anytime I select another camera.","updated":"2017-08-22T12:06:03-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1619662443","userName":"KB102012","userUrl":"https://itunes.apple.com/us/reviews/id479315184","version":"3.1.8","score":2,"title":"Inconsistent and Glitchy","text":"Camera works great. We enjoy the layout of the app, but unfortunately it crashes frequently or will not load and states \"device is offline.\" The app is quite inconsistent and often glitches. The camera seems high quality. We wish the app operated with the same consistent quality. Hoping for some better updates and fixes in the future.","updated":"2017-05-20T20:20:28-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1550796468","userName":"jnguidi","userUrl":"https://itunes.apple.com/us/reviews/id212819569","version":"3.1.8","score":1,"title":"Horrible","text":"I have nothing positive to say about this app. Every time I try to view my camera it takes multiple attempts of logging in and even when I do login it takes another few minutes to load. I even downloaded the newest version in hopes it would improve. Nope have attempted to login 3 times now with a message reading \"timeout\" every time. I need to allow at least 10 mins every time I would like to view my camera.","updated":"2017-02-23T05:38:44-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1678535242","userName":"Concerned987","userUrl":"https://itunes.apple.com/us/reviews/id116986210","version":"3.1.8","score":1,"title":"Crap","text":"There should be a no star rating. This app is totally crap. The cameras work great, but the app is something that I'd hand to an enemy. Totally nonfunctional, hardly user friendly, and very difficult to understand. It has only a limited amount of what you're able to do to manipulate your cameras...if it can pick all of them up. I want this app to be totally revamped, and until then, I'll be sure to advise against this costly system with limited user capabilities.","updated":"2017-07-11T17:10:28-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1511460590","userName":"Subielovin","userUrl":"https://itunes.apple.com/us/reviews/id398029093","version":"3.1.6","score":3,"title":"Loved this app worked well for awhile","text":"I've been using this app with my security camera. It worked great the first  couple weeks and now it won't let me view my live camera on my phone unless I'm connected to wifi. Can you please fix this issue????","updated":"2016-12-29T08:16:08-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1555265089","userName":"Cinderwalker","userUrl":"https://itunes.apple.com/us/reviews/id161866410","version":"3.1.8","score":1,"title":"App crashing","text":"Everything was great and then update crashed.  Cameras are useless if the app won't open.  My Grandmother lives with me and this has been the best thing for me check in on her while at work.  Now I can no longer see what is happening at my house while I am away.  Please fix this bug.  I have iPhone 6s v 10.2.1 and everything was great until this \"fix\" which is more like a break.","updated":"2017-03-01T09:46:35-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1494629470","userName":"Cronnee","userUrl":"https://itunes.apple.com/us/reviews/id536997542","version":"3.1.2","score":1,"title":"Useless app","text":"I have to uninstall this app & reinstall it every time I want to use app. That defeats the purpose of the camera's. Cameras work great but app has a lot of issues. Since I can't use app with cameras, because of the reinstalling & uninstalling of this app. Love cameras, but app too use cameras is, has way too many problems & now I have to buy different brand of cameras so I can have security in my place. Please fix this app. ASAP!!!!!","updated":"2016-12-02T06:00:23-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1470197569","userName":"Jenny Pipes","userUrl":"https://itunes.apple.com/us/reviews/id123269151","version":"3.1.2","score":3,"title":"50%","text":"Cameras work great. Easy to set up    This app though - gets 1 star. Starts glitching where I have to delete and reinstall the app. That is super annoying. Installed today and already  delete/reinstall app 4 times !!!!!","updated":"2016-10-20T17:50:33-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1418413980","userName":"bedaone","userUrl":"https://itunes.apple.com/us/reviews/id163276286","version":"1.0.3","score":5,"title":"Great security systems","text":"Easy to set up. Cameras work great both indoors and out. I receive proper notifications. It does its job. It's worth the investment if you want to see what's going on around your home.","updated":"2016-07-23T07:53:05-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1481983043","userName":"Amykoval","userUrl":"https://itunes.apple.com/us/reviews/id221303571","version":"3.1.2","score":1,"title":"Have to keep deleting and restarting app","text":"Completely annoying. Fix the app or I'm returning the cameras and deleting the app for good!!!!\nI have it 1 star ONLY because of the app. It would be 5 stars if I didn't have to keep deleting it and restarting the application. Very annoying. Overall I like the 2 way voice and the quality of the cameras. It serves its purpose.","updated":"2016-11-10T04:46:03-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1501935025","userName":"iLive4theBeat","userUrl":"https://itunes.apple.com/us/reviews/id240751340","version":"3.1.2","score":1,"title":"No response from tech support","text":"As everyone has already stated, the app does not function correctly so you have to constantly delete the app and then re download it. The frustrating part is that when you try to contact them, theres a really long wait for tech support and they do not reply back to your emails.","updated":"2016-12-14T15:23:19-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1373698678","userName":"vargasfam","userUrl":"https://itunes.apple.com/us/reviews/id105208401","version":"1.0.3","score":1,"title":"Used to work","text":"What happened? This app worked well, I contacted developer when I started having problems and was told to reinstall I have and it has not worked since. With a wifi camera you need the app to function. The other app me share does not have same features as this app.","updated":"2016-05-04T22:23:02-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1551178175","userName":"Thechive","userUrl":"https://itunes.apple.com/us/reviews/id220910412","version":"3.1.8","score":4,"title":"Works fine now","text":"Was crashing, seems it has been fixed","updated":"2017-02-23T19:38:56-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1783757605","userName":"Cactus 788","userUrl":"https://itunes.apple.com/us/reviews/id119541393","version":"3.1.8","score":3,"title":"Fix update with Meshare","text":"Saw a review for Zmodo saying Meshare is previous version and works like version 3.1.8.  I downloaded Meshare to fix wife's phone and it works the way it was!  5stars for Meshare, one star for funlux.","updated":"2017-09-10T08:51:53-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1550827480","userName":"DJ.DEE","userUrl":"https://itunes.apple.com/us/reviews/id148486168","version":"3.1.8","score":4,"title":"App keeps crashing","text":"Every thing was working great till the new update app keeps crashing at start up","updated":"2017-02-23T06:24:44-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1557490014","userName":"StealthSnake","userUrl":"https://itunes.apple.com/us/reviews/id222412613","version":"3.1.8","score":2,"title":"Updated Review","text":"The newest update has caused my app to not work at all! \nI have upgraded to two stars because the app came back on, but it still give me trouble at random. Cameras give good pictures when they stay online.","updated":"2017-03-04T11:40:28-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1551006167","userName":"CstellaC","userUrl":"https://itunes.apple.com/us/reviews/id168264551","version":"3.1.8","score":1,"title":"Stop crashing!!!","text":"I just updated. It was working great, I could see the cameras, update settings and all of that. Today the update came and now the app keeps crashing. I deleted the app, got it again and still nothing. Please fix otherwise the cameras are a waste of money.","updated":"2017-02-23T12:39:05-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1551109060","userName":"Ladyrein05","userUrl":"https://itunes.apple.com/us/reviews/id113315138","version":"3.1.8","score":1,"title":"Update ruined it","text":"I have no complaints up too now. The app crashes anytime I attempt to log in. This is a serious problem as I am rarely home and having been robbed before need my cameras to not only alert me but for me to access live/recorded feed.\n\nPlease fix asap","updated":"2017-02-23T17:31:45-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1325105100","userName":"Jadenyc","userUrl":"https://itunes.apple.com/us/reviews/id24207766","version":"1.0.3","score":1,"title":"Device is useless when you can't even connect your account.","text":"I've been trying to set up a new router connection and set up takes me to scan barcode page. Then nothing works.  Complete waste of money. I've written to company and no reply.","updated":"2016-01-30T12:39:31-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1442936598","userName":"HazyDaze1010","userUrl":"https://itunes.apple.com/us/reviews/id101372936","version":"1.0.3","score":1,"title":"One star is one too many.","text":"If there were awards for least usability, least features and poorest performance, The FunLux app would sweep every category. Amazing that they are a plug and play device company that can't build a freaking app. I'm so sorry I bought this product.","updated":"2016-09-01T11:51:32-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1508394280","userName":"+me add me","userUrl":"https://itunes.apple.com/us/reviews/id106201249","version":"3.1.6","score":1,"title":"Can't view cameras on cellular network","text":"I just updated the app to realize that you can't view the cameras once you are on cellular data. Clicking on live camera view shows \"connection error\". Please fix this issue immediately!!!!!","updated":"2016-12-24T17:56:53-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1323176110","userName":"scott*","userUrl":"https://itunes.apple.com/us/reviews/id23904184","version":"1.0.3","score":2,"title":"BUGS","text":"Great app but to many bugs. That date and time keeps fast forwarding. To like a month ahead. Also I feel like the multiple view of the cameras should be live video feed.","updated":"2016-01-27T02:55:41-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1550986261","userName":"Astoria marr","userUrl":"https://itunes.apple.com/us/reviews/id210727906","version":"3.1.8","score":3,"title":"App crashing","text":"App keeps crashing after the update even after reinstalling it it, please fix!!!","updated":"2017-02-23T11:36:27-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1550855112","userName":"CLA218","userUrl":"https://itunes.apple.com/us/reviews/id155325269","version":"3.1.8","score":3,"title":"Update","text":"Since the recent update it keeps crashing. Before that it was great. Fix please","updated":"2017-02-23T07:06:42-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1552042942","userName":"Mkay218","userUrl":"https://itunes.apple.com/us/reviews/id553163332","version":"3.1.8","score":1,"title":"Terrible app","text":"Now the new update doesn't log you in. It keeps freezing at log in and says timeout. Over all  Funlux is terrible. What's the point of the cameras if I can't use the app to view the house while away from the house?","updated":"2017-02-24T22:49:20-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1550888538","userName":"Jakeman3425","userUrl":"https://itunes.apple.com/us/reviews/id485290488","version":"3.1.8","score":1,"title":"Crap app","text":"I want my money back, the app keeps crashing every time I open it. I am relying on you to make an app so I can watch my daughter at night. Take the time and make your app work the way it suppose to. You guys are a joke, I want my money back.","updated":"2017-02-23T08:04:03-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1551607770","userName":"Dirt207","userUrl":"https://itunes.apple.com/us/reviews/id172690499","version":"3.1.6","score":1,"title":"Update Crap","text":"Ever since I did you last update, nothing works, why don't you go back to old way, so it works, I'm not crazy, because all the other reviews say same thing.  Get with it.  My cameras are worthless now.","updated":"2017-02-24T07:05:54-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1459212775","userName":"Dhruvesh","userUrl":"https://itunes.apple.com/us/reviews/id49159558","version":"3.1.2","score":3,"title":"Good basic ip camera features","text":"This is my first up camera, so far seems good features.  Camera image quality is ok.","updated":"2016-10-01T11:15:05-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1498811996","userName":"Njshep","userUrl":"https://itunes.apple.com/us/reviews/id43004351","version":"3.1.2","score":1,"title":"But a Different Brand!!!","text":"This app is horrible. As you will see from the other comments, you have to constantly delete and re-download this app on a daily basis. The cameras work great, but this app is not worth the frustration!","updated":"2016-12-09T07:20:33-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1451393782","userName":"Thuc888888","userUrl":"https://itunes.apple.com/us/reviews/id525136980","version":"1.0.3","score":3,"title":"Not work nee ios 10","text":"Need update to work with ios 10","updated":"2016-09-17T13:29:38-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1551084136","userName":"AppPlaya01019","userUrl":"https://itunes.apple.com/us/reviews/id405679485","version":"3.1.8","score":1,"title":"App crashes instantly","text":"This version of the app crashes instantly upon launching it.  The cameras are useless now.  I have removed and reinstalled.  I can't get it to work.  Need fix asap.  I have an iPhone 6 Plus on 10.2.1.","updated":"2017-02-23T16:31:40-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1550912233","userName":"Tappajappa","userUrl":"https://itunes.apple.com/us/reviews/id42491978","version":"3.1.8","score":1,"title":"App Crashes","text":"This app is horrible. It constantly crashes. Have installed, uninstalled, turned phone off and on multiple times. Cameras are useless without the app. Going to return them.","updated":"2017-02-23T08:44:38-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1541557731","userName":"Muman6622","userUrl":"https://itunes.apple.com/us/reviews/id164941834","version":"3.1.6","score":1,"title":"Can't view cameras on cellular connection","text":"Can only view cameras while connected to wifi.  Worthless for a person who doesn't spend 24 hours connected to wifi.","updated":"2017-02-10T08:17:16-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1550816335","userName":"Tennis_Shoe","userUrl":"https://itunes.apple.com/us/reviews/id285776979","version":"3.1.8","score":1,"title":"Horrible update","text":"As if it wasn't bad enough that the video barely works in the previous version, now all it does is force close and can't even use the app at all. Please fix!","updated":"2017-02-23T06:08:21-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1499077812","userName":"BlueDevils2010","userUrl":"https://itunes.apple.com/us/reviews/id180475238","version":"3.1.2","score":1,"title":"App needs immediate fix… crashes without opening","text":"App worked ok first time for installation… that's it… never opened after that, it crashed over & over… installed again - worked ok first time only. PLEASE FIX IT ASAP","updated":"2016-12-09T19:48:45-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1551092296","userName":"Devin Jenkins","userUrl":"https://itunes.apple.com/us/reviews/id173045471","version":"3.1.8","score":1,"title":"Update makes everything useless","text":"The current update won't even open the app now. This needs to be fixed ASAP.","updated":"2017-02-23T16:51:38-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1551070505","userName":"Certainlynotkat","userUrl":"https://itunes.apple.com/us/reviews/id136491840","version":"3.1.8","score":1,"title":"Crashing","text":"Just updated today to the new version and it won't even open without crashing. Please fix!!!","updated":"2017-02-23T15:55:32-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1550955832","userName":"Fteros09","userUrl":"https://itunes.apple.com/us/reviews/id42469372","version":"3.1.8","score":1,"title":"I was excited...","text":"I was excited to see that video was going to work better with 10.2 ... now once I log in, the app crashes ... decent cameras, but the app is very disappointing.","updated":"2017-02-23T10:17:05-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1551734139","userName":"Dmpglide","userUrl":"https://itunes.apple.com/us/reviews/id307018199","version":"3.1.8","score":1,"title":"Funlux","text":"Just had an update today now the app won't work. It opens and shuts down right away. iPhone use. Also very, very slow when opening.","updated":"2017-02-24T11:37:16-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1551031737","userName":":(..,.","userUrl":"https://itunes.apple.com/us/reviews/id179477289","version":"3.1.8","score":1,"title":"App shuts down","text":"The app just updated and now shuts down after being open for 2 seconds, can't even get beyond the welcome screen","updated":"2017-02-23T14:03:09-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1550944072","userName":"x3Mystery","userUrl":"https://itunes.apple.com/us/reviews/id426101098","version":"3.1.8","score":1,"title":"App update","text":"DO NOT UPDATE! I just updated the app and now it keeps crashing. I can't view anything. Once I click on the app, it'll load and crash right after it loads.","updated":"2017-02-23T09:50:12-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1452869970","userName":"Kurtp1959","userUrl":"https://itunes.apple.com/us/reviews/id268506602","version":"1.0.3","score":1,"title":"Funlux keeps crashing","text":"So this app, continues to crash every time I open it. Tried reinstalling and the same thing happens. You guys need to get this fixed!","updated":"2016-09-20T05:10:33-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1550886429","userName":"jpspyro","userUrl":"https://itunes.apple.com/us/reviews/id29910979","version":"3.1.8","score":1,"title":"App crashes on this update","text":"Latest update app crashes when trying to swipe through the welcome screens","updated":"2017-02-23T08:00:37-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1493575557","userName":"Fireeyez","userUrl":"https://itunes.apple.com/us/reviews/id49435052","version":"3.1.2","score":1,"title":"Cam even use the cams","text":"I bought 3 of them but via the app it doesn't setup keep starting over telling me connection timed out. I give up","updated":"2016-11-30T12:04:43-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1551076259","userName":"KoL Fan?","userUrl":"https://itunes.apple.com/us/reviews/id38967087","version":"3.1.8","score":1,"title":"Bad update","text":"Crashes at the opening screen and app won't even open. The update is a huge disaster....please fix it!","updated":"2017-02-23T16:11:50-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1550649425","userName":"R.OsorioG","userUrl":"https://itunes.apple.com/us/reviews/id311352142","version":"3.1.8","score":1,"title":"The app doesn't work properly on iPhone 5","text":"The app close in self few seconds after I try to open it.","updated":"2017-02-23T01:52:50-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1578911099","userName":"javanan008","userUrl":"https://itunes.apple.com/us/reviews/id234665713","version":"3.1.8","score":1,"title":"App won't log in","text":"I sign in put password and email and it won't log in. Just stays in same spot! Can you fix this???","updated":"2017-04-02T06:51:18-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1491007995","userName":"Qazxsdetvbmjfvkkuv","userUrl":"https://itunes.apple.com/us/reviews/id158600654","version":"3.1.2","score":1,"title":"Delete / install","text":"Hardware seems okay, but the app is terrible. I've reinstalled 5 times so far to make it work again.","updated":"2016-11-25T18:50:20-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1551106786","userName":"Eafppp","userUrl":"https://itunes.apple.com/us/reviews/id201496497","version":"3.1.8","score":1,"title":"App crashes on iPhone","text":"The most recent update just crashes on the iPhone. Can't even open the app, it's useless.","updated":"2017-02-23T17:26:50-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1551119604","userName":"Funlux","userUrl":"https://itunes.apple.com/us/reviews/id552911691","version":"3.1.8","score":1,"title":"Waist of money","text":"The app crashes almost instantly therefore I can't set it up these will be going back","updated":"2017-02-23T17:54:02-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1551144349","userName":"Kfoster79","userUrl":"https://itunes.apple.com/us/reviews/id31863376","version":"3.1.8","score":1,"title":"Worked until update","text":"Just crashes as soon as I open the app. Fix ASAP","updated":"2017-02-23T18:39:30-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1551099099","userName":"Lizardrath","userUrl":"https://itunes.apple.com/us/reviews/id149826777","version":"3.1.8","score":1,"title":"Stopped Working After IPhone Update","text":"Waiting for a fix since update. Blinks and closes.","updated":"2017-02-23T17:08:47-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1550966803","userName":"makeitrain4465","userUrl":"https://itunes.apple.com/us/reviews/id38326031","version":"3.1.8","score":1,"title":"Not working","text":"Recent update had made the app useless, won't open","updated":"2017-02-23T10:43:26-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1457026053","userName":"n_gate57","userUrl":"https://itunes.apple.com/us/reviews/id283040657","version":"3.0.4","score":1,"title":"Rendered Useless","text":"The newest update does not support DVRs any longer, only single webcams. No way to go back to the previous version.","updated":"2016-09-27T20:16:06-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1551135073","userName":"Xerox2k11","userUrl":"https://itunes.apple.com/us/reviews/id107556840","version":"3.1.8","score":1,"title":"Update doesn't work on iPhone 7","text":"Use to work great, just crashes in Iphone 7s since the update.","updated":"2017-02-23T18:22:06-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1500763899","userName":"Seannna","userUrl":"https://itunes.apple.com/us/reviews/id332732611","version":"3.1.2","score":1,"title":"App Still seems to be in BETA phase","text":"Application Keeps Crashing. This is a very big hassle. I have to keep re downloading the app.","updated":"2016-12-12T15:24:03-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1552017943","userName":"Davin_dick_ward","userUrl":"https://itunes.apple.com/us/reviews/id335991236","version":"3.1.8","score":1,"title":"Worst app","text":"Constantly crashes and cannot login most of the time","updated":"2017-02-24T22:08:18-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1550923906","userName":"Jonsey666","userUrl":"https://itunes.apple.com/us/reviews/id125854348","version":"3.1.8","score":1,"title":"Update causes app to close","text":"App opens and automatically closes. I cannot do anything. Needs a fix ASAP!","updated":"2017-02-23T09:07:06-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1551096218","userName":"superman595","userUrl":"https://itunes.apple.com/us/reviews/id10835367","version":"3.1.8","score":1,"title":"Useless Right Now","text":"Get the newest update FIXED.  Can't even get passed the new screen!  5 cameras are useless right now!","updated":"2017-02-23T17:01:52-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1551092143","userName":"zhedance","userUrl":"https://itunes.apple.com/us/reviews/id32958158","version":"3.1.8","score":1,"title":"Keeps crashing","text":"Please fix - app keeps closing and the images don't appear.","updated":"2017-02-23T16:51:19-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1551042241","userName":"uptickguru","userUrl":"https://itunes.apple.com/us/reviews/id289549298","version":"3.1.8","score":1,"title":"Junk app","text":"Crashes every time you select. Makes camera uselesd","updated":"2017-02-23T14:35:26-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1584835530","userName":"REDEEone","userUrl":"https://itunes.apple.com/us/reviews/id49257353","version":"3.1.8","score":1,"title":"Waste of money","text":"This app is horrible. Cameras are great if you get the app to work but otherwise they are useless. Will be returning the cameras asap","updated":"2017-04-09T09:59:38-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1551004715","userName":"TaterBug471988","userUrl":"https://itunes.apple.com/us/reviews/id28229204","version":"3.1.8","score":1,"title":"Crash City","text":"Can't even use the app. I log in and it crashes. Guess I'll be returning the camera's.","updated":"2017-02-23T12:34:09-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1499492915","userName":"Oh ma guad","userUrl":"https://itunes.apple.com/us/reviews/id136900428","version":"3.1.2","score":1,"title":"Fix the app","text":"Fix the app because I can't even start it up and what is the point of I ant see my cameras","updated":"2016-12-10T09:50:31-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1439149768","userName":"Brodkin","userUrl":"https://itunes.apple.com/us/reviews/id27332962","version":"1.0.3","score":1,"title":"Crashes on Recent iOS Releases","text":"Want an updated OS? Hope you don't need to access your cameras! They won't work!","updated":"2016-08-25T11:17:14-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1518292243","userName":"Chrysene","userUrl":"https://itunes.apple.com/us/reviews/id181145122","version":"3.1.6","score":1,"title":"Does not work with iOS 10.2 apple","text":"I ended up returning the cameras the app would not connect to the wireless.","updated":"2017-01-08T21:16:58-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1550913389","userName":"camrez77","userUrl":"https://itunes.apple.com/us/reviews/id227396119","version":"3.1.8","score":1,"title":"Poorly written app","text":"It keeps crashing as soon as I open it","updated":"2017-02-23T08:46:43-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1550586923","userName":"Riomoto","userUrl":"https://itunes.apple.com/us/reviews/id42104657","version":"3.1.8","score":1,"title":"Crashes on iPad","text":"This app works well on my Google Pixel and iPhone but crashes on the intro screen on my iPad","updated":"2017-02-23T00:09:34-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1551040411","userName":"Scriss s","userUrl":"https://itunes.apple.com/us/reviews/id537451768","version":"3.1.8","score":1,"title":"App is a Zero","text":"Camera is good but the app is the worse. Returning this product and will not recommend.","updated":"2017-02-23T14:29:35-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1513745625","userName":"Arizromo","userUrl":"https://itunes.apple.com/us/reviews/id525364136","version":"3.1.6","score":1,"title":"Not working on ios 10.2","text":"Please update to work on ios 10.2 asap!!!!!","updated":"2017-01-01T23:51:57-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1550937012","userName":"Bioney","userUrl":"https://itunes.apple.com/us/reviews/id272499266","version":"3.1.8","score":1,"title":"Horrible..!!!","text":"The app just crash after the new update","updated":"2017-02-23T09:34:12-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1551095661","userName":"Camera issue","userUrl":"https://itunes.apple.com/us/reviews/id107368122","version":"3.1.8","score":1,"title":"Keeps crashing","text":"Please fix","updated":"2017-02-23T17:00:23-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1551007008","userName":"Cohens Wayne","userUrl":"https://itunes.apple.com/us/reviews/id35981524","version":"3.1.8","score":1,"title":"Won't Work","text":"Was working fine until yesterday's update. Nooooooo","updated":"2017-02-23T12:41:55-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1550968432","userName":"zschwalbe4","userUrl":"https://itunes.apple.com/us/reviews/id43794700","version":"3.1.8","score":1,"title":"Don't update","text":"App continually crashes after update.","updated":"2017-02-23T10:47:47-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1486889752","userName":"TJM85","userUrl":"https://itunes.apple.com/us/reviews/id171226789","version":"3.1.2","score":1,"title":"Cool cameras, terrible App","text":"Cameras are great, but this app is garbage. It keeps crashing and you're forced to delete and reinstall repeatedly. Awful...","updated":"2016-11-18T15:02:30-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1479838373","userName":"Benbenbenbenben28","userUrl":"https://itunes.apple.com/us/reviews/id22559877","version":"3.1.2","score":1,"title":"App won't work!!!","text":"App fails to open every other day!! Please fix!!!","updated":"2016-11-06T09:23:47-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1537821690","userName":"Silentbob690","userUrl":"https://itunes.apple.com/us/reviews/id49695068","version":"3.1.6","score":1,"title":"Can't use on iPhone.","text":"Update your app so it is compatible with ios10","updated":"2017-02-05T06:22:48-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1552065028","userName":"Brendaenda","userUrl":"https://itunes.apple.com/us/reviews/id120140680","version":"3.1.8","score":3,"title":"Fix it! Please","text":"PLEASE FIX THE APP","updated":"2017-02-24T23:20:48-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1494962791","userName":"1BigTuna","userUrl":"https://itunes.apple.com/us/reviews/id22135637","version":"3.1.2","score":1,"title":"Don't waste your money","text":"Cameras are good value, but app is horrible.  I want a refund.","updated":"2016-12-02T20:09:46-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1550829687","userName":"danny20032003","userUrl":"https://itunes.apple.com/us/reviews/id290732774","version":"3.1.8","score":1,"title":"bad update","text":"after update cannot open app","updated":"2017-02-23T06:27:58-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1507036805","userName":"Big--Ticket","userUrl":"https://itunes.apple.com/us/reviews/id5208447","version":"3.1.2","score":1,"title":"Me","text":"Very poor experience","updated":"2016-12-22T16:50:12-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1579804986","userName":"Dawin6912","userUrl":"https://itunes.apple.com/us/reviews/id101483868","version":"3.1.8","score":1,"title":"No playback","text":"No playback","updated":"2017-04-03T08:36:19-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1532588540","userName":"Marie 413","userUrl":"https://itunes.apple.com/us/reviews/id472317067","version":"3.1.6","score":1,"title":"Wouldn't connect","text":"WOULDNT CONNECT TO 10.3 iPhone so upset","updated":"2017-01-28T17:46:25-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"4799894335","userName":"LS1killer","userUrl":"https://itunes.apple.com/us/reviews/id87353305","version":"5.2.02","score":3,"title":"Started off great.","text":"I bought the outside cameras and they have been nothing but perfect!! Love them! I went ahead and purchased the inside cameras with Audio made by funlux as well. So confusing , I’m supposed to download a different app for the same brand?? When I scan the QR code in my iPhone the camera says ready but the app just sits there and doesn’t proceed to the next screen. My outside cameras literally setup all 3 within 5 minutes. Here I am the next day after getting the inside cameras and still cant connect. Why would the setup be so different than the others ?? Frustrating to say the least","updated":"2019-09-18T06:07:55-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1550947135","userName":"Papi grossy","userUrl":"https://itunes.apple.com/us/reviews/id552862271","version":"3.1.8","score":1,"title":"Funlux app","text":"The app is not working, 😡","updated":"2017-02-23T09:57:19-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1552000236","userName":"dime4000","userUrl":"https://itunes.apple.com/us/reviews/id100796525","version":"3.1.8","score":1,"title":"Soo bad","text":"The worst","updated":"2017-02-24T21:41:08-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1492548216","userName":"Boss dj74","userUrl":"https://itunes.apple.com/us/reviews/id114571815","version":"3.1.2","score":1,"title":"Crap!!","text":"Not a good app","updated":"2016-11-28T12:57:01-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1501547040","userName":"mikemoneysniper3","userUrl":"https://itunes.apple.com/us/reviews/id539273049","version":"3.1.2","score":1,"title":"THIS APP IS HORRIBLE!!!!","text":"FIX THIS NOWWW !!!!!!!!!","updated":"2016-12-13T23:22:43-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"7469699278","userName":"Fredpo123","userUrl":"https://itunes.apple.com/us/reviews/id416793060","version":"6.1.4","score":1,"title":"No recomendable. No deja añadir dispositivos y es normal que los bote sin ninguna razón.","text":"Actualizaciones de la app inservibles. No recomiendo.","updated":"2021-06-15T20:55:23-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1777034797","userName":"FerchoCarde","userUrl":"https://itunes.apple.com/us/reviews/id533612403","version":"4.1.14","score":1,"title":"La dañaron","text":"Ahora solo se ve solo 1 cámara ,mejor usen MeShare está mejor","updated":"2017-09-06T06:55:25-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"6526384535","userName":"JvilleRiderKB","userUrl":"https://itunes.apple.com/us/reviews/id229501524","version":"6.0.6","score":2,"title":"Apple I-Phone issues","text":"Just recently this App stopped working on my I-Phone. It’s fine on my android phone. Did you guys make any recent changes within the last 4-5 days?","updated":"2020-10-11T23:17:58-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"6132463764","userName":"Peggyejay","userUrl":"https://itunes.apple.com/us/reviews/id367810024","version":"6.0.2","score":1,"title":"Recent update error   -   Has been FIXED","text":"6/28/2020. 6.0.0 Failed Update! \nLindabevan2014 Account\n\nStill shows lindabevan2014 and her password when I try to log in. I logged out of the app and I deleted her info and tried to log in under my name and password and it failed! I reset my password twice and it still fails. Please fix this.","updated":"2020-06-28T08:51:08-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"5699696813","userName":"anaq33","userUrl":"https://itunes.apple.com/us/reviews/id1053659657","version":"5.2.06","score":5,"title":"What is happening??","text":"They were working so well but just today the app stared Tripping!!! It’s not working anymore.what happened?","updated":"2020-03-22T21:48:19-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1595229020","userName":"Gman8831","userUrl":"https://itunes.apple.com/us/reviews/id277942454","version":"3.1.8","score":3,"title":"Overall good design-- couples glitches need attention","text":"4-22-17\nApp is more stable. Still have automatic scheduling issue described below. \n\n2-23-2017 update:\nI thought the update would help with the bugs I initially discussed. NOPE. Now the app crashes after being open about 2 seconds. SAD! ONE STAR!\n\nPrevious review: Overall, the design of this app is intuitive and easy to use. The biggest annoyance is that the automatic mode scheduling feature does not work. I set times for the different modes to automatically activate, but it never works, so I am forced to manually change the mode from \"home\" to \"sleep\" every night (and change it back to \"home\" in the morning.) Secondly, trying to access cloud footage from the live stream view causes the app to hang. I am assuming this is because I have not subscribed to the cloud storage, but an error message should appear rather than the app freezing.","updated":"2017-04-22T14:47:35-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"3531421057","userName":"Another_Dissatisfied_customer","userUrl":"https://itunes.apple.com/us/reviews/id290990903","version":"5.2.02","score":1,"title":"Stopped working when WiFi password changed","text":"I agree with other users.  What is wrong with your software staff? Do they even test their software before making it available for general use?\n\nTwo cameras were working fine for a year but as soon as I upgraded my network (still 2.4GHZ) it stopped working.  Is your new so called software?  Is it a Wong QR code? It is not the device.  So work out the problem.","updated":"2018-12-14T17:00:12-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1798550157","userName":"disappointed puzzle lover","userUrl":"https://itunes.apple.com/us/reviews/id187832868","version":"4.1.14","score":1,"title":"Last update disaster sept 2017","text":"Doesn't work any longer on iPad. 9/2017. Useless \n\nDon't you test your updates before release! Open app shuts off as soon as it opens on iPhone & iPad","updated":"2017-09-19T10:48:09-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1780765508","userName":"Sinister2c","userUrl":"https://itunes.apple.com/us/reviews/id16130047","version":"4.1.14","score":1,"title":"Update Broke","text":"I started using this app because the ZMODO update last month rendered my camera DVR system useless. Now they updated this app with same garbage interface API. I can NOT see my cameras 2 thru 8. Pure garbage update.","updated":"2017-09-08T13:04:35-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1779192845","userName":"Keving3379","userUrl":"https://itunes.apple.com/us/reviews/id278091454","version":"4.1.14","score":1,"title":"DO NOT BUY!!!!","text":"Do not buy there dvr or wired cameras they do not work with all the apps they ditched there customers to try and push there wireless. They screwed there customers who is next","updated":"2017-09-07T14:00:03-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1778855334","userName":"crc272","userUrl":"https://itunes.apple.com/us/reviews/id346923114","version":"4.1.14","score":1,"title":"Update","text":"Update ruined the app can only see one camera now useless security system when you cant see all the cameras. This is the same as the zmodo app that quit working last month guess its time to pitch the dvr and go with a more reputable company","updated":"2017-09-07T08:19:44-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1709714785","userName":"Sjacinto","userUrl":"https://itunes.apple.com/us/reviews/id86184633","version":"3.1.8","score":1,"title":"Can't even sign up","text":"Got the 3 cam deal on Amazon day. Then saw the bad app reviews. Decided to give it a chance anyways but the app does not allow me to even sign up. When I put my phone number it tells me it's incorrect. Excuse me??!!\n\nReturning them today.","updated":"2017-08-02T08:21:14-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1571891064","userName":"ja.mack","userUrl":"https://itunes.apple.com/us/reviews/id43726961","version":"3.1.8","score":2,"title":"MUST NEEDED Improvements","text":"As I'm sure most people have done, I bought the products from a lightning deal off Amazon. The app is aesthetic but is hardly functional. The app fails to notify me of when a motion is detected unless I actually go into the all and see/check. In addition the app has crashes in cache or something if you go out of it and return...you literally will have to turn the app off and restart the app in order to regain functionality of it. It also stores the last visual of the room prior to your closing of the app, rather than a preview of the room within a given period of time. There's gonna be a lot of returns of this issue isn't resolved steadfast.","updated":"2017-03-24T18:08:03-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1550930811","userName":"R.rabi","userUrl":"https://itunes.apple.com/us/reviews/id390446761","version":"3.1.8","score":1,"title":"Garbage","text":"This app is garbage if there's anything less that one start I'll give it to them, the App keep crashing I can't open it and there's no any other ways to connect the camera, so now my camera is useless. I just waste my money on this thing I'll send it back and buy a different brand because this's all garbage and waste of money","updated":"2017-02-23T09:21:31-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1550875875","userName":"pablobarbalho","userUrl":"https://itunes.apple.com/us/reviews/id208276636","version":"3.1.8","score":1,"title":"Awful update","text":"Already bad app now updated and crashes before it finishes loading. Wth. So much for your peace of mind.NOT. Also way overpriced.","updated":"2017-02-23T07:41:49-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1550581383","userName":"Sfhoneybee","userUrl":"https://itunes.apple.com/us/reviews/id11375840","version":"3.1.8","score":1,"title":"Please fix the APP!!!!!!!","text":"😢😢😢😢😢\nWith the most recent update. {I'm on an iPhone --running the 10.2.1 update}--- with this most recent I have 5 useless  cameras/VERY EXPENSIVE PAPERWEIGHTS. \n\n 😢😢😢😢😢\n\nYou get \"5 sad 😢😢😢😢😢faces\"--- not 5 stars....\n\nI did \"double check this issue\"-- I downloaded the App on my iPad (most recent update 9.5.3)-- The App works great there--but here is the problem there---- I can only use at my HOME/FREE WIFI HERE (for my IPad)---I can see all my cameras FANTASTICALLY... but really I could just walk down the hallway too!!!! So-- I NEED TO BE ABLE YO VIEW MY CAMERAS ON YOUR APP ON MY IPHONE ---WHEN I AN NOT HOME.--please get this fixed... or I need to return my 6 cameras to Amazon. 😢😢😢😢","updated":"2017-02-23T00:00:45-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"},{"id":"1279256846","userName":"Kempoboy1985","userUrl":"https://itunes.apple.com/us/reviews/id130327930","version":"1.0.3","score":1,"title":"Fix please","text":"I have over 800.00 invested in my cameras and cable. Yes, my cables cost me more than my system. \nWorked great until an update ? Now I must be on the same wifi as the security system. \nHow is this helpful? ITS NOT!\nThe sole purpose for me getting this system was to monitor my business.\n\nI install and maintain networks for small business.. ILL NEVER BUY THIS BRAND AGAIN!","updated":"2015-10-29T20:38:28-07:00","url":"https://itunes.apple.com/us/review?id=1012900028&type=Purple%20Software"}]