[{"id":"4870834386","userName":"paul-hom","userUrl":"https://itunes.apple.com/us/reviews/id18492878","version":"2.3.3","score":3,"title":"IOS 13 has broken the app","text":"I’ve been happily using the app since I bought mu Sonic DAC in 2017.  Unfortunately iOS 13 has broken the app and the remote control function is broken (it now longer appears as a new screen, the app freezes).","updated":"2019-10-01T15:34:18-07:00","url":"https://itunes.apple.com/us/review?id=1016797038&type=Purple%20Software"},{"id":"5958480184","userName":"Title17","userUrl":"https://itunes.apple.com/us/reviews/id25974945","version":"2.4.0","score":1,"title":"Stereo pair of speaker now bricks","text":"Well, what a bummer. I bought a stereo pair of speakers that I use heavily, based on my years of great experiences with many Oppo products. Unfortunately, they decided to get out of the hardware business shortly thereafter. But they still supported the app for a while, so it was not a total loss. Until now. After iOS 13 came out, the app crashed right after startup. Which renders the stereo pair totally inoperable. I can play through one speaker without using the app, but strangely I only get one channel of audio. So basically I have two very expensive bricks.\n\nUpdate. So a year later they released a new version, claiming it fixes the iOS 13 problem. Do not believe it. The app still crashes on startup. Two expensive speakers are still bricks.","updated":"2020-05-17T13:09:32-07:00","url":"https://itunes.apple.com/us/review?id=1016797038&type=Purple%20Software"},{"id":"5628920508","userName":"dregoric","userUrl":"https://itunes.apple.com/us/reviews/id469616358","version":"2.4.0","score":1,"title":"Updated but still garbage","text":"Oppo finally issued update to fix issues with ios 13. However, it seems no one at oppo even tried to use it on ios 13 device. When the screen of ios device goes off and you switch it back on, Sonica app restarts and if you were deep in some albums or tracks, you are just thrown to the home screen and have to start from the beginning.  Awful update. I suggest to stay away from Oppo products. Whether it is audio or smartphones, such support just shows how company stands behind their products. Shame on you Oppo team.","updated":"2020-03-07T08:02:39-07:00","url":"https://itunes.apple.com/us/review?id=1016797038&type=Purple%20Software"},{"id":"7297875460","userName":"MannyFreshTX","userUrl":"https://itunes.apple.com/us/reviews/id497358293","version":"2.4.0","score":1,"title":"Major Disappointment","text":"iOS 13 deemed the app inoperable. While this device is no longer produced, the developers could’ve at least pushed out a final stable build that would work for future OS updates to come.\n\nThis is not the case. Shows that the company doesn’t care for the satisfaction of its long standing customers, but instead just the revenue they produce from their current product line up.\n\nFor reference, when I tried reaching out they replied “thank you for bringing up your concern”. Have not received any further correspondence since.","updated":"2021-05-04T10:38:14-07:00","url":"https://itunes.apple.com/us/review?id=1016797038&type=Purple%20Software"},{"id":"1693631250","userName":"BenkuThomas","userUrl":"https://itunes.apple.com/us/reviews/id22713461","version":"2.3.0","score":1,"title":"Poor remote for an excellent DAC","text":"The Sonia DAC itself is an excellent DAC, but the remote app is dreadful.  The fact that this is the only remote available for the DAC makes it all the more painful.  It requires multiple clicks just to get a fine grain volume control with up and down arrows.  The app seems to disconnect with the device every time the phone or iPad goes to sleep and goes back to the default screen requiring multiple clicks again to get back to the last screen I was using.  I really hope Oppo improves this app to bring it on par with the quality of the DAC or better yet makes a physical remote available.","updated":"2017-07-22T09:16:53-07:00","url":"https://itunes.apple.com/us/review?id=1016797038&type=Purple%20Software"},{"id":"1966251620","userName":"Megakarl99","userUrl":"https://itunes.apple.com/us/reviews/id42733200","version":"2.3.0","score":1,"title":"Utter garbage.","text":"For a company that makes such phenomenal products, this app is astonishingly bad. What’s more it’s the only option for controlling many of their components that they didn’t think to include a standard IR remote with. Volume control and input switching are buried deep in the app, which crashes about 50% of the time during loading. It’s enough to lead me to sell the DAC it controls, or at best move it to a different room where I don’t need a remote to control it. I wish I could give it a half star.","updated":"2017-12-02T19:10:13-07:00","url":"https://itunes.apple.com/us/review?id=1016797038&type=Purple%20Software"},{"id":"5631568833","userName":"wavepacket","userUrl":"https://itunes.apple.com/us/reviews/id267610436","version":"2.4.0","score":4,"title":"Thanks","text":"Thanks for keeping the app alive. I use it often to stream Tidal directly to Sonica and, of course, as a remote control. It’s not perfect (none are) and I like the album art and layout better than on the Tidal app.","updated":"2020-03-07T23:09:33-07:00","url":"https://itunes.apple.com/us/review?id=1016797038&type=Purple%20Software"},{"id":"2041902615","userName":"jdsewell","userUrl":"https://itunes.apple.com/us/reviews/id285714810","version":"2.3.3","score":4,"title":"Good App","text":"I would prefer to have a bit more functionality with volume control but I see potential. Also would be nice for it to display within the app the bitrate currently being played.","updated":"2017-12-30T11:13:22-07:00","url":"https://itunes.apple.com/us/review?id=1016797038&type=Purple%20Software"},{"id":"5750682908","userName":"whothehellneedsnicknamehere","userUrl":"https://itunes.apple.com/us/reviews/id961339836","version":"2.4.0","score":2,"title":"\"Remote control\" function","text":"After the latest update of the application on ios 13 it crushes when try use the function \"remote control\". So you did not fix ios 13 issues but created the issue. Please fix it asap!","updated":"2020-04-02T05:04:11-07:00","url":"https://itunes.apple.com/us/review?id=1016797038&type=Purple%20Software"},{"id":"1943147390","userName":"Ambiwalencjusz","userUrl":"https://itunes.apple.com/us/reviews/id178770911","version":"2.3.0","score":2,"title":"Good but","text":"Excellent product, I like the app but drains battery like crazy.","updated":"2017-11-23T08:43:11-07:00","url":"https://itunes.apple.com/us/review?id=1016797038&type=Purple%20Software"},{"id":"1971378135","userName":"Morse123","userUrl":"https://itunes.apple.com/us/reviews/id24621370","version":"2.3.2","score":4,"title":"App now fixed for IOS 11.2.","text":"The app is pretty solid and what it does it does well.\n\nOverall very pleased.  I am using ApowerMirror app to mirror screen to laptop then onto large screen.\nWould like to see some more exciting images.  For instance showing cycle of artist pictures from the net would be very nice (similar to JRiver theater mode).\nAlso integrated web radio (via URL) would be great.\n\nPlays from NAS storage over DNLA fine but hit or miss with embedded artwork in TAG.","updated":"2017-12-04T19:22:48-07:00","url":"https://itunes.apple.com/us/review?id=1016797038&type=Purple%20Software"},{"id":"5086826901","userName":"Chief_lee_visceral","userUrl":"https://itunes.apple.com/us/reviews/id85462646","version":"2.3.3","score":4,"title":"Confirmed iOS13 broke remote control in the app","text":"Nothing to add. Hope Oppo can fix though I know the product is no longer produced.","updated":"2019-11-04T14:18:42-07:00","url":"https://itunes.apple.com/us/review?id=1016797038&type=Purple%20Software"},{"id":"2935983437","userName":"Buddy Bolden","userUrl":"https://itunes.apple.com/us/reviews/id39794777","version":"2.3.3","score":1,"title":"Sonica Speaker Doesn’t Work, So App is Worthless","text":"Is meant to control Oppo’s Sonica Bluetooth/WiFi speaker. However, since the speaker itself doesn’t work as advertised and isn’t supported by the company (which seems to be in the process of going out of business), the app is pretty much useless.","updated":"2018-07-19T13:59:31-07:00","url":"https://itunes.apple.com/us/review?id=1016797038&type=Purple%20Software"},{"id":"5400238767","userName":"JKKinNYC","userUrl":"https://itunes.apple.com/us/reviews/id1121990467","version":"2.3.3","score":1,"title":"Needs upgrade for IOS 13","text":"Oppo advises that the app no longer supports IOS 13 meaning my Sonica can’t connect to my WiFi. One star for Bluetooth at least still working.","updated":"2020-01-13T16:21:36-07:00","url":"https://itunes.apple.com/us/review?id=1016797038&type=Purple%20Software"},{"id":"7282587416","userName":"fflowwiththego","userUrl":"https://itunes.apple.com/us/reviews/id24499560","version":"2.4.0","score":1,"title":"Unusable in ios 14.5","text":"The app keeps crashing with in seconds of launching on iOS 14.5 both on iPhone and iPad, rendering the app and my Sonica Dac completely useless!!","updated":"2021-04-30T15:47:07-07:00","url":"https://itunes.apple.com/us/review?id=1016797038&type=Purple%20Software"},{"id":"7801045492","userName":"kyawmin1961","userUrl":"https://itunes.apple.com/us/reviews/id1316443201","version":"2.4.0","score":1,"title":"App keep crashing","text":"App keep crashing on iPhone XS but work fine on 11 Pro max with same iOS versions 14.7.1","updated":"2021-09-13T00:24:11-07:00","url":"https://itunes.apple.com/us/review?id=1016797038&type=Purple%20Software"},{"id":"1600866624","userName":"jaynewt","userUrl":"https://itunes.apple.com/us/reviews/id12666133","version":"2.2.8","score":2,"title":"unstable update","text":"device keeps switching off and warns not ready. slower and clunkier than the previous version","updated":"2017-04-29T13:06:00-07:00","url":"https://itunes.apple.com/us/review?id=1016797038&type=Purple%20Software"},{"id":"1500178524","userName":"Coodiss","userUrl":"https://itunes.apple.com/us/reviews/id134872932","version":"2.2.0","score":1,"title":"Very poor Apple Music support","text":"Can't stream Apple Music like you can Spotify connect. Also the app doesn't detect any downloaded Apple Music under \"on this device\". Stereo pairing can only be used if you play music through the app. Therefore if you rely on Apple Music for all of your music playback, it's impossible to use the stereo pairing functionality. Only works for: Spotify users, tidal users, and people who manually loaded songs onto their phone.","updated":"2016-12-11T13:22:12-07:00","url":"https://itunes.apple.com/us/review?id=1016797038&type=Purple%20Software"}]