[{"id":"7778990906","userName":"gobucks22","userUrl":"https://itunes.apple.com/us/reviews/id39537898","version":"3.5.6","score":5,"title":"Excellent App, Needs One Key Feature","text":"Overall, this app is outstanding. One feature I’d like to see is LED brightness control on the schedule feature when Auto mode is enabled. Brightness control is available when manual mode is selected in a schedule, but not in auto mode. I have a HealthProtect 7470i.","updated":"2021-09-06T16:30:15-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7429559423","userName":"ORHobbes","userUrl":"https://itunes.apple.com/us/reviews/id39113257","version":"3.5.3","score":2,"title":"Bad app, great machine","text":"The Blueair Classic 680i is a fantastic air cleaner. (albeit a very large unit) However, the app is lacking in numerous ways compared to competitors… \n\n 1) No Apple HomeKit integration \n\n 2) If you are an Apple user, you cannot add the device to your home automation scenes. (ie, automatically turn on when I arrive home and turn off when I leave home, etc) \n\n 3) No Home Screen widget to see current air quality stats \n\n 4) No integration with Siri Shortcuts app or commands. (they have this enabled for Alexa and Google, so they clearly are just ignoring Apple users) \n\n 5) The setup process to connect the device to your home WiFi is not intuitive and more cumbersome than other apps. It also does not support 5ghz WiFi. \n\n 6) The app requires your exact location, not a close location. That’s a huge privacy concern! Why do you need to know my exact location? Anywhere within a 1/2 mile is close enough for the outdoor air quality levels in the app. You don’t need my pinpoint location. \n\n 7) No notification options. Other apps send you a notification if AQI, PM2.5, VOC, etc goes over specified levels. Blueair sends me nothing. \n\n 8) No firmware update button in the app, so you cannot force it to check for updates. You have to wait until it decides to check on its own.\n\n9) No way to save or export the weekly/monthly data.","updated":"2021-06-05T06:35:38-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7585936291","userName":"idontknowwhat","userUrl":"https://itunes.apple.com/us/reviews/id22351377","version":"3.5.3","score":1,"title":"Good product, Bad WiFi","text":"Filters are great, can tell the difference in my home, as I operate three of them 24/7 in auto mode. The app and WiFi features leave something to be desired. Latest version of the App routinely crashes when I try to access one of my three filters.  Says device is offline, but the control panel on the device says it’s online. I’mi installed all three of them, had to contact tech support website for tricks on how to get the WiFi to connect, as none of the factory provided instructions worked.  With a lot of patience, you can eventually get them to work on WiFi.","updated":"2021-07-17T00:40:17-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7990278538","userName":"coldgrease","userUrl":"https://itunes.apple.com/us/reviews/id123231256","version":"3.5.9","score":2,"title":"App keeps signing me out!","text":"The app is pretty good and used to work fine but now it keeps signing me out. That’s ok - I use a password manager so I can sign in quickly. No problem, right? Wrong. The login screen asks for an email address but it isn’t coded as an email field so my email address doesn’t auto populate. So I need to type in my email address every time I use this app. Every time I want to change the fan speed I need to type in my email address. Very frustrating.","updated":"2021-11-04T23:12:34-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"8059748701","userName":"thare 11","userUrl":"https://itunes.apple.com/us/reviews/id1241698018","version":"3.5.10","score":5,"title":"Quite and just wonderful","text":"I have had my Blue air room air cleaner for 6 months. It is quite and keeps my bedroom fresh and clean air. The app is wonderful and has an easy to use features. I am able to set a clean cycle to quite and medium speed while we sleep. I would recommend this air cleaner to all.","updated":"2021-11-24T16:06:25-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7875287589","userName":"Wth1010100","userUrl":"https://itunes.apple.com/us/reviews/id27590803","version":"3.5.7","score":5,"title":"WIFI issues","text":"Not sure if it’s the app or the device.  I have walked through the setup procedure multiple times tonight with no luck.  Guess I will be calling support.","updated":"2021-10-03T20:00:17-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7914881841","userName":"0ddott0","userUrl":"https://itunes.apple.com/us/reviews/id40726986","version":"3.5.8","score":4,"title":"Great Interface, but the app can not get my location right","text":"Been using the health protect for sometime now and have been enjoying the purifier. However, whenever I use the app the location for my purifier always changes to a location in my direct vicinity and never my actual address.","updated":"2021-10-14T13:08:00-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7745297860","userName":"Direblue","userUrl":"https://itunes.apple.com/us/reviews/id39389744","version":"3.5.5","score":3,"title":"Precision Location Required","text":"FYI\n\nThere does not appear to be a way to use the WiFi features without sharing your precise location with Blueair or those that provide the company with technical services.   This was a big let down. \n\nThe app is useful though. So what would have been five stars is now three because of the questionable requirement.","updated":"2021-08-28T11:52:31-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7777910971","userName":"peaches 212404","userUrl":"https://itunes.apple.com/us/reviews/id962305657","version":"3.5.6","score":1,"title":"Can’t select product when trying to connect a new device","text":"Trying to set this product up and the app is broken, it won’t let me select a product. \n\nI’ve called support, and they’ve done nothing to help, just “it could be your phone?” Even though this issue is documented for other users, and everything else works on my phone ...\n\nI’ve sent an email to info@blueair - but nothing seems to be coming back.","updated":"2021-09-06T08:46:32-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7890030825","userName":"Note owl","userUrl":"https://itunes.apple.com/us/reviews/id15282246","version":"3.5.7","score":2,"title":"Great product but the app needs work","text":"Why can’t you have an iPhone AND an iPad hooked up at the same time??? For example: on your smart phone, you chose your air purifier… reconnect to wifi… wait for wifi to connect. (Yawn) Now if you are using your iPad and want to adjust the air purifier, your no longer connected and have to start the process again. And visa versa. It’s ridiculous!","updated":"2021-10-07T19:24:14-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7640155795","userName":"sndicijsnd","userUrl":"https://itunes.apple.com/us/reviews/id407457119","version":"3.5.3","score":3,"title":"Goes offline and a pain to reconnect.","text":"App functions alright, except for going offline any time the power is disrupted. In order to get back online, have to delete and reinstall app EVERY TIME regardless of network config (no VPN, proxy etc.)\n\nI hope the devs can resolve this. The App’s quality should be commensurate with the price tag of the appliance.","updated":"2021-07-31T12:47:24-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7496816186","userName":"April New Owner","userUrl":"https://itunes.apple.com/us/reviews/id1302433961","version":"3.5.3","score":5,"title":"Blue air 7410i","text":"We highly recommend this product. Very quite and we like the app that monitors the indoor and outdoor air quality. Very easy to use.","updated":"2021-06-23T05:22:29-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"8079488667","userName":"Elonicx","userUrl":"https://itunes.apple.com/us/reviews/id418464673","version":"3.5.11","score":5,"title":"Excellent app","text":"Thanks to the awesome team, the bug was fixed in a very short time. A handy app and very helpful.","updated":"2021-11-30T03:51:28-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"8000129263","userName":"only1jv","userUrl":"https://itunes.apple.com/us/reviews/id211848600","version":"3.5.9","score":1,"title":"Can’t add my Health Protect","text":"I’d love to use the app and give it more of a review, but it’s broken and when I go to tap on adding my health protect nothing happens. If I tap on a different product it just asks me to enable precise location settings. Yet there are no such settings. \n\nEither way, I’m definitely not getting any value out of having a Bluetooth or Wi-Fi enabled device.","updated":"2021-11-07T14:25:04-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7805578377","userName":"Badair@wood","userUrl":"https://itunes.apple.com/us/reviews/id929402537","version":"3.5.7","score":1,"title":"Will not connect","text":"Just bought a new Motorola router and this is the only device in the house that will no longer connect. \n1. It will only see a 2.4 ghz WiFi signal no 5 ghz. \n2. If WPA-2 PSK is selected on router then it will say wrong password. \n3. Changing router to WPA allows it to connect (I will not leave the router on WPA this is just a test) the app then times out on the finalizing step.","updated":"2021-09-14T07:48:00-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7863749448","userName":"Jcryeee","userUrl":"https://itunes.apple.com/us/reviews/id291963644","version":"3.5.7","score":3,"title":"Not syncing","text":"Product work fine. The fan kicks in occasionally  when cooking etc… I don’t understand why app is showing excellent in auto mode while  the fan is blowing hard..","updated":"2021-09-30T19:43:09-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"8046514394","userName":"Deegrr1","userUrl":"https://itunes.apple.com/us/reviews/id39059491","version":"3.5.10","score":1,"title":"Does not use Face ID - PLEASE FIX THIS","text":"This app worked great with my old phone that used fingerprint ID.  However now that I have a new iPhone 13, this app now forces me to fully login with email and password every time I open it. There’s not even an option to remember my email address so I have to manually type it out every bloody time. PLEASE FIX YOUR APP!!!","updated":"2021-11-20T21:43:59-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7563110822","userName":"128hq","userUrl":"https://itunes.apple.com/us/reviews/id100219420","version":"3.5.3","score":1,"title":"Don’t buy WiFi version- COMPLETELY USELESS","text":"I have had nothing but problems with this app. What’s the point of having an app that you have to trouble shoot every couple of weeks?!? Just get the regular versions of the air purifiers and save yourself the headache and frustration of trying to make this useless program work","updated":"2021-07-10T22:21:18-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7711363657","userName":"cnatalizia","userUrl":"https://itunes.apple.com/us/reviews/id100854487","version":"3.5.5","score":5,"title":"Quality and Simplicity","text":"Everyone","updated":"2021-08-19T09:20:07-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7784889870","userName":"Cmecatchu2","userUrl":"https://itunes.apple.com/us/reviews/id34419452","version":"3.5.6","score":1,"title":"Cant sign in after update","text":"Cant sign in, control or even use my air cleaner after last update. I am using Apple 12Pro and Ipad Pro. Neither will Go to sign in keep\nCircling after email address and then pops back out to enter email again. I can sign on to website but that doesnt help me control my unit…..","updated":"2021-09-08T09:45:56-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7195392225","userName":"Stevelabo","userUrl":"https://itunes.apple.com/us/reviews/id235348717","version":"3.5.0","score":5,"title":"April 2021 Health Protect 7770i","text":"In light of the poor reviews, I want to weigh in on my BlueAir app experience. In short, it works and provides loads of control and information. I can only speak for the latest BlueAir HealthProtect 7000 series connectivity, but I’m impressed. No need to open any manuals to set it up. However, first the app attempts to connect via Bluetooth to the unit using my iPhone 12. This is confusing since the unit WIFI icon just flashes and no progress seems to be happening in the app. I didn’t realize that a Bluetooth connection was necessary. It took several minutes before something started happening. I never did see the unit in the phone Bluetooth settings. But it made a connection and immediately I was prompted for the WIFI credentials. From there it was smooth sailing. I recommend to be patient while the Bluetooth connection is automatically established between the app/phone and the filter unit. I cannot complain about the overall experience and the app certainly delivers in terms of data offered. I also use a “non-smart” BlueAir Pro L, two non-smart IQAir Health Pro Max units and two wifi connected Molekule Air units. Overall I prefer BlueAir primarily because they move so much more air at much lower power and noise levels. They are not “true HEPA” in the conventional sense, but air quality monitoring shows they are just as effective.","updated":"2021-04-07T12:21:53-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7786112484","userName":"Hamid Palo","userUrl":"https://itunes.apple.com/us/reviews/id240120602","version":"3.5.6","score":1,"title":"Rarely works","text":"When it works it does what it says. Often you can't log in so your fancy $800 health protect that you left in night mode is not adjustable.\n\nUninstalling etc does not help. Purifiers are great but wouldn't buy them again because of the problems with the app.","updated":"2021-09-08T19:05:13-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7782327479","userName":"hellogoodbye384","userUrl":"https://itunes.apple.com/us/reviews/id1267987859","version":"3.5.6","score":1,"title":"Great Product, App Troublesome","text":"Ever since yesterday’s update, I’ve been unable to log back in. It just hangs at the “enter email address” screen. Additionally, the filter progress often gets reset without my actively doing so, removing the effectiveness of this feature.","updated":"2021-09-07T16:20:26-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"8014716837","userName":"shawnra","userUrl":"https://itunes.apple.com/us/reviews/id110269530","version":"3.5.9","score":1,"title":"Precise location should not be required - privacy issue","text":"This permission request is ridiculous. No reason you need to know the exact location of my filter in my house for the app to operate. Such an invasion of privacy.","updated":"2021-11-11T21:34:20-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"8049215893","userName":"Manbearpig808","userUrl":"https://itunes.apple.com/us/reviews/id235360543","version":"3.5.10","score":1,"title":"So close","text":"App keeps asking for feedback constantly. Fan speed stuck on full for both purifiers. Can only think it’s the app. Tried reinstalling the devices but now can’t connect to wifi. So bad.","updated":"2021-11-21T14:37:04-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7763060147","userName":"Weirdly","userUrl":"https://itunes.apple.com/us/reviews/id85280167","version":"3.5.5","score":1,"title":"App is faulty.","text":"When I click on “Connect Product” the menu opens with 6 choices, but when I make my choice, nothing happens.  I even uninstalled app and tried again.  No luck.","updated":"2021-09-02T08:39:37-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7480028003","userName":"_aleph","userUrl":"https://itunes.apple.com/us/reviews/id376295763","version":"3.5.3","score":1,"title":"Needs precise location…","text":"Why does an air filter app require name, email, pw, and precise gps (approx not allowed) location to use? Beyond absurd. I don’t see why Unilever needs to know my precise location in order to control an air purifier.","updated":"2021-06-18T15:57:07-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7644209000","userName":"chikule2019","userUrl":"https://itunes.apple.com/us/reviews/id999436359","version":"3.5.3","score":1,"title":"Why does this app need precise location?","text":"This app is out of touch with data retention / data privacy standards. It requests precise location in order to be able to connect the device. \n\nThere is no technical reason for this other that marketing purposes. It should be entirely optional, not mandated. \n\nWho knows what else they are tracking? \n\nWithout location, I can’t use this app, so it gets 1 star.","updated":"2021-08-01T15:11:15-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7727079166","userName":"Hastypete","userUrl":"https://itunes.apple.com/us/reviews/id246850870","version":"3.5.5","score":1,"title":"App doesn’t do anything.","text":"Can’t set up device. When I click to add o get pretty pictures of all the models but nothing happens when you click any of them.","updated":"2021-08-23T16:48:14-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7951178838","userName":"foucault","userUrl":"https://itunes.apple.com/us/reviews/id36700925","version":"3.5.8","score":1,"title":"Uninstalled","text":"I keep checking back occasionally to see if BlueAir is listening to customer complaints about the location requirement … clearly they are not.\n\nThey apparently think none of their customers work in tech/software engineering and couldn’t possibly understand this issue, instead of hearing us.\n\nTHEY DO NOT NEED TO READ YOUR PHONE’S GPS TO COMPLY WITH PRIVACY REGULATIONS. \n\nFull stop.  It is a lie if they tell you otherwise.","updated":"2021-10-24T21:10:41-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7686536173","userName":"Sheazer1","userUrl":"https://itunes.apple.com/us/reviews/id470978224","version":"3.5.5","score":1,"title":"Literally can’t be used","text":"It won’t let you add a product. It brings up the menu. You can scroll around. But you can’t select any of the products.","updated":"2021-08-12T19:55:08-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7715721669","userName":"Fgfhbhv","userUrl":"https://itunes.apple.com/us/reviews/id128782076","version":"3.5.5","score":1,"title":"Broken","text":"Useless.  Connect Product does nothing.  No help, either, in the product owner manual, and bought 4 580i machines.  All these useless buttons which don't do anything.","updated":"2021-08-20T13:27:23-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7788276992","userName":"Ajdx41970","userUrl":"https://itunes.apple.com/us/reviews/id26398208","version":"3.5.6","score":1,"title":"Doesn’t work","text":"Takes forever to go through start up process and cannot locate the air purifier.  Junk.","updated":"2021-09-09T09:31:46-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7797325160","userName":"esreverniemankcin","userUrl":"https://itunes.apple.com/us/reviews/id119153469","version":"3.5.6","score":1,"title":"No way to login","text":"Returns to email screen and doesn't ask for a password.","updated":"2021-09-11T23:00:07-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"8034309060","userName":"red at tutu t cuff fix","userUrl":"https://itunes.apple.com/us/reviews/id667144671","version":"3.5.10","score":1,"title":"Getting worse","text":"Every time I open the app it asks me how it’s doing. If I answer it it keeps asking me. Do you guys ever test the app?","updated":"2021-11-17T10:21:58-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"8105438968","userName":"remove the chat option","userUrl":"https://itunes.apple.com/us/reviews/id365882187","version":"3.5.11","score":1,"title":"App won’t sync with device","text":"App wont sync with the device and no one answers the support emails!","updated":"2021-12-07T10:22:27-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"8052997764","userName":"richardo 3","userUrl":"https://itunes.apple.com/us/reviews/id36397586","version":"3.5.10","score":1,"title":"Machine Ok","text":"The machine itself is okay, but the mfg keeps sending these annoying demands to review thier product, which is not okay.","updated":"2021-11-22T17:08:19-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7814200105","userName":"Turbotj","userUrl":"https://itunes.apple.com/us/reviews/id26636748","version":"3.5.7","score":1,"title":"Refusing to let me setup unless I provide my precise location","text":"I am returning the product.","updated":"2021-09-16T21:08:58-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"5204791621","userName":"Trixie Belden","userUrl":"https://itunes.apple.com/us/reviews/id446091376","version":"2.8.6","score":5,"title":"How do people not get this?","text":"I bought five BlueAir Purifiers this past week, three that work with the app. I opened the box, took out the instructions, it told me to install the app, I followed the directions in the app after I downloaded it, and setup took about one minute. I can’t see how anyone could have an issue with that. It also gives you local air quality, options to remotely change the speed on the machine, brighten or lower LED light, filter replacement reminder schedule, and also the ability to schedule automatic start and stop times for the machine through the week, including fan speed and nighttime modes. The app is self explanatory,  easy to use, and does what it needs to do. It’s basically a remote for the machine, or like a thermostat that lets you schedule days and times of use. Just what I need! I can’t figure out why it has such a low rating! I think all the people that have had no problem with it just haven’t taken the time to give it the proper five star reviews it deserves!","updated":"2019-11-27T11:54:16-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"3802011866","userName":"$ is green","userUrl":"https://itunes.apple.com/us/reviews/id982387015","version":"2.8.1","score":1,"title":"Rediculous non functioning app","text":"I purchased the blue air unit to the tune of $800 because it gives air quality readings . The app configurations do not work despite one hour on the phone with Blue Air only to be told that there must be something wrong with my iphone. Really guys I’ve never had a problem before downloading this app , how about the app  doesn’t work properly even with tech support on the other end of the phone giving instructions , talk about unaccountability and passing the blame to consumers for a faulty app .  I will be returning this product for one that gives readings and  costs far less than this product. And last but not least the network that this app insists one connect to is an unsecured network and leaves one open to interception  and I was more than willing to do so to get this units readings . This unit isn’t silent on the third level it’s very loud, the\nPurpose is to clean the air and although the first setting is hardly audible , the advantage to higher settings is to remove vocs that are present without seeing the readings on an app  by just smelling them .\n  Wish I’d paid attention to the other reviews before wasted 4 hours of my time with this tech issue and more importantly the waisted time / effort in now returning the unit. Good luck if you bought this product .","updated":"2019-02-22T12:31:34-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7099445041","userName":"Jim_Kirk","userUrl":"https://itunes.apple.com/us/reviews/id175926222","version":"3.4.0","score":5,"title":"Works well with 7470i","text":"I returned my recent purchase of a 680i for a 7470i.  Reasons for the return: Primarily the LOUD 680i FAN.  Other reasons: the improved aesthetics, the improved premium LCD display (on the 70i series), the improved 4% speed steps for the new fan(via the app), less fan noise and, pleasantly surprising, an app experience I rate as 5 stars with the 7470i vs a lesser quality experience with the 680i.   \n\nWhat worked great was a much easier initial device setup with a Bluetooth link to find and add the 7470i device to the app.  Once added to the app all app features worked well on my Mesh network and I see and control the device on the 5G band.  Compared to the Classic 680i setup, the 7470i was super easy.  FYI setup was done on an iPhone 12 Pro max.\n\nEverything worked so well I decided to get a 2nd larger unit, the 7770i, and I expect setup to be as smooth as it was for the 7470i.","updated":"2021-03-13T12:24:57-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6445840960","userName":"udmouse","userUrl":"https://itunes.apple.com/us/reviews/id34924529","version":"3.0.6","score":3,"title":"Works great, setup feels like an excercise in futility.","text":"I’m not sure where the 1 star rating comes from except that the setup is complicated and the onboard computer on the machine is really slow. The effect of this is that it can take almost 30 seconds for the machine to receive commands from the app during setup. This is a special complication when you need to confirm the presence of an indicator light on the machine from the app (a wrong answer will send you straight back to the beginning of setup).\n\nOnce the machine is setup the app is actually really interesting, giving real-time updates of air quality in your house and reacting quickly to your commands. \n\nStill, my machine only supports 1 WiFi band (2.4ghz), an increasingly obsolete band as we move into faster and faster wireless computing, which is yet another technical hoop to jump through. This app needs some updates but the operation is smooth if you can get to the core functions of the app, and there’s almost no reason to own the higher end machines if you can’t use the app for real time sensor information, imho.","updated":"2020-09-19T08:39:40-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6361816574","userName":"btn","userUrl":"https://itunes.apple.com/us/reviews/id35819701","version":"3.0.4","score":2,"title":"Good Hardware, Poor App","text":"The Blueair filter itself has done a nice job at keeping the air indoors fresh despite the wildfires outdoors. I do wish that it’s automatic fan speed setting would be smarter and drop, for example, VOC levels far enough below a fan speed that it doesn’t need to spin up and down frequently while working to keep levels below a certain threshold visible in graphs in the app. The app has gone from 3 stars (when it had a more white background) to 2 stars in this blue background version. The regular need to constantly swipe to the left to get to present time on a chart finally motivated me to write this review. I also question why the latest version of the app confines itself to using less screen area than the last major version. I experience the issue reported by other reviewers that setting the location for a device doesn’t seem to be saved, and mysteriously “drifts” despite explicitly entering an address. Overall, I would be happier if we could get the old version back, or if Unilever put their considerable resources into producing an app worthy of 2020 (in terms of technology). Thanks!","updated":"2020-08-25T22:58:04-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7250908184","userName":"buybybye2020","userUrl":"https://itunes.apple.com/us/reviews/id537188011","version":"3.5.0","score":1,"title":"Seriously?!?! Is this really an app? Get your act together!!!","text":"I have been using BlueAir for many years when the original app worked great.  Now, this new app has got to be the worst app I have ever used: So why did you replace the app?!?!  I have 22 BlueAir air purifiers of all sorts (I have homes all over with these units) and I am literally ready to throw them all out, as I need to control the units remotely.  I have had to program and reprogram each and every unit multiple times (yes, you read all the reviews correctly - MAJOR headache to program each and every unit for wifi setup — and I’m an engineer!) because of the “buggy” app; it keeps taking my units offline, they appear and disappear on my app, it shows on when it’s not or off when it’s not, and, today, my filter-usage status is not on.  I don’t want to delineate all the other horrific mishaps and “broken” issues with your app, as I read them all on the posts and don’t need to elaborate any further!! \n\nSo when are you seriously and honestly going to fix this app?!  Doesn’t the 1-star rating give you any incentive to scrap this whole app and get some experts to put a real app together that works?!?!","updated":"2021-04-22T06:16:09-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6937169518","userName":"dawg4life91","userUrl":"https://itunes.apple.com/us/reviews/id39168648","version":"3.1.0","score":4,"title":"Updated: App fixed and working well","text":"Appreciated that Blueair tech manager reached out to better understand issues with app and wanted to ensure it was working properly. The app is now working as it should...again I do appreciate that they reached out and especially that the app now works as I constantly recommend this air purifier to family and friends. \n\n—————-\nThis shouldn’t be a difficult app.  Maybe just stop and write a new one from scratch - should be easy for a newbie coder. While the app says it is offline, the purifier is actually online as I am able to minimally control it through Alexa. The only thing that is off is the app.   It is strange to see an app that seems so backwards compared to 99.9% of apps in the App Store. Please fix the app situation as we love the air purifiers.","updated":"2021-01-31T09:45:07-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7001911375","userName":"Fairytalekdp","userUrl":"https://itunes.apple.com/us/reviews/id167957732","version":"3.1.0","score":1,"title":"Bad app experience","text":"I've got and used various BlueAir products over the years, from old school fully manual to remote controlled purifiers to now, smart ones. The purifying part is always fantastic and top of the range, without a doubt. But the smart part... not so good. My brand new HealthProtect took me 2 hours to set up right out of the box as the handbook just says \"follow instructions on the app\" and I couldn't find the purifier for a long time on the phone. Until I accidentally unplugged and replugged it then I finally found the lost cutie. Used ok for two weeks and now I once again lost control of this tower as I rely on the app to use the night mode and check filter status. I've tried replug, re-setup, re-login, re-download the app, everything I could think of. No idea how to let it get working from the phone. Frustrated why they haven't incorporate with Apple HomeKit and Google Assist. It's 2021 anyways and everything smart is linked together and centralized to few powerful apps. And this is certainly not one of them.","updated":"2021-02-16T09:38:49-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7396192744","userName":"Ghandunagar2014","userUrl":"https://itunes.apple.com/us/reviews/id86753531","version":"3.5.1","score":3,"title":"Terrible","text":"Had to maybe reconnect two air purifiers in random intervals to get both to show up on the app. Initially one would show up and upon adding the other one, it would be replaced. Stating there’s only one device indoors. Kind of frustrating. Finally worked after an hour of going at it Also, can we notifications on the phone for when the air quality is bad indoors? That and a setting to change from 24 hour clock display to 12 hour. If I see these requests show up on an update in the future. I’ll be astonished. \n\n Updating review two days later. Spent $1100 on airfpurifers. They’re both showing offline smh\n\nUpdate: reset everything. Reconnected. Seems to be running fine","updated":"2021-05-27T16:45:21-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7164437313","userName":"Boast-not","userUrl":"https://itunes.apple.com/us/reviews/id140916314","version":"3.4.0","score":1,"title":"Functionality","text":"Purchased my first Blueair Air Purifier from Bestbuy today so I registered the device for the extended warranty and thought I might browse the store for other larger room purifiers. But, this app blows like the purifiers themselves. The freakin cookies warning won’t go away, using the “filter”, no pun intended, to narrow down my search didn’t function properly, so went about shopping from another page on the app and it was better till it just randomly closed. I like the, air quality in my area and in my home function, but the location would not allow me to use my own address. Not a big deal since it’s an outdoor air quality test but geez, if can’t even use my exact location that I’m physically typing myself, what’s to say future purchase wouldn’t be sent to the wrong address. I also considered getting a WiFi capable model but this app tells me the Swedes are not up with technology. One of the worst apps I’ve come across.","updated":"2021-03-30T18:28:20-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"4830756297","userName":"heyoni","userUrl":"https://itunes.apple.com/us/reviews/id100053908","version":"2.8.5","score":1,"title":"Another pointless violation of privacy","text":"When I first installed this app, it was fine. It asked for bluetooth for initial pairing, I accepted and immediately revoked it. It asked for my location to tell me the outdoor air quality and I said never. Despite that, the app worked and did everything I could possibly ever want to do with an air purifier’s remote control.\n\nToday, after maybe 3 months of owning it, the app stops working. I figure I’ll just add back the device and that should fix things. This time, it asks for my location, I said no, and this thing, this ungrateful machine that I own replies back: “you cannot add a device until location services are turned on”. What?\n\nWhen did this thing hit puberty and start talking back?That’s it. This app is a useless. I could fake a gps location and put myself in Antarctica just to spite the project manager who’s responsible...but this is too much work. Too many apps requiring way too much information on me to perform the most mundane task ever. I can’t keep doing this.\n\nSo it’s going offline. I’m resetting the device, uninstalling the app and going “old school” where you push buttons ON the device you’re interacting with...no more updates, no more phoning home and no risk of mutiny from my AIR FILTER. \n\nIt’s been a good 3 months Blueair but you gots to go now.","updated":"2019-09-23T21:14:18-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6674953822","userName":"EEINPTN","userUrl":"https://itunes.apple.com/us/reviews/id29709102","version":"3.0.9","score":2,"title":"Each App Updates Causes More Headaches","text":"The previous version up through last week worked OK with some occasional off-line or system dropouts. The latest update yesterday meant, yet again, I had to delete my Blueair units, reboot them and then add them through a 15 minute process...yet again. I also had to reset the locations of the units as, once again, the app assumes I’ve set these up in our neighbor’s house. It’s time for some better pre-release of app testing. One thing that does seem to be improved is the VOC’s level monitoring. Previously, the App indicated all of our units were sensing sky high levels of VOC’s most all the time, which I verified was incorrect. Now, this only happens when we burn candles at evening dinner time.","updated":"2020-11-22T13:42:51-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6440526475","userName":"mrjzou","userUrl":"https://itunes.apple.com/us/reviews/id154248631","version":"3.0.6","score":5,"title":"Unless and confusing","text":"Seriously, Blueair needs to do something with this App.  Complicated to set up, confusing to use and often shows product offline when it is actually working.  I love Blueair products and have been using for over 10 years, but the App really disappoints me!!","updated":"2020-09-17T21:10:19-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"1996007009","userName":"Dan Bahk","userUrl":"https://itunes.apple.com/us/reviews/id158096711","version":"2.5.4","score":3,"title":"Great when works. App needs some additional short-cut buttons.","text":"Had some difficulties when first connecting my Blueair 480i with the app. After many failed attempts, I tried connecting using different devices(iPhone, iPad etc.)and finally got it to work using my wife’s iPhone. I thought I had a faulty unit and was on the verge of returning it for a new unit.  After using it for a week, I noticed that to activate the ‘auto’ mode, I had to cycle through the fan settings.  It would be nice if there was a dedicated button for ‘auto’ mode. Other than that, I am very VERY happy with my Blueair air purifier and app combination. Nothing beats the Blueair when you compare it on all the important factors: performance, low noise and convenience.","updated":"2017-12-14T07:18:36-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7145183884","userName":"szymkjz","userUrl":"https://itunes.apple.com/us/reviews/id39840877","version":"3.4.0","score":1,"title":"Disappointing match for the hardware","text":"I have trouble getting the basic functions to work. It was difficult to enter schedule, only to find it did nothing. I can’t get the schedules to work. At night I like the dimmer control on my 7410i to be set at 1% to turn off the LED bar and still read the screen and about 4% during the day, but takes several attempts to get slider to stop at right place (that low settings).  Difficult to know if my filter subscription is linked to my unit or not. Finally the app shows my outdoor location with address a few houses down, can add correct address, but can’t delete the incorrect address. Looks nice, but not very functional at the moment. The app lacks the same thoughtful design as the hardware in my opinion.","updated":"2021-03-25T19:50:11-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7058539471","userName":"JaBellaNet","userUrl":"https://itunes.apple.com/us/reviews/id107348439","version":"3.4.0","score":1,"title":"Useless","text":"The app is useless! If you have a secure or hidden network, and this is a feature that is drawing you to blueair products, do not buy! How can a company reasonably ask a customer to unsecure their network and open it up to hackers in order for their products to work on WiFi?!?! Solution: have your developers allow manual input of WiFi network!! It’s very simple! \n\nThey also claim that the units filter the air every 12 minutes, even the smallest particles. If that is the case, why did my house still smell of last nights dinner when I got home from work the next day? Both units running 24/7 on high speed...area is only half of what the square footage requirements for the machines...\n\nIf I had known, I would have invested in another company’s products.","updated":"2021-03-02T17:33:12-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6771004486","userName":"TMoneyR523","userUrl":"https://itunes.apple.com/us/reviews/id40456711","version":"3.0.11","score":1,"title":"App completely stopped working","text":"Ever since their release of HealthProtect, the app has entirely stopped working. We have ~15 BlueAir devices around our offices, including HealthProtect. All devices now constantly show as offline, but we have two HealthProtects that show online conveniently. However, if you try to make any changes to one of them via the app, it doesn’t go through and reverts about an hour later on the app.\n\nI’ve tried emailing support through their preferred channels on the website and even Facebook with no response. I’m incredibly frustrated because we rely on the apps to let us know when it’s time to change the filters. I’m giving this one star for the time being since it doesn’t work at all.","updated":"2020-12-19T08:44:21-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"3869061251","userName":"Travel Fellow","userUrl":"https://itunes.apple.com/us/reviews/id87092375","version":"2.8.2","score":4,"title":"So Far So Good","text":"Had some initial trouble setting up my Classic 205’s through the app until I realized it was a PEBKAC error. Turned off MAC Filtering on my router and everything worked perfectly including a firmware update to all three units.\n\nThe app is easy to setup and fairly intuitive to use.\n\nOne suggestion would be to expand the functionality of Night Mode to be able program individual days (or groups of days) differently (i.e.- Have one schedule of on/off period for week days and different one for weekends)\n\nMy only complaint would be to re-think the use of BreezeoMeter for outdoor air pollution levels. That area of the app does not work nearly as nicely as IQAir’s AirVisual app.\nThe current location bounces around too much when staying in one spot and adding places has oddly specific place names. I don’t know if it’s because they have a physical air monitor there or if it’s a function of pinning their map’s location combined with public database analysis from satellite data.","updated":"2019-03-11T04:18:10-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6075173958","userName":"Mr_Blister","userUrl":"https://itunes.apple.com/us/reviews/id31386500","version":"3.0.0","score":1,"title":"3.0 breaks many things","text":"The 3.0 update, despite featuring a cleaner and UI, has a worse UX, which has actually broken a number of things that previously worked:\n1. The push notifications management screen is gone. I still get notifs that I had setup previously but no idea where to modify now\n2. Celsius is the only temperature option\n3. The indoor graphs don’t update with much frequency with the data points anymore, even though the underlying data is there (I can see it via IFTTT connection)\n4. TVOC calculations seem to have changed (which is not inherently bad, but there’s no scale anymore), and I noticed the moment I opened the new app it reset my TVOC readings on the filter to 0 which makes me wonder how reliable it is\n5. The indoor reading on the home screen used to default to last viewed (Eg humidity) but now always defaults to particles which is frustrating if you want to monitor something like TVOCs more closely.\n6. Filter status is now listed as a percent, which is useless for most humans, we think in terms of days/weeks/months so please revert to a time-based measure or at least display both.","updated":"2020-06-14T08:30:43-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6199313742","userName":"dufffader","userUrl":"https://itunes.apple.com/us/reviews/id48998149","version":"3.0.3","score":2,"title":"Cabinair P2i is now supported but...","text":"App crashes when I add it. Happens after the Bluetooth pairing dialog pops up. Tried removing Bluetooth and pairing again, restarting the iPhone etc but no luck. \nSo essentially I see that I can add Cabinair but obviously I need to wait one more update to be able to use it. \nLast review I have 1 Star for regressing vs previous app versions. Now that I see some BT support, two stars. But a feature that doesn’t work is as good as no feature. Better luck next time. \n\nI’ve been using my P2i as a standalone air filter for months now. Too bad I can’t go to Blueair and ask for a refund for the smartphone integration that doesn’t work. That pisses me off slightly.","updated":"2020-07-14T21:23:27-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6518910840","userName":"Btakami","userUrl":"https://itunes.apple.com/us/reviews/id424926807","version":"3.0.7","score":1,"title":"Unusable","text":"Unfortunately you need this app to operate the Blueair 480i.  For the life of me I cannot get this app to work or to even get my air purifier online to work.  I have tried every which way to try and make this work but it is totally useless.  I have not even heard from their support team after I emailed them for help.  Will probably return my $700 unit!  Such a shame, as this Truley had potential.  My other $175 purifier works excellent via the WiFi, not sure why Blueair can get this right!?  This developer is costing the company!  Get a new developer before it all goes to s*&t.  UPDATE: Forget about customer service, there is none.  Wrote to them a week ago 3 times and no response.  Unit being returned.","updated":"2020-10-09T19:33:36-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"5197227354","userName":"D3M0327","userUrl":"https://itunes.apple.com/us/reviews/id936961624","version":"2.8.6","score":1,"title":"Can’t connect to WiFi","text":"I keep trying to connect my iPhone 11 pro max to my Blueair model 205 but the app keeps saying connect to WiFi in which I am connected to and within 4 feet of my wireless router. I troubleshooted my router, my phone(by turning cellular data off, trying my 5G WiFi and my regular WiFi and trying my phones personal hotspot. I find it ridiculous that I bought this unit yesterday under the impression I’d be able to control it through WiFi but I cannot even get the app to connect to WiFi never mind the actual purifier. This is a absolute joke, as the purifier actually works but the company just tries to get you to spend lots money on technology they have yet to figure out.","updated":"2019-11-25T15:33:47-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6689670272","userName":"bones boy","userUrl":"https://itunes.apple.com/us/reviews/id37261296","version":"3.0.10","score":1,"title":"Unbelievable","text":"In my history of downloading apps from the App Store (probably since I’ve used my iPhone 4) I’ve never seen an app that worked so perfectly well, then got updated and became immediately unusable and trash! Since the update, the app is useless. It’s impossible to track anything over time and half the functions don’t work. If I’d known the developers were going to create this nonsense I would have never spent so much $$$ for my air purifiers. The second most important function for these devices is the ability to trend and track indoor and outdoor air changes throughout the season. The developers have made this impossible. It’s incredulous how bad the app is now!","updated":"2020-11-26T18:01:51-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6764046419","userName":"martinwheatridge","userUrl":"https://itunes.apple.com/us/reviews/id132030678","version":"3.0.10","score":1,"title":"Save $70 and a headache do not buy the i Series","text":"The app has significant issues connecting the device to a WiFi network. It requires internet be connected to the WiFi. This suggests the product is phoning home with private data.\n\nNext, the app doesn’t give you the parts per million nor concentration of VOCs. Instead, it uses a continuous time series graph with categorical ratings: Very Polluted, Polluted, Moderate, Good, and Excellent and I cannot find those categories values.\n\nAs such, save the $70 and buy the non-i Series and a stand alone air quality monitor that gives you access to “your data” and doesn’t potentially compromise your security by phoning home with data.","updated":"2020-12-17T11:42:06-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6553104760","userName":"tinsley 13","userUrl":"https://itunes.apple.com/us/reviews/id31928102","version":"3.0.7","score":1,"title":"Challenged App Developers Jeopardizing Future of Blueair","text":"Yep, there’s a reason this app has the absolute worst user rating in the App Store. Set up took an hour with each of my three air purifiers. After set up, the app was buggy and clunky, but at least controlled the devices. Then it stopped working. \nMy home network map shows it’s connected, but I’ve lost any control of the devices. There’s no update function on the app, and all the usual tricks have not worked. Two thumbs down! Time to call China for a new app, you “Swedish” company you... maybe even time to manufacture the beautifully designed device yourself so you can regain quality control.","updated":"2020-10-19T16:48:54-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6465742921","userName":"am_water","userUrl":"https://itunes.apple.com/us/reviews/id24765260","version":"3.0.6","score":3,"title":"Nice visual update, needs HomeKit/Siri support","text":"Once they add HomeKit, there is no reason not to go with Blueair when buying a good air purifier. The app looks much better than the old one but I’m sure they will be working out a few bugs. I’d really like to see the time in AM/PM and not 24 hour military time when doing scheduling.\n\nOverall though it’s an upgrade, and I think is easier to use. The visual air quality graphs are nice but I’m more into just being able to control my purifier manually. \n\nCan we expect HomeKit support someday?","updated":"2020-09-24T21:24:37-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"4335236012","userName":"bunnbun2","userUrl":"https://itunes.apple.com/us/reviews/id16489801","version":"2.8.3","score":2,"title":"Not User Friendly","text":"I have never encountered an app that is so counterintuitive!  It has no explanations how to set up functions and have to contact them to see why it didn’t work. Filling out the form is another trial because it won’t submit and does not tell you what needs fixing. Every line is filled but it goes nowhere. I get on chat and again bland general statements. I insisted on step by Step explanation to try to understand the error. Oh- so many details were left out of the set up of the function. This is really frustrating. Still have other questions but then chat was dropped!","updated":"2019-06-18T09:53:52-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6831975350","userName":"idondon","userUrl":"https://itunes.apple.com/us/reviews/id35417885","version":"3.0.12","score":1,"title":"Terrible/Useless App","text":"They make amazing air purifiers, but will not purchase another one until they fix their app issues. It’s plagued with bugs. There has been multiple updates in December of 2020, but you still can’t connect your product to the app. After putting in the WiFi password, the “connect” button does not work. They need to simplify the app, I don’t care about air quality in the app for my local neighbor. I can use weather apps for that. The developer really needs to fix their app, because they will loose me as a future customer if these app issues don’t get resolved.","updated":"2021-01-04T17:51:00-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6525705402","userName":"bbeheshti","userUrl":"https://itunes.apple.com/us/reviews/id3643182","version":"3.0.7","score":1,"title":"Blueair App ***BROKEN***, can’t connect product.","text":"Blueair App is basically unusable for managing the hardware settings, WiFi settings and managing the Blueair units.\n\n===> when adding a new product (I.e. Classic 205 Blueair, the “Setup my device” doesn’t work when you try to Connect a new product.  The button doesn’t do anything when you click on it. <===\n\nThere is no way to change the WiFi setting on the Blueair product.  The Setting function on the Blueair app basically doesn’t have any settings that you adjust.  The Blueair website and knowledge base doesn’t offer any info on how to change WiFi setting when you need to rename WiFi and password.\n\nWhen the Blueair product loses WiFi and needs to be power cycled, the IOS App doesn’t sense that and continues thinking it is connected.  \n\nLastly, too much clutter on the App.  Population information, etc.  Blueair needs to focus on developing an App to manage the hardware and product first!!","updated":"2020-10-11T17:30:55-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6779267298","userName":"rlpack1956","userUrl":"https://itunes.apple.com/us/reviews/id155798917","version":"3.0.11","score":1,"title":"Lazy","text":"The App is a joke.\nThe connection process is ham-handed and horribly lacking.  It wastes time scamming you into believing it may actually connect directly to your home WiFi when it will absolutely not.  I’ve had these filters for over 5 years and not one time have they connected to my home WiFi without going through a marginally effective manual connection process that takes repeated attempts to actually connect.\nThe customer service and responses are snippy, dismissive and decidedly indignant.  It is incredibly frustrating for such a good product to be negatively impacted because of lazy software development.","updated":"2020-12-21T15:24:26-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6419263623","userName":"great purifiers. Useless app","userUrl":"https://itunes.apple.com/us/reviews/id428125421","version":"3.0.6","score":1,"title":"Useless","text":"The old version of the blueair friend app was very useful. Both in determining the quality of the indoor air as well as the outdoor air. Also it allowed you the option of controlling connected blueair purifiers. However, the last several “ updates” have rendered the app useless. The information displayed referring to air quality is completely inaccurate. Even attempting to use it is very frustrating. The old app was accurate and easy to navigate. This makes it pointless to purchase the blueair aware air quality monitor as you can’t actually see any accurate values through the app.","updated":"2020-09-11T14:43:57-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7316950895","userName":"RockNRowBoat","userUrl":"https://itunes.apple.com/us/reviews/id32212205","version":"3.5.1","score":1,"title":"Worst app on my phone","text":"First it took almost an hour to get a password set with their ridiculous requirements for passwords as if I’m securing Fort Knox instead of a fan in a box, that’s a major pain in the rear. Next, I’m unable to resister my air cleaner to receive the extended warranty because the text on the registration page is not at all legible so there’s no way to tell what to put where.\nI’ve got half a mind to return the $600us  air cleaner (a fan in a box) because of this horrible app.  If they can’t create the simplest app that this product requires, can they be trusted to make a functioning, reliable air cleaner?","updated":"2021-05-09T03:45:29-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6966816839","userName":"In Need of Quality","userUrl":"https://itunes.apple.com/us/reviews/id623587048","version":"3.1.0","score":1,"title":"App Still Doesn’t Work","text":"Seemed unimaginable that such a good brand would have such a poor interface. I actually didn’t believe the reviews. \n\nFirst the app wouldn’t pair with the purifier. Then, with the help of technical support it finally paired. The support person was hopeful a new version of the app just been released would resolve many of the chronic issues. Unfortunately many of the control features and data display are non-existent!!!!! \n\nMy issue was escalated to the next level of support two weeks ago but I have heard nothing. I simply want to turn off that blue LED and set the schedule so it doesn’t wake me at night. The support person (who actually tried to be very helpful but was not supplied the tools or knowledge to do so) actually suggested I put a piece of tape over the LED. \n\nThe unit is quiet, but I am very unlikely to purchase another given the very ill equipped customer support. Seems to be a chronic failure here.","updated":"2021-02-07T13:13:23-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6615808848","userName":"dapotamus","userUrl":"https://itunes.apple.com/us/reviews/id25100799","version":"3.0.7","score":2,"title":"Broken scheduling feature","text":"I own a Classic 580i. There is a serious bug when trying to schedule my air cleaner. The ability to choose a scheduled time is severely broken because the time picker does not display properly. The choice of times is obscured off the edge of the screen/window. This functionality is broken on both iPad (13.5) and iPhone (14.1), though in different ways. Please address this ASAP as using the app to schedule and control the cleaner is a core part of the premium attached to your Classic products.","updated":"2020-11-06T09:53:57-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"3423034421","userName":"whywontitwork??????","userUrl":"https://itunes.apple.com/us/reviews/id49592943","version":"2.8","score":1,"title":"Used to work... now doesn’t","text":"I just moved to a new location and now can’t get my Blueair aware sensor to connect to the internet. I’ve tried the normal and manual protocols in every way I can think of. It will set up to my phone fine, but just says OFFLINE and the sensor blinks orange. The “contact support” page on the app is blank - doesn’t give me any option for contacting support. I’ve reached out via Facebook with no response and the support link on Apple store links to an insecure page with a warning. I’m hoping this wasn’t a huge waste of money and the company gives me some actual way to get in contact with tech support.","updated":"2018-11-15T21:29:50-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6991237488","userName":"Mara C.","userUrl":"https://itunes.apple.com/us/reviews/id312228582","version":"3.1.0","score":1,"title":"New app won’t work.","text":"In 2020 I purchased 3 classic air purifiers from Blueair. With littke work I was able to connect my smart device to remotely control all of them, last year at purchase. 6 months later the company changed the app and none of my Blueair air purifiers will communicate with my modem-router. I have spent numerous hours trying to troubleshoot this problem. I’m really mad because I spent a lot of money on these air purifiers and replacement filters. I can no longer tell when the filter is dirty since the sensor and indicator light won’t reset with newly replaced filters. #BlueairPleaseFixThisIssue !","updated":"2021-02-13T16:47:37-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6068707948","userName":"paulfromcalifornia","userUrl":"https://itunes.apple.com/us/reviews/id4456152","version":"3.0.0","score":1,"title":"It’s gotten worse!","text":"This update is much worse than the previous version. The only new piece of information is the level of PM 1, which is nice. The vertical scale of the data seems to be compressed. I can’t see any variation in the graph for any of the indoor sensor data. Also, I can find out how to display temperatures in Fahrenheit. Should be easy to fix ... The outdoor data does not seem to be correct. What is the source? It used to be breezometer. The time granularity now seems to be very coarse. Please consider improving! For now, I will try to revert to the previous version of the app, if possible.","updated":"2020-06-12T17:31:51-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"5660690101","userName":"NickyCJ*","userUrl":"https://itunes.apple.com/us/reviews/id167384828","version":"2.8.6","score":3,"title":"App troubles","text":"I had the same issues mentioned in other reviews with registering a device. I even tried on multiple devices without success. I deleted the app from my phone but then decided to try a few days later. I allowed bluetooth and it connected to my device right away. Only handy feature is changing device speed. I thought it had sensors to read air quality but turns out that’s only for select machines.","updated":"2020-03-14T10:53:05-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6071627280","userName":"userj1357246","userUrl":"https://itunes.apple.com/us/reviews/id339735195","version":"3.0.0","score":1,"title":"Very bad app update, not user friendly.","text":"This is a complete opposite of what we saw on the previous app, which was useful, give it back! The main features to show air components change on the purifier by the time is soooo confusing and the chart is not clear, it’s just bland - like there is no change. And why the temp all of a sudden in C? I really don’t mind that, but it’s a big change from previous F. The color of the app is dark, I prefer it white and clear like an air that the air purifier clears. It’s a lot to get used to and I don’t know if I can use it as much. Please make another update.","updated":"2020-06-13T10:11:19-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"5938576049","userName":"Omgxdjk","userUrl":"https://itunes.apple.com/us/reviews/id217123278","version":"2.8.6","score":1,"title":"Yeah... the app still doesn’t work","text":"Even though I am connected to the blue air Wi-Fi, the app keeps telling me to connect to it. I have tried everything.\nI then see replies from the company that say the app was updated and the bugs were fixed... it’s just frustrating to see a company lie about this. \nI just want to connect to get the air quality data, which is supposedly included in the very high cost of this machine, however I am unable to no matter what I do. \nBtw I am a 25 year old college kid who has a ton of tech experience... it’s really just a problem with this app.","updated":"2020-05-12T21:52:11-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6280788379","userName":"rogovin1980","userUrl":"https://itunes.apple.com/us/reviews/id510619297","version":"3.0.3","score":1,"title":"Nightmare app","text":"This app is such a nightmare, both before and after the update. It’s almost impossible to connect it to the device. My husband and I tried it for hours and it just takes you in a loop of connecting with different flashing symbols and having to enter your WiFi password 20 times.  Then, in the one time we could get it connected, it doesn’t stay connected. Some nights I can adjust the device from my phone, other nights not. They need to get it together with this app especially given the purifier is SO expensive!","updated":"2020-08-04T17:32:20-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"4870810588","userName":"hkremer","userUrl":"https://itunes.apple.com/us/reviews/id37001451","version":"2.8.5","score":1,"title":"Pathetic.","text":"Auto setup didn’t work, tried it about three times. Then the manual config, that didn’t work either. Joined their config network and came back and hit Done, nothing happened.\n\nHere’s my advice to companies like Unilever who are trying to get digital. If you can’t do it. Don’t. Just do what you do, and don’t try to get all modern. Sell reliable stuff. Don’t waste people’s time with half baked apps. I have lots of smart home stuff. This is the worst so far. \n\nI wish I would have read these abysmal reviews prior to buying the unit, which is going back, and your supplier is going to pay return shipping.","updated":"2019-10-01T15:24:40-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6801473467","userName":"135whybother","userUrl":"https://itunes.apple.com/us/reviews/id998914912","version":"3.0.12","score":1,"title":"Disappointed","text":"I’d give it no stars if I could! I can’t even get the app to connect to my purifier to see how it’s actually working. I called customer service and they took a message. Why bother answering the phone if you can’t help?!?!? I’ve tried all the connection tips, no luck. Interesting that there are so many instructions to troubleshoot their app - almost like they know it doesn’t work?!?!?! I can only assume the machine is actually doing what it’s supposed to do - it would be nice to be able to see the information instead of assuming!","updated":"2020-12-27T18:28:22-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"1599184979","userName":"Morphy1983","userUrl":"https://itunes.apple.com/us/reviews/id376921989","version":"2.3.1","score":3,"title":"Smooth but need more features","text":"The app works smooth but that's it. Schedule function should be quite basic in current smart devices market but it doesn't have it. Night mode is quite confusing, what will it do after the night mode end? just turn off or resume back to the mode before night mode start? Also lacking of simple timer, ex: 1hr/3hr...etc. These are not diffifult feature if you already build a App could do wirelessly control.","updated":"2017-04-27T13:58:32-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6156425557","userName":"Blueface90210","userUrl":"https://itunes.apple.com/us/reviews/id125362177","version":"3.0.1","score":5,"title":"Works Well For Me","text":"Got the air cleaner on 7/3/20 and the app makes it relatively easy to connect to the machine. Easier than my Roomba app connection.  And the app functionalities are very useful and intuitive. Good job Blueair - from what I’ve heard from others the app was a disaster; you must have fixed the issues!","updated":"2020-07-04T06:04:02-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"4034565609","userName":"SF Cavendish","userUrl":"https://itunes.apple.com/us/reviews/id32427439","version":"2.8.2","score":1,"title":"They make GREAT air purifiers but this app should go back to the drawing board","text":"1. I tried to create an account. I entered my email address, then it asked me to enter my password. I entered a password. It said that it was incorrect. Um... I was trying to create a password, how could it be incorrect? I tried 3 times. Same result. \n\n2. I tried to change the Temperature setting so that it would be in Fahrenheit. I changed it but when I went back to settings, it had changed back to Celsius. I changed it again. When I went back to it, it had gone back to Celsius again. I tried 3 times. Same result. \n\n3. I then tried to see the air quality for my area. It said that it was “good” and gave an air quality index number. No explanations, no details. And there was no reference to the outside temperature. Once more, I tried it 3 times. Same result. \n\nWhile BlueAir makes excellent air purifiers, this app is an insult to the brand.","updated":"2019-04-19T16:27:29-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6736348262","userName":"Tompsk644","userUrl":"https://itunes.apple.com/us/reviews/id107875450","version":"3.0.10","score":1,"title":"Non functional App","text":"Bought the air purifier based on the historical reputation of the company. Fundamentally the app does not work, will not setup the fan and so you lose a bunch of functionality. \n\nAlso didn’t appreciate the fact that you have to accept their cookies if you go through their support line on the app on a phone. Not sure if that is California compliant but certainly makes me want to return this unit unless something miraculous happens in terms of customer support and solutions (which based on the reviews below is an open question).","updated":"2020-12-09T20:36:58-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6809030251","userName":"DCGJGG","userUrl":"https://itunes.apple.com/us/reviews/id168574160","version":"3.0.12","score":1,"title":"Ridiculous","text":"I’ve not been able to connect a unit in months, despite previously having the ability to do so. It’s obvious this company cares nothing about its customers and is falsely advertising the products it sells. Shame on them. If you’re looking at these reviews prior to purchasing a unit, don’t give these people your money. You’ll regret it.   The poor quality of this app and this company’s response is starting to make me question the quality of the purifier units. Is my air truly cleaner?  Can we trust that the purifiers work as represented?","updated":"2020-12-29T19:24:58-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7167568145","userName":"EveryoneIsAnotherYou","userUrl":"https://itunes.apple.com/us/reviews/id32958576","version":"3.4.0","score":3,"title":"Buggy app - schedules offset by 1 hour for US customers","text":"The app has a bug for HealthProtect 7470i air purifier customers in the US, where a schedule set to begin at 8:00 AM actually does not begin until 9:00 AM. This is likely due to a daylight savings time or other calculation error in the app. Overall the app is fairly reliable and full-featured, but has a lot of “fit and finish” issues like this, that need to be addressed.","updated":"2021-03-31T11:06:05-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6496158737","userName":"Red Sox!!","userUrl":"https://itunes.apple.com/us/reviews/id930621154","version":"3.0.7","score":3,"title":"Why Does it Turn Orange?","text":"The BlueAir Aware is an affordable way to get an idea of air quality, but the app gives very little quantitative data to actually figure out how bad the air really is. For example, our unit turns orange sometimes, indicating pollution, but the PM2.5 is excellent and the VOCs are good to moderate according to the app. I’m guessing the carbon dioxide calculation is triggering the orange light, but that’s just a guess because the app doesn’t show that (it apparently used to).","updated":"2020-10-03T07:49:24-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7160447610","userName":"Rabinski J.","userUrl":"https://itunes.apple.com/us/reviews/id394026309","version":"3.4.0","score":1,"title":"Blueair App","text":"I have never had a more difficult time connecting to an app.  I managed to do it with great difficulty when I first got the Classic filter after many tries.  If you lose a connection the best thing to do is disconnect the filter from power and plugging it back in after totally deleting the app from your iPhone and then reloading it and setting it up from scratch.  Start fresh!  I am a retired operations manager and IT director at a county of 550,000 residents and I understand software and how it should work.  Need I say more?","updated":"2021-03-29T17:37:05-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7325463270","userName":"Secryt","userUrl":"https://itunes.apple.com/us/reviews/id43197911","version":"3.5.1","score":5,"title":"It works fine!","text":"I don’t know what all these negative reviews are but the app is simple and functional. It looks nice and does everything you need it to do. Pretty sure the bad reviews are just spamming or literally they got a non-WiFi unit and are just confused.","updated":"2021-05-11T06:34:24-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7164941147","userName":"Tim Cook Is A Hoser","userUrl":"https://itunes.apple.com/us/reviews/id490120633","version":"3.4.0","score":1,"title":"Useless","text":"Doesn’t recognize that phone is connected to 2.4g wifi. Won’t add device.\n\nAlso, why does this app need location services? Seems like obvious spyware to me. And why does the device need to connect to my wifi network? Again super fishy.\n\nDeleted the garbage app from my phone and life. Thankfully, I bought a basic model and not a “smart” model.\n\np.s. comments from Blue Air rep condescending and off base. the 605 does have a wifi chip and the only way to turn off the insanely bright led (nobody would want that in their bedroom) is to go through a long process of downloading their ultra glitchy app, create a blue air account, connect the 605 to wifi, and use the app to turn off the led. outrageously stupid process, which in the mean time gives these morons all your personal info. sry man you can’t polish garbage.","updated":"2021-03-30T21:41:58-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7129108898","userName":"Snowy101","userUrl":"https://itunes.apple.com/us/reviews/id176191133","version":"3.4.0","score":2,"title":"Connection is OK, fan speed is playing funny","text":"By reading a lot of bad app connection review online for the older model. I decide to go a newer model, 7710i. \n\nPro: The app connection works great for 7710i! \n\nCon: \n1. The google assistant integration like a joke, but since this feature is released recently and I hope it got improved.\n2. Both the app and unit itself seems can’t calculate fan speed very well. My fan has a weird pattern: fast on 1, slow on 2, faster on 3, and fastest between 1-2! Worst of all, when it between 1-2, either set by app or on auto mode, it make a very loud whistling noise along with the fastest speed. I have tried several ways and don’t know what to do to fix it. I only owed this unit for 2 days and now I am thinking to return it...","updated":"2021-03-21T13:53:45-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6629040916","userName":"EAS2010","userUrl":"https://itunes.apple.com/us/reviews/id40093524","version":"3.0.7","score":1,"title":"Suddenly stopped working","text":"I don’t know what’s going on. It all of a sudden all of my filtered are shown to be offline. I cannot control them from the app any longer. I have removed and reinstalled the app three times now and cannot get anything to reconnect. The help page on the website looks like it’s broken and I’m at a loss. This worked fine for about 5 months and now nothing works. Incredibly frustrating experience for such an expensive product.","updated":"2020-11-10T03:16:39-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"2120360287","userName":"Love,peace","userUrl":"https://itunes.apple.com/us/reviews/id160755004","version":"2.6.1","score":5,"title":"love my blue air!!","text":"I love this filter. I have the worst allergies. i now get shots for them, and this filter has helped me a ton. i have two cats (allergic to both) and it does a great job of cleaning the air in my room. I LOVE the new update - it’s so cool to see the air quality at your exact location. highly highly recommend","updated":"2018-01-23T19:48:09-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6877286651","userName":"Bradfld007","userUrl":"https://itunes.apple.com/us/reviews/id37651996","version":"3.0.12","score":1,"title":"App is terrible!!","text":"Where to begin.. the current status is almost always wrong as the date is incorrect and won’t show current day. The fan status and filter status is also out of sync.  When I bought this filter 8 months ago, the app worked well and was fairly reliable. After the update back in the summer, it stopped working and has been totally useless.  Great filter but useless if you are looking for app connectivity.","updated":"2021-01-16T08:32:52-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6697089685","userName":"iamst3","userUrl":"https://itunes.apple.com/us/reviews/id350948937","version":"3.0.10","score":4,"title":"Latest Update Made it Worse","text":"Edit 11/28: App works perfectly now. \n\nApp uploads automatically and now my aware and purifier will not connect. Deleted app and products and still the same error about not being able to connect to WiFi. Please find a new app designer and fix the issue!","updated":"2020-11-28T17:20:01-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"1592666460","userName":"Guidelines","userUrl":"https://itunes.apple.com/us/reviews/id32461646","version":"2.3.1","score":3,"title":"Great start!  Needs more features","text":"This app is a great start. I have a model 205 purifier. I like the scheduling capability of Night Mode, but I'd really like to see a more robust 24/7 scheduler -- multiple 'run' periods per day, a periodic feature. I'd also like to see a one-button run for an hour or two feature. \n\nFinally, it's a bummer you can at least adjust fan speed via the watch app -- now, that would be cool!","updated":"2017-04-19T07:48:12-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6110450303","userName":"Bri cool","userUrl":"https://itunes.apple.com/us/reviews/id175371003","version":"3.0.1","score":3,"title":"App takes long to sync up with device","text":"After finishing setup, the app kept showing the device is offline.  However it is NOT offline.  I can turn the device on and off. That confusion lead me to rerun the setup multiple times. Finally, I gave up and let it sit. After a while, the app finally sync up with the device.","updated":"2020-06-22T19:17:16-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7243494237","userName":"iOSGuru","userUrl":"https://itunes.apple.com/us/reviews/id101354929","version":"3.5.0","score":1,"title":"Pathetic app = pathetic product?","text":"Yet another company that alienates and frustrates its customers by building a pathetic app. I’ve connected via Wi-Fi but the app keeps telling me to connect the product. When I go to the support area of the app to send a message it keeps booting me back to another part of the app. \n\nEither get your act together technically or don’t claim to have a Wi-Fi feature. By having pathetic connected technology you called into question your filtering technology.","updated":"2021-04-20T06:21:39-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6736420822","userName":"luckymetunes","userUrl":"https://itunes.apple.com/us/reviews/id36869393","version":"3.0.10","score":2,"title":"The Ghost of Blue Air Sense","text":"Was working fine on wifi for a few years but with the last update it is not. It ALWAY shows offline, but eirily, it sometimes keeps the schedule! Must be a ghost turning it on at night and then in the AM. I tried it all- uninstalling, unplugging, changing wifi, unsecured wifi, dancing about...but nothing changes to it say it is online. But yet it sometimes starts up at the proper time.  Oooo👻","updated":"2020-12-09T21:12:17-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"1487268904","userName":"CasiStar","userUrl":"https://itunes.apple.com/us/reviews/id123134215","version":"2.0","score":5,"title":"Easy to use and great connectivity!","text":"So happy that there is an app to go along with my blueair. The purifier has changed my life with mine and my husband's allergies and now I can connect to my Aware to see what the levels are like in my home. Easy to use and connect to our wifi. Love it!","updated":"2016-11-19T05:17:07-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6093709158","userName":"Cincinnati Jake","userUrl":"https://itunes.apple.com/us/reviews/id37902656","version":"3.0.0","score":1,"title":"Could not connect app to device.  I give up.","text":"The app would not connect to the device over my WiFi.  It instructed to do so over an alternate network, said it was successful, then I return to the app which said it was not connected after all.  I did it a few times and the same thing occurred.  I like the Blueair device itself but this app is a disaster.  If someone buys the device expecting Wi-Fi functionality they should prepare to be disappointed.","updated":"2020-06-18T17:29:12-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7112632332","userName":"Inertiajpl","userUrl":"https://itunes.apple.com/us/reviews/id28125666","version":"3.4.0","score":5,"title":"Works great with 7440i","text":"Can confirm other reviews, the 7000 series integration with the app is robust, easy to setup and reliable. One thing that still is unclear…it seems that the app needs to be open in order for the scheduled routines to be triggered…","updated":"2021-03-17T04:09:50-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7317627605","userName":"napdizzle","userUrl":"https://itunes.apple.com/us/reviews/id40457512","version":"3.5.1","score":4,"title":"Last update seems to have fixed most major bugs","text":"The last update seems to have fixed the major bugs I’ve been experiencing. Still needs some polish, but this is an app that does what it is supposed to do.","updated":"2021-05-09T07:01:51-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6337989753","userName":"AZC75","userUrl":"https://itunes.apple.com/us/reviews/id10100030","version":"3.0.4","score":1,"title":"Latest app is terrible","text":"Previous versions your air purifiers were the focal point on the application. Now they are consigned to an after thought as the app defaults to showing North Atlantic Ocean weather. The main function of the latest app is to invade your privacy to grab as much identifying information as possible. You are forced to login and enable location services to control your air purifier. In addition the UI looks as if it time warped from the late 90’s.","updated":"2020-08-19T08:36:56-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7263812208","userName":"1$;!:8&/!!:7:","userUrl":"https://itunes.apple.com/us/reviews/id11055546","version":"3.5.0","score":1,"title":"Worst app I’ve ever used.","text":"If you need to be able to control your devices via an application, I would strongly reconsider your choice to use BlueAir devices. The company has made it clear that they do not care about their devices working with an app. You’ll read through these reviews — like I did — and think, “these folks just aren’t tech savvy - I’m sure it’s not that bad.” A few days later you’ll be leaving a review just like this.","updated":"2021-04-25T14:05:15-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6436284515","userName":"ianpollock","userUrl":"https://itunes.apple.com/us/reviews/id18015371","version":"3.0.6","score":1,"title":"Good filter, useless app","text":"Honestly no app would be better than this. There is no real value in this app other than a fancy remote control. The default position of the air quality indicator is sometime last month and then you have to scroll to get to the present day. \n\nI think it is designed to get you to buy the next filter not to actually help you use the filter. You can only pair one device at time it seems.","updated":"2020-09-16T14:45:29-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6823404657","userName":"C Smooth Fly","userUrl":"https://itunes.apple.com/us/reviews/id29955820","version":"3.0.12","score":5,"title":"Beautiful Product","text":"This is a beautiful looking product (Health Protect 7770).  Fan speed 1 makes zero discernible sound. And despite what I read in other posts, the app setup was quick and easy. Awesome product!","updated":"2021-01-02T12:47:30-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7212842616","userName":"Nickname4Rviews@Apple","userUrl":"https://itunes.apple.com/us/reviews/id495990977","version":"3.5.0","score":2,"title":"Incorrect fan speed/filter life","text":"App displays incorrect fan speed on the classic 605. It only displays correct fan speed if fan speed is adjusted in the app. If fan speed is changed via the schedule or on the machine control panel, the app displays incorrect fan speed. Also, filter life is listed at 9999 days and no longer displays correct information. This needs to be fixed.","updated":"2021-04-11T22:59:19-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"5042572354","userName":"Eeyuh","userUrl":"https://itunes.apple.com/us/reviews/id241063353","version":"2.8.5","score":5,"title":"Love it","text":"I use this to check air during fire or smog season. Quick and easy, gives me details about what’s in the air. If we need to evacuate I can easily see where to go for clean air. Easy, useful and helpful.","updated":"2019-10-28T12:10:30-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7049186162","userName":"Fettermen","userUrl":"https://itunes.apple.com/us/reviews/id1097688908","version":"3.4.0","score":5,"title":"Much Improved!","text":"Revised app much improved, easy control of all 4 of my units sitting on the couch!  I have severe allergies and these units have made a huge difference.  Improvements to the app have helped tremendously!","updated":"2021-02-28T07:08:21-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"3367335451","userName":"3rdpig","userUrl":"https://itunes.apple.com/us/reviews/id28928332","version":"2.8","score":3,"title":"Update needs an update","text":"This update is ok except for the graphs.  Liked the previous version where I could pinch or stretch the timeline to get a better sense of how things are changing. Now the line looks too flat. I wish I could exaggerate the y axis to accentuate the changes. Otherwise I like the new look. So we lost the CO2 eq - it was pretty much the same as the tVOC line anyway.","updated":"2018-10-31T23:21:14-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6767353149","userName":"Johnny Warehouse","userUrl":"https://itunes.apple.com/us/reviews/id35963172","version":"3.0.10","score":1,"title":"Terrible app","text":"It's really disappointing that this expensive well reviewed air filter comes with such a crappy expensive app that doesn't work. I've tried to communicate with customer service about this, but getting nothing but a run around. I don't think Blueair is ready for prime time when it comes to their app. I'd recommend getting the models that don't include the app. Just set it yourself manually. So disappointing.","updated":"2020-12-18T09:50:03-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"3408096811","userName":"GGG&G","userUrl":"https://itunes.apple.com/us/reviews/id103433774","version":"2.8","score":1,"title":"Friends it isn’t","text":"Current app is a major step backwards. The Aware can provide 3 pollutants and 2 functions you probably already have in you home with far less expensive instruments, temperature and humidity.  Now CO2 is no longer reported.  History has been reduced to a single graph rather than now, daily, weekly etc. until features of previous app are restored look for a different device.  Contrast is also poor on my smart phone.","updated":"2018-11-11T18:03:02-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6646911236","userName":"RicPunj","userUrl":"https://itunes.apple.com/us/reviews/id43315101","version":"3.0.7","score":1,"title":"Hate the new App","text":"The old app version was so much nicer. Here they have made it look better but made filter info summerised. Earlier Filter info was much better. Date installed. Health. \nThis App is quite horrible, does not read the filters. I have 7 Blueair units on this (live in India) and now 3-4 constantly show offline while the filters show they’re online. \nDon’t like the new App. Give us the old one. It worked perfectly.","updated":"2020-11-14T22:31:13-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6116990586","userName":"MsRoxandroll","userUrl":"https://itunes.apple.com/us/reviews/id468314425","version":"3.0.1","score":1,"title":"App update is the worst.","text":"The new update is so cluttered and requires several steps to see VOC levels. Since the new update the VOC level has not really moved. It is stuck at polluted even though I have opened all windows and have used fans to air out the space. My VOC levels used to be excellent. All other readings have not moved either. Also,  I have not been able to receive notifications. The app is now useless.","updated":"2020-06-24T10:15:50-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"5625080205","userName":"xirr0815","userUrl":"https://itunes.apple.com/us/reviews/id27665236","version":"2.8.6","score":1,"title":"Absolutely useless and wasting your time","text":"I’m trying to set up a classic 208. After the 15th try in which the app is unable to connect, neither manual nor in anyway else and the units magic glowing button always blinking/glowing in a way the app doesn’t offer as a selection option - I’m giving up. \nHow can every cheap China hardware be setup with a button press and a ‘quality product’ drive you nuts just trying?!","updated":"2020-03-06T11:58:48-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7191626137","userName":"MountStHelens","userUrl":"https://itunes.apple.com/us/reviews/id22890712","version":"3.5.0","score":1,"title":"Disconnects from Wi-Fi","text":"I’m having the same problem as many other customers appear to be having. My Healthprotect filter disconnects from Wi-Fi every day or two. Sometimes turning it off and unplugging will fix it. Sometimes I have to delete the app and reinstall it to get the Wi-Fi connected again. Also scheduling doesn’t always work. Very disappointing for such an expensive filter.","updated":"2021-04-06T13:23:20-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6800629694","userName":"terasurfer","userUrl":"https://itunes.apple.com/us/reviews/id11638459","version":"3.0.12","score":1,"title":"Not useful","text":"I’m not sure why the company made the 405 wifi-capable at all, except for marketing.  There’s really nothing worthwhile to do with the app.  You can change the fan speed, and the front LED brightness (?!)...and that’s pretty much it.  I was hoping I could get a view of the indoor air quality throughout the day, only to realize the 405 doesn’t actually have a sensor for this.  I’m ditching the app, undecided so far on the unit.","updated":"2020-12-27T12:53:57-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6999291022","userName":"Antonio M Sena","userUrl":"https://itunes.apple.com/us/reviews/id28919184","version":"3.1.0","score":5,"title":"Works great and easy to use","text":"Connected to my Health Protect 7770i with no issue. Able to control a d set schedule from the app. Love the app and product so far.","updated":"2021-02-15T18:01:37-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6416603808","userName":"cairnsim","userUrl":"https://itunes.apple.com/us/reviews/id103011285","version":"3.0.6","score":1,"title":"Trainwreck of an app","text":"I can’t remember the last time I downloaded an app that simply didn’t work. \n\nThe app requires you to create an account and log in to control your air purifier, but the login screen is entirely broken. It repeatedly shows a confirmation when I tap the button to login, then reloads the same screen. I’ve not been able to sync my new air purifier because the app is in such a bad state.","updated":"2020-09-10T19:40:03-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6102397574","userName":"Colerose412","userUrl":"https://itunes.apple.com/us/reviews/id120208009","version":"3.0.0","score":1,"title":"Doesn’t work","text":"So frustrating. It connected with the device for a week and was so cool. I haven’t been able to connect with it since. Tried reaching out a couple times and it was unfruitful — they just provided the same info as the info on the app and website. Disappointing and frustrating. Seem to get caught in a loop when trying to connect. The air purifier was very expensive.","updated":"2020-06-20T18:13:47-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6855762485","userName":"lelogbook","userUrl":"https://itunes.apple.com/us/reviews/id85626935","version":"3.0.12","score":1,"title":"Terrible","text":"I give up. These are expensive devices which have central features requiring an app - which simply doesn’t work. I’ve spent countless hours trying to find work arounds - and the customer service provides guidance to reinstall the app and restart the Wifi. It’s absolutely horrible and it’s been like this throughout multiple versions. Is anybody from Blue Air reading these reviews?","updated":"2021-01-10T21:04:12-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6423165906","userName":"Axabrax1","userUrl":"https://itunes.apple.com/us/reviews/id32064130","version":"3.0.6","score":2,"title":"September 11 update broken","text":"Never had any problems with this app until the most recent update which broke connectivity with all three of my devices and now I cannot reconnect them! Please fix this. Troubleshoot button does nothing to assist as it assumes the problem is my Wi-Fi rather than your broken, buggy software.","updated":"2020-09-12T17:32:02-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6425940528","userName":"JRNinDC","userUrl":"https://itunes.apple.com/us/reviews/id24572122","version":"3.0.6","score":1,"title":"Garbage app","text":"This app has turned into a useless tool. I tried to login - no luck. Updated the password. No luck. It keeps saying I already have an account. Of course I do. The app keeps trying to set up a new account. The old version of this app worked. This one is worse than useless. Next time I need an air purifier it will not be from Blueair and I cannot recommend their products to anyone.","updated":"2020-09-13T12:12:19-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7161006388","userName":"jinzhangA","userUrl":"https://itunes.apple.com/us/reviews/id357834997","version":"3.4.0","score":1,"title":"Total trash","text":"Have to disable 5Ghz WiFi to get this piece of s connected, after all the work to get it finally connected it starts to dropping off. The UI is miserable to use. I’m using iPhone 12 but the app make my phone slow as 10 years old. Returning the air filter. Feel like a good app developer is too expensive to afford? Well, the filter is way overpriced anyway. Figure it out.","updated":"2021-03-29T21:28:07-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6692840282","userName":"Wiggint","userUrl":"https://itunes.apple.com/us/reviews/id48901707","version":"3.0.10","score":1,"title":"Still won’t connect... Go back to your previous app!","text":"My two Blueair devices both say they’re connected to wifi, but the app won’t find them. \n\nThis app is complete garbage in so many ways. The sensor data readout is buggy, setting up devices is buggy... the entire thing. It is beyond me why you changed the app when the previous version was fine.","updated":"2020-11-27T14:02:08-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6071482931","userName":"Hutch Pciture Co","userUrl":"https://itunes.apple.com/us/reviews/id49594866","version":"3.0.0","score":1,"title":"This new update is terrible","text":"What app company sold you guys on this new refresh? It doesn’t work. Gives the wrong data. Why is the outside data on top for the layout? I didn’t buy the unit to measure the outside. Please correct your terrible ideas. \nIf this isn’t corrected I’m throwing away the until. I’ll send you a video of it outside in the trash as apparently this is what you want to measure.","updated":"2020-06-13T09:22:09-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"1822326984","userName":"Marco Figueiredo","userUrl":"https://itunes.apple.com/us/reviews/id145251067","version":"2.5.4","score":2,"title":"Frustrating setup and monouser","text":"Setting up a Blueair Classic took several attempts - the WiFi communication is cumbersome and requires your phone connecting to an ad-hoc network created by the appliance.\n\nOnce done, my wife tries to also connect but using her own phone and... All over again. After 25 minutes (!) she now has access and can see the graphs and... I lost access from my phone. It only accepts one access. Period. Just brilliant for something at premium price.\n\nAbsolutely frustrating experience; do not recommend to anyone.\n\nAnd won't be able to say whether the monitoring works or not, in which case I argue or doesn't.","updated":"2017-10-02T02:07:16-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6675691832","userName":"2by2","userUrl":"https://itunes.apple.com/us/reviews/id13254061","version":"3.0.9","score":1,"title":"Why do you keep making it worse?","text":"Every update makes this app worse. Last update I had to wait ten days to reconnect my devices successfully. Now another update, and again, i can’t reconnect! Before the last few updates this app worked perfectly for years with no issues. Why are you making this hard?","updated":"2020-11-22T19:03:31-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"1252327599","userName":"SamboSoul","userUrl":"https://itunes.apple.com/us/reviews/id44072972","version":"1.0.2","score":3,"title":"incorrect AQI readings","text":"overall this is a solid application with a nice, clean user interface, however, the AQI reading is way off at least for Shanghai when comparing it to the readings from the US embassy or world air (both show a value of 132 right now when Blueair Friend app shows me an AQI of 80). I think that needs to be looked at.","updated":"2015-09-02T20:16:24-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6823654049","userName":"Ginky Gimlet","userUrl":"https://itunes.apple.com/us/reviews/id36782683","version":"3.0.12","score":5,"title":"Sense+ now works well with Alexa","text":"Latest update has fixed WiFi connection issues and Alexa issues","updated":"2021-01-02T14:24:33-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6341556813","userName":"GoldAcctHolder2","userUrl":"https://itunes.apple.com/us/reviews/id105494415","version":"3.0.4","score":1,"title":"Utter disaster","text":"I have no idea what Blueair was thinking when they released this app refresh. For a company that charges a premium price for their products one would expect the quality of their app and air monitor to match the price. But this is simply terrible, super hard to read, the data for the air quality monitor is most definitely wrong as it’s currently registering 0 PPM in my house.","updated":"2020-08-20T07:49:25-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"3384412451","userName":"75 Grad.","userUrl":"https://itunes.apple.com/us/reviews/id353708291","version":"2.8","score":1,"title":"Won't allow login to account.","text":"App was working until this week. Now it says to login, but then refuses to do so: saying invalid ID or password. Trying to do a PW reset gives you a \"blank\" reset email. I then though ok, try creating a new account, but their server says \"email already exist\"! Tried logging in via iPhone, iPad, and PC and nothing allows me now to control my 400 series Classic purifier. Very disappointed to say it mildly!","updated":"2018-11-05T09:37:18-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6738382408","userName":"jshfhjeibsvagqbjrkr b","userUrl":"https://itunes.apple.com/us/reviews/id34334709","version":"3.0.10","score":1,"title":"Unable to connect 580i to WiFi","text":"This is mind boggling as it’s the only way to see the current and overtime impact of the filter. Would be nice to know what the room started with but after 20 attempts of every scenario (multiple phones, ipad, WiFi, hot spot, etc) it never connects to any device. It cannot be that hard to find a programmer to make this easy can it?","updated":"2020-12-10T09:38:03-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"5620265963","userName":"KappaJee","userUrl":"https://itunes.apple.com/us/reviews/id105647681","version":"2.8.6","score":3,"title":"Does not support 5 Ghz Wifi !!!!","text":"I tried 5 times to connect without success only to finally discover that it mentions 2.4 Ghz wifi in a small print screen. Tried it and it worked perfectly while i was earlier on the 5Ghz getting soooo frustrated.","updated":"2020-03-05T08:49:47-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"5254353952","userName":"feng0hua0","userUrl":"https://itunes.apple.com/us/reviews/id421478526","version":"2.8.6","score":1,"title":"With all due respect, this app is a piece of junk!","text":"Just purchased the unit and trying to set up WiFi connection, it keep saying “Please make sure you are connecting to a WiFi network”. I’m sure I’m connecting to my WiFi (the router is Google WiFi) and my router providing 2.4G Hz network. Both of unit and my phone are right next to my router. What should I do instead of returning the product??","updated":"2019-12-09T19:30:36-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"1577097673","userName":"Oldbeeman","userUrl":"https://itunes.apple.com/us/reviews/id38644732","version":"2.3","score":5,"title":"WiFi Connection","text":"Lost WiFi connection for over a week about a month ago. No problems with the app since.","updated":"2017-03-31T04:36:34-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7011456528","userName":"Pro Ju","userUrl":"https://itunes.apple.com/us/reviews/id119059543","version":"3.1.0","score":1,"title":"Fix your app please","text":"Hi! I knew Blueair is a good product and I really don’t understand why you can’t make your app useable when so many users already telling you there is existing issues with it? Current in the past few months, my air quality shows 0 on every readings, only temperature and humidity showing data, this is a joke right?","updated":"2021-02-18T17:45:24-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6389263975","userName":"MamboTed","userUrl":"https://itunes.apple.com/us/reviews/id35895886","version":"3.0.4","score":1,"title":"WiFi cannot connect","text":"Tried four times to connect the purifier to the app, it shows the unit was successfully added and “checks for updates”. The unit is never added. Aggravating and I was really looking forward to using the app. From other reviews I see, I gather that I’m not the only one experiencing issues. Hope it’s updated soon!","updated":"2020-09-02T18:48:45-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"1817843113","userName":"tomy29","userUrl":"https://itunes.apple.com/us/reviews/id37375211","version":"2.5.4","score":5,"title":"Works Well!","text":"Works as advertised.  No connection issues and love being able to manage the devices remotely.","updated":"2017-09-29T19:19:28-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7387430801","userName":"Sargasso C.","userUrl":"https://itunes.apple.com/us/reviews/id218904083","version":"3.5.1","score":2,"title":"Unnecessary privacy intrusion","text":"This app does not let you operate the appliance you just paid $800 for unless you give the app permission to know your location. And not just your location but your “precise location.”\n\nThis is a totally unnecessary intrusion on privacy and I wish I knew this before buying the machine.","updated":"2021-05-25T10:30:49-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6671684803","userName":"Sunflare98","userUrl":"https://itunes.apple.com/us/reviews/id38541937","version":"3.0.9","score":3,"title":"Love hate relationship","text":"Sometimes this app works great. Sometimes it’s flaky as can be. Luckily when I’ve had issues, signing out and back in seem to fix it (or deleting and reinstalling the app).  Would love to see it more reliable.","updated":"2020-11-21T16:38:25-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6722773046","userName":"nerdicus","userUrl":"https://itunes.apple.com/us/reviews/id38100574","version":"3.0.10","score":1,"title":"Working fine and now can’t get it to connect","text":"It was working fine for over a year and then last week, my 2 units said they were offline and I can’t them to connect back. I’ve uninstalled the app, unplugged and replied the units, tried to start “fresh”. I don’t know what the issue is. Really really frustrating and annoying.","updated":"2020-12-06T00:01:48-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7144565734","userName":"The Real Kel","userUrl":"https://itunes.apple.com/us/reviews/id176105066","version":"3.4.0","score":1,"title":"Cannot get my device to go online","text":"It has been working fine for a few weeks. Today, it only shows offline. I have added the device about six times this afternoon, and every time it is successful, but the app only shows it as offline. What a frustrating piece of useless software.","updated":"2021-03-25T15:41:29-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6689118605","userName":"2Bornot2BImpressed","userUrl":"https://itunes.apple.com/us/reviews/id22406175","version":"3.0.10","score":1,"title":"Cannot connect to device post 11/20 Update","text":"Latest update disconnected my two 680i air purifiersfrom the app. Devices appear on my network map, and indicate that they have WiFi connectivity. However I can no longer manage them via the app despite reinstallation If this is not fixed I will look to return them. Very poor.","updated":"2020-11-26T13:53:00-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6065434849","userName":"anonymous dogggie","userUrl":"https://itunes.apple.com/us/reviews/id977552851","version":"3.0.0","score":1,"title":"New app is horrible","text":"I automatically updated to the new version today and it looks horrible. The chart is not accurate(different from the old app showing on my family member’s phone). The app is very hard to use and everything is squeezed together into one screen. Please roll back to the old version.","updated":"2020-06-11T21:00:54-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6357574708","userName":"Mosan17","userUrl":"https://itunes.apple.com/us/reviews/id15251453","version":"3.0.4","score":1,"title":"Beta quality at best","text":"Where to start? Spent 30 minutes getting 680i to connect to WiFi. UI layout is convoluted and confusing. Feels like a maze. Setting locations is act of futility. Once set, the location changes by a couple homes or streets. This app should not have been released without someone outside the dev team actually testing.","updated":"2020-08-24T19:00:34-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6421401197","userName":"gjahrbdkegrbskrbr","userUrl":"https://itunes.apple.com/us/reviews/id1064749087","version":"3.0.6","score":1,"title":"New app is no good","text":"The old app worked great! It would record PM2.5, VOC, temp and humidity without the app being open so I could look at historic data. It would also send me notifications if particles or temp/hum was too high. It was one of my favorite apps. The new app has none of that functionality. Sure it’s more pretty but the functionality is poor.","updated":"2020-09-12T05:57:43-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7367491104","userName":"AlphaJarmel","userUrl":"https://itunes.apple.com/us/reviews/id14831128","version":"3.5.1","score":1,"title":"App is Leaking Personal Information","text":"I was able to get it to connect to my personal air purifier however someone else is able to go into my Blue Air account on the app and remove and rename my app. The app itself is clearly not secure and people should avoid it until Blue Air fixed their encryptions. First time I’ve ever had this issue.","updated":"2021-05-20T15:09:08-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"3887314096","userName":"gogohoffman","userUrl":"https://itunes.apple.com/us/reviews/id49999429","version":"2.8.2","score":4,"title":"Request Improvments","text":"Aldowledgment of firmware update options would be nice. It locked me in to an update without giving me an option to postpone and no timer to indicate how long I would be standing there.","updated":"2019-03-16T01:51:51-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6774724843","userName":"MakNut","userUrl":"https://itunes.apple.com/us/reviews/id5122297","version":"3.0.11","score":1,"title":"Worse with every update","text":"Unfortunately this app has only gotten worse with time. It used to work flawlessly but now won’t even connect to the filter and has become worthless. If you’re considering getting a blue air because of this functionality save your self the headache.","updated":"2020-12-20T08:33:42-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6622972661","userName":"Jeanluq","userUrl":"https://itunes.apple.com/us/reviews/id387344516","version":"3.0.7","score":1,"title":"Garbage app","text":"Same problem like other folks, the app is impossible to connect with the unit, $880 price tag. Update: even years after using this product they are still having the same issues. The account is still pending verification etc. How are they still in business is beyond me.","updated":"2020-11-08T08:48:25-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6631497315","userName":"Iuyiuyiuy","userUrl":"https://itunes.apple.com/us/reviews/id179514036","version":"3.0.7","score":1,"title":"Do better","text":"Unfortunately... this application does not work as intended.. the bright led light on my health protect air purifier keeps changing brightness on its own . this is a problem when you have it in a child’s room and they are trying to sleep. Fix it or I’m sending the  air purifier back. Hire someone other than the boss’s teenage son to produce a real app.","updated":"2020-11-10T18:00:59-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6310565801","userName":"Tklough","userUrl":"https://itunes.apple.com/us/reviews/id131096151","version":"3.0.3","score":1,"title":"Can’t sign in","text":"The app worked fine a few months ago. Now it won’t let me sign in. I’ve tried changing my password and reinstalling the app but neither worked. The whole motivation for buying your air filter was that I could control it remotely. Now I can’t and it’s too late to get a refund on the filter.","updated":"2020-08-12T06:44:07-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6869208836","userName":"Spezaled","userUrl":"https://itunes.apple.com/us/reviews/id11350204","version":"3.0.12","score":1,"title":"Garbage app!!","text":"This app is awful! It never remembers the settings for both my Sense + units. It keeps saying I need to replace the filters even after I did, and used the reset button. And God forbid you disconnect an air purifier from it...it takes 30 steps and 2 days to bring it back online. I’m shocked BlueAir  allowed this garbage to be released.","updated":"2021-01-14T07:44:39-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6350300744","userName":"fast_lychee","userUrl":"https://itunes.apple.com/us/reviews/id5483474","version":"3.0.4","score":1,"title":"Locations not saved properly, frustrating","text":"If you add locations and save them, the next time you open the app, some of the locations you saved get changed slightly (like moved a couple houses down or the next street over.) Very annoying.  Would be very nice app otherwise.","updated":"2020-08-22T17:13:28-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6692138234","userName":"ebolabrahmin","userUrl":"https://itunes.apple.com/us/reviews/id143136746","version":"3.0.10","score":1,"title":"Endless attempts to connect fail","text":"This worked fine for a bit but then disconnected and all attempts to reconnect will not work regardless of the instructions followed. Miserable connected experience; Austin Air makes a better product without the IoT hellscape of an experience offered by this poorly designed product.","updated":"2020-11-27T09:38:53-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7243784497","userName":"ffiggs","userUrl":"https://itunes.apple.com/us/reviews/id190580957","version":"3.5.0","score":1,"title":"Honestly the worst app I have ever used","text":"If you succeed in connecting it to your BlueAir, then it will be a minor miracle. If you are able to keep it connected and reliably receive data that makes sense, then you my friend, are the Air Purifiers Gold Almighty.  The poor reviews are not an exaggeration, and it makes the entire Blue Air purifier not worth it.","updated":"2021-04-20T07:47:51-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6808012732","userName":"Pazagram","userUrl":"https://itunes.apple.com/us/reviews/id280052855","version":"3.0.12","score":1,"title":"Bad app","text":"Clunky and cumbersome app with hit-or-miss results. I try to only use it to connect my purifier to WiFi and it has the hardest time doing that. Sometime it can’t and I walk away. Then the purifier runs at full blast for hours so I come back and fruitlessly try again. For such high end machines this is a shamefully low end app.","updated":"2020-12-29T12:41:46-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6919627846","userName":"Mr.Ursus","userUrl":"https://itunes.apple.com/us/reviews/id321707711","version":"3.1.0","score":1,"title":"App doesn’t work","text":"I downloaded the app and went through the process of creating an account. Finally, I was able to start setting up the device but noooo. The “Set up my device!” Button is completely unresponsive and doesn’t tap or do anything. The worst app experience ever.","updated":"2021-01-27T05:47:20-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6806181942","userName":"aduebs","userUrl":"https://itunes.apple.com/us/reviews/id148114800","version":"3.0.12","score":1,"title":"Blueair just doesn’t care the customers’ feedbak","text":"All the feedbacks by other customers match my using experience. I have no idea why the company keeps igoring what customers feel about the app. Because of the crap app, I have decided to buy other brand air purifier for my next though the purifier works great.","updated":"2020-12-29T02:14:10-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6768311141","userName":"TallyFL","userUrl":"https://itunes.apple.com/us/reviews/id27198335","version":"3.0.10","score":1,"title":"Zero stars","text":"Zero stars rates the usefulness of this product. I have six Blue Air filters. Great product. This app seems to have gotten worse over time. When I select one of my filters that says offline, the app abruptly crashes. Not user friendly or conducive to solving issues with the app. Very frustrating!!!","updated":"2020-12-18T16:03:50-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6505418554","userName":"Nshuusksjhgadlslndsbbssbhsjs","userUrl":"https://itunes.apple.com/us/reviews/id173822833","version":"3.0.7","score":1,"title":"Pointless App","text":"After upgrade, you lose ability to do the basic control (like fan speed) that previous versions had.  The app is just another way to try and sell you more filters.  Going to return and purchase another brand.","updated":"2020-10-05T21:58:28-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6163054317","userName":"chippo c","userUrl":"https://itunes.apple.com/us/reviews/id107668266","version":"3.0.1","score":2,"title":"Worse than old version","text":"Usability is significantly worse in the new version. It seems to be slightly better in the latest patch, but graphs still do not display properly and purifier control is more difficult.","updated":"2020-07-05T23:48:33-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7214846557","userName":"rimmanay","userUrl":"https://itunes.apple.com/us/reviews/id500035432","version":"3.5.0","score":1,"title":"Unusable app","text":"Wow, should have read the app reviews before spending hundreds of dollars on the ‘smart’ Classic air filter.\nThe smart feature is completely useless because I’m unable to connect the device to the app. Tried 2 different phones.\nNow the VOC light is orange and I’m unable to check what that means.","updated":"2021-04-12T11:02:19-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7166583875","userName":"Ldirt","userUrl":"https://itunes.apple.com/us/reviews/id29814985","version":"3.4.0","score":1,"title":"Used to work fine","text":"Latest update ruined the ability to connect to the air purifier and the machine is acting like it’s possessed by the devil. Constantly changing speeds within mere seconds. \n\nAlso cannot stay logged in to my “account” on the app and the purifier is constantly on and off line.","updated":"2021-03-31T06:33:53-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6867416637","userName":"Spikenet55","userUrl":"https://itunes.apple.com/us/reviews/id31701219","version":"3.0.12","score":1,"title":"Bug fest","text":"This app once you create an account won’t let you login again. When trying to login it keeps telling you that you already have an account. Duh. I am trying to login.  Worst app I have ever encountered since smart phones were developed. I would give it zero stars if I could.","updated":"2021-01-13T20:55:51-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"3298815557","userName":"Jad70887","userUrl":"https://itunes.apple.com/us/reviews/id493861987","version":"2.6.4","score":4,"title":"Pain to setup wifi","text":"Was about to return it before wifi finally worked after a dozen attempts","updated":"2018-10-13T17:31:23-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6753757484","userName":"Fawsh","userUrl":"https://itunes.apple.com/us/reviews/id34330349","version":"3.0.10","score":1,"title":"Keeps saying offline... cant get it to connected","text":"Had for a year .  First connection .. great.. at some point it went offline and haven’t been able to reconnect since. I have tried 15 times. Very frustrating.   Great when its actually online but thats rare or never","updated":"2020-12-14T14:21:55-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6351389949","userName":"TKCv786","userUrl":"https://itunes.apple.com/us/reviews/id535936828","version":"3.0.4","score":1,"title":"Absolutely completely useless app","text":"I connected my device and within half an hour it no longer appears.  I have tried several times to re-connect the device, while the app confirms connection, our device does not appear any more!","updated":"2020-08-23T01:00:25-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6073719403","userName":"Mdt196","userUrl":"https://itunes.apple.com/us/reviews/id100566973","version":"3.0.0","score":1,"title":"Just plain bad","text":"iPad version crashes when trying to set a schedule. Once I’ve set a schedule on my iPhone, I can’t see it anywhere. Does the scheduling app allow only one or multiple schedules? Why must I allow location services to use the app? Come on guys these are amateur mistakes.","updated":"2020-06-14T00:28:41-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"2552379118","userName":"travelingargentine","userUrl":"https://itunes.apple.com/us/reviews/id136376624","version":"2.6.2","score":2,"title":"Couldn’t connect to WiFi. No WiFi security, so skipped WiFi.","text":"After failing many times to connect to WiFi, I finally gave up.  Just as well, because Blueair Classic 605 has no WiFi security and I don’t want it to be taken over/used for a DDOS attack.  Welcome to the IoT.  No thanks.  But I’m definitely keeping the Blueair Classic 605 itself!","updated":"2018-05-15T16:33:51-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"1343453388","userName":"Doki10000","userUrl":"https://itunes.apple.com/us/reviews/id86651922","version":"1.2.4","score":3,"title":"Works well but nightmode doesn't work","text":"The remote control works well, even when away from home and the readings are pretty accurate, however night mode does not work and there is no Siri support.","updated":"2016-03-05T18:37:16-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7085059197","userName":"aimacaimacaimac","userUrl":"https://itunes.apple.com/us/reviews/id134070667","version":"3.4.0","score":1,"title":"Terrible","text":"The app is terrible as everyone described. I sadly bought a 680i at great expense & can’t get it to recognize WiFi - not can I get it to simply function in auto mode from the touch screen. This is horrible and I never would’ve purchased if this were the case.","updated":"2021-03-09T16:58:06-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6721173285","userName":"Doggedly","userUrl":"https://itunes.apple.com/us/reviews/id302389064","version":"3.0.10","score":1,"title":"App not working","text":"When I click on the setup my device button it does nothing. I’ve followed all the trouble shooting steps and still nothing. Very disappointed after spending all this money on a product that doesn’t deliver what it’s advertised to do.","updated":"2020-12-05T12:19:52-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"5107052911","userName":"computerbandgeek","userUrl":"https://itunes.apple.com/us/reviews/id28841508","version":"2.8.5","score":1,"title":"Fails to connect to classic 605 repeatedly","text":"It used to work but I haven’t been able to get it to connect for months. And of course the schedule feature of the filter has now stopped working because it isn’t connected to WiFi.","updated":"2019-11-08T15:14:41-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7050213251","userName":"RipOff Alert","userUrl":"https://itunes.apple.com/us/reviews/id100387833","version":"3.4.0","score":1,"title":"Gives me the blues","text":"How difficult is it to make a app that works? App won’t consistently connect to the filters, does not respond half the time, displays are tough to read, scrolling theu time history is buggy, etc. if there are no app developers in Sweden just outsource the work.","updated":"2021-02-28T12:51:30-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6436633807","userName":"MGM44","userUrl":"https://itunes.apple.com/us/reviews/id25778928","version":"3.0.6","score":1,"title":"Connection between devise and app is a dumpster fire","text":"Great product, nice looking app. When they come together it’s an awful, unhelpful cross your fingers and hope it works disaster. \n\nAny solution that includes deleting the product, logging out, deleting the app and re-downloading needs to be seriously examined.","updated":"2020-09-16T17:30:27-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"4244060677","userName":"caligirl415sf","userUrl":"https://itunes.apple.com/us/reviews/id479910693","version":"2.8.3","score":1,"title":"Unfriendly app, replace engineer!","text":"It’s not a friendly app, I have followed all the instructions and it doesn’t work. Honestly, if you see this many poor review as a developer shouldn’t there be any upgrades. Looking at all the poor review it seems they have not fix the bug and issue. It’s a shame but I’ll be returning my unit.","updated":"2019-05-31T22:43:17-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7016708618","userName":"Graceface ✩","userUrl":"https://itunes.apple.com/us/reviews/id36173591","version":"3.1.0","score":3,"title":"Schedule will not save LED settings","text":"Unfortunately the Schedule will not save the selected LED setting.  It will insist on changing it to the default setting of its own. Defeats the purpose of having a schedule!","updated":"2021-02-20T01:55:10-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7332540246","userName":"huskyboy56320","userUrl":"https://itunes.apple.com/us/reviews/id12772876","version":"3.5.1","score":1,"title":"Useless app","text":"It used to be good app where you could check indoor air quality but after redesign it’s completely useless. It logs straight line for months on all parameters not to mention that graph is tiny fraction of the size it used to be. Bring back old version!","updated":"2021-05-13T00:09:32-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6750940148","userName":"M1V22","userUrl":"https://itunes.apple.com/us/reviews/id43930822","version":"3.0.10","score":1,"title":"Awfully unreliable","text":"I’m using a classic 680i with this app but this  app never reports the 680i is online even though the 680i is connected to WiFi correctly. \nWe love the 680i but this app spoiled the value of 680i significantly. We really wish Blueair fixes this app quickly (the issue is persisted more than 4 months).","updated":"2020-12-13T19:22:07-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6746411470","userName":"bobzilla03","userUrl":"https://itunes.apple.com/us/reviews/id49526719","version":"3.0.10","score":1,"title":"Unbelievably bad app!","text":"You have to create an account to start you air filter, this is ridiculous.  You can’t cut and past you password into the itsy bitsy field they give you in the app. This app is horrible, it makes me want to return it without even starting it up :-(","updated":"2020-12-12T13:11:55-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6476956352","userName":"mrouhana","userUrl":"https://itunes.apple.com/us/reviews/id242480248","version":"3.0.6","score":1,"title":"Disappointed","text":"I am very disappointed with this app, although I thought a product made by Unilever should be of a certain standard like what we are used to. I don’t recommend blue air system at all, bad experience , I wish I bought something else","updated":"2020-09-28T02:40:55-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6158904981","userName":"R. Reventlov","userUrl":"https://itunes.apple.com/us/reviews/id361788551","version":"3.0.1","score":1,"title":"Extremely dissatisfied","text":"I don’t usually leave negative reviews, but this app has become so terrible that I was compelled to do so. Basically it’s become less user friendly and now no longer shows accurate information for PM2.5 or VOC. If I could rate zero stars, I would.","updated":"2020-07-04T21:33:13-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"1599503560","userName":"Monty808808","userUrl":"https://itunes.apple.com/us/reviews/id269365391","version":"2.3.1","score":1,"title":"Very poor app","text":"Really? Is it chart control issues not obvious tithe developers that decided to release the app? For executive management you approved? Fire your app developers and dudes don't release a product that does not work.  We all know that your chart control and wifi connectivity is terrible....: so dudes.... very simple.... hire better developers ....","updated":"2017-04-27T23:11:51-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6391393685","userName":"Laquidara","userUrl":"https://itunes.apple.com/us/reviews/id158959405","version":"3.0.4","score":1,"title":"Last century technology","text":"Many WiFi systems are currently using Eero routers. BlueAir is needing 2.4 to access your network and Eero is 5.0. \nSo if you have Eero technology in your home WiFi, your BlueAir remote is worthless. You will not be able to use it because Eero does not give you the option of choosing 2.4.","updated":"2020-09-03T09:32:53-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6732897325","userName":"Rico5.0","userUrl":"https://itunes.apple.com/us/reviews/id117783781","version":"3.0.10","score":1,"title":"Stopped Working..","text":"When I first downloaded the App it worked fine, was really cool to see all the air quality specs and control my device. Unfortunately the app no longer works and I can’t control my device remotely and can’t see the specs. Please fix!","updated":"2020-12-08T21:16:44-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6697992059","userName":"Bummed by glitch","userUrl":"https://itunes.apple.com/us/reviews/id102763383","version":"3.0.10","score":1,"title":"App always glitching","text":"Why does there always seem to be an issue with this app?? Please figure this out... we bought the more expensive unit so we could control it over WiFi on the app... but with the constant problems with the app, it’s useless!","updated":"2020-11-28T23:49:57-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6418546101","userName":"Viddiewell","userUrl":"https://itunes.apple.com/us/reviews/id43486545","version":"3.0.6","score":1,"title":"Thought it was me, it’s the version","text":"Nope. WiFi almost never connects. When it does, the app forgets the tethered device within minutes. I own three, and they work beautifully. You just can’t connect them anymore. This version of the app is a disaster.","updated":"2020-09-11T09:31:56-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6515436725","userName":"JayPars8989","userUrl":"https://itunes.apple.com/us/reviews/id215664547","version":"3.0.7","score":1,"title":"Unable to setup","text":"Will not connect to wifi via setup. The wifi images do not match up with the descriptions. After trying each option, this is still no network to join. This is on iOS 14 iPhone 11 Pro.","updated":"2020-10-08T19:16:38-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6898396312","userName":"Jim sad air","userUrl":"https://itunes.apple.com/us/reviews/id373161909","version":"3.0.12","score":1,"title":"Just purchased","text":"Wow, what a disappointment. The reviews are accurate. The app is useless. And I bought based on ability to time operation. Didn’t need any other features, but It won’t connect. \n\nGoogle reviews said nothing about the crappy app.","updated":"2021-01-21T19:11:11-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6074008176","userName":"121223101987","userUrl":"https://itunes.apple.com/us/reviews/id220746195","version":"3.0.0","score":1,"title":"Cabin Purifiers ???","text":"With the new update, I wasn’t able to control my Cabin P2ID anymore, where it showed that it was disconnected.\n\nSo I decided to delete the product and add it again, where I was surprised that the cabin purifier isn’t anymore an option in the products list that I can add !","updated":"2020-06-14T02:22:38-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6938643673","userName":"∆X4Life","userUrl":"https://itunes.apple.com/us/reviews/id39086099","version":"3.1.0","score":1,"title":"Will not connect to Classic","text":"My wifi network changed and now I cannot connect to the device. App will not move past the initial add device screen. App was barely functional before the change and now it’s dead.","updated":"2021-01-31T19:04:58-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7178140216","userName":"YuxiaoQ","userUrl":"https://itunes.apple.com/us/reviews/id268245324","version":"3.4.0","score":1,"title":"Kept asking me to connect to 2.4G","text":"Kept asking me to connect to a 2.4G wifi when I am already connected to a 2.4G! only started since this new version. Very annoying and makes this app completely unusable.","updated":"2021-04-03T02:31:53-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6396242506","userName":"alfredvvr","userUrl":"https://itunes.apple.com/us/reviews/id160962349","version":"3.0.5","score":1,"title":"Connection problems","text":"Connecting to the app is always dropping this making it difficult and cumbersome to use. Bought 2 units because of wifi capability but with the app continuously disconnecting, I should have opted for the standard model.","updated":"2020-09-04T19:34:18-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7241721905","userName":"Basta505","userUrl":"https://itunes.apple.com/us/reviews/id34637351","version":"3.5.0","score":1,"title":"Love the air purifier; hate the app","text":"Needs a MAJOR fix! Too many bugs to list, which is sad because I like to control the air purifier remotely but when I delete app, per instructions so that I can reconnect to my wifi, there is no log in for returning users!!! Argh.","updated":"2021-04-19T17:49:40-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7140390733","userName":"ebohphobe","userUrl":"https://itunes.apple.com/us/reviews/id39955882","version":"3.4.0","score":1,"title":"Good purifiers, app is garbage","text":"As many have already stated, app will not maintain connection to the new purifier. Will probably return the purifier and go back to my old one unfortunately. Wish Blueair realized that a reliable purifier is better than a “smart” one that doesn’t work.","updated":"2021-03-24T12:58:27-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6643321054","userName":"Bojazzzz","userUrl":"https://itunes.apple.com/us/reviews/id140654132","version":"3.0.7","score":1,"title":"Really bad app","text":"Bought the Blueair sense+ series about 6 months ago and was working fine. All of sudden WiFi doesn’t connect anymore. Tried everything and it’s still the same. Such a shame.","updated":"2020-11-14T00:20:00-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"1487527508","userName":"NathanMaggio","userUrl":"https://itunes.apple.com/us/reviews/id202669491","version":"2.0","score":5,"title":"All about home automataion","text":"Love being able to turn on/off remotely. Feels like the FUTURE.","updated":"2016-11-19T16:09:39-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6497203657","userName":"Tiggerlori","userUrl":"https://itunes.apple.com/us/reviews/id209748295","version":"3.0.7","score":1,"title":"Product great - app frustrating","text":"We love the air purifier. The app is EXTREMELY FRUSTRATING. It took me several days to connect product to app and then no controls appeared on my app like the App Store pics said it would. \n\nI understand while the ratings on the app are so low.","updated":"2020-10-03T13:53:43-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6494321736","userName":"hazeluser","userUrl":"https://itunes.apple.com/us/reviews/id141080205","version":"3.0.7","score":1,"title":"The new app still doesn’t work","text":"Ever since the redesign, this app has been useless. The graphs don’t work, it doesn’t collect data points except when you start the app.\n\nAlso, the “knock” notifications don’t appear anymore.","updated":"2020-10-02T19:57:34-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"4711165129","userName":"EC in EG","userUrl":"https://itunes.apple.com/us/reviews/id211775854","version":"2.8.4","score":1,"title":"The app is essentially non-functional","text":"Sorry to report that app will not complete the connection between unit, phone app, and home Wifi (this was after 30 min and multiple attempts).   A great idea, but it should not be that tough, and given that this is a $300 unit, the app should work!!!","updated":"2019-09-01T14:24:33-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"4360750129","userName":"Pb9999999999","userUrl":"https://itunes.apple.com/us/reviews/id128355335","version":"2.8.3","score":1,"title":"Really poor","text":"1) every time I change filter I have to set it up again. \n2) latest version can’t name the device “error processing your request” with no back or skip option so I’m stuck\n3 can’t remember a WiFi NW password, really?\n4) very counterintuitive to use","updated":"2019-06-23T16:19:43-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6478787248","userName":"SNEAKERJOCK","userUrl":"https://itunes.apple.com/us/reviews/id192449277","version":"3.0.6","score":1,"title":"HORRIBLE APP RESPONSE","text":"The old app worked PERFECTLY. Since the new app was released, including all of its updates, has rendered it completely useless. I have spent THOUSANDS of dollars to have ALL BlueAir products throughout my home; including Aware sensors and Sense+ purifiers in EVERY room. \nBlueAir you need to fix this NOW. I AM EXTREMELY DISSATISFIED.","updated":"2020-09-28T14:00:22-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"3415355585","userName":"Susans185","userUrl":"https://itunes.apple.com/us/reviews/id26654744","version":"2.8","score":1,"title":"Do not like the new look!!","text":"The graphs are much harder to read. I miss the CO2 info separate from VOC. The time and date font is too tiny and contrast is not enough. I miss the ability to zoom out on the graphs. What happened?!?  And now the monitor is orange but the app says air quality is excellent!","updated":"2018-11-13T18:40:56-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6596109717","userName":"spycoops","userUrl":"https://itunes.apple.com/us/reviews/id70027717","version":"3.0.7","score":5,"title":"Okay for me","text":"Easy setup. Easy connection. App controls great.","updated":"2020-10-31T22:11:16-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7173461395","userName":"Tazz314159","userUrl":"https://itunes.apple.com/us/reviews/id3976105","version":"3.4.0","score":1,"title":"Useless","text":"I have fiber WIFI and fast cellular. I tried both in my many attempts to get this app to connect to my Blueair Classic. No idea if might be useful but I gave up and just turned on the machine and deleted the app. Seriously people —- terrible UI","updated":"2021-04-01T22:04:42-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6613049265","userName":"Marvin Jimenez","userUrl":"https://itunes.apple.com/us/reviews/id589198251","version":"3.0.7","score":1,"title":"Cant log in","text":"Trying to log into my account. Think my password is wrong, so I reset it. Still can’t log into the account. Did I just spend 1700 on two air purifiers I can’t even bring online? Maybe.","updated":"2020-11-05T15:35:24-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6080368429","userName":"Ghddfff","userUrl":"https://itunes.apple.com/us/reviews/id243745452","version":"3.0.0","score":1,"title":"Blueair 480i","text":"The previous app was much more useful. The old graphs were much easier to read and understand. The temperature is only displayed in Celsius now with no way to change it to Fahrenheit. Disappointed I spent more money for the WiFi purifier.","updated":"2020-06-15T14:43:35-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7282239169","userName":"Learned","userUrl":"https://itunes.apple.com/us/reviews/id142201772","version":"3.5.1","score":5,"title":"Good upgrade.","text":"Yayyyy.  Finally have an update that works !! Thanks !","updated":"2021-04-30T13:29:50-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6575533594","userName":"Ravi","userUrl":"https://itunes.apple.com/us/reviews/id42165442","version":"3.0.7","score":1,"title":"Horrendous update","text":"I’m not sure who thought it was an intelligent move to nest the fan controls in an additional menu. This is primarily a remote app. Tracking local air quality is a secondary feature. Reflect your purposes accurately.","updated":"2020-10-26T03:59:48-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6199250081","userName":"ColanderCombo","userUrl":"https://itunes.apple.com/us/reviews/id37804519","version":"3.0.3","score":1,"title":"Doesn’t work","text":"Won’t let me add a filter without logging in... but it won’t let me login. Password is correct (verified many times) and no errors are displayed, but I can never get past the password screen","updated":"2020-07-14T20:59:05-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7285459589","userName":"dgxcswktffcseg","userUrl":"https://itunes.apple.com/us/reviews/id365215149","version":"3.5.1","score":1,"title":"Auto mode os not smart","text":"Doesn’t auto mode mean it should when to turn up/down, and when to turn up and down???\nWhen the air is just clean, why does the fan have to work at all???","updated":"2021-05-01T08:30:11-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6675105795","userName":"G)-(057","userUrl":"https://itunes.apple.com/us/reviews/id13302492","version":"3.0.9","score":1,"title":"Last update broke everything.","text":"Had everything working then after the update it can’t connect to my products.","updated":"2020-11-22T14:48:57-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6758089275","userName":"Meausurement fan","userUrl":"https://itunes.apple.com/us/reviews/id40589844","version":"3.0.10","score":1,"title":"Competitive for worst app ever","text":"It’s shocking that a company that makes an apparently good hardware product will release an app that is terrible, has long lags between updates, and declining quality with each update.","updated":"2020-12-15T20:18:46-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"5305709380","userName":"Nyny five","userUrl":"https://itunes.apple.com/us/reviews/id344492946","version":"2.8.6","score":1,"title":"Completely useless app","text":"Good product with the worst app I have ever downloaded. WiFi does t work whatsoever. Tried to connect it with my iPhone for literally 10 times. Completely waste of my time. Delete.","updated":"2019-12-22T11:12:40-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6986884188","userName":"nopenonot","userUrl":"https://itunes.apple.com/us/reviews/id34600251","version":"3.1.0","score":1,"title":"Cannot add a new device in app","text":"Insane. Can’t add a new device to account in app. The button is not actionable ( “Setup my device!). I paid a lot for the WiFi functionality and it’s useless until this app works.","updated":"2021-02-12T14:30:46-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6106279866","userName":"enter.your.nickname","userUrl":"https://itunes.apple.com/us/reviews/id444243314","version":"3.0.1","score":1,"title":"Useless app","text":"Cannot see anything on the chart anymore.\nIts too small , have to pinch it with two fingers at the same time to move.\nAnd it doesn't show anything at all.\nWho ever design this UX should be fired immediately.","updated":"2020-06-21T17:49:14-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6720563457","userName":"Assinatakum Indonesia","userUrl":"https://itunes.apple.com/us/reviews/id258847752","version":"3.0.10","score":1,"title":"FIX THE WIFI CONNECTION SETTING ISSUES!","text":"The latest update makes my 680i cannot connect the app with my wifi. So i cannot control my 680i using my phone. It was working normal before this update came. I’m using iOS 14.0. Fix this bug ASAP!","updated":"2020-12-05T08:33:03-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6674544106","userName":"classic280iuser","userUrl":"https://itunes.apple.com/us/reviews/id610762470","version":"3.0.9","score":1,"title":"Unusable. Very poor quality.","text":"The app connects to the purifier but shows purifier offline always. Even after successfully connecting it. Tried all troubleshooting steps. Disconnect and reconnect. Hotspot. It just doesn’t work!","updated":"2020-11-22T10:58:19-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6674199480","userName":"Fireball20001","userUrl":"https://itunes.apple.com/us/reviews/id18861039","version":"3.0.9","score":1,"title":"Older iPhones are now broken","text":"Do you regress your software?  The app crashes running on an iPhone 6 now after latest app update.  Crashes as soon as you select a device","updated":"2020-11-22T09:00:25-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7257066785","userName":"CMUboy","userUrl":"https://itunes.apple.com/us/reviews/id22121166","version":"3.5.0","score":1,"title":"Addresses got crossed","text":"I entered my address. But every time my address gets reset to some other address in my neighborhood. Scary. I hope the app isn’t sharing data with people in that address. \n\nVery buggy app.","updated":"2021-04-23T20:35:33-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6857137642","userName":"aaronvro","userUrl":"https://itunes.apple.com/us/reviews/id23427024","version":"3.0.12","score":1,"title":"This app is unusable","text":"I can’t connect my device. It freezes up when I even try to input my email address. I’ve tried redownloading multiple times","updated":"2021-01-11T06:06:48-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"3423048649","userName":"twentiesrn64","userUrl":"https://itunes.apple.com/us/reviews/id866567051","version":"2.8","score":5,"title":"Outdoor Air","text":"Do you get to check the outdoor air without signing in","updated":"2018-11-15T21:36:04-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6993518520","userName":"vgoklani","userUrl":"https://itunes.apple.com/us/reviews/id20447889","version":"3.1.0","score":1,"title":"Absolute Garbage","text":"The App is filled with bugs, and support is non-existent. The prior app was perfectly adequate and fully functional. This newer version should never have been released. I would suggest a roll-back.","updated":"2021-02-14T06:39:49-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6722418255","userName":"Dr. Inkwell","userUrl":"https://itunes.apple.com/us/reviews/id35627506","version":"3.0.10","score":1,"title":"Buggy and unstable","text":"This app is very unstable and full of bugs.  I’ve had to reload, reinstall and troubleshoot many times over the years. Even the troubleshot button is buggy!","updated":"2020-12-05T21:18:47-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6130956930","userName":"Moza SR","userUrl":"https://itunes.apple.com/us/reviews/id155841324","version":"3.0.1","score":1,"title":"Not connecting","text":"I tried to connect it to the wifi and my phone but the app is not good. Hope you guys can make it more user friendly and easy to use","updated":"2020-06-28T00:24:42-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7152364453","userName":"product is good, app isnt","userUrl":"https://itunes.apple.com/us/reviews/id26476987","version":"3.4.0","score":1,"title":"Not worth the download","text":"Never connects product right, always drops connection when it does. This is even with using a very high-speed bandwidth and a powerful router","updated":"2021-03-27T15:49:42-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6678086699","userName":"Rainbow puppy 🐶","userUrl":"https://itunes.apple.com/us/reviews/id37372952","version":"3.0.9","score":1,"title":"Latest update disconnected WiFi and it won’t reconnect","text":"Everything was fine until the latest update and now my app won’t reconnect to the unit. So frustrating.","updated":"2020-11-23T11:01:00-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"3961163081","userName":"alisunq","userUrl":"https://itunes.apple.com/us/reviews/id35488162","version":"2.8.2","score":1,"title":"Can’t even sign up","text":"The app has no option to sign up and instead just asks for a password - when you click reset it sends you a broken link. Really horrendous tech for such pricey units.","updated":"2019-04-02T12:38:01-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6497245938","userName":"SantaFeLAH","userUrl":"https://itunes.apple.com/us/reviews/id288616453","version":"3.0.7","score":1,"title":"Wish I had read the reviews","text":"Nothing to add that hasn’t already been written. Cannot pair after multiple attempts. And no customer support. Shame on this company.","updated":"2020-10-03T14:11:46-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"5689735208","userName":"SWP-SF","userUrl":"https://itunes.apple.com/us/reviews/id113807676","version":"2.8.6","score":1,"title":"Blueair Friend is Stuck in the Ice Age","text":"How is it that Blueair Friend still requires a 2.4 network when half the world has moved on to 5.0 only?\n\nAny chance you guys will update your software to run on 5.0 networks anytime soon?","updated":"2020-03-20T19:55:24-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7039024459","userName":"Fu_Manchu","userUrl":"https://itunes.apple.com/us/reviews/id26674314","version":"3.4.0","score":1,"title":"Worse and worse","text":"You know what’s awesome about this app? Every time they update it, it gets worse! Will never buy a Blueair product again. Cheap Chinese garbage for top dollar.","updated":"2021-02-25T18:27:46-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7316244544","userName":"Bruce1768","userUrl":"https://itunes.apple.com/us/reviews/id12266176","version":"3.5.1","score":4,"title":"BlueAir app experience","text":"I find the BlueAir app is useful and greatly increases the value of my \nHealthProtect 7410i","updated":"2021-05-08T23:33:51-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6591420320","userName":"Kevin Hartman","userUrl":"https://itunes.apple.com/us/reviews/id479008468","version":"3.0.7","score":1,"title":"Returned the air purifier due to this crap app.","text":"Unable to connect to the app. So I have to return the air purifier due to this useless app. Not sure how other users can bear with this crap app. \n\nThe app developers should be 100% responsible for my return.","updated":"2020-10-30T14:07:38-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6931355201","userName":"@Sigil","userUrl":"https://itunes.apple.com/us/reviews/id30073427","version":"3.1.0","score":1,"title":"Parasites","text":"This is a horrible app. This companies privacy  policies is on par with Facebook and Google. They are horrible. \n\nDo not use the app. Do not buy filters from these people. Buy them from Costco.","updated":"2021-01-30T00:16:42-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6224441027","userName":"DevinHouse","userUrl":"https://itunes.apple.com/us/reviews/id41990241","version":"3.0.3","score":1,"title":"Wi-Fi never connects","text":"After a firmware update, WiFi no longer connects. So it’s just a stand alone unit, not worth the extra money paid to get online access.","updated":"2020-07-21T08:27:33-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6207958599","userName":"fineartworks","userUrl":"https://itunes.apple.com/us/reviews/id114368874","version":"3.0.3","score":1,"title":"Keeps hanging on setup","text":"Had to reset everything after last update, and then the app hangs and won't connect. Get a real app developer; this is not a good update.","updated":"2020-07-17T01:30:01-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6799740432","userName":"Paul AVB","userUrl":"https://itunes.apple.com/us/reviews/id33965088","version":"3.0.12","score":1,"title":"Update does not work","text":"The original app was excellent. The latest will not connect to my sense plus or my sensor making this expensive equipment useless.","updated":"2020-12-27T07:41:38-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6697576321","userName":"G101A","userUrl":"https://itunes.apple.com/us/reviews/id32730337","version":"3.0.10","score":1,"title":"Used to work. Now just shows offline.","text":"Just stopped working. Keep trying to connect to same wi-fi but nothing. Awful.","updated":"2020-11-28T20:42:31-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"1978429424","userName":"B-Billy","userUrl":"https://itunes.apple.com/us/reviews/id21389409","version":"2.5.4","score":2,"title":"Doesn’t work","text":"Right out of the box, this app does not pair with the unit.   That was a selling point, and it DOES NOT WORK.   I’ll be returning the unit, sad to say.   Can anyone recommend a better brand?","updated":"2017-12-07T14:27:53-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6690529464","userName":"Dykgffs","userUrl":"https://itunes.apple.com/us/reviews/id192074414","version":"3.0.10","score":1,"title":"Bad updates","text":"Last update made the app useless. Device always appears to be offline and I can't control it.","updated":"2020-11-27T00:30:28-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"5808222384","userName":"Lovefab68","userUrl":"https://itunes.apple.com/us/reviews/id31385192","version":"2.8.6","score":1,"title":"All stinks","text":"I can’t get past entering my email on the iPhone app. I can only log on on my iPad. What now explain what the abbreviations mean in the app. Assume the user had no knowledge of the terms","updated":"2020-04-13T19:45:12-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"3582618302","userName":"hilal23","userUrl":"https://itunes.apple.com/us/reviews/id26588332","version":"2.8.1","score":1,"title":"Intrusive","text":"Sorry but why do you need my name and email address before you allow me to pair my phone with my unit? This is not a free service like Facebook, I paid several hundred dollars for my Classic 405.","updated":"2018-12-27T22:54:16-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6904914695","userName":"Errys Frondarina","userUrl":"https://itunes.apple.com/us/reviews/id114597656","version":"3.0.12","score":1,"title":"Unusable","text":"Can’t even connect my blue air to the app because there’s so many bugs on the app. Paid $400 for a purifier with an app that doesn’t even work. Scam company","updated":"2021-01-23T10:24:49-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"4528213925","userName":"SiouxN","userUrl":"https://itunes.apple.com/us/reviews/id37649819","version":"2.8.3","score":1,"title":"Won’t connect after many Attempts","text":"Also crashed when trying to look at outdoor air quality.","updated":"2019-07-27T15:35:28-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6760459667","userName":"Michaelbern","userUrl":"https://itunes.apple.com/us/reviews/id343654343","version":"3.0.10","score":1,"title":"DOESNT WORK!!!","text":"Can’t find my blue air unit in the app, so literally my unit just lost remote control function.\nSeeing so many same reviews complaining about it, stop buying Blueair!!!Stop buying Blueair!!!","updated":"2020-12-16T11:55:05-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6743992480","userName":"richmondezer","userUrl":"https://itunes.apple.com/us/reviews/id19746203","version":"3.0.10","score":1,"title":"Messy","text":"Worked fine until the last few updates. What a mess!","updated":"2020-12-11T23:03:31-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7038443062","userName":"Nassarovic","userUrl":"https://itunes.apple.com/us/reviews/id338070566","version":"3.4.0","score":3,"title":"Siri","text":"Why not support siri and apple home .?","updated":"2021-02-25T14:32:00-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6422235537","userName":"Rimo310","userUrl":"https://itunes.apple.com/us/reviews/id212818349","version":"3.0.6","score":1,"title":"Can’t even create an account","text":"I get an error that the form to create an account is incomplete - probably because I’m not opting into receive emails.","updated":"2020-09-12T10:40:29-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"1491363886","userName":"DP Kong","userUrl":"https://itunes.apple.com/us/reviews/id328453684","version":"2.0.1","score":1,"title":"App crashes everytime and never opens","text":"This works the first time, but ever since then I never got it working. Always crash by itself upon opening.","updated":"2016-11-26T07:35:45-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6828431262","userName":"Fireace08","userUrl":"https://itunes.apple.com/us/reviews/id135245151","version":"3.0.12","score":1,"title":"Can’t connect to app","text":"This app is useless everytime I get to about 60% in the set up, it just hangs and never connects to wifi.","updated":"2021-01-03T20:00:41-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7340976217","userName":"lilyontheshoulder","userUrl":"https://itunes.apple.com/us/reviews/id39108698","version":"3.5.1","score":1,"title":"App doesn’t match the product","text":"Extremely frustrating ... disconnect to the unit all the time","updated":"2021-05-15T02:02:30-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"3785796537","userName":"Reggiezzzzzzzzzz111222333","userUrl":"https://itunes.apple.com/us/reviews/id218641157","version":"2.8.1","score":1,"title":"Difficult WIFI Connection","text":"All but impossible to connect to iPhone via WiFi. Filter is great but WiFi connection is terrible.","updated":"2019-02-18T09:57:25-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6689271493","userName":"CTopher012172","userUrl":"https://itunes.apple.com/us/reviews/id86416304","version":"3.0.10","score":1,"title":"Update Broken","text":"Since this latest app update I can no longer connect to my purifiers.","updated":"2020-11-26T15:03:17-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6337256730","userName":"KoolUhl","userUrl":"https://itunes.apple.com/us/reviews/id640428392","version":"3.0.4","score":1,"title":"Incorrect","text":"I used the app to check the air outside. We’re in the valley and it’s full of smoke from fires. The app said the air was excellent. Doesn’t work.","updated":"2020-08-19T04:52:55-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6176517796","userName":"comicboy77","userUrl":"https://itunes.apple.com/us/reviews/id585925049","version":"3.0.1","score":1,"title":"Horrible app","text":"Horrible app. Nothing work well with app but my purification works fine.  Replaced filter every 5 months","updated":"2020-07-09T05:36:30-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6093615317","userName":"phanthidan","userUrl":"https://itunes.apple.com/us/reviews/id1180977354","version":"3.0.0","score":1,"title":"Bad app","text":"Horrible connection issues and tried 3 times now but gave up","updated":"2020-06-18T16:53:41-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7103253331","userName":"Seattle Skew","userUrl":"https://itunes.apple.com/us/reviews/id35868288","version":"3.4.0","score":1,"title":"Pure frustration","text":"This app needs to go back to the garage. Actually worse than connecting a wi-fi printer, and that’s not easy.","updated":"2021-03-14T13:27:09-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6623590113","userName":"Touch Gene","userUrl":"https://itunes.apple.com/us/reviews/id29802755","version":"3.0.7","score":1,"title":"Junk","text":"This took me in circle after circle. Connects then asks to connect again.  How sad.  Liars!    Spent a. Couple hours","updated":"2020-11-08T12:19:20-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6425473387","userName":"bayarea bikeguy","userUrl":"https://itunes.apple.com/us/reviews/id16184738","version":"3.0.6","score":1,"title":"Fail","text":"Don’t give your personal info to get this app. The app’s only real use is to schedule the fan speed. \n\nRecommendation for Blueair.  Just implement HomeKit.","updated":"2020-09-13T09:21:30-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7011801777","userName":"Winedoc","userUrl":"https://itunes.apple.com/us/reviews/id121282647","version":"3.1.0","score":1,"title":"Great machine TERRIBLE WiFi","text":"This company makes a great air purifier. I’m on my second machine—a replacement and now this fails to link with WiFi and my phone.","updated":"2021-02-18T19:54:45-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6097199871","userName":"irvwr","userUrl":"https://itunes.apple.com/us/reviews/id26295074","version":"3.0.0","score":1,"title":"New purchase, unable to add product to app","text":"App crashes during setup so I am unable to use.","updated":"2020-06-19T11:51:39-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"4620415823","userName":"rhino127","userUrl":"https://itunes.apple.com/us/reviews/id33742614","version":"2.8.3","score":1,"title":"Buggy app","text":"Does not configure properly. Very disappointing for such a premium product. Seems European cannot make apps work with appliances.","updated":"2019-08-15T08:06:02-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6721381831","userName":"Jggyfjtr","userUrl":"https://itunes.apple.com/us/reviews/id20261922","version":"3.0.10","score":1,"title":"Abysmal app","text":"For an overpriced HEPA filter with wireless control, you’d expect at least some degree of acceptable performance from the app.  Unfortunately, you’d be wrong.","updated":"2020-12-05T13:49:22-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6947073649","userName":"thatnameistaken42","userUrl":"https://itunes.apple.com/us/reviews/id107619264","version":"3.1.0","score":1,"title":"worst control app for a device","text":"This app is as much of a joke as the product its designed for. Buyer’s remorse is an understatement.","updated":"2021-02-02T19:30:50-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6758023343","userName":"sfericmars","userUrl":"https://itunes.apple.com/us/reviews/id11047858","version":"3.0.10","score":1,"title":"Horrible","text":"Nothing makes this work I am over it.","updated":"2020-12-15T19:47:40-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6553611181","userName":"Maybeicy","userUrl":"https://itunes.apple.com/us/reviews/id293867682","version":"3.0.7","score":1,"title":"Not working","text":"Fix it or I will return product","updated":"2020-10-19T20:18:12-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"3246444173","userName":"herosmom76","userUrl":"https://itunes.apple.com/us/reviews/id160646279","version":"2.6.4","score":1,"title":"Not compatible with 411 series","text":"Would have been cool but it doesn’t give the option to connect with the 411 series.","updated":"2018-09-29T22:46:43-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"2243404198","userName":"debtamintosh","userUrl":"https://itunes.apple.com/us/reviews/id170664892","version":"2.6.2","score":1,"title":"Cannot get app to connect to blueair","text":"Have tried everything on their trouble shooting menu.","updated":"2018-02-24T11:42:48-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7300887600","userName":"Pulpo8a","userUrl":"https://itunes.apple.com/us/reviews/id390931419","version":"3.5.1","score":1,"title":"Blueair 605","text":"Can’t even turn on unit by hand or app. This whole line up is trash. Waste of money. App no help at all.","updated":"2021-05-05T05:48:48-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6796039414","userName":"Hello World 1","userUrl":"https://itunes.apple.com/us/reviews/id109060525","version":"3.0.12","score":1,"title":"Not good","text":"iPhone 12 heats up when using the app and the app keeps freezing.","updated":"2020-12-26T08:10:53-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7151442810","userName":"takumi8228","userUrl":"https://itunes.apple.com/us/reviews/id100256544","version":"3.4.0","score":1,"title":"Feels like living in the 2000s","text":"The app reacts to the every command 10 seconds later.  It’s really not usable :(.","updated":"2021-03-27T10:13:43-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"3295991531","userName":"alekseyfrompoland","userUrl":"https://itunes.apple.com/us/reviews/id475584994","version":"2.6.4","score":1,"title":"Connection issue","text":"Can’t connect to wifi, i emailed to support but they seems can’t help :(","updated":"2018-10-13T00:55:04-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6685346346","userName":"Kayaktom58","userUrl":"https://itunes.apple.com/us/reviews/id17481400","version":"3.0.9","score":1,"title":"Cannot connect","text":"I’ve done everything I know to do.  Cannot connect.  Bad app.","updated":"2020-11-25T12:11:40-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7497561939","userName":"Joe P Austin","userUrl":"https://itunes.apple.com/us/reviews/id274052319","version":"3.5.3","score":3,"title":"Good improvements, but needs more","text":"The bug fixes recently have been great.  However, I have been trying to purchase filter replacements and there isn’t a simple “check out” button once I select my filters. There’s only options to select subscriptions - but no “buy now” “check out” etc. instead I purchased the filters on Amazon prime.","updated":"2021-06-23T09:05:25-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7137566448","userName":"Zachary Marney","userUrl":"https://itunes.apple.com/us/reviews/id119632107","version":"3.4.0","score":1,"title":"Do not download","text":"This app is horrible. It serves no purpose and is not functional","updated":"2021-03-23T19:21:37-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6457646554","userName":"PhotoChristopher","userUrl":"https://itunes.apple.com/us/reviews/id37132131","version":"3.0.6","score":1,"title":"Terrible","text":"Device won’t connect to app.","updated":"2020-09-22T14:40:11-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6954319524","userName":"ThatsAll?","userUrl":"https://itunes.apple.com/us/reviews/id212138126","version":"3.1.0","score":1,"title":"Useless","text":"Literally does nothing","updated":"2021-02-04T13:23:08-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6425422871","userName":"owooqoqoqoq","userUrl":"https://itunes.apple.com/us/reviews/id490098399","version":"3.0.6","score":1,"title":"Can’t connect","text":"Can’t connect my air purifier to the updated app.","updated":"2020-09-13T09:03:46-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6530565018","userName":"j-run-7462","userUrl":"https://itunes.apple.com/us/reviews/id19996360","version":"3.0.7","score":1,"title":"Well deserved 1 star review","text":"Amazingly bad. Not many apps can be this bad. There should be awards!","updated":"2020-10-13T05:13:52-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7089640381","userName":"Mermaidregatta","userUrl":"https://itunes.apple.com/us/reviews/id237800378","version":"3.4.0","score":1,"title":"If I could give this App a -0 I would.","text":"App is the worst App I’ve ever used.","updated":"2021-03-10T22:35:58-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6368872802","userName":"dmyaho","userUrl":"https://itunes.apple.com/us/reviews/id128970476","version":"3.0.4","score":1,"title":"Can’t connect to WiFi","text":"Can’t connect to WiFi","updated":"2020-08-27T21:25:10-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"5586514587","userName":"saud msa","userUrl":"https://itunes.apple.com/us/reviews/id464915385","version":"2.8.6","score":1,"title":"Not working","text":"The app will not even let me log in ! \nError occurred msg ......","updated":"2020-02-27T01:10:22-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6868373576","userName":"NimaZD","userUrl":"https://itunes.apple.com/us/reviews/id249060449","version":"3.0.12","score":1,"title":"Email error","text":"It’s not connecting to the classic 205 model","updated":"2021-01-14T03:25:49-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6850763035","userName":"simonsaysDIE","userUrl":"https://itunes.apple.com/us/reviews/id1232989590","version":"3.0.12","score":1,"title":"Just horrible","text":"Horrible.","updated":"2021-01-09T14:09:48-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6433361944","userName":"sigh wishing it worked","userUrl":"https://itunes.apple.com/us/reviews/id492855158","version":"3.0.6","score":1,"title":"F-","text":"Does not work - keeps asking for wifi passwords, never connects. Lame.","updated":"2020-09-15T18:23:43-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6664404475","userName":"Alekspost","userUrl":"https://itunes.apple.com/us/reviews/id163165958","version":"3.0.7","score":1,"title":"Schedule for US is broken","text":"Scheduled is shown 1-12 WITH NO AM/PM option!","updated":"2020-11-19T16:58:11-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"1280849037","userName":"Duska90","userUrl":"https://itunes.apple.com/us/reviews/id28752969","version":"1.1.1","score":1,"title":"No data?","text":"No data to be shown in the app. How can an app be released in this state??","updated":"2015-11-02T02:30:58-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7098824185","userName":"Adawg4002","userUrl":"https://itunes.apple.com/us/reviews/id20786548","version":"3.4.0","score":1,"title":"Disconnects from wifi hourly","text":"Terrible app...unacceptable.","updated":"2021-03-13T08:41:47-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6360041443","userName":"am12345654321","userUrl":"https://itunes.apple.com/us/reviews/id1203878797","version":"3.0.4","score":1,"title":"AM","text":"APP is no good, constantly losing a connection to the purifier.","updated":"2020-08-25T10:24:31-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7137968081","userName":"Foo7446247953478642198542","userUrl":"https://itunes.apple.com/us/reviews/id13252652","version":"3.4.0","score":2,"title":"Not as good black electrical tape","text":"All I want to do is turn off the ultra-bright light, be able to turn on night mode, and get the wifi icon to stop blinking. For this I need to install an app on my phone???  Why not use the LCD touch screen on the device?\n\nOh, you require my location to run the app?  For an air filter??  Ok, I’ll temporarily unplug my wifi router from the internet and turn off cellular data and then allow location services for the app. After I turn off the bright light, I’ll delete the app so it can’t send my data to the Internet. \n\nOh, *now* you want my email address???  For an air filter???  Dream on. \n\nI deleted the app and covered the light and the flashing wifi icon with electrical tape. Problem inelegantly solved.\n\nEven so, I may never be able to use the purifier in my bedroom because of the remaining light from the screen and the inability to invoke night mode without the app.  (Seriously, does one need to use the app every night before bed to turn on night mode?  Does it have a darkness detector?  Why can’t I tap an icon for this?)\n\nI feel an urge to return this pricey 7470i device in protest of this customer-hostile behavior.\n\nPlease consider the experience of your customers who do not want an Internet-of-things device.  The perpetually flashing wifi icon is both comical and unfortunate.  Maybe draw a line through it instead of making it flash at least?  Do that and replace the germ shield icon with a night mode icon and you’ll be golden.   No app needed.","updated":"2021-03-23T22:21:58-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6229419428","userName":"Kreylix","userUrl":"https://itunes.apple.com/us/reviews/id42840112","version":"3.0.3","score":1,"title":"Mid July’20 update deleted login info","text":"Epic fail!","updated":"2020-07-22T13:11:19-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"3941580961","userName":"angio10sin","userUrl":"https://itunes.apple.com/us/reviews/id147075646","version":"2.8.2","score":1,"title":"Can’t pair my cabin air","text":"Bluetooth connectivity bad","updated":"2019-03-29T06:26:08-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7184110299","userName":"BiggleWiggle","userUrl":"https://itunes.apple.com/us/reviews/id28588440","version":"3.4.0","score":1,"title":"2.4ghz required?  Lost registration, Forced location??","text":"Return this overpriced garbage and buy a levoit.  Better functionality, quieter operation, cheaper maintenance, and zero ozone. \n\nThe app won’t let you connect to the device unless you are on a 2.4ghz wifi. While mine has that band, it is not selectable via ios, or possible to make it selectable router side.  Therefore this app is completely useless, and this “intelligent” air purifier is no better than my 75$, low/medium/high true hepa devices.  The device, like any decent IoT wifi 2.4ghz device, should have an adhoc AP used to configure it. Even my 7$ smart wifi bulbs have that.  This is garbage. \n\nIt’s also pretty sketchy that they won’t let you add a device unless you allow the app to track your location via gps.  Invasion of privacy much?\n\nUpdate:\nI figured out how to temporarily disabled 5ghz wifi on my eero mesh wifi, which i verified by using an AP scanner and watching the MACs representative of my wifi SSID go from 2 available to 1.  I then rebooted my phone and tried the app again. Same error. “You have to be connected to a 2.4ghz network”.  I tried this many times. \n\nI thought something must be cached inthe  blueair app data, so I deleted it and re-downloaded it.  When prompted i put in my email address in the app and click next, at which time I’m presented with the account registration/creation dialog(instead of password), that I finished an hour ago. So i try to register again and it says my email address is in use. I have no registration emails from them either. So i cannot log into the app, or register, and one must(along with giving their location data via gps) to add the air purifier. Even if I could, i’d probably still get an error about not being on a 2.4 ghz network, which i am.  \n\nOn a side note, during registration if you decide you mistyped your password in the first field, and type it again, they delete everything you typed in the password confirmation field, so you are forced to type that again as well. Isn’t that nice of them to add that extra step for us?  Thanks!\n\nIf I could rate this app and the company negative stars, I would.","updated":"2021-04-04T14:03:41-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6681318304","userName":"Dsra915","userUrl":"https://itunes.apple.com/us/reviews/id153464382","version":"3.0.9","score":1,"title":"FIX IT! IT’S NOT WORKING SINCE THE LAST UPDATE!","text":"EVERSINCE THE LAST UPDATE THE APP CAN’T CONNECT TO MY BLUEAIR AIR PURIFIER!!!","updated":"2020-11-24T09:23:32-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7693767362","userName":"atlbrent","userUrl":"https://itunes.apple.com/us/reviews/id30620112","version":"3.5.5","score":2,"title":"App wifi connect needs work","text":"I know I know, 2.4ghz only. But here’s the deal. Most modern access points only have one ssid for both 2.4 and 5ghz. So, you get stuck in this loop trying to add it then it fails at end to connect. I noticed mine went solid for a sec then failed in process. So, 21yrs in IT says go rouge. While setting up and the minute I see unit go solid Wi-Fi, I pulled power. Plugged back in and bam! Connected.  But really. I think something in code for adding Wi-Fi that needs to be addressed. Do some in house testing with different brands maybe…netgear/orbi is my setup which isn’t exotic. No way to isolate the 2.4 or give it a different ssid. Otherwise, app isn’t bad and filter is awesome aside from replacement filter cost. Cheers.","updated":"2021-08-14T18:13:14-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"7281390103","userName":"ninocaruncho","userUrl":"https://itunes.apple.com/us/reviews/id103604368","version":"3.5.1","score":1,"title":"App not adding my 7770i!","text":"Bought a new 7770i and tried adding it to this app. Everything gets connected till 80%. The purifier is connected to the internet. But at the \"Finalizing setup...\" page the app abruptly ends and I get sent back to main page of app. Purifier not added to my account. Tried this several times. Used an iPad too but same results. \n\nI borrowed a Samsung Android phone and surprisingly the 7770i was added to my account with no problem. I thought this would automatically add my 7770i to my iOS blueair app but it did not even though I used the same account. \n\nHow do I fix this? I only use iPhones. \n\nWhy is it working on Blueair Android app and not on the Blueair iOS app?  Why is 7770i not appearing on my iOS app even if the 7770i  is successfully added to my account when I used the Samsung app?\n\nPlease help.","updated":"2021-04-30T08:39:21-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"3880364627","userName":"Zombielovergirl12","userUrl":"https://itunes.apple.com/us/reviews/id221564826","version":"2.8.2","score":4,"title":"[fixed with latest version] Can’t setup air purifiers","text":"Update 3/14/19 - I am finally able to connect to my air purifiers again with the latest update. \n\nPrevious review 1/12/19 - I’m unable to setup my new air purifier with this update. I also can’t connect to my old unit which is already configured anymore. When I try to name my devices it says “There was an error processing your request. Try again”","updated":"2019-03-14T06:22:24-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6960307572","userName":"JohnGalt82","userUrl":"https://itunes.apple.com/us/reviews/id123766701","version":"3.1.0","score":3,"title":"Can’t believe Blueair would offer something like this","text":"I concur with many of the other reviewers, the app is useless. I have 5 new Blueair air purifiers and after 2 days of trying have not been able to connect even one to my wifi. I have had Blueair devices for years and really like them, I cannot believe how dysfunctional this app is. I know my way around networks and linking devices to them, I have tried both Android and Apple phones, neither works. Extremely disappointing! Blueair, please fix this app or loose customers. \n\nUpdate: After spending some more time with the app I was able to get the Blueair connected to my WiFi. The app and the device have significant lag between inputs. The trick for me was to REALLY take my time between steps. I have increased my rating to three stars as I still think this could be implemented in a better way.","updated":"2021-02-06T00:46:55-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6783573611","userName":"treet007","userUrl":"https://itunes.apple.com/us/reviews/id524403290","version":"3.0.11","score":2,"title":"App Installation Not for the Faint of Heart","text":"Start with the Blueair device unplugged but physically ready to go. Be extremely patient and observant when setting up the Wifi.\n1. Setup account in Blueair.com if you had not done so. Do not use the Blueair app to create the account – go to the Blueair.com directly using your web browser of your choice. Use a strong \nunique password (12 alphanumeric characters minimum with special characters).\n2. (Optional) Setup separate wifi network for IoT (Internet of Things) and setup a unique WPA2 password. Ensure you are using 2.4GHz frequency (not 5GHz).\n3. Download Blueair app on your smartphone (not tablet or other mobile devices). Sign in with your new Blueair account.\n4. Turn on wifi on your smartphone. Make sure you are not running any VPN (Virtual Private Network) and that your wifi is not set for “private address”.\n5. Make sure you are on the wifi network where you want the Blueair device to use. Have the wifi password handy and ensure the SSID broadcast is on.\n6. Plug in the Blueair device and wait about 2 minutes.\n7. Run the Blueair app on your smartphone and follow the instructions. Look at the wifi indicator on the Blueair device very carefully, since the blinking rate can be difficult to interpret.\n8. You will then enter the wifi password when prompted in the app.\n9. It will error and press the wifi indicator for 4 seconds (count 1001, 1002, etc) to reset to manual mode (when instructed by the app).\n10. Connect your smartphone to the CLASSIC-xxxx wifi network (or whatever network the app tells you).\n11. Enter the wifi password again in the app when prompted.\n12. The Blueair app should then indicate that the setup is complete (it can take up to a minute).\n13. At this stage, your Blueair device is now setup in your Blueair account at their cloud service.\n\nOnce the above steps are done, you can then setup another mobile device (like a tablet), install the Blueair app, log into your Blueair account, and see you Blueair device. You no longer need to use your smartphone to manage your Blueair device via wifi connection.\n\nNext thing is to set your location (and only have the location active when the app is running) and reset the filter so that the Filter Status is correct. See the FAQ in the Blueair app’s Help, which takes you to the same Blueair.com web site Support page, for more info.\n\nNote that these steps are for Blueair for iOS v3.0,9 (3). Note also that it took me 3 tries to finally get the Blueair device’s wifi and app to work correctly. If you need to reset the Blueair device’s wifi to start over, just press the wifi indicator on the device for 4 seconds, and it should then blink in its “new start” mode.\n\nUPDATE: The app appears to reset the Blueair settings. When you run the app, ensure you double-check the Auto, Filter, and other settings to ensure they are set the way you want them. For some reason, my app keeps putting the Blueair device in Fan mode instead of Auto, and the app forgets that the filter replacement setting was reset. As others commented in the Apple App Store, the Blueair app appears to be unstable.","updated":"2020-12-22T21:22:16-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6741635322","userName":"Colo Admin","userUrl":"https://itunes.apple.com/us/reviews/id490730773","version":"3.0.10","score":1,"title":"Impressive how horrible the initial experience is","text":"I have to say it’s really impressive that a company selling products that cost as much as a new iPhone are able to make the onboarding experience as incredibly bad as Blueair has.  I just received my new $900 680i and was excited to plug it in and get purifying.  90 minutes later I just hope it lives up to its air cleaning reputation and that I never have to interact with its app ever again.\n\nFirst issue; in 2020 their devices still can’t utilize a modern WiFi standard or hidden WiFi networks.  It will only work with 2.4ghz networks, the network has to be broadcast, your phone has to be on the same network during setup, you have to give it location access just to add your new device.  Well, I only had 5ghz enabled, and I have a network specific to devices I don’t trust, which my phone is not typically on.  Additionally, iPhones generally prefer 5ghz, so even dual mode is insufficient.  I had to create a new 2.4ghz network (or could have switched my 5ghz to 2.4-only, permanently for this device), and then join my phone to it, just to be able to tell this thing how to connect to WiFi.\n\nSecond; didn’t work.  You get stuck at the choose your device screen, or the pre-requisite list screen.  If ANY prior attempt at enrolling the device fails, you’ll never get past this if you do not also power cycle the purifier; they don’t tell you this anywhere, so you end up in an infinite loop of errors and timeouts.\n\nThird; manual setup doesn’t work.  I can join the purifier’s custom-connect WiFi network, but the app refused to recognize I had done so.\n\nFinally, I power cycle it, start over, reconfigure my 2.4-only broadcast-enabled WiFi network, and 90 minutes later I’m able to get the app to actually work and enroll the device.\n\nConsidering this a win, I peel the initial setup label off the top of my device, and the sticker they use leaves all the adhesive behind on the unit.  Are you kidding me?  I just spent $900 on an air purifier, and 90 minutes configuring this ridiculous app, and my final interaction is going to be using Goo Gone to scrub adhesive off my product?","updated":"2020-12-11T07:45:00-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6736090363","userName":"Yongyuthp","userUrl":"https://itunes.apple.com/us/reviews/id276418575","version":"3.0.10","score":2,"title":"App still not working","text":"It has been almost a month now and the app that was working fairly well is now not connecting despite all efforts. And this I e at a time when Bangkok AQI go to 150-160 \n... Get this fix ASAP blueair","updated":"2020-12-09T18:38:35-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6440131979","userName":"PhineasFong","userUrl":"https://itunes.apple.com/us/reviews/id333875124","version":"3.0.6","score":1,"title":"blueair classic connectivity","text":"what the heck!   why bother with an app that is TOTALLY not functional.  i can’t even connect machine to see what the app does.  the QR scan code on the machine that is supposed to be your connectivity link is also a junk website. AND i can’t even give this app 0 stars to submit review- forces me to put in a non deserved star!","updated":"2020-09-17T18:02:36-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6437011138","userName":"MVKIA","userUrl":"https://itunes.apple.com/us/reviews/id396994667","version":"3.0.6","score":1,"title":"Absolute Disaster of an App","text":"-edit-\nThe App does not work with iOS 12.4.8.\nIt worked with some difficulty with iOS 13.x.x. \nThe rating remains for the App.\n-\n\n1. The Signup Screen is a disaster. It creates an account but just does not to take you to the next screen. You are left wondering what the hell is going on. After a few times trying to create an account, it has actually created an account the first time, but the app just sat there refusing to show a response or going to the next screen. I checked by logging in with a browser and with Android App (which pops up with a get host name failure?). I suppose the server confused the app. \n\n2. The Connect screen is another disaster. It goes up the point of entering WiFi password and stalls there no response. The Classic 480i blinking endlessly. I pulling the plug and retrying several times I just gave up. \n\n3. The device lights are another disaster. The circle around the WiFi is different from WiFi symbol, Blinking and Pulsing are different - Really? You should fire your usability expert if you had hired one in the first place. \n\nAll you had to do was blink it when wifi is not setup and light it when it is connected and turn it off when it loses connection. \n\nSorry, the app deserves the 1 ratings it has got so far.","updated":"2020-09-16T20:20:44-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6435835223","userName":"Ang Manman","userUrl":"https://itunes.apple.com/us/reviews/id17394400","version":"3.0.6","score":1,"title":"Just Terrible","text":"I bought the classic 500/600 & the first step after unboxing is to download this app. It simply doesn’t work. As soon as it connects, it drops, and then sends through the entire set up again. Emails & chat sent to customer support get canned non responses, and so far no follow up. Basically I have no idea if the unit is even working or if I have a $1k fan.","updated":"2020-09-16T11:34:52-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6425323375","userName":"Opuscape","userUrl":"https://itunes.apple.com/us/reviews/id307931421","version":"3.0.6","score":1,"title":"Thank you and some feedback","text":"Update:\n\nNewer versions have made this application worse.  None of the problems below have been addressed and now I cannot communicate with my sense+ at all.  This has been going on for too long now.  \n\nPlease revert to the old application code base so that I can use my products.  If you cannot do this and cannot fix this app then it will be time to return your products to Costco.  I already have one unit with a noisy fan inside the warranty period and now this.  \n\n————\n\nFirst, thank you for investing in updating this application to ultimately improve usability and functionality.  I most appreciate what appears to be your intent to enable multiple automatic schedules for the same device so that different days can have different schedules.  \n\nThe new code does have a key issue for last 2 versions that I want to make you aware of.  When trying to program a schedule, the pop-up time-Of-day scroll wheels are visually a blank white box with no text or graphics at the top left of the screen.  If you mimic what you would normally do to program a start or stop tie, you can see that some of the functionality behind the GUI is there but it is impossible to successfully program.  I am using iPad Air on latest iOS 12 (cannot upgrade to iOS 13 per Apple).","updated":"2020-09-13T08:29:27-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6367835942","userName":"Gheyz","userUrl":"https://itunes.apple.com/us/reviews/id29759326","version":"3.0.4","score":1,"title":"Difficult setup; doesn’t stay connected; Amazon skill broken","text":"The whole reason I got this is so that I could control the device with my phone and Alexa. I had to try five times to get my Classic 580i connected to my WI-FI. Then after getting it to work, the app mysteriously looses connection with the device and asks me to connect a device again. I don’t want to do that because the first step is reset the device and it took me so long to just get it on the network. The amazon Alexa skill is also not available right now. What is the point of buying the connected version if it doesn’t connect to anything?","updated":"2020-08-27T13:53:53-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"6358936340","userName":"MichaelHanT","userUrl":"https://itunes.apple.com/us/reviews/id186165862","version":"3.0.4","score":1,"title":"Now what?","text":"Worst app update ever. I purchased 13 680i with previous app working fine, but now can’t even access to any one of my 680i remotely with this lagging app. Will switch to Dyson in the future. Shame on those who developed this app!","updated":"2020-08-25T04:12:14-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"4681656163","userName":"m_chandan76","userUrl":"https://itunes.apple.com/us/reviews/id301949365","version":"2.8.4","score":1,"title":"New app updates bad","text":"After latest update of app on 21 August, air purifier is not working , it’s continually show 400 2.5 pm till date and working with full speed in auto mode , I changed the filter also but still same, please help, and rectify the application issue,","updated":"2019-08-27T06:57:10-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"4372904410","userName":"Deemzz","userUrl":"https://itunes.apple.com/us/reviews/id150633164","version":"2.8.3","score":1,"title":"Can’t configure","text":"Tried setting up my device on an apple and an android phone with no luck at all","updated":"2019-06-26T08:47:29-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"2718933669","userName":"NaptheNap","userUrl":"https://itunes.apple.com/us/reviews/id107071272","version":"2.6.3","score":3,"title":"Beautiful design. Flaky connection","text":"A nice looking and functional app. So why not 5 stars?  The app frequently becomes stuck on status ‘Connecting...’ with a grey background. This occurs after the phone is locked. It’s 100% reproducible every time. \n\nIf anyone else is having this issue, one workaround is to force-close and reopen the app each time. This can be done by double pressing the home button and ‘Swiping up’ on the Blueair app. \n\nEDIT: Old setup issue below. SOLVED: Seems like the unit doesn’t play nice with virtual wifi networks. After disabling that setting on our home Netgear router, was able to complete the initial setup fine after that. In Blueair’s defence, this specific issue is in fact mentioned in an online support article. \n\nORIGINAL REVIEW:\n\nSpent 30 minutes trying to get the new 280i and 480i to work our fam WiFi network. Both using the standard route and via ‘classic-connect’ manual option. \n\nAs an engineer myself the next will try setup a dedicated 2.4ghz network without security. I have no idea why it can’t connect to my network which is just a regular WPA2 802.11n network. \n\nIt seems others here also struggle with WiFi. A suggestion to the dev team : maybe test with wider range of customer routers and setups. Real world conditions in the lab can be far from representative. \n\nIn conclusion we have *many* of other smart IoT devices on the network, from a wide range of manufacturer, all working fine. The issue appears to be BlueAir.","updated":"2018-06-18T08:21:14-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"},{"id":"3359600352","userName":"Davzone","userUrl":"https://itunes.apple.com/us/reviews/id387428489","version":"2.8","score":2,"title":"Old design looked better","text":"This new design doesn't fit well with iOS. \nThe old app looked nice on iOS. The new app is much worse. Colors are off. Buttons and the whole ux is off. Looks like a badly designed Android app.","updated":"2018-10-29T19:41:11-07:00","url":"https://itunes.apple.com/us/review?id=1016299342&type=Purple%20Software"}]