[{"id":"8098028656","userName":"bduejsna","userUrl":"https://itunes.apple.com/us/reviews/id142576021","version":"3.5.3","score":2,"title":"Keeps logging me out","text":"App worked good for a while and we were happy with our purchase but now I keep getting logged out and have to log back in. I would hold off on buying this product until after they are able to roll out a fix.","updated":"2021-12-05T06:40:30-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7992762430","userName":"av8r445","userUrl":"https://itunes.apple.com/us/reviews/id18328575","version":"3.5.3","score":1,"title":"Smart location still broken plus privacy issue","text":"UPDATE - I’ve also just discovered that in addition to smart location still turning itself off, it also keeps automatically turning on the App Analytics option. So make sure you keep unchecking that option multiple times a day if you don’t want your personal analytics data sent to Logitech.\nTheir change log is right in that this update seemingly fixes the login issues. But smart location is still turning itself off just as frequently as when this whole thing broke back in the June update. Makes smart location still mostly useless. Have tried logging out of all devices and the web, deleting the app, reinstalling. Also has an annoying feature where the list of devices for smart location keeps growing with multiple copies of the same devices. How much longer is this app going to stay broken? It used to be really good prior to June.","updated":"2021-11-05T15:17:06-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7950614040","userName":"sourman116","userUrl":"https://itunes.apple.com/us/reviews/id577898346","version":"3.5.3","score":4,"title":"New upgrade is horrible","text":"Update: these problems were fixed in the last app update. Thanks for responding!\n\nYou have to sign in on their website to use this app now. HORRIBLE and now I’m stuck with 3 cameras where the whole point was the ease of the app. You can get a camera from anyone, the app is the difference maker.","updated":"2021-10-24T16:39:45-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"8094817157","userName":"10 buxton","userUrl":"https://itunes.apple.com/us/reviews/id355030694","version":"3.5.3","score":3,"title":"12/04.   Smart location still not working.","text":"It seems to be pretty consistent not working. Just have to be correcting all the time. The latest update has corrected everything. Have two - one inside and one outside - great cameras. Use them with HomeKit.","updated":"2021-12-04T09:37:27-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1853777016","userName":"Canyak","userUrl":"https://itunes.apple.com/us/reviews/id157492705","version":"3.1.1","score":2,"title":"Not great","text":"This has great potential, but it is currently far from where it should be. There is no Apple TV support. There is no iPad multitasking support. We use the camera as a baby monitor, so multitasking and picture in picture would be really nice to have. It also has no way to change the WiFi network in the app - you have to do a factory reset on the camera just to change what WiFi you want to use. That is a horrendous pain to deal with when you are traveling and staying at a new place every night. It does not support background audio. It is completely dependent on “cloud” servers to function at all, even if you have the remote recording feature turned off. You can have a perfectly functioning LAN, but the whole thing will stop working if it can’t talk to Logitech. It desperately needs the ability to function locally in at least a basic mode. Ideally it could function in full mode too and be able to utilize NAS instead of cloud storage. Logitech used to be a great hardware company. Now they seem to be crippling their hardware to try and sell software service subscriptions. That is not what I or I imagine most people want. Focus on giving customers what they want and you’ll make lots of money. Focus on making lots of money and you’ll go the way of all the other has-been companies.","updated":"2017-10-16T16:32:53-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"8027954394","userName":"IHugBunnies","userUrl":"https://itunes.apple.com/us/reviews/id596146673","version":"3.5.3","score":1,"title":"Worked until it didn’t.","text":"Worked great on my old iPhone. Spent an hour and a half on the phone with customer support, and it absolutely will not work on my new iPhone. As I don’t have another phone or an iPad, I’m out of luck. My $200 Logitech camera is now a useless piece of junk.","updated":"2021-11-15T13:55:09-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"8129984766","userName":"ig user me","userUrl":"https://itunes.apple.com/us/reviews/id441820581","version":"3.5.3","score":1,"title":"Terrible ap","text":"I have to log in every time I open the ap and is incredibly slow to play back videos. Very frustrating and disappointing to say the least.","updated":"2021-12-14T10:21:09-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2142726993","userName":"Cuppie555","userUrl":"https://itunes.apple.com/us/reviews/id27212466","version":"3.1.4","score":2,"title":"Good start but needs some work","text":"A must have app if you’re using a Logi Circle camera.  I have the Logi Circle2 and love the camera.  I also like it does’t broadcast 24/7 and only records when there is movement.  That saves on internet usage.  The app needs some work though. The live feed gets frozen if you are running the app in the background and then open it again.  You have to force close the app and then reopen EVERYTIME you open the app.  The other issue is with the Smart Notifications.  You are only able to geofence your phone and not multiple phones using the same account.  If I’m home I won’t get notifications of movement which is nice and expected of any camera being used in 2018.  But if I’m gone and my wife is home with her phone connected to the camera I will get notifications of movement.  The Nest camera and app allows multiple phones to be synced.  That way everyone only gets notifications if ALL phones are not within the geofence area.  If they add this functionality and improve the app stabilization I would give this 5 stars and tell everyone I know to buy one of these.","updated":"2018-01-29T13:08:18-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1622340007","userName":"Jgftyyhgff","userUrl":"https://itunes.apple.com/us/reviews/id121455703","version":"2.3","score":1,"title":"Switched to a better camera","text":"Update 23 may 2017: camera has turned into utter garbage. Went down a week ago and has not worked since. Tried resetting it back to factory default & setting up again but nothing works. First it says the cloud servers were down. Then it's trying to tell me I don't have an internet connection when I clearly do. Lowering my rating to 1 star. Do yourself a favor and get a different camera. This is not built to last. \n\nUpdate 22 December: With every update the app seems to get worse and worse. My camera now goes offline for no reason at least 5 times a day. Downloading of clips is still broken. If you are contemplating buying this camera don't do it. I only still use it because I doubt I'd be able to resell it for any money. \n\nBeen a logi circle owner for about a year. I just recently bought an arlo q camera to replace it and I gotta say I couldn't be happier. Wish I just would've got it from the get-go. 7 days of free recording vs the logi circles 24 hours. It's a no brainer. Plus it's much more customizable and supports IFTTT. Logi circle works well but there's just better options out there with more features. The logi circle is definitely not worth the $200 I spent on it.","updated":"2017-05-23T17:12:51-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7823601742","userName":"SolarWind","userUrl":"https://itunes.apple.com/us/reviews/id38273732","version":"3.5.2","score":2,"title":"FRAGILE! (Previously great app rendered far worse by update)","text":"Echoing what user bellyhanglow said, the so-called security improvement shipped by a recent update has made the usage MUCH worse. Unlike that user I have been able to login and view my subscription videos on my multiple cameras BUT I find I am often astonished by a “requirement” to login AGAIN and sometimes that happens shortly after having viewed the cameras without any device pauses or downtime’s. I also occasionally get bounced back & forth between browser and app with login failures but I have found a method of short-circuiting it after it begins. Users should NEVER need to debug apps! \nIf indeed there is actually any improved security it has come at the price of stupendously fragile connection now. \nIf the connections don’t become stable I cannot imagine that I will renew my logi circle subscriptions when they come up for renewal in a few months.","updated":"2021-09-19T11:35:17-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"6788364089","userName":"Gampapa3","userUrl":"https://itunes.apple.com/us/reviews/id199921359","version":"3.4.5","score":1,"title":"Cannot open or delete app","text":"I have an iPhone 6s Plus with IOS 14.2 with the updated Logitech Circle 2 app. I am unable to open the app even after shutting my phone off and then rebooting. I am also unable to erase this app from my iPhone. I’ve tried to erase it from the home screen it has an XE press it it disappears but it’s not deleted. When I go to the App Store to download it has the open indicating that it never deleted in the first place. I’ve tried to delete it from my list of purchased apps end it only gives me the option to hide not to delete. I’ve also tried to delete it from going to settings general to iPhone storage and then scrolling down to the app tapping it and hitting delete and confirming delete. It still will not delete. I’ve even gone to settings then to screen time then to add content and restrictions and made sure that I enable the delete app option. So bottom line this app is totally useless unless I can fix this. The camera cost me $150 and I cannot use it since my phone updated to 14.2 iOS. I would love it if logitech would read this and contact me to help me fix this.","updated":"2020-12-24T05:31:25-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1303041227","userName":"Jiggidyuo","userUrl":"https://itunes.apple.com/us/reviews/id86116693","version":"1.5.1","score":5,"title":"Works Great! Perfect Video Monitor","text":"Continuous live feed makes this camera awesome! It now works really well as a baby monitor. When reviewing monitors these days, a lot of the reviews care little about a battery, but you need to be able to move the camera around the house without a cord if your gonna use this as a baby monitor. The battery does well enough for me. 4-6 hours depending on use. It has a save battery option but no telling how helpful it is to use. Video quality is definitely good enough and the night vision works great. The app is pretty simple and easy to use.  Options like being able to take a photo while watching a live feed is cool. Love the FREE 24 cloud storage. PLEASE don't change that feature. Huge selling point for me! If after 24 hours I haven't downloaded it, I probably don't want it anyways.\nThis is a 5 star app and video monitor in my book!","updated":"2015-12-19T12:03:40-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1501844711","userName":"Kschn12","userUrl":"https://itunes.apple.com/us/reviews/id87802124","version":"2.1","score":2,"title":"Why am I getting 50 notifications a minute?","text":"We use this as a dog camera, and it's great. Yesterday, I left work in the middle of the day to go untangle my puppy, who had chewed up her towel and gotten the strings wrapped around her neck. So it's a handy little device. But this new app update is complete garbage. The constant notifications are driving me insane. It's literally sending me notifications at least once a minute, but they've been totally still and napping for hours. Alert me when there's significant activity; not when the dogs are simply breathing. I don't want to change the settings; because if they're actually doing something (like chewing), I want to be alerted that moment, so I can tell them to stop. And the \"person detected\" feature is both creepy and inaccurate. Not a happy camper.","updated":"2016-12-14T09:52:46-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"4284434876","userName":"LMizuho","userUrl":"https://itunes.apple.com/us/reviews/id875719989","version":"3.4.2","score":3,"title":"Needs Improvements","text":"PROS: with the subscription, you can create up to five zones, via completely customizable shapes. This was perfect for me, as I live on a very busy street and need to focus on areas on our property, vs the usual busy traffic and pedestrians. \n\nCONS: although the zones have helped reduce the noise and bombarding of notifications, I’m still getting “likely detected” notifications for zones (even though I specifically only selected the zones for notifications, not outside zone activity). This means that motion is detected near, but NOT INSIDE the zones and is notified still. What is the point of the zone feature I am paying for then??? I have a bus stop and busy side walk in front of my home so there will always be “person/motion likely detected” notifications clogging my phone. It’s very difficult to discern if it is a true threat or not. \n\n^ Please fix or provide a toggle option for this!","updated":"2019-06-08T09:24:36-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1373483450","userName":"Nick710","userUrl":"https://itunes.apple.com/us/reviews/id32119314","version":"1.6","score":1,"title":"Last update broke the night vision!","text":"I'm glad to see that Logitech is continually making updates and adding features. However the last firmware update has cause the cameras night vision to turn on and off repeatedly in a completely dark room. We use the cam as a baby monitor, but currently we had to shut off the night vision because it would turn off about 5-10 secs after it would turn on; and repeat. Each time making a clicking noise in the room. The camera hangs from the wall above the crib, just as it did before the update.  I've tried rebooting and even a full reset with re-adding it to the account. Nothing changed. So it must be your update and it's probably server side as I believe that's how you control turning on the cameras night vision. It's not a decision the camera itself makes. \nPlease fix it, we want to like the camera again. \nLastly, I want to say thank you for removing the 3 min timeout that rendered the cam useless as a baby monitor.","updated":"2016-05-04T10:36:02-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7731492491","userName":"fieldtripz","userUrl":"https://itunes.apple.com/us/reviews/id37070883","version":"3.5.2","score":3,"title":"Partially fixed","text":"The login issue doesn’t occur as often (for now), but the big issue I’ve noticed over weeks is that the videos don’t appear to always get deleted. Not sure why this happens. There needs to be a much better way to ensure that videos are deleted. The current method is cumbersome and I don’t believe the videos are always getting deleted. I’ve been checking 2x with the app. Sometimes 24 hours later a video reappears and it’s unsettling.\n\nI haven’t bothered using the app with the Home app or smart location for awhile because I have another type of camera that does it and it’s a backup in the event the Logi has an outage. I had a Logi cam that was broken by a bad firmware update. When not in use I unplug cameras due to privacy concerns. This app doesn’t integrate enough with iOS.","updated":"2021-08-24T22:07:14-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2007022344","userName":"Jared Rogers","userUrl":"https://itunes.apple.com/us/reviews/id32360988","version":"3.1.2","score":1,"title":"Using App Breaks HomeKit Functionality","text":"I purchased this camera because of its compatibility with HomeKit. After using the camera for a day with HomeKit only (and no issues) I downloaded the App to tweak some settings. Hours later I opened the Home App and noticed that the feed would not load, opened the Logi Circle App and the feed was working in App. I changed the settings back to default in the Logi Circle App to see if one of my changes had caused the issue but that didn’t fix it. I unpaired the camera from the Logi Circle App and HomeKit then paired it back for a week and it worked all week. I then paired the camera back to the Logi Circle App and within hours the feed in the Home App was no longer working. This App breaks the camera’s HomeKit compatibility. I would not recommend this camera if you want to use it with HomeKit and the Logi Circle App, it only works with one or the other. Hopefully Logitech will fix this, if not I will be returning the camera and deleting the App.","updated":"2017-12-18T10:20:18-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7519065574","userName":"USMCRecon8546","userUrl":"https://itunes.apple.com/us/reviews/id119562728","version":"3.5","score":1,"title":"What is going on?!","text":"Following the latest update to the app, it continually logs me out. There is no monitoring at this point. If the cameras trigger an event, you constantly first have go through the entire log in and validation process before you can view the cameras! I’m assuming this is a new method of forcing users to pay for the monitoring service instead of the standalone user camera monitoring.   After purchasing several cameras I now have to start over and will be tearing them out and replacing. Complete waste of money and time.\n\nUPDATE: Now I can’t even log into the app to view the cameras. Opening the app requires a log in. After logging in, the app restores to the section asking to log in again. This just repeats and does not allow actual log in. I cannot describe the disappointment and total anger that I spent so much money and time on these cameras. Avoid and try anything but these!","updated":"2021-06-29T05:38:16-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1509815241","userName":"Kevin Jaber","userUrl":"https://itunes.apple.com/us/reviews/id401826419","version":"2.2","score":5,"title":"Great Performance","text":"This is a very good product. I have it running 24/7. Notifications issue need to be fixed, why! If you use the app on two different mobiles, the mobile notifications won't work on both mobiles 📱 but it will send notifications to one of these connected mobiles, but still you can enjoy the HD resolution. Make sure you have a steady internet connection for a faster recording loading as the camera with slow connection might take longer to load. \nTip: for dark night recording, please install strong light sensors outside this will extremely help your logi security camera to record a better and higher resolution at night. \n\nAll my respect to Logitech Products 👍","updated":"2016-12-26T20:34:42-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"5139654713","userName":"de Schnack","userUrl":"https://itunes.apple.com/us/reviews/id35514050","version":"3.4.5","score":4,"title":"Kudos for enable HomeKit secure","text":"The camera has been working very reliably for 1.5 years, running 24/7. I have had no issue using either the Logi app or HomeKit. Now, Logitech just enabled HomeKit Secure via firmware upgrade (note: it renders the Logi app obsolete and they warn you clearly to that regard). Big thank you to Logitech for enabling a new HomeKit feature on a 1.5 year old camera. I was waiting to see who was moving on HomeKit Secure to make my purchase decision, and now will very well add another Circle to my collection because they chose not to penalize existing customers. Maybe Logitech learned something after years of dismal customer support. That’s called customer retention. A rare feat in the tech world today.","updated":"2019-11-14T19:29:37-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3596812906","userName":"Trapior","userUrl":"https://itunes.apple.com/us/reviews/id106327596","version":"3.3.1","score":5,"title":"New purchase, works well","text":"Got two camera for Christmas. They’re easy to set up and have a good selection of options. I look forward to see what options will be added. \n\nI have both cameras on 5G at home and they work great. Notifications come about 30 seconds after an event. The person identification works great. My main use case is to watch my home’s windows and entrances. The IR settings are great too, but only seem to come on when the camera needs it. \n\nAs far as landscape view only, as others have commented, it would be nice if the controls of the camera turned to portrait while keeping the camera full screen. In my case, one window is watching a vertical range and another is horizontal. It has been fine working with the sideways view for now but it would be nice to have the option to set the camera as portrait-view in my settings. \n\nDoes not work with home kit for me, but this app works well enough that it is not an issue. It initially connects to the camera and gets the feed, then says camera not responding.","updated":"2018-12-31T12:20:57-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7760171647","userName":"Bellyhanglow","userUrl":"https://itunes.apple.com/us/reviews/id16509226","version":"3.5.2","score":1,"title":"AWFUL","text":"I’ve tried logging in 35 times without success. With a rash of recent car thefts and break-ins in my neighborhood I’d like to be able to see what set the alert off and not spend 10 minutes attempting to log in. This used to be a good set up but since the new update it’s absolutely awful and there’s no point in having it if I can’t actually see what is setting the alert off.\n\nFollowing up after several “remove the app and reinstall” chats with support. It’s still AWFUL. Nothing has changed, I still have to log in and that takes me to another page which doesn’t log me in, and I do this 15-20 times before I give up. Latest request from support was to go to settings in the Logi circle app, go to help and submit a diagnostics report. If I can’t log into the app I can’t submit a report, thanks for the help.","updated":"2021-09-01T14:11:12-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1470490498","userName":"4403 1968 65","userUrl":"https://itunes.apple.com/us/reviews/id85435843","version":"2.0.1","score":1,"title":"Inadequate App design","text":"Just bought 4 of the these cameras because of their design and they fit most of needs. App however is very in thoughtfully created. It's does not have neat features that Nest or Arlo provides. To begin with it does not allow you to turn it on or off by certain schedule. I have to turn it on and off if I don't want to use it when I am home. A simply idea that circle tech team just missed. For all four cameras I have to apply the same settings individually. It would be nice to be able to control all cameras in the system through one interface. Multi camera pan randomly picks a camera that will have largest view. I should be able to select what camera gets the largest view. More over the viewing pan is very poorly designed. Overall, I am giving it one star because the app lacks basic functions. Camera itself is good except the speaker crackles very bad.","updated":"2016-10-21T05:21:06-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2030731799","userName":"Joeldk1","userUrl":"https://itunes.apple.com/us/reviews/id170247692","version":"3.1.3","score":4,"title":"Suggestions","text":"Why not find bugs before deployment? Had to uninstall and re-install to get app to work again after last update. C-mon guys your supposed to be the legendary web cam developers. Everything should be seamless and polished. Why can you not seek forward while zoomed...nobody thought of that? The one thing that drew me into buying the camera was seeking quickly through the each motion detected event quickly. Why not seek fast option for each activated sequence? You guys are developing apps like amateurs. I have faith that you will surpass my expectations in future versions. Right now I will settle\n\n1. Adjust playback speed, skip ahead 10 sec or scroll function. I spend too much time moving the slider over an inch waiting it to load sliding another inch waiting to load over and over until the whole footage has been reviewed. \n\n2. Times to be alerted. I don't need to be alerted when I am home. Could it be scheduled. \n\n3. The daily brief is nice but misses many things. What's wrong with including all scenes \n\nI will write another review as this cool little cam evolves.","updated":"2017-12-26T19:14:44-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2278858655","userName":"Shane O'","userUrl":"https://itunes.apple.com/us/reviews/id42083622","version":"3.2.1","score":2,"title":"Camera’s nice but the app needs a lot of work.","text":"First off, which is obvious from the moment you open it…it only works in landscape. I get that the video is 16:9, that doesn’t mean I want to turn my phone sideways automatically. A more elegant solution would be to move the UI below the video playback area when holding in portrait. I don’t need detail, I need to see a preview to determine whether or not the notification I’ve received is important.\n\nSpeaking of notifications. Smart locations work intermittently, and often deliver false positives such as when you are home, or when light changes drastically. Sometimes, you get nothing. Meh.\n\nThe app will often hang and refuse to update, forcing you to quit. The camera will still be viewable via HomeKit, etc.","updated":"2018-03-06T18:39:27-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3905137683","userName":"Flowulf","userUrl":"https://itunes.apple.com/us/reviews/id37818446","version":"3.4","score":1,"title":"Camera Feed Loading Takes Too Long","text":"The features of the camera and app are great but the camera feeds takes forever to load. If you have someone knocking on the door you can’t immediately view the feed as it takes time to load. I have to log in on a computer to the Logi Circle site and get better response and load times there than through the application.\n\nIt seems that when you view the live feed, you are not streaming the feed directly from the camera, instead you viewing the feed that is being streamed to a Logi Circle server. It would be better off updating the application so that when you view the live feed you are pulling the stream straight from the camera and not from a Logi Circle server.\n\nReviewing past recordings is the same result; loading times take forever.","updated":"2019-03-20T12:35:09-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7870459926","userName":"Where's the wish list?","userUrl":"https://itunes.apple.com/us/reviews/id23495388","version":"3.5.2","score":4,"title":"Used to be good, now unusable","text":"Logitech recently changed their security authentication process and it has made the app nearly unusable. Sometimes you can log in right away, sometimes you are forced to try logging in 10+ times until you give up. What is the point of a security system that you can’t check when you need to?\n\nUPDATE: The developer contacted me in response to this review and asked me to try the beta of the next version of the app. It seems to have fixed the problem. Hopefully they roll it out widely soon! Star rating conditionally upgraded anticipating the fix.","updated":"2021-10-02T12:52:06-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1899705553","userName":"Odellios","userUrl":"https://itunes.apple.com/us/reviews/id15890468","version":"3.1.1","score":3,"title":"So so as a baby monitor","text":"The quality of the video is much better than our previous withings baby monitor.  And we like the way this app presents various movement throughout the day in case we have a need to peek back.\n\nThe camera seems to need updates all the time, and every time it does, the app gets confused about the state of settings on the camera. I have to plan on 10 or 15 minutes to fiddle with it to get the LED setting to go off again after firmware updates because the app seems to get confused about the camera’s view of the setting every time.  If it happen d rarely I could live with it, but I’ve only had the camera for a month and a half and I’m sure I’ve had to do it 4 times...","updated":"2017-11-05T09:46:05-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2341746198","userName":"PolloTec","userUrl":"https://itunes.apple.com/us/reviews/id34193062","version":"3.2.1","score":3,"title":"Nice update, great potential","text":"This app update to iPhone X was a welcomed upgrade, however, the app has great potential in its current state. It works, but just it starting to feel dated and a bit clunky. Listing of enhancements follows:\n\n-Better geofenced smart alerts when signed in on 2 devices. Currently, if one device is home and another is away, the other device gets all the alerts. There should be an option to have alerts pushed ONLY when all signed in devices are away from home.\n-app icons on left side can be pushed further left into the “notch” on iPhone X to improve cleanliness of video playback window. \n-Wi-Fi & battery status icons found on the camera settings page can be moved to the video playback window on the left side in the notch as well. \n-live video playback for all cameras simultaneously in the split screen view would be a welcomed upgrade. \n-turn off camera/privacy mode when home would be great \n\nFinally, other camera manufacturers have more robust feature sets. Logi needs to keep pushing forward to stay competitive. Keep at it!","updated":"2018-03-24T09:26:37-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3142560878","userName":"H.Henning","userUrl":"https://itunes.apple.com/us/reviews/id30486479","version":"3.2.5","score":4,"title":"Lots of potential, but Software needs work","text":"The camera hardware is really nice and the quality is good as long as you don’t want to use 1080p in the Home app. The iPhone and iPad app are much more capable, but I really wish I could turn the camera into privacy mode based off my location or HomeKit scene. This would be particularly useful for guests who may not be 100% comfortable with a home security camera. I also wish the AI features were a little cheaper if you just have 1x camera like I do. $9.99 to have the facial recognition is a little steep. I love checking in on my cat when I’m on the go from my Apple Watch. That is a very nice feature.","updated":"2018-09-01T15:37:51-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1795529624","userName":"Sykm4n","userUrl":"https://itunes.apple.com/us/reviews/id28558932","version":"3.1.1","score":2,"title":"HomeKit integration still needs work","text":"Updated to newest firmware.  Everything seems to work well within the logi standalone app, but Home App needs a lot more work.  \n\nI'm comparing HK capability to the Omna 180 and the omna loads live streaming within a few seconds while the logi takes much longer.  The Omna 180 also refreshes the live feed every time you open it in the Home app.  Not the case at all with the Circle 2.  I have to open the Omna camera and then the circle 2 before it refreshes a new live feed.  I believe this to be a simple software fix but until then the Omna cam is still superior in every way except for outdoor functionality.  \n\n***sad that you can only live stream in home app in 720p.  Such a shame!","updated":"2017-09-17T19:02:36-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7705405634","userName":"EZCheeze12345","userUrl":"https://itunes.apple.com/us/reviews/id42446578","version":"3.5.2","score":1,"title":"App is horrible!","text":"I keep rewriting reviews since they keep getting ‘reset’, but the funny thing is, Logitech just can’t escape a bad rating no matter how many times they delete the reviews and have people start over. The log in process is a total joke. I have to repeatedly ‘log in’ which takes me to Safari, which then takes me back to the Circle app and has me repeat until it decides to finally work. It’s clear Logitech wants to abandon this app and the Circle hardware for their new stuff because they refuse to fix this even though it’s been broken for about three months. Do your developers use Git? Maybe you can just redeploy the previous version until you can get some developers who understand how SSO and security work.","updated":"2021-08-17T20:16:48-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7642682081","userName":"ZenrinMaster","userUrl":"https://itunes.apple.com/us/reviews/id116175910","version":"3.5.1","score":1,"title":"Version 3.5 is awful.","text":"The new “security” has the app open a browser to login and launch the app.  This is the worst design EVER!  The moron that created it should be fired and the app needs to go back to all apple security using a thumbprint or face-login.  The web app isn’t much better timing out every hour forcing a re-login.  Why do I want to relogin to my security system every hour when I’m using it to watch my outdoor security cameras???  The app should also permit streaming from multiple cameras at once instead of a snapshot when refreshed, or every so often….  If you are looking at these cameras, don’t spend the money.  They aren’t worth the irritation.  Logitech, fix the system, or provide an API to the camera feeds to let us bypass your incapable apps.","updated":"2021-08-01T05:48:29-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7897586585","userName":"ex lounge lizard","userUrl":"https://itunes.apple.com/us/reviews/id129517050","version":"3.5.2","score":1,"title":"4 cameras sending alerts but no way to see recording!","text":"C’mon - just to get our ID for marketing monetization, you blow up something that’s been working well? Please fix this or these cameras have to be junked - totally fail on home security, which is why most people buy these devices - NOT for fancy SSO - and then if you pick facial recognition and that fails (as it did) one cannot log into with email - who thought of that user experience?\n\nUpdate: seems to work now 10/9…but what happened to the alerts? Let customers know what’s happening as this is a mission critical application for consumers’ family safety. While some may not upgrade to new equipment unless they have to, not fixing this will lose all your brand loyalty forever.","updated":"2021-10-09T20:53:14-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7817642333","userName":"why is this so hard ):","userUrl":"https://itunes.apple.com/us/reviews/id251440760","version":"3.5.2","score":1,"title":"Extremely frustrating to log in","text":"It came with the business i bought. Most of time can’t log in with out repeatedly pressing then log in app which takes me to something called “secure log in” which takes me back to the app where the process started all over again. This can go on a dozen or more times. Nothing I try seems to work consistently even closing out the app. When you finally get to log in decent quality but tonight I have been trying for over a couple hours. Turing off and on my phone doesn’t work either. No luck tonight. Tomorrow I get a reliable security system to protect my business. This is a violation of warranty of fitness and the company should be sued!","updated":"2021-09-17T21:25:59-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7480271644","userName":"CJM7410","userUrl":"https://itunes.apple.com/us/reviews/id42411840","version":"3.5","score":1,"title":"Latest Update Broke Functionality","text":"Since this last update, the app is constantly forcing me to re-log in. And there is no real warning. Notifications with previews work, then it changes to no preview. Then no notifications at all. I’ll launch the app to see what the issue is and I’m forced, several times, to launch the website then relaunch the app to log back in. But why am I logged out so much?\n\nIf that wasn’t enough, once the app has finally let me back in. It shows all of the cameras are now offline. Funny because they still show up in HomeKit. \n\nCould we fix this please? Single sign on is supposed to make the experience better. Not keep kicking us out of the app every few hours.","updated":"2021-06-18T17:44:54-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3517240179","userName":"Alexbender44","userUrl":"https://itunes.apple.com/us/reviews/id38378548","version":"3.3.1","score":2,"title":"Constantly goes offline","text":"Despite having strong internet throughout our small apartment, the camera is always going offline. This has been happening for a while and I finally got so fed up this morning after waking up to 18(!) “camera is offline” notifications that I decided to post my review.\n\nI can be streaming 4K content on my Apple TV and I’ll simultaneously get alerts that the camera is offline. How can that be? Especially when I’m getting pinged every 20 mins by the app when I’m at work. Unfortunately, I can’t recommend this to anyone until it’s fixed.\n\nUPDATE: Has been offline for 3 straight days. Absolute garbage product and wouldn’t recommend it to anyone.","updated":"2018-12-10T16:33:33-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7581281944","userName":"Palm user","userUrl":"https://itunes.apple.com/us/reviews/id32791419","version":"3.5","score":5,"title":"After update delete and reinstall","text":"After the latest update in June every time I try to open the app it would take me to the website to re-login. After a few frustrating weeks I decided to delete the app and reinstall it and since then I’ve had no issues. Overall great camera and app with ability to talk through the camera. One app with cameras in multiple locations. Quick setup and easy to use cameras and app.","updated":"2021-07-15T18:49:07-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3833179215","userName":"Henson_12","userUrl":"https://itunes.apple.com/us/reviews/id180069016","version":"3.4","score":4,"title":"Really nice camera but needs a couple things","text":"I really like these cameras I have 2 of them. I got them for the Apple HomeKit ability. They work pretty good for the most part and I like the new update with the smart location stuff but is there some way you can update that so I can add other family members devices to the list. That would be nice to have so when my son is home and I’m not home I don’t get alerts ever 5 minutes that he walks by the camera. That is the only thing I don’t like about these cameras but other than that they would pretty well.","updated":"2019-03-02T07:42:28-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7618318254","userName":"assignmeanickname","userUrl":"https://itunes.apple.com/us/reviews/id256595626","version":"3.5.1","score":1,"title":"Ok cameras; terrible app","text":"To anyone who just bought this camera....return it immediately and get your money back while you still can.\n\nThe cameras are pretty worthless when the app is as terrible as this. Previously terrible response time for pulling up videos. I was hoping the latest app update.....which has been a loooong while since the last one...I was hoping the “bug fixes” would actually fix it. But things are only worse. Now I can’t even get recorded videos to play. For the annual fee I pay I expect things to work as a basic standard. These cameras are now a piece of junk because I am going to have to switch to another camera with a reliable app.","updated":"2021-07-25T19:03:05-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1798946742","userName":"hsugene","userUrl":"https://itunes.apple.com/us/reviews/id107840999","version":"3.1.1","score":2,"title":"Slightly buggy","text":"The 3.1 and 3.1.1 versions have this annoying bug that sometimes doesn’t open up my live view when I start the app. I have to click away from the live view (e.g., to the day brief) and then click back to the live view. \n\nThis issue mostly comes up if I click the home button with the live view on. The camera LED goes when and then back to green for a few minutes before switching to white. When I open the app again, it gets stuck trying to load the live view. \n\nI thought it might go away in iOS 11, but it didn’t. Hopefully the next update fixes this. Otherwise, it’s a good app.","updated":"2017-09-19T16:40:58-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7626619110","userName":"Unidirectional Velocity","userUrl":"https://itunes.apple.com/us/reviews/id42004553","version":"3.5.1","score":1,"title":"App constantly logging out by it self with latest update","text":"With latest update app ver. 3.5.58; it keeps on logging out it self and forces user to re-login constantly which agitates user to the max degree. The activity notifications also has a major flaw; it pushes out three of the same activity notifications for every single push alerts which are also extremely cumbersome and frustrating to endure.\nNo matter how great the device is, it’s only as good as application driven by thoughtful minds. It is abundantly evident that this app is driven by absent minded developers or perhaps this company may have an owner risk all together. \nPlease fix the issue before we decide to never to invest in your company’s stock.","updated":"2021-07-28T00:47:00-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7854609635","userName":"s9745a","userUrl":"https://itunes.apple.com/us/reviews/id39847767","version":"3.5.2","score":1,"title":"Constant logouts, flaky web sso auth","text":"This app went from “not great” to “infuriating” in the recent update. It’s constantly logging me out, and then it bounces you out to Safari to login as if we haven’t solved the problem of logging in inside of an app years ago. Sometimes it just doesn’t work, sometimes it’s slow, but every time it takes long enough that I end up missing whatever was happening on the camera that I was trying to check on. How absurd is it that it’s faster for me to go downstairs, walk across the house, and look out the front window to see who is at the door than to try open the notification from my camera and look at the video?","updated":"2021-09-28T08:25:31-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7826299604","userName":"mcio1","userUrl":"https://itunes.apple.com/us/reviews/id16206258","version":"3.5.2","score":1,"title":"Horrible","text":"I first purchased the wireless circle 2 for outdoor I was very happy with the performance of the camera and the alerts that I purchased 2 more wired for outdoor but recently like everyone else is having issues with the app will not let you view the camera unless you sign in every time this could be one of the worst experiences I have had so far if nothing changes in the next few months I will switch to ring or nest witch I would recommend everyone else do the same ,,reason I purchased this in the first place was because of a full wireless camera I should’ve went with my instinct and just went with the ring from the beginning","updated":"2021-09-20T06:25:29-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2063223785","userName":"Bcutty8","userUrl":"https://itunes.apple.com/us/reviews/id24745074","version":"3.1.4","score":1,"title":"Very slow","text":"Thought I could use it similarly to the Ring Doorbell but it takes way too long for the live view to come up. The voice delay is also delayed by about 3 seconds so you really can’t communicate with someone at your door with it. The daily recap works some of the time but not always. If you want any more than a day’s recap you need to buy a subscription to store videos longer which I would do if the app worked faster. As a baby monitor it is acceptable but as a security camera it is worthless. I have two cameras which I will probably send to electronic recycling. I thought this would be a good wireless solution but I was wrong. If you are reading this and can still return the camera I would.","updated":"2018-01-06T09:41:25-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3320366444","userName":"Petar","userUrl":"https://itunes.apple.com/us/reviews/id23348303","version":"3.3.1","score":2,"title":"Does what it’s supposed to","text":"I think this app does what it’s supposed to. Unfortunately I find it lacks soul and isn’t engaging me as a consumer. It isn’t an app that I feel that I enjoy interacting with. What I feel is lacking the most is a portrait mode. I don’t want to have to turn my phone sideways just to use the app. It’s great to be able to do it and get a better view, but I don’t think it should be forced. \n\nBut it does what it’s designed to do. View my camera, change settings. If you make it work in portrait, that would instantly bring my rating up to ⭐️⭐️⭐️⭐️. For that last star it would have to gain some soul and engage me.","updated":"2018-10-19T11:59:40-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7626186659","userName":"Andywhip","userUrl":"https://itunes.apple.com/us/reviews/id3896260","version":"3.5.1","score":1,"title":"Ditching Logitech for Ring","text":"I’ve given Logitech a month to fix their terrible update, and the newest update is still no good.\nI don’t understand how you can read these reviews and not jump at the loss of customers from a destructive update. I work in software, I understand the development cycle. This should have been fixed by now (or at least reverted SSO functionality. I’ve been paying for monthly services and will be canceling and moving onto Ring. \nI love the camera, and everything was good for the last year, but I’ve given up.\nPlease, if you’re reading this, return the camera if you can, or don’t bother relying on it for security.","updated":"2021-07-27T21:44:41-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7508278865","userName":"pyroxene26","userUrl":"https://itunes.apple.com/us/reviews/id30744446","version":"3.5","score":1,"title":"Smart location no longer functions","text":"We’ve had Logitech circle 2 cameras for several years to keep an eye on the house and they’ve been great overall. However, the latest iOS app update broke the smart location function; every time I leave the house a pop up notification states “location failed to update from this device” and our ‘doggy cam’ remains off. \n\nTried logging out of all devices, deleting and reinstalling the apps, resetting the cameras, nothing works. We could just leave it on but I like the illusion of privacy. Hope Logitech fixes this in an update soon or I’ll have to look for other options.","updated":"2021-06-26T07:21:32-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7711164042","userName":"kjones9000","userUrl":"https://itunes.apple.com/us/reviews/id18194546","version":"3.5.2","score":1,"title":"Worst app on my entire phone!","text":"When I first got this camera I was very happy but somewhere along the way things hit a sharp decline. The first problem was when they stopped in-app purchases and I could no longer manage my subscription or payment through the app. In the past few months the app has essentially stopped working because all it does now is link me to the web site and I have to log in every time I need to check my camera. In this day and age the app makes the camera and the app right now is complete trash, therefore making this camera complete trash. I will be switching very soon .","updated":"2021-08-19T08:15:51-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7486352270","userName":"I LUV ","userUrl":"https://itunes.apple.com/us/reviews/id38629967","version":"3.5","score":1,"title":"Broken Preview Notification","text":"This latest update broke a very useful feature.  When I receive activity alert notifications the image preview is missing.  I’ve tried uninstalling/reinstalling, power cycling, checked every app and phone setting for notifications always on or while unlocked.  Nothing has been able to resolve the issue.  Everything was working perfectly fine before the latest updated.  I’ve also had the app log me out and I was unable to verify my login because I was stuck in a login loop with this new authentication system that came with the new Logi app update.","updated":"2021-06-20T08:08:57-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3244579702","userName":"Jlclarkrx","userUrl":"https://itunes.apple.com/us/reviews/id149080881","version":"3.3","score":2,"title":"Just ok - notifications are useless","text":"I wanted to receive notifications when there is high movement outside (not necessarily people) but there needs to be better options for choosing the motion sensitivity. The only options for sensitivity for alerts are “all” and “high activity”. I have it set on high activity but i receive 30+ notifications a day due to the wind moving the trees (shadows). Even free solutions such as the manything app has a 10 point motion sensitivity setting. Notifications are useless. Should have gotten an arlo. You also have to pay for motion zones (another free feature on manything). They also need an apple tv app.","updated":"2018-09-29T10:34:20-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3846697014","userName":"Cosmic Circuit","userUrl":"https://itunes.apple.com/us/reviews/id37531588","version":"3.4","score":2,"title":"Day brief shortened, poor airplay mirroring from iPad Pro","text":"The last update has shortened the Day Brief video to only include from 1 minute after midnight to the current time of day rather than a full 24 hour day brief.  For instance if you run a day brief at 9 am Monday it only shows you the highlights from midnight Sunday until 9 am Monday morning.  You still have the ability to go back and search manually through each individual video clip from last 24 hours individually but it is very time consuming to do so.\nI believe most want the full 24 hour day brief or give people an option to choose.\n\nThe play slider does not function the way you would expect.  No easy ability to drag the slider to quickly skip areas of the video.\n\nAirplay mirroring to Apple TV does not fill screen from iPad Pro (3rd generation) - actually works better and fills screen when mirroring from an iPhone 6.","updated":"2019-03-05T12:39:41-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1566716114","userName":"AnthonysLife","userUrl":"https://itunes.apple.com/us/reviews/id34298027","version":"2.3","score":4,"title":"Almost Perfect","text":"Here's what I use mine for, I have it in my kids room. I love that it records in the cloud for free the moments that matter. So I like having it on all the time so I can later download special or funny moments that happen. But I really want a quick way to engage (turn on) the previously used smart alert settings. So that way when my youngest takes a nap, I can be alerted when she moves and is waking up. A 3D press on the icon is the quickest way I can think to do this. Please set up that feature?! Thanks","updated":"2017-03-17T19:42:39-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7509530071","userName":"David Vasquez","userUrl":"https://itunes.apple.com/us/reviews/id32451833","version":"3.5","score":1,"title":"Paid a lot and am left out to dry!","text":"Been happy with the product for a couple years, but was suddenly logged out and it will not let me back in the app. This isn’t a password issue, the account logs in fine, but the app just gets kicked back to the login screen with no explanation as to why. Can’t even log on to use the camera anymore. After reading all the reviews of people having the same problems and getting no support, I’ll be moving on from Logitech and likely never to return. If a company can’t back their products, I can’t be bothered to remain a customer. Shame.","updated":"2021-06-26T15:04:29-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7542379550","userName":"DaveWood","userUrl":"https://itunes.apple.com/us/reviews/id12066277","version":"3.5","score":1,"title":"Was a great app, now useless due to the SSO login change","text":"I have 9 cameras, 4 Logi Circles and 5 from other brands. The Logi Circles were my favourite cameras, partly due to how great this app was to view videos from them vs the other cameras.\n\nNow with the latest changes to the login process, using SSO with Logitech’s Logi ID, the app is useless. It never stays logged in, and it’s a long process to log in, jumping through the browser etc (presumably using OAuth). Half the time the login process doesn’t even work and you have to repeat it over and over until you’ve done the right rain dance.\n\nIf you hear a noise outside and want to quickly check what it was via the cameras, you just can’t anymore. By the time you’ve done the login dance, the cause of the noise is already gone, or has already gotten in the house and is ready to murder you. Yes, this update may actually cost lives.\n\nPlease fix this Logitech. Or refund our money for the cameras. They weren’t cheap.","updated":"2021-07-05T09:16:16-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7801997763","userName":"Tuckshop2006","userUrl":"https://itunes.apple.com/us/reviews/id37511522","version":"3.5.2","score":1,"title":"Awful","text":"Used to be a well-functioning, easy to use system, which is why I added a few more cameras to my home. For some reason, the update that came through a few months ago royally screwed up the app login, and now appears to have messed up the location detecting settings too. If I had know that the app would have gone so far downhill, I would have built my home security around an entirely different company. It’s been problematic for months and still is not fixed…I feel sorry for the customer service representatives that will have to deal with irate calls","updated":"2021-09-13T06:44:49-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"5225293420","userName":"aputur","userUrl":"https://itunes.apple.com/us/reviews/id15536266","version":"3.4.5","score":5,"title":"Best and easiest camera i’ve ever owned","text":"I love these cameras. I have gone through many other type of home security cameras and they all have been horrible and confusing. I love the app, i love the cameras my dogs have used them as balls and they still work. I tell everyone i know  to get these camera. I am still using logicircle 1st one that came out and just bought my 4th one on ebay.","updated":"2019-12-02T07:50:30-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7861227083","userName":"Seve717!","userUrl":"https://itunes.apple.com/us/reviews/id203715976","version":"3.5.2","score":1,"title":"1000% USELESS APP!!!!!!!","text":"Not only does this app STILL sign you out every single time you close it (FOR MONTHS NOW), now you can’t even login once you’ve been signed out. It just goes to a blank Internet browser and won’t let you get any further. It is now completely useless and I have no way to use my security camera! So some security camera this is. What is the point in having this useless piece of junk camera if I can’t even use it. Oh wait, the camera isn’t useless the app to access the camera (the only way to access the camera) is useless. Nobody will do anything about it!!!!!","updated":"2021-09-30T04:12:16-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3684018982","userName":"Mark's yangyang","userUrl":"https://itunes.apple.com/us/reviews/id148646406","version":"3.3.1","score":5,"title":"Like it","text":"I have several different camera, bought this one with Apple HomeKit version, Absolutely like it! I don’t really have any offline problem, one is on my window, one is outside at the garage door which that one always offline when I use Canary. Not sure why there is so many bad reviews, so want give them a five, for security , I love all the Apple HomeKit stuff instead of simple IP camera. So keep up work :)","updated":"2019-01-22T21:45:06-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1503302804","userName":"weave","userUrl":"https://itunes.apple.com/us/reviews/id27113292","version":"2.0.1","score":3,"title":"The dangers of cloud-dependent devices","text":"Nice and easy to set up and use but it's totally dependent on Logitech servers.  There's been times when the system is down and I can't view my cams.  And right now I am 2500 miles from home and I got an alert that there's motion in my home and I can't view the cam.  Why?  Because the app insists there's a new version I must download first but the App Store says I have the latest.   So obviously the new version hasn't been approved by Apple yet but in meantime I can't view and use the cameras I paid good money for.   Very aggravating.","updated":"2016-12-16T20:52:29-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7489123980","userName":"ChefPoohBear","userUrl":"https://itunes.apple.com/us/reviews/id174864050","version":"3.5","score":1,"title":"Is support really going to continue?","text":"The cameras have been discontinued and Logi promised continued support. Yet the last app update removed all functionality of the app. There hasn’t been an app update in a year then suddenly one after they announce discontinuation of the product?  Is this their way to push users away?? The smart location constantly turns off even with the lock turned on. Preview doesn’t work and I’m constantly logged out. This renders the camera useless. Can’t help but wonder if this is intentional. I have submitted support tickets and no response. Logi fix the issues.","updated":"2021-06-21T03:57:01-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"4198586629","userName":"Phineas Tolstoy","userUrl":"https://itunes.apple.com/us/reviews/id181028863","version":"3.4.2","score":4,"title":"Drains battery?","text":"The app seems decent and the cameras pretty good, though I have nothing to compare them to. But my iPhone battery drains much more quickly now. \n\nFor instance I just checked my battery usage. The top two drainers were the Logi Circle app at 46%, and the Phone at 16%, both with 58 minutes of usage. That’s nearly 3 times the battery drain for same amount of time used. \n\nCan you please do what you can to try to get the app to not drain the battery so badly?","updated":"2019-05-23T18:00:31-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7815537722","userName":"AR&boys","userUrl":"https://itunes.apple.com/us/reviews/id184634509","version":"3.5.2","score":1,"title":"No good","text":"Wish there was a way that I could view my security camera on the main website rather than this app I had nothing but issues I don’t know what they did but the new change is not good at all I’ve been locked out of my account so I cannot even access anything anymore I’ve tried to contact them via email takes him so long to reply there’s got to be easier way to retrieve your account or at least a phone number to call so they could walk you through it I’m going to have to switch to a different camera company not happy","updated":"2021-09-17T06:31:36-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"4415652300","userName":"psbuckley","userUrl":"https://itunes.apple.com/us/reviews/id13725788","version":"3.4.3","score":2,"title":"Unfortunate","text":"Unfortunately there isn’t a 1-1/2 star rating. \nI have three cameras and all have very good WiFi signal, so why do they go offline all the time? I don’t get it!\nAlso, and possibly as importantly, I wasn’t quite as diligent with my due diligence before I purchased mine. Apple Home says that the Circle 2 is compatible with homekit so I just bypassed all those other better cameras because I HAD TO HAVE homekit compatibility!\nBut when you read a little farther on the Logitech site, you discover that the circle 2 WIRELESS is not compatible. Again... the same exact camera that IS compatible, when hooked to a battery, becomes incompatible. \nLogitech blames Apple, but I’d guess that Apples testing revealed shortfalls in the battery powered setup and doesn’t want the Apple name associated with it. At least that’s what I’m going on. \nSeems to work ok with Alexa tho so there’s that!\nFor now, I’d advise to keep looking!","updated":"2019-07-05T11:25:23-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7554139321","userName":"chwebb1","userUrl":"https://itunes.apple.com/us/reviews/id37277452","version":"3.5","score":1,"title":"Latest app with SSO is broken","text":"Recently, Logitech updated this app so that it uses single sign on. While doing this, they made the login happen in a web browser (which is bad enough, it’s a mobile app, not a web app), but even when you try to login, most of the time, it just takes you back to the Circle app and asks you to log in again. A lot of the time I can’t get the app to login. Bring back the old way of logging in, or at least, fix the new way of logging in. I’m seriously considering switching to another solution if this isn’t fixed soon.","updated":"2021-07-08T11:21:40-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"5174809556","userName":"Dignan17","userUrl":"https://itunes.apple.com/us/reviews/id12371583","version":"3.4.5","score":2,"title":"Used to be passable but now it's annoying","text":"I've never loved the app or these cameras but now it's obnoxious.\n\nIt takes forever for cameras to load. Recordings are never any longer than 3 minutes long so have fun downloading 5 recordings of you want something that went for 8-15 minutes (lately all my recordings seem to be 1-2 minutes). And for some reason, now if I want to scrub through a recording,I can't do it in more than ~15 second increments. It's really annoying.\n\nThat's just this app. These cameras have their own problems. They have poor reception so the app is always saying the performance will be poor (I have very good wifi so it's not me). The web app has gotten SOO much worse and keeps buffering non-stop.\n\nI'm definitely thinking about switching to another camera system.","updated":"2019-11-20T18:06:52-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7879645926","userName":"get rid off","userUrl":"https://itunes.apple.com/us/reviews/id116649651","version":"3.5.2","score":1,"title":"Worst app ever!","text":"I usually don’t review anything but I had to do this cause this is one if not the worst app ever! Keeps on freezing. Cannot access the cameras on a regular basis . Had to delete the app and reinstall over 200 times ( not exaggerating) so far over the past 2-3 months and even then I would still not be able to log on to my cameras ! Very frustrating and the least to say constant annoyance . Although I own 5 cameras, if the company doesn’t improve the app very soon I will be throwing them in the garbage and buying another brand. Don’t waste your money !","updated":"2021-10-04T22:57:05-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"5812234623","userName":"DaVBMan","userUrl":"https://itunes.apple.com/us/reviews/id31609957","version":"3.4.5","score":1,"title":"Stuck in Loop setting up","text":"When trying to setup new camera which just got today as it goes through each step it reverts back saying getting ready, then “got it” saying found camera. Then try to name it and it goes back again. If move fast finally get to adding to WiFi and while waiting for it to list nearby networks it loops back. Again have to race to select network and type password. Middle of typing password loops back and finds camera again and have to start over. Reset camera multiple times and restarted app etc.","updated":"2020-04-14T15:53:14-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1797740168","userName":"HSI_MERC","userUrl":"https://itunes.apple.com/us/reviews/id18637352","version":"3.1.1","score":1,"title":"Not off to a good start.","text":"Circle 2 battery, just avoid it. \n\nPros- \nImage quality during the day is really good. \nCamera setup is really easy. \nWide field of view. \n\nCons-\nThe night time recorded motion is horrible. Extremely dark. Good luck making out a person from 5ft away. The live view at night however is amazing. The app is garbage very buggy. Sometimes during the day my recorded images are completely washed out like the sun is shining directly Into the camera even though it's cloudy or before or after sunset. Other times my recorded images are pink during the day. You never know. All tech support has ever done over about 15 emails for the image issues was to restart the camera or delete it and re add it. Completely useless. \n\nIt takes a minimum of 35 seconds if not more to connect live. My nest cam and ring cam will get to a live image in less then 10 seconds. \n\nWifi antenna seems kinda week, compared to my outdoor nest cam.","updated":"2017-09-19T00:10:56-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1984330346","userName":"K.Dar","userUrl":"https://itunes.apple.com/us/reviews/id22726355","version":"3.1.2","score":3,"title":"Serves purpose, but annoying bug","text":"A while back a bug was introduced where the live view would be frozen when opening the app. You need to select a previous clip and then switch back to live view to see live video.  It's more annoying every time I encounter it, as this is used as a baby monitor. Pace of development seems to be on the slow side. Makes me wonder if I made the right choice by going with Logitech over the many other options on the market.","updated":"2017-12-09T18:59:11-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1373098193","userName":"Marka1620","userUrl":"https://itunes.apple.com/us/reviews/id42485836","version":"1.6","score":1,"title":"Moving in right direction","text":"UPDATE 5/3/16\nChanged my rating to 1 star. Update screwed up one of my cameras night vision. Night vision clicks on and off ever few seconds. Killed the power via plug and switch....even deleted cameras from app, did a hard reset and re-added. Still screwed up.\n\nSo far this update is working well and I have no complaints with it. Logitech seem to be moving in the right direction but still has a ways to go.\n\nThe app itself works great and I really have no complaints. The camera software has a little ways to go to be a real contender in the Security camera market.\n\nThere needs to be more cloud recording options that are reasonable in addition to adding zone support. Logitech's old camera system, the alert did zone support in this no reason why this camera shouldn't.\n\nAnother big thing that the Logitech circle is missing, is snapshot text and or email alerts. This is a no-brainer in a security camera.","updated":"2016-05-03T17:19:52-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2151956881","userName":"arsilva99","userUrl":"https://itunes.apple.com/us/reviews/id20890401","version":"3.1.4","score":5,"title":"Great Fun Camera","text":"The Logi Circle Camera has been a great purchase.  I’m really happy with it.  The video is clear and loads quickly.  The daily brief is a fantastic idea.  Being able to scroll through the days events is a big plus.  Notifications are super accurate and no false notifications. I would highly recommend these cameras.  Easy set up and a great value.","updated":"2018-01-31T19:52:29-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7498380588","userName":"mday2792","userUrl":"https://itunes.apple.com/us/reviews/id105817710","version":"3.5","score":2,"title":"Latest update broke app","text":"The new login logic broke what was once a very stable app.  Now, after logged in for some time, the app will crash and force you to re-authenticate using the web portal.  Sometimes even after authenticating and clicking ‘return to app’, it just stays at the log in screen and never actually logs in.  You have to wait some time and hope that it will work the next time you authenticate.  Please fix this soon.","updated":"2021-06-23T14:12:51-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7631773735","userName":"Nicole Henwood","userUrl":"https://itunes.apple.com/us/reviews/id20567417","version":"3.5.1","score":1,"title":"Can’t log in","text":"**the most recent update did not fix the problem, these cameras are worthless as you can’t see any of them because the app doesn’t work!\n\nI can no longer log in to see any of my cameras, they are totally useless and this is additionally frustrating as right now I have contractors in my house when I’m not home and was hoping to be able to see the work in progress. This needs to be fixed ASAP, I’m in some kind of login loop between the app and safari and it just cycles back and forth.","updated":"2021-07-29T08:17:23-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7487057795","userName":"Pitufo41","userUrl":"https://itunes.apple.com/us/reviews/id43877966","version":"3.5","score":1,"title":"Latest update completely failed","text":"I Used to just enjoy checking my circle security camera from my personal phone , now with this new update every time I want to check my camera it always ask me to log in and takes me to the internet website to log in, this is just a completely failed update. Just Annoying the need of log in every-time I open the app, why not set Face ID or other type of secure log in ? . Another failed, the Smart locations never works among other features.","updated":"2021-06-20T12:17:26-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3887036760","userName":"Sahermichmich","userUrl":"https://itunes.apple.com/us/reviews/id150758444","version":"3.4","score":1,"title":"Bad update","text":"I normally do not update my apps because I feel if it’s working fine why mess it up? Well I updated the logi circle app and what do you know!! Now one of my cameras time is wrong it’s now 9:32am it says it’s 3:40am.\nWhy why why?? How can I fix this now. Settings don’t have a way to sync time with my phone!!! Aggravated!\nPart 2... now that same camera is not recording!! I pay for monthly daily recording we have a business in a very dangerous area and now we have no evidence of anything that happens. Come on please fix this crap or let me go back to the previous version!!","updated":"2019-03-16T00:17:07-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"4691957622","userName":"poiu890","userUrl":"https://itunes.apple.com/us/reviews/id115846007","version":"3.4.3","score":1,"title":"Lesson learned","text":"Cameras worked great during trial period. Once I subscribed 1 camera is offline 90% of the time. I reset the camera, it worked for a bit the “day brief” shows it was recording. The camera is nice, when online it works great. Lesson learned, I should’ve stuck with Wyze or upgraded to one of the big names, cloud coverage and software is the most important thing with these cameras.\n\nAfter rebooting several times the second camera worked.  I wanted to amend and say I got it wrong and the cameras work great, but now the camera that has always worked has gone offline.","updated":"2019-08-29T13:55:26-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2822809346","userName":"Mani Camaro","userUrl":"https://itunes.apple.com/us/reviews/id240512794","version":"3.2.3","score":5,"title":"I have a Model X","text":"Model X user the app needs to be left on.  Meaning keep it open on the background, this drains the battery (Slightly) more but will offer quick access to your camera which has amazing visual quality. Note to self I usually have at least 10 apps open on the background and I have great battery life.","updated":"2018-07-02T15:41:25-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7557701989","userName":"SweaterboyJr","userUrl":"https://itunes.apple.com/us/reviews/id275899997","version":"3.5","score":1,"title":"Latest update bricked the Logi App","text":"Rollback the app, Logitech!  You’ve made a horrible mistake.\n\nI’ve used this app for the past two years and it has performed flawlessly.  Only recently has the app been updated. It has logged me out of all of my cameras. \n\nWhen I try to login the app sends me to the website. When I try to login through the website it prompts me to open on my app. It creates this endless idiot loop, by which no one can login in and review video.  Logitech has bricked their own app and the Circle 2 hardware.  What a complete fail!","updated":"2021-07-09T10:14:22-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7602532152","userName":"H $","userUrl":"https://itunes.apple.com/us/reviews/id36458476","version":"3.5","score":1,"title":"STOP LOGGING ME OUT!!!","text":"App works fine until it logs you out without notice. What's the point of having it if it can log you out at any given time??\n\nUPDATE July 21, 2021. DO NOT UPDATE. This ridiculous app constantly logs you out. This happened a few years ago and it's happening again. What is the point of a security camera app if it logs you out at random??? LOL! What a joke of a product. And since I updated it constantly pings me on being unable to update my location. Great job, Logitech. Skip these and go with a proper security system.","updated":"2021-07-21T11:44:47-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"4374940743","userName":"Gtrspeed","userUrl":"https://itunes.apple.com/us/reviews/id157906570","version":"3.4.2","score":4,"title":"Portrait Mode, Please!","text":"I’m about 90% satisfied with the UI.  Setting up alerts and zones is pretty intuitive, and I love the day brief option.  Just one thing that frustrates me daily... whyyyyyyy am I being forced to use this app in landscape orientation?  Yes, with a camera set to ultrawide or 180 FOV, it makes sense to view the individual camera in landscape, but when I’m viewing two cameras simultaneously, why not stack them vertically (a la HomeKit)?","updated":"2019-06-26T20:09:43-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2077422760","userName":"JW0000001","userUrl":"https://itunes.apple.com/us/reviews/id86810719","version":"3.1.4","score":5,"title":"So far so good.","text":"Everything seems to be working as expected. This is my first HomeKit enabled device so I am not yet completely familiar with how it works. Other than viewing the camera in Apple’ HomeKit app, I am not sure what this integration really does for me. Either way, everything is good for now.  Very easy setup of camera using this app.","updated":"2018-01-10T21:14:03-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3690142464","userName":"Bo Ali","userUrl":"https://itunes.apple.com/us/reviews/id41939751","version":"3.3.1","score":1,"title":"Poor setup experience","text":"The app and the camera are poorly designed, did not expect to receive this poor quality camera and app that appears to have been developed by amateurs. The look and feel of the camera is cheap. The camera fails to connect to the cloud rendering the camera useless. I’m able to use it with HomeKit fortunately but can not customize the camera due to the stupid setup process that doesn’t work. I’ve tried contacting customer support but with no avail. Worst camera, regret to have bought in the first place.","updated":"2019-01-24T12:33:14-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1699772434","userName":"itsemily","userUrl":"https://itunes.apple.com/us/reviews/id195645237","version":"3.0.3","score":3,"title":"Easy to use but logs you out","text":"I found my original LogiTech circle easy to set up and a good match for what I was trying to accomplish. But the app frequently logs me out, such that I am no longer getting alerts of activity when I'm away from the house. It does this silently so you have no idea that it has stopped working. Plenty of other apps manage to keep me logged in all the time, so I don't see why this should be a problem.","updated":"2017-07-26T19:03:51-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1764171007","userName":"Stewsan","userUrl":"https://itunes.apple.com/us/reviews/id34160974","version":"3.0.5","score":3,"title":"Difficult to connect when on battery","text":"I have two cameras and the one is plugged in and does a perfect job. The other one is on battery and almost impossible to connect. I always get the \"offline\", check battery, internet, etc. but none of that is a problem. It needs an update to solve the connection issue. Otherwise, very nice camera.","updated":"2017-08-31T08:57:23-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7756446118","userName":"Camaroannie","userUrl":"https://itunes.apple.com/us/reviews/id867792415","version":"3.5.2","score":1,"title":"Get it together QA team!","text":"This logging people out is a huge issue! I get generic emails and not once has there been a solution! This is on your end Logi not mine. Whatever you did to your last update way back in June messed everything up. Your qa team needs to do better!\n I know how much the QA team makes and they’re NOT doing their job! Wish I could get paid like that for doing minimal work. Get it together QA team! We are approaching month 3 and not one fix has been made.","updated":"2021-08-31T13:41:19-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7509392020","userName":"StawberryOG","userUrl":"https://itunes.apple.com/us/reviews/id43818501","version":"3.5","score":1,"title":"Version 3.5 update makes app unusable","text":"I can’t even properly login to my cameras through the app anymore since the update. It redirects you to a website sign in and when you sign in it goes back to app and then asks you to sign in again and then just sends you back to website. This app has become complete garbage. It is now extremely unreliable, and I no longer get proper alert notifications. Please revert version 3.5 update or fix the issues.","updated":"2021-06-26T14:02:41-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2029653861","userName":"Leeny beenie","userUrl":"https://itunes.apple.com/us/reviews/id118377750","version":"3.1.3","score":5,"title":"I feel safe again!","text":"I’m so obssesed with this new addition to my home. I’m able to keep up with what’s going on when I’m not home. night mode is super good, and the audio feedback it picks up helpful when trying to talk to someone at the door. the alerts are always on point.","updated":"2017-12-26T10:12:06-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7650387997","userName":"MLDebbie","userUrl":"https://itunes.apple.com/us/reviews/id105164523","version":"3.5.1","score":1,"title":"App is terrible","text":"I never had trouble with logging into the camera before. I have to go to the app click login then it takes me to where I am supposed to launch the camera and it takes me back to login. Due to the change that was made I wish I could afford another camera. It doesn’t work half the time anymore and tell me\nIt is off line, my internet is fine and the power is on. I don’t recommend this brand any longer.","updated":"2021-08-03T06:42:22-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1588036401","userName":"akrabu139","userUrl":"https://itunes.apple.com/us/reviews/id327349339","version":"2.3","score":1,"title":"Awesome… til the app logs me out","text":"I've been using the Circle for several months now.  It worked perfectly for a long time, but now the app logs me out and stops sending notifications after an undetermined amount of time.  I generally only open the app when there's something going on - and I've noticed on five occasions now I go to open the app just for the sake of it - and I have to log in.  There's even been activity, as I see what I've missed - but no notification as it happened because the app logged out. ಠ_ಠ","updated":"2017-04-13T14:33:05-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7557289545","userName":"Remanman","userUrl":"https://itunes.apple.com/us/reviews/id29681606","version":"3.5","score":1,"title":"Latest change makes it almost unusable","text":"The app has always been a bit slow. Then, it started showing the wrong date, which I can’t figure out how to correct. Neither can I get a reply from LogiTech to my requests for help.\n\nAfter the latest app update, I have to log in each time I want to use the app. To make matters worse, today I can’t even use the app after providing my credentials. The log in screen says it will open the app, but it keeps taking me to the screen where I’m asked if I want to login again.\n\nSecurity is great, but come on. Fix the bugs, especially the old ones, and include the option to use TouchID for login. Even apps from low tech companies have this ability.\n\nHey LogiTech, how do I get a refund for the cameras?","updated":"2021-07-09T08:00:18-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7642605604","userName":"To you idiots","userUrl":"https://itunes.apple.com/us/reviews/id123883553","version":"3.5.1","score":1,"title":"Use to be great, now it doesn’t work","text":"I’ve used this app and cameras for years. After your recent updates, the app no longer works. Keeps showing cameras as offline and when I finally get back online, it goes back offline later. Why did you guys have to go and ruin this app with your broken updates? When will you fix this?  Now I have to figure out a new camera system to use indoors quickly. 😡","updated":"2021-08-01T05:24:21-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1334570742","userName":"MDC4LIFE","userUrl":"https://itunes.apple.com/us/reviews/id25382080","version":"1.5.1","score":5,"title":"Best Home System for Families","text":"I love being able to communicate with my kids at the right moment! It's priceless!\n\nI hope they provide the ability to have multiple users/profiles for an account. I didn't like having to setup everyone with my account.","updated":"2016-02-17T14:55:26-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7802642265","userName":"Mac156","userUrl":"https://itunes.apple.com/us/reviews/id41073387","version":"3.5.2","score":1,"title":"Unfortunate new login process","text":"Recently the app was updated with a new login flow. Simply put, it’s horrible. 1) You have to go to Safari. 2) The time out duration is way to short. 3) After login in Safari, the app does not reliably login.\nBefore, you didn’t have to re login on a regular basis. Now it’s basically a daily thing, if not multiple times a day. Truly frustrating and a poor change, to otherwise excellent camera hardware.","updated":"2021-09-13T10:40:24-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1404221071","userName":"DevinAnn5","userUrl":"https://itunes.apple.com/us/reviews/id181123828","version":"1.6.1","score":5,"title":"Great Product","text":"The camera gives you a wide viewing range and crystal clear picture. It is easy to switch between cameras. However, I wish you could 'live view' all the cameras simultaneously when you have a multi camera set up.","updated":"2016-07-02T09:37:54-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7684380950","userName":"dealloc","userUrl":"https://itunes.apple.com/us/reviews/id34091388","version":"3.5.2","score":1,"title":"Terrible App Security","text":"Apple would be well within their rights to pull this broken app from their Store; Logitech’s attempt at single sign on is badly broken. Note not only tye negative reviews for the latest version of the app, but the lack of developer response to the comments.\n\nThe Logitech Circle is a nice little camera with an unfortunate lack of software support. I wouldn’t recommend one of these cameras until the app is fixed and the reviews trend positive.","updated":"2021-08-12T05:55:03-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"5222657906","userName":"MrDravenX","userUrl":"https://itunes.apple.com/us/reviews/id108904798","version":"3.4.5","score":1,"title":"DO NOT Buy","text":"I repeat, do not buy Logitech cameras. The quality is very poor and I have the best residential broadband speeds and I always get the message, “Your video experience may not be optimal due to a poor connection between the camera and our servers.”  My cameras are close to the router and I’ve change WiFi channels many times after checking to see what’s around my area.  Logitech can’t or won’t upgrade on their end to provide legit service.","updated":"2019-12-01T14:42:38-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7520400727","userName":"SM Fishbones","userUrl":"https://itunes.apple.com/us/reviews/id6364006","version":"3.5","score":1,"title":"Update ruined everything","text":"Came here to see what was going on and realized am not the only one having problems, not sure what they’re thinking driving this product into the ground. It’s a shame cause I’ve really enjoyed their camera and the app for a long time. If they don’t fix this soon am gonna just dump them for good and get some Nest cameras (their prices have come down dramatically since I’ve been a Logicircle customer)","updated":"2021-06-29T13:04:31-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3625192064","userName":"Oscar aka big o","userUrl":"https://itunes.apple.com/us/reviews/id195884112","version":"3.3.1","score":1,"title":"Terrible app","text":"My cameras won't connect sometimes or will go offline. I have 500mbps down and 40mbps up and still struggling. The app takes forever. This has been a Logitech product no one cares about. No new updates. I use to have a Nest iQ and man it's way better but I wanted to be all HomeKit and stuff. Don't buy this camera and if you did return it immediately. If Logitech doesn't put some money in by March to fix this app I'm selling both Logi smart cameras so I can go back to Nest!","updated":"2019-01-07T21:52:02-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"5138873417","userName":"Boojiboy1000","userUrl":"https://itunes.apple.com/us/reviews/id31960509","version":"3.4.5","score":5,"title":"iCloud Secure Video recording!!!!!","text":"I have had 3 Circle 2s for awhile, they are now so much better with iCloud Secure Video. All in my HomeKit app and easy video recording. Everything works as suspected. Kudos to Logitech for not being greedy and not preventing this feature!!","updated":"2019-11-14T15:08:13-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1503233676","userName":"SteveCache","userUrl":"https://itunes.apple.com/us/reviews/id250432478","version":"2.1","score":2,"title":"Alerts are a mess with this update","text":"I've had this camera for a year and recommend it to everyone I know. But this week's update is now causing me to get alerts almost every minute and now I have to pay for so-called \"smart alerts\" in order to get back the alert functionality it previously had. Please fix this back to the way it was!!! 5 stars if it wasn't for this problem.","updated":"2016-12-16T18:33:00-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3324120893","userName":"I.C. Pink","userUrl":"https://itunes.apple.com/us/reviews/id32043681","version":"3.3.1","score":1,"title":"Memory Hog","text":"Ever since the recent update, I have been getting memory warnings on my iPhone. This has never happened before. Now the Logi Circle app doesn’t work even after clearing space on the phone’s memory.  Aren’t the updates supposed to make the product BETTER? It’s 1000x worse!!!  I’m going to dump my circle cameras for something more reliable and memory efficient. Logi Circle means you go in circles trying to find answers with their totally LAME tech support. Circle, alright yeah, it’s crap.","updated":"2018-10-20T11:13:42-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7700310797","userName":"Lexiew1017","userUrl":"https://itunes.apple.com/us/reviews/id86189858","version":"3.5.2","score":1,"title":"What happened","text":"Had a Logi circle camera for years now and used this app to view it but recently the app is terrible. Always logs me out and then won’t even log me in from safari so I go around in circles trying to open app and login to being sent to browser to log in and then back to app for the app to just not work. This is a huge issue I need to be able to check my cameras!!!","updated":"2021-08-16T11:26:43-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"6652824431","userName":"brettuxd","userUrl":"https://itunes.apple.com/us/reviews/id410331184","version":"3.4.5","score":1,"title":"Won’t set up Circle 2","text":"Using the app to set up my Circle 2. Bluetooth is confirmed working on my iPhone however the app won’t recognize the Circle 2 camera when it is plugged in and flashing blue. The app offers absolutely no help in diagnosing the problem. Checked the website and can’t find information there either. Camera is now worthless. Will be looking at accessories from other manufacturers from now on.","updated":"2020-11-16T11:29:34-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"5892990424","userName":"SRucin","userUrl":"https://itunes.apple.com/us/reviews/id294985199","version":"3.4.5","score":5,"title":"Easy to set up and use","text":"I set it up without a hitch. Stopped using it for a few months then turned it on and it was still working - no problem!","updated":"2020-05-02T05:37:01-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7512765407","userName":"Wolverine.1983","userUrl":"https://itunes.apple.com/us/reviews/id10395116","version":"3.5","score":2,"title":"They broke the app","text":"All of the recent reviews are correct.  The app frequently logs me out without reason and when I log back in, it bounces back and forth between the app and my browser.  Also, the preview in the notifications no longer works.  It used to be so much better.  Very frustrating.","updated":"2021-06-27T11:33:20-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1653131607","userName":"NolanP","userUrl":"https://itunes.apple.com/us/reviews/id87003004","version":"2.3","score":3,"title":"Need charging/power on/off notifications!","text":"If the power goes out, there is no notification except when the battery is under 20...\n\nNotifications are needed for ext. power on/off and also Notifications on charge level in 5% and 10% increments.  App is fine, but nowhere near perfect...it's a few steps closer with these notifications. Thanks...NP","updated":"2017-06-22T00:32:31-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7600357875","userName":"OCrachel","userUrl":"https://itunes.apple.com/us/reviews/id1222415028","version":"3.5","score":1,"title":"CAN’T USE WITH A VPN NOW…?","text":"I’m experiencing the same problem every other person on here is complaining about. I deleted the app, then reinstalled to no avail. I then turned off my VPN, and voila, it allowed me to log in. Idk about everyone else, but I don’t feel I should have to give up my iPhone security to accommodate my home security.. that doesn’t make sense.. please fix this ASAP! This is an expensive camera to NOT be able to use.","updated":"2021-07-20T22:15:33-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7656361294","userName":"Lycona","userUrl":"https://itunes.apple.com/us/reviews/id160357658","version":"3.5.1","score":1,"title":"App is not allowing me to sign in.","text":"I think this must be a recent update, because the app has worked fine in the past. I get on the app. I have two options: set up new camera or log in. I click log in, and it forces me to go to a web page. Then it forces me to go back to the app. Reenact insanity. It does not allow me to sign in! I’ve had these cameras with this app since 2016. I guess it’s time to get new cameras.","updated":"2021-08-04T20:32:25-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3227659943","userName":"daniel206425","userUrl":"https://itunes.apple.com/us/reviews/id49260006","version":"3.3","score":3,"title":"Breaking changes?","text":"A recent update seems to have affected my ability to access my camera, which constantly seems to go offline. Coincidentally that’s when my Circle’s subscription trial ended, so hopefully no subscription doesnt mean flaky connectivity... it’s a security camera!\n\nAlso it’s annoying that the app is horizontal only.","updated":"2018-09-25T00:50:55-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7738112231","userName":"Marty Beck","userUrl":"https://itunes.apple.com/us/reviews/id141096215","version":"3.5.2","score":1,"title":"Slow interface to app","text":"Slow interface with camera, not smooth at all. I’m amazed at this because when I open the camera in HomeKit it’s very good. You would think the native app from the company itself would be better, but it’s not????  Now they won’t update the app and it constantly asked for sign-in. I’m not caving and buying YOUR new stuff like you want, I’m buying another brand.","updated":"2021-08-26T13:52:36-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3593364393","userName":"ul","userUrl":"https://itunes.apple.com/us/reviews/id38256999","version":"3.3.1","score":4,"title":"Where’s the Apple TV app?","text":"Please add an Apple TV app so we can easily monitor our baby upstairs without resorting to AirPlay.  \n\nPlease make launching it a bit faster.\n\nOther than these two points, the app does a decent job and allows my wife and I to quickly view almost any part of our home.","updated":"2018-12-30T15:54:09-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7490875881","userName":"dhenendjaiejrbrkskrb","userUrl":"https://itunes.apple.com/us/reviews/id34605051","version":"3.5","score":1,"title":"Re-log-in every time, sometimes fail","text":"Same problem as others:  app now requires extensive repeat log in process every time and sometimes fails, so locked out of using app. This is a total failure and should be immediately rolled back to prior state. We’ve invested in your hardware and cannot easily switch to a competitor, so please take responsibility and roll this bad update back now!!!!","updated":"2021-06-21T13:54:09-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1750777977","userName":"Bond18t","userUrl":"https://itunes.apple.com/us/reviews/id85329078","version":"3.0.5","score":4,"title":"Does the job well","text":"Loads a live view pretty quick and has several configuration options. 1 bug I've notice is the bottom of the video is sometimes smeared when you load the app. Hopefully will be fixed soon.","updated":"2017-08-26T04:07:32-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7596577604","userName":"treat your self","userUrl":"https://itunes.apple.com/us/reviews/id209558527","version":"3.5","score":1,"title":"Was the best camera until this latest update","text":"I use it as a baby monitor at night and it keep logging out in the middle of the night and the login process is an endless circle that sometimes lead nowhere. I sometimes have to por my login info 3X before I can see anything. It keeps going from app to website again and again. This is ridiculous!","updated":"2021-07-19T21:40:31-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7570100848","userName":"Cdearbeck","userUrl":"https://itunes.apple.com/us/reviews/id145222022","version":"3.5","score":1,"title":"Someone will have plenty of time to steal items","text":"After the new Single Sign On that the app now requires, you’ll constantly have to login when you get an alert. Signing in will take you anywhere from 20 seconds to an eternity when the handshake between the app and your browser fail, if you’re buying a circle for safety and security, don’t bother. \n\nTo Logi,\nFIX IT… pretty simple.","updated":"2021-07-12T19:38:21-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7640742518","userName":"Steve jaye","userUrl":"https://itunes.apple.com/us/reviews/id350447124","version":"3.5.1","score":1,"title":"Horrible after updating","text":"The app wasn’t the greatest! It lagged and lacked features that lower cost cameras offer. After the last update, it keeps logging me out and it takes for ever to login again and it’s stuck in a loop of wanting to login and open your web browser. Horrible and don’t waste your time with them especially for the cost of their cameras.","updated":"2021-07-31T17:19:02-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"5301730952","userName":"Les S","userUrl":"https://itunes.apple.com/us/reviews/id37192013","version":"3.4.5","score":1,"title":"Why hire tech support to read from scripts","text":"I have been trying to update the camera to beta firmware and the only response I get from tech support is one where they either read from a script or assume the issue is resolved without being resolved. So what’s the point of tech support? Is is just an empty gesture to make it seem like you care? Doesn’t seem like a good brand building exercise.","updated":"2019-12-21T13:54:45-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1391745307","userName":"Gb6TH2e2","userUrl":"https://itunes.apple.com/us/reviews/id118378866","version":"1.6.1","score":5,"title":"The lag doesn't stop it from being awesome","text":"Despite a few seconds of lag from camera to iDevice, it's still an awesome product and awesome app. I feel like I won't have to worry as much about crime in my area.","updated":"2016-06-09T15:57:50-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7746725756","userName":"Juega satin","userUrl":"https://itunes.apple.com/us/reviews/id482931699","version":"3.5.2","score":1,"title":"The worst security app","text":"Completely awful by the time you managed to login to your cameras your entire estate would be ruined and the worst part is the the cameras don’t record or work properly if your reading this thinking this app and cameras are a good idea don’t there are other companies that actually work and doesn’t make you sign in every five minutes.","updated":"2021-08-28T22:18:59-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2315988505","userName":"Bakbob","userUrl":"https://itunes.apple.com/us/reviews/id125277901","version":"3.2.1","score":2,"title":"View on app needs to change","text":"The landscape view is the default view on the app, however when you log in on the internet on you smart phone the view is portrait. With multiple camera, it is much easier to view the individual cameras and choose which one you want to look at on full screen.","updated":"2018-03-17T06:57:53-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"5150874234","userName":"headhunt69","userUrl":"https://itunes.apple.com/us/reviews/id586652843","version":"3.4.5","score":4,"title":"Recording and Review","text":"I like this App and the WIRED cameras. The battery powered cameras are power hungry and take way too long to wake up. \nWould like the ability to review who logged on and are viewing and when and if any recordings were deleted.","updated":"2019-11-16T07:39:06-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1443374175","userName":"Stublife08","userUrl":"https://itunes.apple.com/us/reviews/id247846196","version":"2.0","score":5,"title":"App is seamless, new storage option kills it","text":"Now I can watch my dog all the time. I starting to play with the new custom day brief feature and it's so fun. Two way talk and night vision is great and eat is extremely easy to use.","updated":"2016-09-02T08:05:23-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7602863652","userName":"JoshuaJP96","userUrl":"https://itunes.apple.com/us/reviews/id37282339","version":"3.5","score":1,"title":"Loss of thumbnail notifications","text":"The most recent update stops sending a still image preview with notifications.  This is a loss of a useful feature as now you must start the app (re-login frequently) and watch the video clip in order to know what the alert is. The still was a timesaver as you could quickly see at a glance what the activity is.","updated":"2021-07-21T14:07:42-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7661922682","userName":"twitte","userUrl":"https://itunes.apple.com/us/reviews/id17354839","version":"3.5.1","score":1,"title":"Was good, now terrible","text":"Used to work fine for me. In the later app versions the login process changed and is horrendous. The app launches a webpage to try and login. The process works less than 50% of the time. It is becoming useless. Think it’s time to be switching over to a new indoor system. Cameras are not worth the price when you’re unable to log in to the app.","updated":"2021-08-06T07:27:32-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2016580213","userName":"Accordsport6589","userUrl":"https://itunes.apple.com/us/reviews/id112814961","version":"3.1.3","score":2,"title":"HomeKit Support on This Camera Needs Work","text":"Logitech has been very disappointing across the board recently. Rushed products and services. Horrible support. This camera is no exception. The camera randomly disconnects and needs to be restarted. HomeKit streaming barely works if at all. I’ll likely get the Omna camera instead since it actually functions as it should with HomeKit.","updated":"2017-12-21T22:12:37-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2277682999","userName":"Chris R B","userUrl":"https://itunes.apple.com/us/reviews/id37658175","version":"3.2.1","score":5,"title":"Works great","text":"I like it. The service is responsive and the app is fine. Works as I’d expect. I’ve only had it running for 48 hours but haven’t had a single issue and I check it regularly.","updated":"2018-03-06T09:40:39-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1996272301","userName":"chuck.d","userUrl":"https://itunes.apple.com/us/reviews/id19903466","version":"3.1.2","score":3,"title":"Camera is good, subscription difficult","text":"Had a problem where to buy the subscription it was showing wrong country currency. Tried resetting but didn’t fix it. Then after buying one of the subscriptions it didn’t work for one of my two cameras. \n\nAlso you can’t the subscription through the app but it advertises for you to buy it. \n\nThe subscription process is too hard to find and too much friction. I really wanted it for the subscription features. \n\nBut the camera quality is great and if that’s all you care for, it’s worth it.","updated":"2017-12-14T09:36:54-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3209287685","userName":"Way2muchkc4u","userUrl":"https://itunes.apple.com/us/reviews/id220274471","version":"3.3","score":4,"title":"Best update so far","text":"I’ve had these cameras for 2 weeks. This latest update has made it so much easier to use the cameras. I have one that’s all wireless and it’s so nice to see the battery level right on the first menu page. No more digging in submenus!-)","updated":"2018-09-20T02:06:43-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2535328650","userName":"SCC INC","userUrl":"https://itunes.apple.com/us/reviews/id344967759","version":"3.2.3","score":1,"title":"New update rendered useless","text":"Latest update was supposed to fix issues with iPhone X. Now you can’t even access the app at all. It’s just keeps loading. Will be contacting credit card company for a full refund of product since I can’t use this camera and the company won’t update their software! What a rip off! Incredibly frustrating! It has been this way for over a month! Inexcusable! 😡","updated":"2018-05-11T21:16:57-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2067100590","userName":"Guitarkidsam","userUrl":"https://itunes.apple.com/us/reviews/id87674730","version":"3.1.4","score":3,"title":"Needs more in app features","text":"Is would be nice if you could adjust the exposure (brightness) while viewing the app. I use this camera to monitor a reef tank, and at times the image is over exposed and washed out. Also you need to allow split screen on the iPad. Makes you guys look behind the times.","updated":"2018-01-07T14:11:43-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1559048251","userName":"CDWRK","userUrl":"https://itunes.apple.com/us/reviews/id161952061","version":"2.2","score":4,"title":"Not receiving notifications","text":"Since the last update, I no longer received notifications on my iPhone.\n  \nAddendum:  Deleting and reinstalling the Logi Circle app seems to have corrected the problem that started with iOS 10.","updated":"2017-03-06T19:15:31-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7542113775","userName":"Gshpp","userUrl":"https://itunes.apple.com/us/reviews/id31109577","version":"3.5","score":1,"title":"App Won’t Load","text":"Since the last update there have been nothing but issues. First it kept logging me out, then the past two days the app won’t even load. I tried going in through a browser and logging in to check my camera, but it says “not supported on iOS (Safari). I am away and have no way to monitor my house.","updated":"2021-07-05T07:51:25-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3437155184","userName":"icebearwantsfood","userUrl":"https://itunes.apple.com/us/reviews/id589913319","version":"3.3.1","score":1,"title":"Doesn’t do its primary job","text":"The camera worked great for couple of months. I wanted to make sure that this camera works before buying yearly subscription plan. But the app no longer would load live view. The alerts and day brief works but when viewing live camera the loading circle keeps spinning. It is good that i waited for few months before throwing more money on this camera.","updated":"2018-11-19T13:08:09-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1456210859","userName":"==HDD==","userUrl":"https://itunes.apple.com/us/reviews/id144136789","version":"2.0.1","score":4,"title":"Zooming bug","text":"Great hardware and nice app. One annoying thing: I like the zooming function in the app, but it's really unstable on iOS 10, sometimes after few zooms, the camera view will get stuck, you can't zoom out or do anything. Frustrated.","updated":"2016-09-26T06:35:14-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1425324928","userName":"ShawnsAstar","userUrl":"https://itunes.apple.com/us/reviews/id278409205","version":"1.7","score":5,"title":"Amazing Innovation","text":"Great product and great app. I haven't experienced any of the issues mentioned thus far. Camera quality is great, smart location notifications are amazing and the ability to mount it up high is great. Great jog Logi Team!","updated":"2016-08-02T14:50:59-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"5361267448","userName":"notchristopher","userUrl":"https://itunes.apple.com/us/reviews/id42155764","version":"3.4.5","score":1,"title":"Wow this is terrible","text":"Great camera once you get them set up. But getting them setup can take hours. If you add it to HomeKit first then remove it the app will never see it. So how do you reset it?  Who knows?  I’m waiting for a support email three days now. \n\nI have one camera working great but adding two is a nightmare. I suggest looking at different companies. Maybe they are easier.","updated":"2020-01-04T12:35:13-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7856610326","userName":"mic.genius","userUrl":"https://itunes.apple.com/us/reviews/id484693643","version":"3.5.2","score":5,"title":"Best Interface","text":"Sad to see the new Circle View isn’t supported by this app.\nI wish apple homekit would adopt the same interface.","updated":"2021-09-28T21:29:59-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7531292398","userName":"Aidriel","userUrl":"https://itunes.apple.com/us/reviews/id28141848","version":"3.5","score":1,"title":"3.5 software is terrible!!","text":"The program update to 3.5 is just terrible!! totally cripples the log in process. The app now uses a web browser to log in. Then it goes back to the application, but the app doesnt link. So you are stuck in endless loop between App and Web browser. Trying to log in. This is unacceptable!!!  Looking for a new Camera and company today. 3.5 update is TRASH","updated":"2021-07-02T08:41:08-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3941576108","userName":"BillyKonstantine","userUrl":"https://itunes.apple.com/us/reviews/id527030981","version":"3.4.1","score":4,"title":"Good app","text":"Really nice app! I hope they find another way to scroll through playback as on the iPhone X, it’s hard to scrub since it’s touching the app switcher icon on the bottom and it switches apps a lot\nEDIT: they responded to me that it was fixed, and it indeed is !","updated":"2019-03-29T06:25:01-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2939011231","userName":"iPhone","userUrl":"https://itunes.apple.com/us/reviews/id42810044","version":"3.2.5","score":4,"title":"Apple TV","text":"Will you release an Apple TV app? It would be great to at least view my cameras from my TV. Thanks!\n\nOtherwise, these are great cameras. They are easy to install, have great views, and have high functionality. These are definitely worth the purchase!","updated":"2018-07-20T03:33:00-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2485532559","userName":"Gudinne","userUrl":"https://itunes.apple.com/us/reviews/id131653773","version":"3.2.3","score":5,"title":"App is great and camera is amazing!","text":"This camera is absolutely high quality and has amazing nighttime vision. The app is great as long as you keep it updated and restart it after a few months. Love my Logi!","updated":"2018-04-29T18:02:31-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7532457706","userName":"Bakerman","userUrl":"https://itunes.apple.com/us/reviews/id38000489","version":"3.5","score":2,"title":"Update is terrible","text":"I have used this software and the cameras for years. Until the update this was good stuff.\n\nNow the endless login cycle is outrageous. I am beyond disappointed in what has been done here, and will be retiring my cameras one by one to switch to another brand-solely because of the hideous login cycle.","updated":"2021-07-02T16:21:09-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1797244156","userName":"Bonedog84","userUrl":"https://itunes.apple.com/us/reviews/id23360896","version":"3.1.1","score":5,"title":"Amazing","text":"Someday this will cost ten x as much.  Note to developers:  allow Bluetooth pairing for sound output.  It's weird that my cats drinking water comes from my speakers when I was just listening to music on headphones.","updated":"2017-09-18T17:43:59-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1508335667","userName":"Logi User","userUrl":"https://itunes.apple.com/us/reviews/id541058957","version":"2.2","score":3,"title":"No notifications","text":"After the latest update, the app no longer allows me to turn on the activity notifications on my phone.  If I enable smart alerts, the app just sits and pretends to be doing something.  If you back out though, the feature remains not selected.","updated":"2016-12-24T15:22:30-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7831136484","userName":"jlwenineer","userUrl":"https://itunes.apple.com/us/reviews/id193514073","version":"3.5.2","score":1,"title":"Terrible app","text":"I don’t normally write reviews but this app is so horrible.  Finally figured out you have to close the app before you allow it to open from safari. Otherwise you just go back and forth from safari to Logi app.  But now that doesn’t even work.  Disappointed because now the camera is a $300 paperweight.","updated":"2021-09-21T15:42:41-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7787988048","userName":"Rajsh321","userUrl":"https://itunes.apple.com/us/reviews/id311721873","version":"3.5.2","score":1,"title":"Keeps asking me to log in.","text":"The app keeps asking me to login every time I try to use the app. This used to be a nice security camera, but they have done something because of which now it's a lousy product. If they don't fix this issue, not very many people are going to want to use their camera anymore.","updated":"2021-09-09T07:50:57-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7655819448","userName":"dbrauner9","userUrl":"https://itunes.apple.com/us/reviews/id237168308","version":"3.5.1","score":1,"title":"Don’t Update App","text":"After the last update it is completely useless. Does to me the same as what the others are complaining about- auto log out, takes me to a web page, then back to app. Now, all my cameras show offline but my wife can see them because she hasn’t updated yet. It was once a pretty flawless app.","updated":"2021-08-04T16:58:40-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7595751240","userName":"getthebikes","userUrl":"https://itunes.apple.com/us/reviews/id35375072","version":"3.5","score":3,"title":"App logs out unless you delete and reinstall","text":"The app would constantly log me out when I opened it. I found out you have to delete the app and reinstall. It fixed my problem after that.","updated":"2021-07-19T15:54:25-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"5436071907","userName":"Cheerioboy25","userUrl":"https://itunes.apple.com/us/reviews/id143795850","version":"3.4.5","score":1,"title":"Poor design decisions","text":"- Horizontal only is terrible\n- Saves triggered event clips only, you can’t browse through the entire 24h video feed. \n\nDealbreaker was not being able to scrub the timeline. The camera triggered an event we wanted to watch. But it ended early with no way to watch the rest of the feed. And here I paid for the circle safe subscription. What was the point...","updated":"2020-01-22T12:17:26-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7486549421","userName":"Me Borikua","userUrl":"https://itunes.apple.com/us/reviews/id265943456","version":"3.5","score":2,"title":"Messed up update","text":"Having to login constantly makes this app useless. You destroy the notification system of this app. Fix that. An entire security system destroyed by your update is insane. What is the point of investing on something this unreliable.","updated":"2021-06-20T09:11:21-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2670150522","userName":"Timdiesel05","userUrl":"https://itunes.apple.com/us/reviews/id416755272","version":"3.2.3","score":4,"title":"Decent App","text":"This is a good app but could be better. I’ve been reading the comments and the iPhone X users are saying it’s useless. I can say it burns quite a bit of battery going through the cloud. Overall I’m happy with this app.","updated":"2018-06-10T00:30:27-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2354245289","userName":"SnowboardSB","userUrl":"https://itunes.apple.com/us/reviews/id39693515","version":"3.2.2","score":1,"title":"What the fk!!!!","text":"I have an iPhone X. The latest update is a mess. I cannot even find the play icon anymore. It’s totally missing. When I click on an event then just the same picture shifts right on the screen. \n\nThen somehow I was fumbling around trying to find the play button and it shows up on one of my camera about 0.5 inches up the middle of the screen. \n\nJesus Christ....what happened to your QA Department?!","updated":"2018-03-27T20:35:39-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7809472780","userName":"56 knitter","userUrl":"https://itunes.apple.com/us/reviews/id207705280","version":"3.5.2","score":1,"title":"Worst app ever","text":"We have several cameras and it worked perfectly until recently sometimes the app works other times it doesn’t, sometimes it takes me 30 times just to log in i have deleted and reinstalled only to no get logged in after several attempts.  The last update was the WORST","updated":"2021-09-15T10:54:39-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"6900362950","userName":"certaintlynot","userUrl":"https://itunes.apple.com/us/reviews/id744022383","version":"3.4.5","score":1,"title":"Good luck!","text":"Good luck trying to set this piece of junk up on the app, I’ve had to reset it over 5 times because it keeps going offline and then the app doesn’t pick it up even when the LED is flashing blue and you’re following it step by step. It’s impressive how well setup the videos are where it picks up the camera right away during setup","updated":"2021-01-22T07:00:46-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7804997092","userName":"AW_Gator","userUrl":"https://itunes.apple.com/us/reviews/id13542472","version":"3.5.2","score":1,"title":"Logitech’s plan to get you to buy new","text":"It’s SHAMEFUL that Logitech has made such a mess with the IOS login process.  I wrote them and they offered surprise but no fix.  Since I can login EASILY in OSX and Win10… I can only suspect that they are trying to force LogiCircle users to buy the new HomeKit model .  Why am I upset??? I’m upset because the LogiCircle cam has worked flawlessly until now.","updated":"2021-09-14T04:40:41-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7670857783","userName":"JoshCorb","userUrl":"https://itunes.apple.com/us/reviews/id205709408","version":"3.5.1","score":1,"title":"Endless Loop of Logging In","text":"After recent updates I am unable to login consistently. I get in a continuous loop of logging in on the website and then launching the app. Usually works after multiple attempts but not today. Also seems to be slow to alert me of activity in the camera. Need a fix quick.","updated":"2021-08-08T17:21:24-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7477509817","userName":"what 9999","userUrl":"https://itunes.apple.com/us/reviews/id49409327","version":"3.5","score":1,"title":"Update breaks app","text":"Current version of app needs you to create a new login and then asks you to login every time you open the app. However after you login it just keeps asking you to login or setup a new camera. I’m getting notifications of activity on the camera, but now I have no way to see the activity.","updated":"2021-06-18T00:23:44-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3003543313","userName":"michellarella","userUrl":"https://itunes.apple.com/us/reviews/id39401001","version":"3.2.5","score":3,"title":"Latest update “out of touch”","text":"I’m super-bummed it lost the ability to zoom in. Maybe one in nine attempts make it work. **Zoom resolution is not great—no enhancement—reminds me of what it was like watching an old VHS tape and wondering what the point of doing it is. **Window mounting is extremely limited and I’m wondering how long the suction cup holds...(ak)","updated":"2018-08-01T19:16:54-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7603752765","userName":"wesleyi","userUrl":"https://itunes.apple.com/us/reviews/id41242204","version":"3.5","score":1,"title":"Hello…Logitech, are you there??? Is anyone there!?!?","text":"We use this app as our baby/toddler monitor and quite simply, Logitech broke it in a recent update and they have failed to respond or fix it. It’s as if they are shooing me away intentionally from using their product. I don’t get it, but it’s making me second guess ever buying ANY logitech product ever again. So sad.","updated":"2021-07-21T20:29:03-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7603555257","userName":"Sethlouis","userUrl":"https://itunes.apple.com/us/reviews/id80026532","version":"3.5","score":1,"title":"App and camera is now worthless","text":"This was formerly a reliable combo I could use to spy on my dog and monitor my home when away. Now it's useless hardware and useless software. As others here have reported the app flow is broken. The app opens a browser so to make me log in and the browser opens the app. Maybe this is the logical loop repented by the product name Logi Circle. \nAvoid!","updated":"2021-07-21T19:13:57-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1682321348","userName":"CanadianSnuggleBunny","userUrl":"https://itunes.apple.com/us/reviews/id164819512","version":"3.0","score":3,"title":"Was hoping the update fixed skipping....","text":"but it did not:( The iPhone/iPad playback still skips every 5-10 seconds. Not a huge deal.....but was really hoping Logitech would have corrected this (especially given the extended time between updates).","updated":"2017-07-14T10:27:26-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7867046007","userName":"Magnolia Fan","userUrl":"https://itunes.apple.com/us/reviews/id995023179","version":"3.5.2","score":1,"title":"What happened??","text":"This app is unusable. It gets stuck in the buffering screen and won’t move from there. I followed the instructions from the other comment and downloaded the beta for the new version and it’s the same issue. I might as well buy new cameras as I need this to work on my phone.","updated":"2021-10-01T16:22:44-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"5296061785","userName":"Maui Kid","userUrl":"https://itunes.apple.com/us/reviews/id43835701","version":"3.4.5","score":5,"title":"Works well!","text":"Love my Circle cameras and this app. Once it’s setup it’s easy to use and the notifications work all the time.\n\n5 Stars from me!","updated":"2019-12-20T07:26:43-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7580826668","userName":"Aztecgamer","userUrl":"https://itunes.apple.com/us/reviews/id329725766","version":"3.5","score":1,"title":"ZERO stars","text":"It’s been over a week now and nothing has been done to correct the fact the app NO longer works. Call support and they just log your info and ask for time to fix. They also suggest accessing from a desktop computer - non iOS , MacOS \nCamera and security is worthless now","updated":"2021-07-15T15:34:52-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7528378430","userName":"Skymonster","userUrl":"https://itunes.apple.com/us/reviews/id9762421","version":"3.5","score":1,"title":"Log In Change Ruined This App","text":"I loved this app for my Circle cameras. The updates to the login process ruined this app. I’m having to re-login all the time. The little thumbnail warnings the there is activity no longer contain a photo. I hope they scrap this change and go back to where it was. It worked great and they ruined it.","updated":"2021-07-01T14:19:38-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7497269307","userName":"xUSuckIH8Ux","userUrl":"https://itunes.apple.com/us/reviews/id417441283","version":"3.5","score":1,"title":"Latest update broke app","text":"The latest update broke this app. Have to constantly login which eliminates notifications of events happening when you’re away. Before the latest update the app was great with notifications and monitoring. Please fix this app and I will modify my review. Until then, 1 star. Avoid using.","updated":"2021-06-23T07:36:26-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1918704556","userName":"L'double","userUrl":"https://itunes.apple.com/us/reviews/id17366512","version":"3.1.1","score":2,"title":"Needs Work","text":"No iPhone X support yet. Extremely frustrating to have to close the app out on the side. Really wish this app could be used landscape or portrait. No Apple TV support, this is a must have for a camera app I feel. \nI’m really hoping for a major app overhaul soon. The Camera is great, but the app is holding it back.","updated":"2017-11-13T12:06:18-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2344044463","userName":"Taysh","userUrl":"https://itunes.apple.com/us/reviews/id42584819","version":"3.2.2","score":1,"title":"IPhone X support horrible","text":"Ok so the app was just updated for the iPhone X. The interface was implemented great, but watching video is horrible. First, the video is cropped and doesn’t take advantage of the new screen size. Second, the controls while watching video shift when brought up. Implementation is horrible and was much better before the so called in home X support. Please fix ASAP","updated":"2018-03-25T00:26:42-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2116755773","userName":"Tess227","userUrl":"https://itunes.apple.com/us/reviews/id104235105","version":"3.1.4","score":1,"title":"Bad App.","text":"Love the picture quality but had to reset WiFi and now can’t get any cameras to work. Requires a hard reset on the camera itself rather than just going into the settings and putting in you new WiFi information.  Now I have $400 with of camera that won’t connect. App runs loops trying to figure what to do. Bad. Just do not waste your money.","updated":"2018-01-22T18:19:16-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7480008448","userName":"Steve Gale","userUrl":"https://itunes.apple.com/us/reviews/id39338577","version":"3.5","score":1,"title":"Not happy with this app.","text":"This app has not worked well for me from the beginning.  The camera keeps going Offline and sometimes it records only 2 to 3 second clips.  Also the new version keeps asking for me to login from the wed site even though I’m using the app.  Not happy with this camera and app.","updated":"2021-06-18T15:48:03-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2327472507","userName":"Austinphoto6789","userUrl":"https://itunes.apple.com/us/reviews/id105836588","version":"3.2.1","score":1,"title":"App needs work","text":"The app gives an error when I try to pay for a subscription. I have not been able to pay for the subscription in two weeks. I’ve been trying daily. So since I’m still on the free trial, I get an update anytime a plant blows in a slight breeze. This means I have 20,000 notifications a day and my battery life on my phone is affected. 🙄","updated":"2018-03-20T11:26:53-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7869183809","userName":"Wjwyatt","userUrl":"https://itunes.apple.com/us/reviews/id148167622","version":"3.5.2","score":1,"title":"It keeps logging me out","text":"I get alerts, but when I click the notification to watch the video, it tells me that I’ve been logged out. Started several months back. Extremely problematic as it takes time to see a video that I’m trying to review quickly.","updated":"2021-10-02T05:58:37-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7553328386","userName":"Sabri1234567890","userUrl":"https://itunes.apple.com/us/reviews/id119421865","version":"3.5","score":1,"title":"Logi tech camera app doesnt work","text":"This used to be great but until they updated it the app keeps logging me out everytime and its hard to see the camera fast u still have to log in and then sometimes it works and sometimes it just logs u back out . They gotta fix the app bec this is ridiculous.","updated":"2021-07-08T06:52:51-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3571241231","userName":"airic","userUrl":"https://itunes.apple.com/us/reviews/id26975122","version":"3.3.1","score":3,"title":"Missing features","text":"I’d like to see geo location features for turning on and off the camera with camera sharing. See Nest Cam. \n\nPortrait mode support. Landscape view is tedious.\n\nHome screen icon shortcuts for turning on and off camera. Start recording etc.","updated":"2018-12-25T05:18:32-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3279528763","userName":"nvee3","userUrl":"https://itunes.apple.com/us/reviews/id33480773","version":"3.3","score":4,"title":"Not bad","text":"It’s working great for me so far. Started with one camera and now have two. I like the new design. Works with HomeKit too. Not having any issues with anything. Please keep adding new features.","updated":"2018-10-08T15:38:42-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1986632522","userName":"Exavior","userUrl":"https://itunes.apple.com/us/reviews/id12656954","version":"3.1.2","score":1,"title":"Broken on iPhoneX","text":"I always worry when companies like Phillips go into software development.  They never seem to keep up with things in terms of maintenance and updates.   \n\nThe developers on your team should have been testing the app with new iOS long before the new phones were released. \n\nBecause your app uses the same “swipe up from bottom” gesture as the OS, there is no way to exit the app.  Users are trapped as there is no home button on the new phones. \n\nThis should have been addressed months ago.  And here we sit, dealing with your inability to support your products like “real” software developers do.","updated":"2017-12-10T15:18:31-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3207820444","userName":"Patcoy","userUrl":"https://itunes.apple.com/us/reviews/id12381359","version":"3.3","score":2,"title":"Patrick","text":"The picture and replay is nice.  The audio when connecting to the camera is not good. Person on the other end of camera really can’t hear you as a viewer. On the other hand, to listen in on the activities is great. You can hear very well. Improve volume on the camera.","updated":"2018-09-19T15:20:07-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1437468895","userName":"Petropete54","userUrl":"https://itunes.apple.com/us/reviews/id143534553","version":"1.7","score":5,"title":"Great camera and app","text":"I just bought the camera and installed the app. It was very easy to set up, connect and view. Great night vision also.","updated":"2016-08-22T12:08:57-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7558923461","userName":"Gottaplay334","userUrl":"https://itunes.apple.com/us/reviews/id201647679","version":"3.5","score":1,"title":"Upgrade is downgrade","text":"This latest upgrade was certainly a mistake. Start with something that works and mess it up. This is not progress. \n\nConstantly being logged out. Go through multiple, redundant screens to log back in. \nWhen on Facebook and following an outside link, Logi hijacks the link.","updated":"2021-07-09T18:43:03-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7678949864","userName":"kat_nyc","userUrl":"https://itunes.apple.com/us/reviews/id7109015","version":"3.5.2","score":1,"title":"Unusable","text":"I’ve had this camera for almost 2 years and never had a major issue until approximately 2 months ago. The app constantly logs me out, sometimes won’t log me in and the cameras seem to go offline a lot (which I suspect is a software issue and not a hardware one.)","updated":"2021-08-10T19:50:52-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2069865097","userName":"NeedApple","userUrl":"https://itunes.apple.com/us/reviews/id35306104","version":"3.1.4","score":2,"title":"Needs iPhone X support","text":"Aside from the inexcusable iPhone X support, and logitech is not the only one because Nast does that too, this is a pretty good camera. I love the extreme wide angle, the quality is very high, the day review is really useful, the alerts are pretty spot on, the connectivity is strong.  \n\nThe app just needs some work but it’s pretty good!","updated":"2018-01-08T11:03:19-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7588602495","userName":"Q Lam","userUrl":"https://itunes.apple.com/us/reviews/id35899353","version":"3.5","score":1,"title":"App is unusable with latest update","text":"This new login mechanism simply does not work. The app repeatedly asks you to login but when you do it refuses to open. Keeps asking you to login. Makes the cameras unusable. Have been using these cameras for baby monitors for 3 years and it had been good until now.","updated":"2021-07-17T17:39:57-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2186578241","userName":"Taylorwb","userUrl":"https://itunes.apple.com/us/reviews/id18788502","version":"3.2","score":3,"title":"Good. Needs a bit more bugs ironed out.","text":"LED off setting keeps coming back on. Some adjustment on motion detection sensitivity would be nice... slow to transmit to HomeKit enabled products. Other than that works well. \n\nWill change to 5 stars if bugs are ironed out","updated":"2018-02-09T04:41:52-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2017673280","userName":"Natedawg369","userUrl":"https://itunes.apple.com/us/reviews/id32736341","version":"3.1.3","score":2,"title":"Reliability issues","text":"I have loved the circle and the app. Better than others I have tried. Their app recently has become unreliable and even quits or closes out. We use this as a baby monitor and Logitech has downtime or pushes updates at terrible times. Come on Logitech. You can do better.","updated":"2017-12-22T06:45:37-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1466095594","userName":"Knic4536","userUrl":"https://itunes.apple.com/us/reviews/id529641452","version":"2.0.1","score":2,"title":"Constantly advertises","text":"Tried to get you to upgrade to circle safe. I paid stop it, it never ends.\n\nEach video has chunks, when switching chunks they show the start of the previous chunk.\n\nNo fast forward in each video, not having this is super annoying","updated":"2016-10-13T08:53:55-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1685184000","userName":"Rustys Itouch","userUrl":"https://itunes.apple.com/us/reviews/id25413341","version":"3.0","score":2,"title":"smart alerts no longer working with update","text":"dissapointed to find that smart alerts are no longer working with the upgrade. when I go to turn them no withnig the camera settings they just spin and never turn on.  needs work","updated":"2017-07-16T16:46:14-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7592753075","userName":"Tayanez","userUrl":"https://itunes.apple.com/us/reviews/id202592253","version":"3.5","score":1,"title":"Entirely Broken. Devs???","text":"As many other users have pointed out:\n* App does not stay logged in. Need to login every week. \n* Smart Location services are broken. If you quit the app it does not track location and turns off the feature with no warning. \n* App does not post smart alerts when events happen. I never get any notifications anymore. Checked app notifications on the app and in iOS settings. It is broken. \n\nPlease fix your app. Your software is turning m an expensive camera into a paperweight.\nThis is unacceptable.","updated":"2021-07-18T20:40:07-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7486956394","userName":"Broondy","userUrl":"https://itunes.apple.com/us/reviews/id452781868","version":"3.5","score":1,"title":"Fix the problem","text":"This was a great functioning security camera until they changed it to password mode. Now I cannot access it through my phone and they told me I would get help within 48 hours. It’s been 3 days and still no reply. Do not buy from this company.1","updated":"2021-06-20T11:36:20-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"4312461946","userName":"daveB.","userUrl":"https://itunes.apple.com/us/reviews/id42036750","version":"3.4.2","score":3,"title":"Needs refinement","text":"App is okay. I echo the other reviews about horizontal only and no multi live view.  I bought a three pack of these circle 2 cams, hoping to use one to replace an Amcrest Camera. \n\nAfter some test and trial, decided to keep the Amcrest hooked up as the app is more user friendly with these two features. \n\nPlease add a vertical view to the app, and give me the choice to turn the phone if I can’t see what I need. \n\nAnd live multi view. No still shots. If Amcrest can do it, so can you!","updated":"2019-06-13T21:42:41-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7860938989","userName":"Ttocsik","userUrl":"https://itunes.apple.com/us/reviews/id46126526","version":"3.5.2","score":1,"title":"App is awful - used to be much better","text":"App won’t open on its own. Redirects you to website and loops back. I have a battery operated camera and it’s useless. The other video from my wired cameras won’t play back. They just load until you close the app. Very disappointed!","updated":"2021-09-30T02:23:53-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7748096139","userName":"RSerino","userUrl":"https://itunes.apple.com/us/reviews/id48867288","version":"3.5.2","score":1,"title":"MAJOR log in issues","text":"I have been using Logi Circle cameras for 5 years for my home and my businesses- This issue with logging in and out NEEDS to be fixed. I have to log in 20+ times to view my cameras- this is NOT acceptable! Especially when I’m paying for a subscription.","updated":"2021-08-29T07:00:37-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"4656202924","userName":"MiAzRabbit","userUrl":"https://itunes.apple.com/us/reviews/id185119770","version":"3.4.3","score":2,"title":"Drops offline all the time since last update.","text":"Used to be so good. Now constantly dropping offline and sending all those notifications all day and night. I do not get what happened, but thinking of throwing all this gear away if this is not fixed soon.","updated":"2019-08-22T12:47:59-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1468436185","userName":"No sound","userUrl":"https://itunes.apple.com/us/reviews/id34361651","version":"2.0.1","score":1,"title":"Horrible","text":"Just bought today and set up worked great and then made the mistake of doing the firmware update... zoom freezes and you need to restart your phone before it will pan back out again only to have it lock up on you in seconds....good example of a company that does not fully test updates.","updated":"2016-10-17T09:06:13-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7891973770","userName":"TB001122","userUrl":"https://itunes.apple.com/us/reviews/id31071356","version":"3.5.2","score":1,"title":"Notifications have stopped","text":"The sign in issue has been a little better but now notifications have stopped. When viewing a camera feed it takes 45 seconds for the events to load. Not great for security","updated":"2021-10-08T07:47:43-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3669770334","userName":"raianoat","userUrl":"https://itunes.apple.com/us/reviews/id31895262","version":"3.3.1","score":3,"title":"Sensitivity setting","text":"Would like to see the ability to adjust sensitivity setting. I receive too many “high activity” notifications for a car driving by.","updated":"2019-01-19T07:49:57-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1720708638","userName":"iMac4joy","userUrl":"https://itunes.apple.com/us/reviews/id32912714","version":"3.0.4","score":3,"title":"Almost great...","text":"My single biggest complaint is the inability to put the camera audio through Bluetooth using the app... it always comes through my phone speaker, even with headphones and stuff.","updated":"2017-08-09T17:35:41-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1804001495","userName":"nickulees","userUrl":"https://itunes.apple.com/us/reviews/id35153941","version":"3.1.1","score":5,"title":"Great App, Better Security Cam","text":"Redesigned menu is great. Much easier to tell what you're adjusting. Daily Brief is the best feature. App is smooth and responsive. Best cam for the money.","updated":"2017-09-22T10:33:55-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7694937309","userName":"Golfman62","userUrl":"https://itunes.apple.com/us/reviews/id294857986","version":"3.5.2","score":1,"title":"I think Covid got the app","text":"Can't log in. Had the app open yesterday and today I'm trapped in the login loop. Get alerts though. \n\nIt's been like this for 2 months. This can't be too hard a fix guys. \n\nLike the other guy said. Telling that the review count is reset. How does the App Store let that happen?","updated":"2021-08-15T02:13:29-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1275301214","userName":"WonHee","userUrl":"https://itunes.apple.com/us/reviews/id43359130","version":"1.3","score":5,"title":"Simple yet handy!!","text":"Bought Circle a fee days ago and got delivered today. Installed this app and it was super easy to set it up with Circle.","updated":"2015-10-22T00:43:32-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3649642189","userName":"SquishyCat","userUrl":"https://itunes.apple.com/us/reviews/id26042922","version":"3.3.1","score":2,"title":"Stop the launch chime!!!","text":"The app works as expected, but there’s no way that I’m aware of to kill the launch chime. As a security product, I will likely launch the app when I see an alert, at night...and I don’t want to wake up the whole house. Plus, it’s just bad user experience.","updated":"2019-01-14T07:49:31-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7526880037","userName":"abcdr1an","userUrl":"https://itunes.apple.com/us/reviews/id103500969","version":"3.5","score":1,"title":"Recent app update broke the application","text":"The app now requires you to login via a browser every time you launch it. However, sometimes you get caught in an endless loop where you are sent back and forth between the app and the browser. Please fix this!","updated":"2021-07-01T05:46:41-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7481248245","userName":"selekt0r","userUrl":"https://itunes.apple.com/us/reviews/id197444016","version":"3.5","score":1,"title":"SSO sign in garbage","text":"The latest update of this app with SSO made this an absolute garbage experience. Constantly logs me out of the app numerous times a day when I get camera activity notifications. Then when trying to log in using SSO, I have to try it 2 or 3 times before it even signs me in. Who approved this update?","updated":"2021-06-19T00:19:36-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"4521648474","userName":"Doctor Mantis Toboggan","userUrl":"https://itunes.apple.com/us/reviews/id22891337","version":"3.4.3","score":2,"title":"Great when it works, which is rare","text":"The smart location feature is utterly useless. It supposedly allows you to set the camera to turn on and off based on your location but it only works about 25 percent of the time. A great piece of hardware with a garbage app.","updated":"2019-07-26T12:18:05-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1471797893","userName":"ilans","userUrl":"https://itunes.apple.com/us/reviews/id43362281","version":"2.0.1","score":5,"title":"Bug in iOS 10 and iPhone 7","text":"Notifications are not working","updated":"2016-10-23T08:48:06-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7886282814","userName":"dr0se11","userUrl":"https://itunes.apple.com/us/reviews/id1336441683","version":"3.5.2","score":1,"title":"Cannot login","text":"I am experiencing the same issue as the individual on Sept 1. I keep trying to login and the website isn’t working. I cannot contact support without going through the site. Flawed servicing which is unfortunate because I love the app when it works.","updated":"2021-10-06T18:26:03-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7562033518","userName":"PBTwoPlus","userUrl":"https://itunes.apple.com/us/reviews/id14984602","version":"3.5","score":1,"title":"App now worthless","text":"Do not download this latest update if at all possible. You have to go to Logitech’s website to login outside of the app. It logs me in but redirecting back to the app does nothing. I’m prompted to login again and taken back to the site in an endless circle. \n\nLogitech fix this issue!!!","updated":"2021-07-10T14:39:57-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"6410204129","userName":"n8ku","userUrl":"https://itunes.apple.com/us/reviews/id19464299","version":"3.4.5","score":1,"title":"Cannot Load Videos","text":"The cameras are great, but the app is terrible. It’s impossible to go back and review videos. They take forever to load. Then the app freezes and closes. I’m very disappointed that I bought two cameras that are useless because of the poorly designed app.","updated":"2020-09-08T22:42:34-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"5205845704","userName":"GirleeGolfer","userUrl":"https://itunes.apple.com/us/reviews/id102393995","version":"3.4.5","score":5,"title":"Great Cameras!","text":"UPDATE.....\n\nIf switching to Beta HomeKit Secure integration, with cameras behind windows... For temporary relief, turning off night vision can, in brief, minimize the reflection.\n\nFor best results purchase the window mount… allows for night vision use and  the 180° view goes from good to great.\n\nMy experiences with the app and cameras have been pretty good, thus far. No connectivity issues at all.","updated":"2019-11-27T18:36:24-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1922720859","userName":"G'z Up","userUrl":"https://itunes.apple.com/us/reviews/id39680195","version":"3.1.1","score":3,"title":"Good but not great","text":"Needs more updates and to add the ability to move around home screen cameras to your liking! App lacks some things that could make this camera even better!","updated":"2017-11-15T05:26:31-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7904845361","userName":"enigma_acn","userUrl":"https://itunes.apple.com/us/reviews/id150135221","version":"3.5.2","score":1,"title":"Avoid Logitech!!!","text":"Do yourself a favor and avoid their products, their tech support is plain awful and this app simply doesn’t work, just like their Circle View camera. I should’ve paid attention to the reviews, now I regret buying any of their products.","updated":"2021-10-11T19:44:25-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7716379170","userName":"TheSaltyShark","userUrl":"https://itunes.apple.com/us/reviews/id152777751","version":"3.5.2","score":1,"title":"I used to love it—","text":"I loved this app and cameras I even paid monthly for their subscription but ever since they changed something in the app and made it keep logging us out. I cannot stand it, canceled my circle safe subscription and don’t even use my cameras anymore. 100% on alro now.","updated":"2021-08-20T18:27:15-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7562510405","userName":"M.Shores","userUrl":"https://itunes.apple.com/us/reviews/id296299267","version":"3.5","score":1,"title":"Latest update is garbage","text":"What is going on with this app ? Works perfect for a dat then l get an offline of all 5 cameras and l have to delete the app and reload it. This has been going on for a week already. If this isn’t fixed quickly I’ll remove these cams and go to full Ring set up!!","updated":"2021-07-10T18:12:59-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"5949427146","userName":"CaptainMess","userUrl":"https://itunes.apple.com/us/reviews/id16144900","version":"3.4.5","score":3,"title":"Great other than one thing","text":"-Apple needs to bring HomeKit to wireless! This is an easy feature to build into app, and the camera is directly hooked up on network, sooo...","updated":"2020-05-15T09:56:38-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"5318981751","userName":"MyHrh","userUrl":"https://itunes.apple.com/us/reviews/id102673434","version":"3.4.5","score":1,"title":"Getting worst by the updat","text":"Records per minute and it is horrible, it once was great the first year it came out. Keeps getting worst every update. The point of updating should be to make things better. I need this fixed ASAP. Will change and buy something else","updated":"2019-12-25T12:08:54-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3501311769","userName":"dont wanna a nick name to post","userUrl":"https://itunes.apple.com/us/reviews/id265174595","version":"3.3.1","score":2,"title":"Glitchy","text":"It went from notifying me on every movement even after going in settings to adjust it would auto default to “all movements“. So I uninstalled and reinstalled and now I don’t get a single notification which is worthless. Get it together please!","updated":"2018-12-06T13:37:38-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3596512416","userName":"Kvetch","userUrl":"https://itunes.apple.com/us/reviews/id101346178","version":"3.3.1","score":1,"title":"Disappointing at every level","text":"Wireless circle 2 cam has very short battery life. The camera takes forever to ‘wake up’ to view on phone, sometimes never, with frequent ‘camera offline’ message. I’m down to only 1 cam now and will replace it soon with a better product.","updated":"2018-12-31T10:12:11-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3456652456","userName":"stinkypete2021","userUrl":"https://itunes.apple.com/us/reviews/id35163458","version":"3.3.1","score":3,"title":"Good cameras, not so good app","text":"Currently my favorite cameras out of all available today. The App however is slow and needs to work in portrait and not force switch to landscape. Also, the iPad app is not optimized for new iPads. Please update!","updated":"2018-11-24T16:09:06-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1464005601","userName":"applejacks36","userUrl":"https://itunes.apple.com/us/reviews/id36581138","version":"2.0.1","score":1,"title":"Constant poor connection","text":"I like this but this crap doesn't work when you need it too. When you reset it, it takes a million years to reconnect and start working again. I should not have to manually turn it off and on again to reconnect to my wifi. Fix your stuff!!","updated":"2016-10-09T14:23:52-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7903872817","userName":"MrsOrangw","userUrl":"https://itunes.apple.com/us/reviews/id466409162","version":"3.5.2","score":1,"title":"Notifications","text":"No more notifications as soon as ios15 updated. No amount of resetting the camera or deleting and redownloading the app works. Beta same issue. I want to get my alerts when someone comes to my door! Works fine on devices NOT on ios15.","updated":"2021-10-11T12:34:14-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7502621973","userName":"LShaheen","userUrl":"https://itunes.apple.com/us/reviews/id125450171","version":"3.5","score":1,"title":"Don’t update","text":"Like everyone else I can no longer log in after the app update. I hope Logitech fixes this ASAP as I now feel unsafe. I just added two new Logi cameras to my crew. I feel like they owe me money if they stop supporting the camera after 2 months after purchase","updated":"2021-06-24T18:49:19-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2088419109","userName":"Killerbosso","userUrl":"https://itunes.apple.com/us/reviews/id201419183","version":"3.1.4","score":3,"title":"Customers are # 1","text":"Nice camera works well but don’t forget your costumers \nI don’t get alerts anymore \nI can’t not longer update for monthly payment. So I can save my recording \nPlease do something about it\nThanks","updated":"2018-01-14T05:55:04-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1853521039","userName":"Andbernalbo","userUrl":"https://itunes.apple.com/us/reviews/id307657125","version":"3.1.1","score":2,"title":"Recording function and AirPods compatibility","text":"Please fix AirPods compatibility, I don’t want everyone listening to what I’m listening.\n\nAlso is there a recording function? Some how camera skips some activity, will be great if I can record what I’m seen.","updated":"2017-10-16T13:07:50-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7873629256","userName":"skenitze","userUrl":"https://itunes.apple.com/us/reviews/id41744304","version":"3.5.2","score":1,"title":"Horrible App","text":"The app is constantly kicking me out and it’s impossible to sign in 90% of the time!!!   I have the Logi cameras to watch my home and pets and i can’t count on this app anymore.  If this continues i will be replacing my camera system with a more reliable brand and app provider!!!","updated":"2021-10-03T08:50:13-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7549975037","userName":"Landoo®","userUrl":"https://itunes.apple.com/us/reviews/id271355056","version":"3.5","score":1,"title":"Latest update","text":"Loved this app up until the most recent update! I am constantly getting kicked out and unable to monitor and or get live notifications in real time. Very disappointing as I am a helicopter mom and have been using logicircle for a while now.","updated":"2021-07-07T09:11:10-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7500292882","userName":"doogald","userUrl":"https://itunes.apple.com/us/reviews/id33872413","version":"3.5","score":1,"title":"Latest update keeps forcing login","text":"Rather than showing my camera views, the latest update never saves my login and forces me to log in again. I’m guessing the developers know they messed up and are fixing it, let’s hope it’s really soon.","updated":"2021-06-24T04:08:27-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"4990682026","userName":"Bernardyan","userUrl":"https://itunes.apple.com/us/reviews/id135003375","version":"3.4.4","score":3,"title":"Can we make the progress selector smoother?","text":"Love the camera. However, the app is not good enough. It’s super hard to drag the progress dot while playing video. Can we make this better?","updated":"2019-10-20T21:37:00-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7659159009","userName":"Bogdutzu","userUrl":"https://itunes.apple.com/us/reviews/id100424533","version":"3.5.1","score":1,"title":"New update is horrible","text":"It keeps opening Safari every time to login then still not working.  Stop that Logi.  We already have security with FaceID and passwords.  That’s not security to keep opening safari to stop the camera.  Absolutely horrible update.","updated":"2021-08-05T13:36:59-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1698426108","userName":"Michael5581","userUrl":"https://itunes.apple.com/us/reviews/id18142001","version":"3.0.3","score":1,"title":"Holy hell","text":"This is just awful. Will not connect to camera without unplugging it and plugging it back in. Resolution only goes up to 720p despite it being 1080p camera. Takes 30-60 seconds to load live view in the rare case it works and I have fiber internet. Circle 2 was released too early with logs of bugs.","updated":"2017-07-25T20:21:24-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1901935059","userName":"Bill12389","userUrl":"https://itunes.apple.com/us/reviews/id488652686","version":"3.1.1","score":3,"title":"Pretty good","text":"You get what you pay for. I think the apps fine and the camera works well. Easy set up.  Only thing that frustrates me is I have to log back in every 2 weeks or so","updated":"2017-11-06T08:49:09-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7502062685","userName":"Michael Taranchino Chow","userUrl":"https://itunes.apple.com/us/reviews/id417941846","version":"3.5","score":1,"title":"Has never been great.. now it’s worse than ever","text":"The connectivity with the camera has never been ideal. Now the app makes me re-login almost every time. By the time I do that, my dog has already eaten his own feces and is on his way back to give us kisses in the bed.","updated":"2021-06-24T14:38:01-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"6047211244","userName":"InkRH","userUrl":"https://itunes.apple.com/us/reviews/id397098444","version":"3.4.5","score":1,"title":"Doesn’t work for circle 2 camera","text":"Bought a circle 2 camera from Apple, this app doesn’t allow me to add it. Camera adds to HomeKit but neither adding it to this (the official Logitech app) individually after resetting it or as an already paired camera works.","updated":"2020-06-07T08:06:20-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7539472885","userName":"ps_farmer","userUrl":"https://itunes.apple.com/us/reviews/id650665747","version":"3.5","score":1,"title":"What’s going on? (2)","text":"Same issue as above. Open app and requires me to sign in opening a web browser. It then opens the app again. This circle continues with no way to check the camera feed.  Resulting in a worthless camera.","updated":"2021-07-04T13:27:35-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1968273894","userName":"Bserious00","userUrl":"https://itunes.apple.com/us/reviews/id461018548","version":"3.1.2","score":3,"title":"Logi circle 2 wired","text":"This app is getting better all the time. But the last update seems to have killed the audio  in live stream, no sound at all. Also please enable portrait mode it this app.\n\nUpdate \nPowering off and on the cam has corrected the audio issue. The notification are a bit late by about 1 minute but working. The only thing still missing for some unknown reason is portrait mode.\n\nPlease add Apple TV support","updated":"2017-12-03T13:19:18-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1909320375","userName":"Euro253","userUrl":"https://itunes.apple.com/us/reviews/id188099770","version":"3.1.1","score":1,"title":"Good Camera but frequent disconnects","text":"Camera quality is great and the ability to \"look\" through the windows is great. Problem is that it frequently disconnects and\ncant then be remotely reset. Its not the problem of my network, since I have Canary and Nest cams as well and they never go down\n\nUpdate\n\nSoftware has improved but still goes offline for no reason. Doesnt happen to other cams. Till software is fixed and remote reset is not enabled, this camera is useless\n\nUpdate\n\nStill goes offline without reason","updated":"2017-11-09T14:23:03-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1660516028","userName":"Tri George","userUrl":"https://itunes.apple.com/us/reviews/id117188852","version":"2.3","score":1,"title":"Constant Poor Connectivity","text":".... and to waste your time in addition to your money, app will state and give you appearance that problem is with your internet and have you running around in \"circles\" before you realize problem is Logitech.\n\nI wouldn't buy this camera again!","updated":"2017-06-28T00:28:27-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7813238366","userName":"dkw42","userUrl":"https://itunes.apple.com/us/reviews/id41198752","version":"3.5.2","score":1,"title":"Can no longer log in","text":"After a recent update, the authentication seems to have moved to the web.  So the app bounces me to a web page which bounces me back to the app, but fails to log me in.  So I can no longer use any of my cams.","updated":"2021-09-16T13:35:30-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"4843225920","userName":"Stormchaser2f5","userUrl":"https://itunes.apple.com/us/reviews/id175823764","version":"3.4.4","score":1,"title":"Sometimes works sometime doesn’t.","text":"Would not recommend these cameras or the company. I’ve had packages delivered with no alerts or record of them being there. Customer service is slow to respond, and generally useless. Cameras go offline for no apparent reason. Very unreliable.","updated":"2019-09-26T19:46:39-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"4508623544","userName":"servsite","userUrl":"https://itunes.apple.com/us/reviews/id27309247","version":"3.4.3","score":2,"title":"App constantly crashes.","text":"Reviewing past recordings (that I pay for) is very difficult. About 2 times out of three the app crashes before I can get to time I’m looking for (usually earlier the same day).","updated":"2019-07-23T19:45:31-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7582898851","userName":"b1tt3f1x1T","userUrl":"https://itunes.apple.com/us/reviews/id567036117","version":"3.5","score":1,"title":"Latest update broke everything","text":"Constantly prompted to login and then the a constant loop back to the website and app and I can’t login to see the camera. They better fix this soon. Single sign on was a bad idea.","updated":"2021-07-16T05:25:40-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2115792174","userName":"J0nathan!","userUrl":"https://itunes.apple.com/us/reviews/id30002639","version":"3.1.4","score":2,"title":"Great camera but so many issues","text":"Pros:\n-Easy to set up\n-Compatibility with HomeKit is great\n-Great mic and audio feedback\n-Picture is average if not less than average\n\nCons: \n-Fee for premium features if ridiculous. Price should be lower\n-Picture quality (dynamic range) is a night and day difference when viewing camera’s live feed through Apple’s “Home” app\n-Logi application needs to be easier to navigate with better UI\n-Apple TV application would be an amazing feature","updated":"2018-01-22T10:26:57-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7754670142","userName":"The Appening","userUrl":"https://itunes.apple.com/us/reviews/id138253265","version":"3.5.2","score":1,"title":"authentication is broken","text":"The app keeps making me log in again and again, I had enough of it… this app has been total crap for years now, not buying a Logitech camera ever again.","updated":"2021-08-31T03:00:54-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7723496249","userName":"guadalupchez","userUrl":"https://itunes.apple.com/us/reviews/id136026957","version":"3.5.2","score":1,"title":"Useless","text":"Will not stay logged in. Forces me into a loop of the app opening a web browser that almost immediately launches the app. Haven’t been able to use the app in a few months due to this issue.","updated":"2021-08-22T16:56:47-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"4920988732","userName":"Lico_Investments","userUrl":"https://itunes.apple.com/us/reviews/id43420807","version":"3.4.4","score":3,"title":"Needs work","text":"Ok camera. I only get updates when I am actually viewing the Live screen on the app- otherwise, I never get motion detection updates.","updated":"2019-10-10T19:13:59-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7725442605","userName":"tc@1991","userUrl":"https://itunes.apple.com/us/reviews/id440928910","version":"3.5.2","score":1,"title":"Login is a perpetual cycle","text":"I can’t login to this stupid app. I have my cameras setup but it won’t allow me to login. It keeps taking me to the online login, then back to the app over and over again. \n\nPlease fix this bug right away!","updated":"2021-08-23T06:07:42-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2368169763","userName":"CALI RAE","userUrl":"https://itunes.apple.com/us/reviews/id105228454","version":"3.2.2","score":3,"title":"Loading issues","text":"Why does it this keep happening? It just loads and loads. I’ve checked if it was my internet, but it’s not. It’s the app. AGAIN.","updated":"2018-03-31T10:00:14-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7512399918","userName":"Maher2112","userUrl":"https://itunes.apple.com/us/reviews/id18911441","version":"3.5","score":1,"title":"Poor tech","text":"Severe latency, poor wireless performance even when the camera is in same room and new WiFi access point.  Much better choices in residential camera systems out there. Dont waste your hard earned cash.","updated":"2021-06-27T09:20:47-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7854965680","userName":"Jllopez1996","userUrl":"https://itunes.apple.com/us/reviews/id625558918","version":"3.5.2","score":1,"title":"I can’t used my cameras anymore","text":"For more than a month I can used my cameras, I already installed a Nest Camera to trying to solve the problems but spend more money because this application don’t work.","updated":"2021-09-28T10:21:08-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7565296404","userName":"erinkaywebster","userUrl":"https://itunes.apple.com/us/reviews/id102898919","version":"3.5","score":1,"title":"Latest update causing problems","text":"after the latest update my logi circle app logs me out every time I exit the app & I have to go the rough the whole login process each time I want to check my camera.","updated":"2021-07-11T11:49:18-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7865993245","userName":"DBATC!","userUrl":"https://itunes.apple.com/us/reviews/id209202118","version":"3.5.2","score":1,"title":"App broken with iOS 15 update","text":"The secure login always takes several try’s to work on an iPhone, but since the iOS 15 update nothing works and I just get a blank login screen for secure sign-in.","updated":"2021-10-01T09:00:18-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3844520576","userName":"Olive26130","userUrl":"https://itunes.apple.com/us/reviews/id101731493","version":"3.4","score":2,"title":"Do the job but hate the horizontal mode","text":"The app is great but please, do not force the app to run in horizontal mode. Develop a vertical one like Arlo, it is more convenient. Phone are bigger and bigger trough the years, it is cumbersome to use it with one hand in horizontal.","updated":"2019-03-04T23:47:46-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7482855593","userName":"davetrav","userUrl":"https://itunes.apple.com/us/reviews/id36386171","version":"3.5","score":1,"title":"They broke it","text":"Has been great. Recent update has me log in every time and this most recent time prompts to open in safari and then safari prompts to open the app - and round and round we go. Garbage if I can’t use it.","updated":"2021-06-19T09:33:40-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7566467848","userName":"Kwithers2000","userUrl":"https://itunes.apple.com/us/reviews/id35057665","version":"3.5","score":2,"title":"Repeated Logins","text":"What is going on with this app? Every time I open the app, it now opens a new chrome window and makes me sign in, then takes me back to the app. Super annoying","updated":"2021-07-11T20:01:12-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2274904585","userName":"Kevin in KC","userUrl":"https://itunes.apple.com/us/reviews/id29598439","version":"3.2.1","score":1,"title":"Save your money","text":"Total waste of money and time. Worked for about two weeks, now will not connect no matter what we do -- including following worthless directions from support. Hoping to get my money back on the camera.","updated":"2018-03-05T14:11:25-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7907503895","userName":"Unhappy Mat","userUrl":"https://itunes.apple.com/us/reviews/id1338330235","version":"3.5.2","score":1,"title":"Garbage","text":"Just got an alert that it detected movement in my garage.  Haven’t logged in since I updated app.  It won’t let me log in. Just sends me to another page that does nothing. It’s going to be for sale cheap when I get home.","updated":"2021-10-12T11:56:40-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1503181233","userName":"Aydall","userUrl":"https://itunes.apple.com/us/reviews/id150970710","version":"2.1","score":2,"title":"The latest update has a problem","text":"After updating, I can't see 24 hours footage record and also daily brief doesn't work, too. Please fix these bugs.","updated":"2016-12-16T16:27:24-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"4226397683","userName":"iTunes Enthusiast","userUrl":"https://itunes.apple.com/us/reviews/id128623030","version":"3.4.2","score":1,"title":"Landscape only?","text":"Fire whoever decided to force landscape view only. What a hassle when you’re trying to get a quick view of the house while you’re out.  Even in the settings they force you to use landscape!","updated":"2019-05-28T11:38:22-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3595773581","userName":"@heyart","userUrl":"https://itunes.apple.com/us/reviews/id42453182","version":"3.3.1","score":5,"title":"Perfect companion to HomeKit app","text":"Great companion to the HomeKit app for those times you need to go back and view older recordings.","updated":"2018-12-31T06:09:18-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1405998607","userName":"4psuri","userUrl":"https://itunes.apple.com/us/reviews/id123669021","version":"1.6.1","score":2,"title":"Could be better","text":"Wish that it has volume to turn up do I need not yell on my phone. Wish the screen isn't pixelated, is there a way to make it clear...","updated":"2016-07-05T11:04:13-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7755492643","userName":"eerick187","userUrl":"https://itunes.apple.com/us/reviews/id695484677","version":"3.5.2","score":1,"title":"Horrible product","text":"Camera constantly goes offline and does not reset I’ve tried everything and nothing works","updated":"2021-08-31T07:32:57-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7731694436","userName":"KDub 101010","userUrl":"https://itunes.apple.com/us/reviews/id392576499","version":"3.5.2","score":1,"title":"Broke like a joke","text":"Everyone needs to be aware that smart location will not stay on at all once you close the app. The login is not working and may be related. The security of this is now at 0.","updated":"2021-08-24T23:32:11-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7483682473","userName":"Redhead301","userUrl":"https://itunes.apple.com/us/reviews/id327885288","version":"3.5","score":1,"title":"Have to login every time I open opp","text":"I have used this app for years successfully. Since the last update I have to login every time I want to view my cameras which is extremely inconvenient.","updated":"2021-06-19T15:00:29-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7087845009","userName":"lola5850","userUrl":"https://itunes.apple.com/us/reviews/id265962498","version":"3.4.5","score":1,"title":"Always offline!","text":"The app and cameras are useless. It doesn’t work with HomeKit. It’s constantly goes offline. You can’t use the app to reset the camera after it disconnects from WiFi. You have to physically reset.","updated":"2021-03-10T10:13:03-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"6368305631","userName":"Rey_702","userUrl":"https://itunes.apple.com/us/reviews/id145691947","version":"3.4.5","score":1,"title":"Only good when you still have warranty","text":"Just finished talking to their tech support and after all of the procedure she asked me to do it ended that the device Circle K2 is no longer good that it won’t ever connect to the cloud.","updated":"2020-08-27T17:29:28-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2812599722","userName":"Ray'0","userUrl":"https://itunes.apple.com/us/reviews/id113307616","version":"3.2.3","score":1,"title":"Aggravating","text":"Keeps telling my WiFi setup error even when it tells me that the network and password is accurate but still won’t connect. Looks like it time for a new camera by a different company","updated":"2018-07-01T06:59:46-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7555339689","userName":"💜😊😝","userUrl":"https://itunes.apple.com/us/reviews/id20177150","version":"3.5","score":1,"title":"Very disappointing","text":"Same problems as others app won’t let me sign in so can’t see camera. Totally disappointing it like they are forcing you to buy new cameras which trust me I won’t be doing","updated":"2021-07-08T19:43:33-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7487195313","userName":"Crazy Hedgehog","userUrl":"https://itunes.apple.com/us/reviews/id29487534","version":"3.5","score":1,"title":"Worst app ever","text":"App was not great before the update. Latest update completely broke it. Asks to log in every time and then doesn’t actually log in and goes back to log in page. Waste of money.","updated":"2021-06-20T13:16:17-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1890051805","userName":"M A 4","userUrl":"https://itunes.apple.com/us/reviews/id35543469","version":"3.1.1","score":1,"title":"Spontaneously stopped working","text":"One day Logi's service randomly stopped sending notifications. I can review events in the app if I check manually, but get no alerts that anything has happened. Useless for security.\n\nAlso, doesn't support Bluetooth headphones.","updated":"2017-11-01T08:12:04-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7861344831","userName":"RhoMc","userUrl":"https://itunes.apple.com/us/reviews/id276295379","version":"3.5.2","score":1,"title":"App doesn’t work since update?","text":"App doesn’t work since update my phone to IOS 15 and I have spent a couple hours on with support. No answers. When will this issue be resolved?","updated":"2021-09-30T04:50:52-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7680476535","userName":"Elletea2","userUrl":"https://itunes.apple.com/us/reviews/id238328813","version":"3.5.2","score":1,"title":"Just throw away the entire system.","text":"What is the use of having this system if the app doesn’t work and hasn’t worked since they “updated” it.","updated":"2021-08-11T05:27:01-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7663091480","userName":"Crazy Lori","userUrl":"https://itunes.apple.com/us/reviews/id33087937","version":"3.5.1","score":1,"title":"Why did you change an app that worked???","text":"Simply DOES NOT WORK ANYMORE!! Please go back to earlier versions of the app. Why do these companies feel the need to ruin perfectly working apps with updates!!! Absolutely INSANE","updated":"2021-08-06T14:54:46-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3250013481","userName":"DanieI L","userUrl":"https://itunes.apple.com/us/reviews/id87528468","version":"3.3","score":1,"title":"Camera Always Offline","text":"Camera constantly goes offline within less than 12 hours of use. The only way to resolve the issue is to physically restart the camera. Not a very useful “feature”.","updated":"2018-09-30T19:51:28-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1510407474","userName":"jskalia","userUrl":"https://itunes.apple.com/us/reviews/id103375488","version":"2.2","score":4,"title":"Great!","text":"Excellent fast performance but needs an apple TV app .. So if the baby is sleeping in the room the apple TV can be switch on to monitor the video","updated":"2016-12-27T18:17:48-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7859023390","userName":"bcarneiro","userUrl":"https://itunes.apple.com/us/reviews/id73016518","version":"3.5.2","score":1,"title":"Horrible login experience. Does not work.","text":"Takes you out of the app to login and rarely works. Terrible since they added this “feature”.","updated":"2021-09-29T12:08:37-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7155840873","userName":"Sidawimalek","userUrl":"https://itunes.apple.com/us/reviews/id235975442","version":"3.4.5","score":5,"title":"Hello","text":"iOS 14.4.1 new update the app freeze u can’t do anything!.","updated":"2021-03-28T12:20:45-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2066276955","userName":"vgamer","userUrl":"https://itunes.apple.com/us/reviews/id32029031","version":"3.1.4","score":1,"title":"Won’t work we last update.","text":"Not sure if it’s the App or the iOS update but hasn’t worked in the last week or so. Had no problem for over a year but now it just stays on the logo screen and loads and loads and loads. Help!!","updated":"2018-01-07T08:14:46-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1620438803","userName":"jsenior","userUrl":"https://itunes.apple.com/us/reviews/id18430583","version":"2.3","score":3,"title":"Add portrait support to get 4 stars","text":"This app could be really great if it was to support portrait mode and a tablet design that shows multiple camera feeds in a single view.","updated":"2017-05-21T16:14:28-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"4030441918","userName":"Zeke769","userUrl":"https://itunes.apple.com/us/reviews/id536041582","version":"3.4.2","score":2,"title":"Live Feed takes forever to load.","text":"Nice camera, nice app. Live feed takes forever to come live. \n1-2 minutes to come live on a wired camera, 12 feet from an excellent WiFi router is unforgivable.","updated":"2019-04-18T18:39:41-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3969504399","userName":"Circle Customer","userUrl":"https://itunes.apple.com/us/reviews/id416846374","version":"3.4.2","score":2,"title":"App Has Become Useless","text":"I have 4 Circle cams (3 years) and the app stalls loading any/all with the 'loading' spinner running continuously!   ALL cams load fine from PC in web browser!\n\nPlease fix!  PS: Love all my Circle cams!","updated":"2019-04-04T11:35:47-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1412255622","userName":"JakeT2","userUrl":"https://itunes.apple.com/us/reviews/id38782000","version":"1.7","score":2,"title":"It needs to record longer clips.","text":"As far as I can tell, it only records after it sees motion. Then it only records for a short time, so it usually doesn't record long enough clips.","updated":"2016-07-15T00:10:22-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7493602096","userName":"DigitalSL","userUrl":"https://itunes.apple.com/us/reviews/id32753145","version":"3.5","score":1,"title":"Update broke","text":"Update broke a lot of things for me massive stability issues. Have contacted support they are useless very disappointed. Have been using for years without issues!","updated":"2021-06-22T08:21:17-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"4187092924","userName":"Wtzca","userUrl":"https://itunes.apple.com/us/reviews/id14220206","version":"3.4.2","score":2,"title":"Terrible app, nice hardware","text":"I’m incredibly disappointed. The hardware is nice and polished and supports HomeKit, but then I downloaded the app, and it’s garbage. It’s basically incomplete/beta abandonware. I have several other HomeKit accessories and this is by far the worst, jankiest app.","updated":"2019-05-21T10:15:39-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7834012026","userName":"PearlJamFanDan","userUrl":"https://itunes.apple.com/us/reviews/id29711814","version":"3.5.2","score":1,"title":"App has been broken for months","text":"The login issues have made this app absolutely unusable for months now. I guess it’s time to throw these cameras in the garbage where the software belongs.","updated":"2021-09-22T11:38:45-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7646163399","userName":"Mishhh_el","userUrl":"https://itunes.apple.com/us/reviews/id121654803","version":"3.5.1","score":1,"title":"App is so buggy","text":"I LOVED this camera and app until recently. I can’t keep my app open for monitoring now without it kicking me out of the app and logging me out all together.. every single night.","updated":"2021-08-02T04:34:33-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7744106378","userName":"Weddingbody","userUrl":"https://itunes.apple.com/us/reviews/id175356974","version":"3.5.2","score":1,"title":"What’s the Point if I can’t log in???","text":"it’s a circular nightmare of clicking the app, taking me to safari, back to the app. do I have 3 useless cameras now bc of a broken app??? I don’t understand what to do with this investment??","updated":"2021-08-28T05:20:46-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3360795976","userName":"Great Danton","userUrl":"https://itunes.apple.com/us/reviews/id152725635","version":"3.3.1","score":2,"title":"Takes too much space","text":"App occupies too much space on my iphone. Need to get more efficiency and automatically delete videos from prior days.","updated":"2018-10-30T03:57:32-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1510189798","userName":"cassandra6166","userUrl":"https://itunes.apple.com/us/reviews/id144235919","version":"2.2","score":2,"title":"Notification","text":"After the new update the circle doesn't send notification anymore","updated":"2016-12-27T08:20:59-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1685116891","userName":"Sean reynoldscs","userUrl":"https://itunes.apple.com/us/reviews/id16497807","version":"3.0","score":1,"title":"No longer transmits sound during live feed","text":"This application rendered all of our cameras obsolete as it no longer allows me to listen to our baby inter baby room or hear any live camera feed only recorded feeds have audio.","updated":"2017-07-16T14:59:24-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7699390531","userName":"sarah277863147943","userUrl":"https://itunes.apple.com/us/reviews/id34190137","version":"3.5.2","score":1,"title":"App won’t open","text":"Was having some of the issues other reviewers wrote about with a login loop. Now, my phone updated to 14.7.1 and this app won’t even open.","updated":"2021-08-16T06:28:24-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"4908664212","userName":"Disbull","userUrl":"https://itunes.apple.com/us/reviews/id31551120","version":"3.4.4","score":4,"title":"Good wired camera","text":"I’m liking the camera a lot. But the app needs to support portrait orientation on the phone.","updated":"2019-10-08T04:12:18-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"5884724113","userName":"Jamesnao","userUrl":"https://itunes.apple.com/us/reviews/id101099056","version":"3.4.5","score":2,"title":"Work good then... Stopped working","text":"App is awful and never connects. Might update if the app let me\nIn or connected my camera ever","updated":"2020-04-30T09:55:38-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1464771253","userName":"Erin77826","userUrl":"https://itunes.apple.com/us/reviews/id107139525","version":"2.0.1","score":1,"title":"Don't buy","text":"It's 3am and the app ha completely crashed on me.  It's very unreliable and therefore unsafe.  My internet and wifi are both working fine so it has nothing to do with either of those things.  My advice, get the nest cam instead.","updated":"2016-10-11T00:58:45-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7740669681","userName":"Wwwbrianspdrcom","userUrl":"https://itunes.apple.com/us/reviews/id102627843","version":"3.5.2","score":1,"title":"What happened","text":"This used to work a few months ago… I’ve sent emails to support with no response.. \nwhat can I do to get this to work again?","updated":"2021-08-27T06:51:16-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7866638412","userName":"Fix ur app Bruhhh","userUrl":"https://itunes.apple.com/us/reviews/id248424395","version":"3.5.2","score":1,"title":"App is broken","text":"App sometimes works, app will keep you a cycle of logging in on their website then redirecting to the app, but never actually lets you. Login","updated":"2021-10-01T13:14:07-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7554664088","userName":"D.Monica","userUrl":"https://itunes.apple.com/us/reviews/id633648538","version":"3.5","score":1,"title":"WTH","text":"I don’t know what’s going on, I don’t have any monitoring since the update, constantly logs me out. It shows no detection and the little times that it has I have to log in all over again. SMH!","updated":"2021-07-08T15:00:02-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7543376400","userName":"guess whos at your house","userUrl":"https://itunes.apple.com/us/reviews/id953511731","version":"3.5","score":1,"title":"Don’t buy Logi circle cameras","text":"Use to be ok but just when I needed camera the most it won’t let you see what’s going on but gives alert for motion detection......I will be replacing it with ring or nest...","updated":"2021-07-05T15:46:04-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7525059261","userName":"JScullin","userUrl":"https://itunes.apple.com/us/reviews/id20349608","version":"3.5","score":1,"title":"App is now useless","text":"Latest update causes you to log in every time and dismiss prompts.\n\n6/29: app still broken. Older footage takes forever to load if it even does.","updated":"2021-06-30T18:17:34-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7658851604","userName":"dslo1","userUrl":"https://itunes.apple.com/us/reviews/id21305354","version":"3.5.1","score":1,"title":"They broke it","text":"Nice job messing up something that worked. Why am I directed to open the app in browser?!  It doesn’t even work most of the time.  Not good for an important emergency app.","updated":"2021-08-05T11:26:36-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7517680362","userName":"Stan!?","userUrl":"https://itunes.apple.com/us/reviews/id102691251","version":"3.5","score":1,"title":"Stay away from latest update","text":"Latest update is a train wreck- forces you to go through a useless login process every time . Make it stop please.","updated":"2021-06-28T20:06:28-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3384523110","userName":"RLJP","userUrl":"https://itunes.apple.com/us/reviews/id44076078","version":"3.3.1","score":1,"title":"Ever-growing App Size","text":"Bad app, it has a bug that makes the app size grow endless, until you have no space left in your phone. The only solution is the delete and install again.","updated":"2018-11-05T10:22:00-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2679385429","userName":"Danilo_","userUrl":"https://itunes.apple.com/us/reviews/id29414942","version":"3.2.3","score":2,"title":"Forced landscape mode is awful","text":"I hate that I have to use this in landscape mode. It’s incredibly awkward and I’m always hitting the menu button by accident. Crummy.","updated":"2018-06-11T19:39:56-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1443296095","userName":"lijujacob","userUrl":"https://itunes.apple.com/us/reviews/id42089935","version":"2.0","score":1,"title":"Trending in the wrong direction","text":"Why do you guys have a subscription button covering my screen. I loved the app before. Please try to improve the experience with each iteration not make some aspects worse.","updated":"2016-09-02T05:14:00-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7870989367","userName":"g*dubs","userUrl":"https://itunes.apple.com/us/reviews/id11022765","version":"3.5.2","score":1,"title":"Can’t login on iOS anymore","text":"It’s a never ending loop to try to authenticate and login on a website. Please update the app so that we can successfully access our cameras.","updated":"2021-10-02T16:49:00-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7863584848","userName":"Melissa052787","userUrl":"https://itunes.apple.com/us/reviews/id511323782","version":"3.5.2","score":1,"title":"Kicked off","text":"Constantly getting kicked out and not able to log back in! So frustrating","updated":"2021-09-30T18:41:08-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7689797837","userName":"laserpilot","userUrl":"https://itunes.apple.com/us/reviews/id11041511","version":"3.5.2","score":1,"title":"Still broken","text":"Still broken on login. Bought some other cameras instead.","updated":"2021-08-13T16:29:16-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7487888251","userName":"Cshynat","userUrl":"https://itunes.apple.com/us/reviews/id29698228","version":"3.5","score":1,"title":"Can’t Log Into App","text":"I haven’t been able to log in all day and now the app won’t even load. I don’t understand the reasons for the recent changes.","updated":"2021-06-20T18:42:09-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"4131054537","userName":"CJ Modiano","userUrl":"https://itunes.apple.com/us/reviews/id28621313","version":"3.4.2","score":1,"title":"Smart location doesn’t work.","text":"You’ll get dozens of alerts per day when you’re just walking around your house, so you have to turn alerts off. Kind of beats the point?","updated":"2019-05-10T17:49:29-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7806356784","userName":"Stevencapffa","userUrl":"https://itunes.apple.com/us/reviews/id180221396","version":"3.5.2","score":1,"title":"App error and fix","text":"I had the login issue like everyone else.  Apparently you have to delete the app and reinstall it to fix….","updated":"2021-09-14T12:53:37-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7655584342","userName":"Jupp66","userUrl":"https://itunes.apple.com/us/reviews/id34007716","version":"3.5.1","score":1,"title":"Used to be a great app. Login  now a mess","text":"I share the same terrible experience like the many other reviews. \nFrequent log offs with a terrible authentication experience.","updated":"2021-08-04T15:10:06-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7479800034","userName":"ridefordtp","userUrl":"https://itunes.apple.com/us/reviews/id108389596","version":"3.5","score":1,"title":"Latest Update","text":"I don’t know how you go from having a really good platform to doing a update on the app which causes the app to be absolutely horrible.","updated":"2021-06-18T14:12:00-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3478276064","userName":"logiConcered","userUrl":"https://itunes.apple.com/us/reviews/id43703312","version":"3.3.1","score":1,"title":"Recent firmware breaks quality!","text":"5.6.28 firmware update almost completely breaks this camera. Image reduction. Brightness levels are out of wack. Seems stuck in low-res even when set to high-res. Let us downgrade or fix this!","updated":"2018-11-30T10:44:09-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2316242576","userName":"Galdito23","userUrl":"https://itunes.apple.com/us/reviews/id213007173","version":"3.2.1","score":3,"title":"Nice App! Will be better with iPhone X support","text":"Great app but it needs the iPhone X support ASAP for full screen... I read that is coming in the next update! 👏🏼","updated":"2018-03-17T08:25:28-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2517949753","userName":"adamcnaglich","userUrl":"https://itunes.apple.com/us/reviews/id42449971","version":"3.2.3","score":1,"title":"No Response...","text":"Often fails to load the video feed from the Home app. HomeKit is the only reason I bought this camera.\n\nAlso, why is the app locked in a landscape view?","updated":"2018-05-07T17:06:00-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2093603408","userName":"Ticker1","userUrl":"https://itunes.apple.com/us/reviews/id105054961","version":"3.1.4","score":5,"title":"Great App","text":"This is by far the best app out there for a WiFi camera.   Love it!!!","updated":"2018-01-15T21:02:00-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1627935195","userName":"Del63bitdhk","userUrl":"https://itunes.apple.com/us/reviews/id38622544","version":"2.3","score":1,"title":"Logs Out, Geofencing Meh","text":"Logs out randomly, defeating the point of the camera since no security alerts are sent. Geofencing isn't great, but workable. Always sends me a message about activity 5 minutes after I leave.","updated":"2017-05-29T11:19:27-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7823306534","userName":"Lineymclinerson","userUrl":"https://itunes.apple.com/us/reviews/id167899334","version":"3.5.2","score":1,"title":"Stop logging me out!","text":"Why is this app constantly logging me out now? So frustrating. This plus the near constant recording of the “motion sensor” is indicating a trend towards the garbage can.","updated":"2021-09-19T09:47:24-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7543254187","userName":"randyv760","userUrl":"https://itunes.apple.com/us/reviews/id38455802","version":"3.5","score":1,"title":"Worst update ever","text":"Latest update turned a once useful app into an endless loop of attempted logins at the website then failure to launch! You have my hefty yearly subscription $$$ and rendered it useless! FIX THIS!!!","updated":"2021-07-05T14:53:05-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3492186871","userName":"SteveBurneo","userUrl":"https://itunes.apple.com/us/reviews/id85168498","version":"3.3.1","score":1,"title":"Wireless does not work with HomeKit","text":"I don’t mind connecting the camera to a power source to get HomeKit working , but the message still is , Home kit does not accept wire free cameras !!! Yet ? When ? This year ? Never ? Waiting on apple ??\n\nPoorly developed app for such a great hardware","updated":"2018-12-04T03:44:09-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2008463546","userName":"ASuperSnave","userUrl":"https://itunes.apple.com/us/reviews/id24910802","version":"3.1.3","score":1,"title":"App no longer works on iPad","text":"Always been a buggy, problematic app and product. Now, though, the app won't even open after installing the latest update.","updated":"2017-12-18T23:46:25-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7737543545","userName":"c8168","userUrl":"https://itunes.apple.com/us/reviews/id230393924","version":"3.5.2","score":1,"title":"Could not login at all","text":"What is going on. Most expensive camera I bought and now useless. Want old app back","updated":"2021-08-26T09:52:18-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7677478819","userName":"DinuteKa","userUrl":"https://itunes.apple.com/us/reviews/id334788081","version":"3.5.2","score":1,"title":"Unable to login","text":"Havent been able to login into the app for days now. App is up to date.  No support online either. Dissatisfied","updated":"2021-08-10T09:40:38-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7672996756","userName":"Owney Me Boy","userUrl":"https://itunes.apple.com/us/reviews/id29832904","version":"3.5.2","score":1,"title":"Still Broken in August","text":"The new login process does not work. It is useless. Do not buy Circle cameras. I’m switching to Ring or Nest unless they fix this mess that they created.","updated":"2021-08-09T06:46:25-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7501114609","userName":"LKirkand","userUrl":"https://itunes.apple.com/us/reviews/id33256090","version":"3.5","score":1,"title":"App completely broken","text":"App was working ok but the latest update lost my setup and login info, and I cannot get logged in or setup again.","updated":"2021-06-24T08:34:29-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3762251509","userName":"Eagleone5","userUrl":"https://itunes.apple.com/us/reviews/id27366470","version":"3.3.1","score":2,"title":"Please add so Cam can run an Alexa routine on motion.","text":"This app should be able to run an Alexa routine based on motion like RING. Audio is to low and takes forever to load on my Giga Verizon network.","updated":"2019-02-12T09:13:51-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1635789476","userName":"Tad Gunderson","userUrl":"https://itunes.apple.com/us/reviews/id15187228","version":"2.3","score":1,"title":"It just does not work","text":"Do not get this. Do not buy it. You are probably seeing it on sale, there is a reason why. Don't bother trying to get support help they will not answer or respond. Logitech is reaching new lows.","updated":"2017-06-06T17:05:19-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7731322108","userName":"ES(US)","userUrl":"https://itunes.apple.com/us/reviews/id1020226729","version":"3.5.2","score":1,"title":"Update Rendered Hardware Unuseable","text":"The most recent update has rendered the system inoperable, and LogiTech refuses to fix it.  Saw a mention in a forum of a class action lawsuit, please post contact information for the law firm.","updated":"2021-08-24T20:57:09-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7542601005","userName":"LL8707","userUrl":"https://itunes.apple.com/us/reviews/id1306474414","version":"3.5","score":1,"title":"So frustrated.","text":"I really hate having to log in every single time I want to look at the camera. Please please fix that 😫","updated":"2021-07-05T10:32:53-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7536706838","userName":"VCtheGreatNJ","userUrl":"https://itunes.apple.com/us/reviews/id243529827","version":"3.5","score":1,"title":"FIX THE APP","text":"All of sudden I cannot login and when I go to reset my password it says the link is expired. Support is an absolute joke too. Still not resolution in site.","updated":"2021-07-03T20:21:47-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"5439729233","userName":"elpapi colombiano","userUrl":"https://itunes.apple.com/us/reviews/id42042847","version":"3.4.5","score":1,"title":"Cam works at times not good","text":"Expensive Camara. Sometimes it works and now is not working. Horrible unfriendly product I don’t recommend it to anybody","updated":"2020-01-23T10:43:51-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3846210963","userName":"satzinger","userUrl":"https://itunes.apple.com/us/reviews/id21226238","version":"3.4","score":2,"title":"Recent update has an issue","text":"When reviewing a previously recorded event, the timeline/scrub icon are hard to grab, and often result in closing the app/panning the footage...","updated":"2019-03-05T09:30:56-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2043278573","userName":"TexasAviator","userUrl":"https://itunes.apple.com/us/reviews/id281663334","version":"3.1.4","score":2,"title":"Fix it.","text":"Latest update kills the app. Will no longer open. Continuously get the rotating green circle of death. Fix this please.","updated":"2017-12-30T22:38:03-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7499290126","userName":"Bhnu","userUrl":"https://itunes.apple.com/us/reviews/id42523960","version":"3.5","score":1,"title":"Latest update broken","text":"I need to login every time I want to check my cameras. Ridiculous, inconvenient, unusable.","updated":"2021-06-23T20:53:31-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2215680553","userName":"ChopinBlues","userUrl":"https://itunes.apple.com/us/reviews/id36427342","version":"3.2","score":3,"title":"-2 stars for lack of iPhone X support","text":"C’mon guys, it’s been 4 months.   Even many of the obscure no-name apps support the iPhone X screen by now.","updated":"2018-02-16T12:32:03-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7868319639","userName":"Bryan_Bell","userUrl":"https://itunes.apple.com/us/reviews/id149923689","version":"3.5.2","score":1,"title":"Pointless","text":"After seeing these ratings clearly this is pointless lol they clearly aren’t working on fixing this","updated":"2021-10-02T00:52:30-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7601093234","userName":"TheBigBezona","userUrl":"https://itunes.apple.com/us/reviews/id15897237","version":"3.5","score":1,"title":"Broken","text":"The latest app update is so bad, it almost seems intentional. I’m replacing my camera with a Ring camera and throwing the Logi camera in the trash wheee it belongs.","updated":"2021-07-21T03:23:56-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7723418113","userName":"troubleclef5","userUrl":"https://itunes.apple.com/us/reviews/id27540877","version":"3.5.2","score":1,"title":"Still broken…","text":"Login is still circular and location settings keep getting disabled. I’m about to quit Logitech altogether.","updated":"2021-08-22T16:19:22-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3264762681","userName":"Innovat0r","userUrl":"https://itunes.apple.com/us/reviews/id131197849","version":"3.3","score":5,"title":"It works","text":"Hope they will add Siri Shortcuts soon.","updated":"2018-10-04T19:42:21-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7497206928","userName":"planetmarsalarm","userUrl":"https://itunes.apple.com/us/reviews/id289700871","version":"3.5","score":1,"title":"Terrible App and Customer Experience","text":"App now forces web login EACH TIME you wish to check your cameras.  This needs to be resolved IMMEDIATELY.","updated":"2021-06-23T07:18:34-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"5287826631","userName":"jcao","userUrl":"https://itunes.apple.com/us/reviews/id27883631","version":"3.4.5","score":1,"title":"Annoying Horizontal-only design","text":"The creators of this app decided to cheap-out and only allow it to work in a horizontal orientation, hence the one star review.","updated":"2019-12-18T08:52:15-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"4650569445","userName":"Noefresh","userUrl":"https://itunes.apple.com/us/reviews/id29098660","version":"3.4.3","score":1,"title":"Not ready for prime time.","text":"I Was looking for an alternative to nest. This is not it unfortunately. Really horrible app and the Camera constantly loses connection inches away from a router. Do not bother.","updated":"2019-08-21T08:59:06-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7508472651","userName":"g.grapeape","userUrl":"https://itunes.apple.com/us/reviews/id29263721","version":"3.5","score":1,"title":"Single sign on broke app","text":"The app no longer works rendering devices useless. Logi tech support thus far (over a week of back and forth) useless.","updated":"2021-06-26T08:21:30-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7652437884","userName":"Rck cola","userUrl":"https://itunes.apple.com/us/reviews/id26628469","version":"3.5.1","score":1,"title":"Can no longer login to see the footage","text":"I just get redirected between the app and the login screen. Please fix","updated":"2021-08-03T19:55:36-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2979184006","userName":"jessety","userUrl":"https://itunes.apple.com/us/reviews/id34962662","version":"3.2.5","score":4,"title":"Not bad, but missing Apple TV app","text":"Would be perfect if there was an Apple TV app","updated":"2018-07-27T13:21:55-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7620830198","userName":"Nomoretryz","userUrl":"https://itunes.apple.com/us/reviews/id372767045","version":"3.5.1","score":1,"title":"USED TO BE GOOD","text":"Now NOT SO GOOD FOR WORKING \nDon’t know what they changed BUT Now you have to sign in all the time and that takes forever.\n    Not Worth it. It was a gift and it was expensive. 1/8star","updated":"2021-07-26T10:26:56-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7535776193","userName":"BZ/CZ/PZ/SOX","userUrl":"https://itunes.apple.com/us/reviews/id223750945","version":"3.5","score":1,"title":"New “ update” is a watergate!","text":"Horrible ; can’t used finger print ID. Logs u out constantly off line horrible spend your money elsewhere","updated":"2021-07-03T13:19:35-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1684924275","userName":"WalksOnAir","userUrl":"https://itunes.apple.com/us/reviews/id26296033","version":"3.0","score":1,"title":"Fatal Bug","text":"New yellow icon app stopped transmitting sound (I learned that it might after I hit the microphone first!). Failed to alert me to my kids cries after updating from the blue icon app. Not what I expect.","updated":"2017-07-16T10:09:26-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7827859653","userName":"PattiFarr","userUrl":"https://itunes.apple.com/us/reviews/id190028441","version":"3.5.2","score":1,"title":"WHY CANT I LOG INNNNNNN","text":"Ridiculous! I cannot look at my cameras because when I log in, I go back to the log in screen to log in. Repeat. Repeat.  Repeat. Omg.","updated":"2021-09-20T17:13:38-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7660039233","userName":"CrossfitUS","userUrl":"https://itunes.apple.com/us/reviews/id259225521","version":"3.5.1","score":1,"title":"Login experience leaves you wanting more","text":"Let’s just say the login experience is terrible…","updated":"2021-08-05T19:56:24-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1803978969","userName":"Dan----","userUrl":"https://itunes.apple.com/us/reviews/id38747518","version":"3.1.1","score":1,"title":"Very bad so far","text":"Can't change ANY of the settings in the app. Does not connect to live stream either. App setting is for a max recording time of 60s. For surveillance??? I hope I'm mistaken.","updated":"2017-09-22T10:16:10-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1520568877","userName":"Rocco Ward","userUrl":"https://itunes.apple.com/us/reviews/id278466548","version":"2.2","score":1,"title":"They advertise motion notifications, but they simple do not work","text":"Motion detection notifications do not work. I have called many times but still no fix.","updated":"2017-01-12T05:46:20-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2010613079","userName":"Burnt Macklins","userUrl":"https://itunes.apple.com/us/reviews/id32309948","version":"3.1.3","score":2,"title":"Update for iPhone X?","text":"Would love to see an update for iPhone X. It’s been out for a while now...","updated":"2017-12-19T19:05:23-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7666112015","userName":"cruzer-u3","userUrl":"https://itunes.apple.com/us/reviews/id140807080","version":"3.5.1","score":1,"title":"My cam stoped working after update.","text":"Have to purchase another camera but never Logitech. \nThanks","updated":"2021-08-07T09:56:00-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7488950225","userName":"cmaohoo283737","userUrl":"https://itunes.apple.com/us/reviews/id13266630","version":"3.5","score":1,"title":"Update stinks","text":"SSO Doesn’t work well. When you do get in. Cameras show as offline. Terrible rollout. Give us the old app back please","updated":"2021-06-21T02:45:40-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"5138897528","userName":"i_Moby","userUrl":"https://itunes.apple.com/us/reviews/id42069356","version":"3.4.5","score":1,"title":"Vertical Support Desperately Needed","text":"Not sure why this is so difficult of an ask but this needs to be added.","updated":"2019-11-14T15:15:42-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"4060522060","userName":"AT&TSUCKSBALLS","userUrl":"https://itunes.apple.com/us/reviews/id3061020","version":"3.4.2","score":1,"title":"Can’t get circle co erage through app","text":"Until i can get recorded coverage through the app this remains a one star product only because the camera is ok.","updated":"2019-04-25T18:21:40-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3641524861","userName":"Seb_084","userUrl":"https://itunes.apple.com/us/reviews/id37612213","version":"3.3.1","score":1,"title":"Loses connection","text":"When it works its great. But it consistently loses its connection and is extremely difficult to reconnect. Very disappointing.","updated":"2019-01-12T05:59:24-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3064600256","userName":"Wallet user 12345","userUrl":"https://itunes.apple.com/us/reviews/id86855494","version":"3.2.5","score":1,"title":"Never works with  HOME app","text":"If you want to use with de home app, buy other camara. \nNever works with home app. You have to enter their app. I have other cameras that works perfect with the home app.","updated":"2018-08-14T12:52:17-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2008188181","userName":"MrEC01","userUrl":"https://itunes.apple.com/us/reviews/id195653453","version":"3.1.3","score":4,"title":"Not Updated for iPhone X Yet. So disappointing.","text":"Not Update for Full Resolution on iPhone X.","updated":"2017-12-18T21:05:24-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1502999351","userName":"imjasper","userUrl":"https://itunes.apple.com/us/reviews/id113073842","version":"2.1","score":1,"title":"Horrible update","text":"So you've made it so the alerts either blow your phone up with a constant stream of alerts or you just shut them off.\nOR\nPay a monthly fee to change the settings \nI recently purchased 2 and LOVED them.\nI was going to add another 6-8 for full security\nI'm now selling these two and will look elsewhere","updated":"2016-12-16T07:56:20-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7833529561","userName":"tsm1907","userUrl":"https://itunes.apple.com/us/reviews/id184184509","version":"3.5.2","score":1,"title":"Terrible","text":"Guess Logitech has given up. This app isn’t even usable. All I want to do is convert my camera to HKSV… but I can’t do it.","updated":"2021-09-22T08:34:07-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7760926586","userName":"pineapplesin","userUrl":"https://itunes.apple.com/us/reviews/id129374089","version":"3.5.2","score":1,"title":"Still as horrible as ever since the 3.5 update","text":"Still as horrible as ever since the 3.5 update","updated":"2021-09-01T19:43:52-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7490940129","userName":"acaudle","userUrl":"https://itunes.apple.com/us/reviews/id108662549","version":"3.5","score":1,"title":"Horrid Quality Control","text":"Last app update broke this app.  Expect to login anytime you need to view your cameras.","updated":"2021-06-21T14:21:08-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"5142817675","userName":"TzTerri","userUrl":"https://itunes.apple.com/us/reviews/id14117628","version":"3.4.5","score":1,"title":"Camera is now bricked after today’s firmware update 8.0.48","text":"Updated camera to support HomeKit video and now my camera is bricked.","updated":"2019-11-15T07:42:41-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1519981212","userName":"Slawsdawg","userUrl":"https://itunes.apple.com/us/reviews/id182645589","version":"2.2","score":1,"title":"No notifications","text":"Worthless without notifications!","updated":"2017-01-11T09:15:07-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7562027093","userName":"kickassoffense","userUrl":"https://itunes.apple.com/us/reviews/id165353855","version":"3.5","score":1,"title":"Horrible App","text":"I am constantly being logged out of the app. So annoying!  Please fix this, Logitech!","updated":"2021-07-10T14:36:59-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7640225198","userName":"Broken by iOS 8","userUrl":"https://itunes.apple.com/us/reviews/id38089191","version":"3.5.1","score":1,"title":"Great camera, terrible app","text":"Get ready for an infinite loop of log in screen/need to log in screen. Totally useless to monitor remotely.","updated":"2021-07-31T13:16:59-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7530344865","userName":"Mike R NYC","userUrl":"https://itunes.apple.com/us/reviews/id26369925","version":"3.5","score":1,"title":"Won’t stay logged in","text":"What happened?  Bad update forces login each time.  Hobbles product terribly.","updated":"2021-07-02T03:44:59-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7521398669","userName":"iougodall","userUrl":"https://itunes.apple.com/us/reviews/id101219361","version":"3.5","score":1,"title":"the messed it up","text":"they messed it up, with having to sign in every time and taking you to  there websites is the dumbest thing ever who ever thought of this should be fired. messed up a good working app and now it takes to long to view a live event. please undo this mess.","updated":"2021-06-29T19:58:46-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2009673702","userName":"Stephen_79","userUrl":"https://itunes.apple.com/us/reviews/id85027782","version":"3.1.3","score":1,"title":"Bluetooth audio doesn’t work","text":"Why doesn’t this app support audio devices connected to the iPhones Bluetooth??","updated":"2017-12-19T10:11:50-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7888421154","userName":"urbangobec","userUrl":"https://itunes.apple.com/us/reviews/id475740673","version":"3.5.2","score":1,"title":"Really doesn’t work anymore","text":"Used to work. Now I can’t log in or see/add cameras.. useless app","updated":"2021-10-07T08:36:31-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"5109423835","userName":"engineer3003","userUrl":"https://itunes.apple.com/us/reviews/id22494085","version":"3.4.4","score":1,"title":"Need to turn phone!!!","text":"This app only supports landscape mode, not portrait!  Quite ridiculously unprofessional app for a company the size of Logitech.","updated":"2019-11-08T23:53:27-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2346858524","userName":"S_Conn","userUrl":"https://itunes.apple.com/us/reviews/id157032149","version":"3.2.2","score":1,"title":"Terrible product","text":"Just avoid it. Constant bug fixes that never work. Camera bogs down local network. No HomeKit support for wire free cameras. I could go on.","updated":"2018-03-25T18:44:43-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1523000957","userName":"Miagia cool","userUrl":"https://itunes.apple.com/us/reviews/id545205388","version":"2.2","score":5,"title":"great amazing incredible","text":"this is an amazing product there have been no problems with it and it is very percise","updated":"2017-01-15T15:26:09-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"4030411566","userName":"Brian1502","userUrl":"https://itunes.apple.com/us/reviews/id34564675","version":"3.4.2","score":1,"title":"LiveView","text":"When are you bringing live view to see the cameras in real time and not the last screenshot when selecting a camera???","updated":"2019-04-18T18:28:31-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3936131327","userName":"HART-OF-SWARM","userUrl":"https://itunes.apple.com/us/reviews/id32627046","version":"3.4.1","score":1,"title":"Started recording/uploading w/o asking","text":"Checked the app after a few hours? Recording was on by default.","updated":"2019-03-28T01:45:36-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7775109505","userName":"TeaLo777","userUrl":"https://itunes.apple.com/us/reviews/id372715535","version":"3.5.2","score":1,"title":"Cannot log in ! Cmon.","text":"Cannot log in …see other reviews. Fix it!","updated":"2021-09-05T13:08:43-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7855779092","userName":"Angry.Mommy","userUrl":"https://itunes.apple.com/us/reviews/id1243052627","version":"3.5.2","score":1,"title":"App and cameras are trash","text":"Constant reboots for both.  Needs to always power cycle.  Both are trash.","updated":"2021-09-28T15:42:34-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7554745628","userName":"brianphd","userUrl":"https://itunes.apple.com/us/reviews/id23251300","version":"3.5","score":1,"title":"Can’t login","text":"App not working. Please fix. Can not login to check camera.","updated":"2021-07-08T15:36:21-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7491290240","userName":"Anghaneth","userUrl":"https://itunes.apple.com/us/reviews/id33387120","version":"3.5","score":1,"title":"Update","text":"Update is terrible! Camera not functional now!'n","updated":"2021-06-21T16:58:42-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7788577267","userName":"natiba34","userUrl":"https://itunes.apple.com/us/reviews/id797048620","version":"3.5.2","score":1,"title":"The new update is bad","text":"Same thing happen to me like the first review","updated":"2021-09-09T11:35:27-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7553016868","userName":"latitony","userUrl":"https://itunes.apple.com/us/reviews/id26919585","version":"3.5","score":1,"title":"Repetitive Login Requirements Is Not Good","text":"This is a disappointing app experience. Login is a hit or miss process. Loop effect driving me insane. Fix this, LogiTech.","updated":"2021-07-08T05:15:20-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"5549641407","userName":"TinTin858585","userUrl":"https://itunes.apple.com/us/reviews/id36071050","version":"3.4.5","score":1,"title":"Worst setup app on earth","text":"Wasted two days; and it gets stuck in endless loop and never finished setup.  Grabage","updated":"2020-02-18T14:56:49-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2494433187","userName":"Bay Area Baseball","userUrl":"https://itunes.apple.com/us/reviews/id250623287","version":"3.2.3","score":1,"title":"Pretty weak","text":"The app crashes when reviewing prior clips. Overall, pretty weak. I thought the Nest app was bad. This is worse. Dropcam app was the best. But now that's gone.","updated":"2018-05-01T21:31:13-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2197887253","userName":"Aerodyno","userUrl":"https://itunes.apple.com/us/reviews/id12805365","version":"3.2","score":1,"title":"Worked a bit but just hangs","text":"App just hangs on the welcome screen. iPhone 7 newest iOS","updated":"2018-02-11T20:43:30-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2038268308","userName":"TerribleoneBryan","userUrl":"https://itunes.apple.com/us/reviews/id34482379","version":"3.1.4","score":1,"title":"Third update since iPhone X release and still support. Pathetic.","text":"Third update since iPhone X release and still no support. Pathetic.","updated":"2017-12-29T06:56:07-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1923509300","userName":"Hancy0007","userUrl":"https://itunes.apple.com/us/reviews/id108752938","version":"3.1.1","score":1,"title":"Not Fully Supported with IPhone X","text":"This version is not supported by iPhone X, still shows half screen.","updated":"2017-11-15T13:31:24-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7571824708","userName":"Zzztuihgds","userUrl":"https://itunes.apple.com/us/reviews/id145024891","version":"3.5","score":1,"title":"Trashed by the update","text":"Log me out every single time.","updated":"2021-07-13T06:53:43-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"6503312500","userName":"Fraggin' awesome","userUrl":"https://itunes.apple.com/us/reviews/id122164181","version":"3.4.5","score":1,"title":"HomeKit version unreliable","text":"1) night vision straight up doesn’t work\n\n2) app won’t connect\n\n3) HomeKit is TERRIBLE","updated":"2020-10-05T07:26:24-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7583767836","userName":"pups1313","userUrl":"https://itunes.apple.com/us/reviews/id36976353","version":"3.5","score":1,"title":"app stopped working","text":"HUGE LOGIN BUG. please fix this ASAP or release old version!","updated":"2021-07-16T09:57:48-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7539970617","userName":"dv604","userUrl":"https://itunes.apple.com/us/reviews/id37915446","version":"3.5","score":1,"title":"LAST UPDATE WAS A MAJOR DOWNGRADE","text":"What is happening?!?? After last update these cameras and this app are essentially useless!!!!","updated":"2021-07-04T17:36:17-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3733839765","userName":"Molokai1298","userUrl":"https://itunes.apple.com/us/reviews/id319136273","version":"3.3.1","score":1,"title":"Crap","text":"CRAP. Don’t waste your money. Too many times off line, says there’s active and there’s not.","updated":"2019-02-04T14:30:22-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1489255203","userName":"TheBossman317","userUrl":"https://itunes.apple.com/us/reviews/id41691772","version":"2.0.1","score":1,"title":"Zoom doesn't work","text":"Bought 4 cameras and returning them all.","updated":"2016-11-22T17:10:47-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7738061195","userName":"Batmannnnnn","userUrl":"https://itunes.apple.com/us/reviews/id176171434","version":"3.5.2","score":1,"title":"Horrible","text":"What happened to this app need a update","updated":"2021-08-26T13:28:16-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3557061808","userName":"carlos-/2","userUrl":"https://itunes.apple.com/us/reviews/id105718702","version":"3.3.1","score":1,"title":"Super slow app","text":"It took more than an hour to setup. Very bad connection to the servers.","updated":"2018-12-21T14:36:49-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"6042657783","userName":"JRT61","userUrl":"https://itunes.apple.com/us/reviews/id16568340","version":"3.4.5","score":1,"title":"Pathetic","text":"If I knew I couldn’t use this on iOS or HomeKit I wouldn’t have bought this. It’s BS.","updated":"2020-06-06T06:13:02-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7525177167","userName":"room ffgv","userUrl":"https://itunes.apple.com/us/reviews/id331491804","version":"3.5","score":1,"title":"Update","text":"Updated app. Now it doesn’t work.","updated":"2021-06-30T19:01:49-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2684074403","userName":"heelcatcher","userUrl":"https://itunes.apple.com/us/reviews/id85693013","version":"3.2.3","score":1,"title":"Unhappy customer.","text":"Bottom line is don’t buy one.","updated":"2018-06-12T15:46:07-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3206718078","userName":"A_Paxton14","userUrl":"https://itunes.apple.com/us/reviews/id363594392","version":"3.3","score":1,"title":"Siri Shortcuts?","text":"Not only should these cameras be HomeKit compatible, but creating Siri Shortcuts would be even better.","updated":"2018-09-19T07:28:44-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1469502680","userName":"amnesia-kei","userUrl":"https://itunes.apple.com/us/reviews/id131479750","version":"2.0.1","score":1,"title":"Can't login to the app","text":"Lovely looking device but I can't log in. So it's useless for now.","updated":"2016-10-19T08:52:15-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2030583154","userName":"JaydaNeo","userUrl":"https://itunes.apple.com/us/reviews/id33876343","version":"3.1.3","score":4,"title":"iPhone X","text":"We need iPhone X support","updated":"2017-12-26T18:07:16-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1511535741","userName":"O Jack","userUrl":"https://itunes.apple.com/us/reviews/id184051049","version":"2.2","score":2,"title":"UNdependable","text":"At times the app will not open.","updated":"2016-12-29T11:17:54-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"5771526100","userName":"Lanloonmusmar","userUrl":"https://itunes.apple.com/us/reviews/id32253884","version":"3.4.5","score":1,"title":"App not working","text":"App for circle 2 us not working","updated":"2020-04-06T08:26:24-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7514452445","userName":"kal736283","userUrl":"https://itunes.apple.com/us/reviews/id580002541","version":"3.5","score":1,"title":"I’m canceling my account","text":"This update broke the app, it’s unusable.","updated":"2021-06-28T00:00:26-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3241328669","userName":"Peter Pancho","userUrl":"https://itunes.apple.com/us/reviews/id147903784","version":"3.3","score":1,"title":"iPhone Xs Max Crashes","text":"If crashes in my iPhone Xs Max when you zoom in too much","updated":"2018-09-28T15:55:05-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3253736771","userName":"Reaxi0n","userUrl":"https://itunes.apple.com/us/reviews/id31086830","version":"3.3","score":2,"title":"High potential, poor execution","text":"While decent and does its job. The most horrendous thing is being forced into landscape mode, all the time. As a user I should be able to choose what view mode I want to use whenever I want (portrait or landscape). Instead I’m forced to landscape which is stupid.\n\nOn the iPhone x2 while being forced in crummy landscape, the cameras don’t all fit. You need to scroll to see the image of any cameras beyond the second.\n\nI need to login to the web app on a desktop to set zones on each camera. Stupid.\n\nThe app doesn’t have background audio. If your phone locks or if you minimize the app, the audio stream shuts off. So you need to have the app active and open to be able to stream.\n\nThe fact that I can’t just change the WiFi and have to manually reset the camera to achieve this goal is stupid. I should just be able to change and set this in the app and the camera should be smart enough to reboot itself. It’s not. If you installed the camera up high on the exterior of your home, plan on getting your ladder out just to change WiFi. Annoying.\n\nCircle Safe (Logitech’s subscription service or cloud recording service: is spotty at best. I have 4 cameras installed on the same WiFi. At times 1 or 2 of them will show as offline and the other 2 online. I can go to the exact place the cameras are mounted and connect to the same WiFi access point and it’s working fine. WHAT?\n\nApple homekit on the wired version of the camera is spot on. My only criticism is with apple and HomeKit in its current state of restrictions and out of the control of Logitech. 720p..\n\nThis also NEEDS to be an appletv app!!\n\nNo camera company that is HomeKit compatible has yet to get it right.","updated":"2018-10-01T19:23:07-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3325142266","userName":"Koranek","userUrl":"https://itunes.apple.com/us/reviews/id38422751","version":"3.3.1","score":1,"title":"\"Camera Offline\"","text":"Logi app claims the camera is offline. Home app is receiving live video. The hardware is good, the app is flaky.","updated":"2018-10-20T18:29:33-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7886152178","userName":"parkviewbob","userUrl":"https://itunes.apple.com/us/reviews/id1336431286","version":"3.5.2","score":1,"title":"New update","text":"Ditto the recent review titled AWFUL.\nCan’t log in","updated":"2021-10-06T17:30:30-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2159839312","userName":"jonodale","userUrl":"https://itunes.apple.com/us/reviews/id28173358","version":"3.2","score":1,"title":"Why no iPhone X support?","text":"It’s been out for quite a while...","updated":"2018-02-02T16:42:05-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2037453188","userName":"brunosplive","userUrl":"https://itunes.apple.com/us/reviews/id87596852","version":"3.1.4","score":1,"title":"IPhone X screen support","text":"Come on Logitech, where is screen support to iPhone X?","updated":"2017-12-29T00:49:46-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2001633505","userName":"Dadys iPhone","userUrl":"https://itunes.apple.com/us/reviews/id101430747","version":"3.1.2","score":1,"title":"No good it takes for ever to set up","text":"Bad","updated":"2017-12-16T10:34:17-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3573308504","userName":"daveyboyboyz","userUrl":"https://itunes.apple.com/us/reviews/id129386995","version":"3.3.1","score":2,"title":"Good luck","text":"Getting this p.o.s. to pair with HomeKit","updated":"2018-12-25T17:53:48-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1557742075","userName":"Ratethiscrap!!!!!!","userUrl":"https://itunes.apple.com/us/reviews/id376812296","version":"2.2","score":1,"title":"Notgreat","text":"Don't waste your money","updated":"2017-03-04T21:16:00-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"6573188541","userName":"dachub","userUrl":"https://itunes.apple.com/us/reviews/id129695424","version":"3.4.5","score":1,"title":"Dumb","text":"Stop it, get so help","updated":"2020-10-25T10:07:31-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2056817375","userName":"Gamer2666","userUrl":"https://itunes.apple.com/us/reviews/id136823819","version":"3.1.4","score":1,"title":"What’s wrong when a security cam doesn’t work?","text":"UPDATED review since latest app update :  none of what was said to be fixed was fixed. It irks me when pseudo updates are created to make it look like issues are being taken care of when they are not. \n\nI STILL cannot download random events or events longer than 3 minutes!  I had an event I wanted to watch yesterday - it was 15 mins long according to the next time stamp (I have my cams with no time outs, supposedly 🙄) and when I went to watch it wouldn’t play. I decided to download, which it did- sorta. I go to look at video and nothing. \n\nAgain, I use this for my mother’s medical history and caregiver surveillance. And my cameras are reduced to expensive paperweights and a useless app that just annoys me beyond words.  Do the right thing and actually produce an app that works as you boast it will. It’s not like this is your 1st tech rodeo. Either ride the bull or stop shoveling it into your worthless updates of an already broken app. Wake up developers!  Your ratings should have you pulling all-nighters to resolve what so many find exasperating!!\n\nAnswer:  A very upset customer!  The newest update or an internal cluster has rendered this app, and by proxy, the cameras useless. I can download only sporadic timed videos, if I’m lucky. \n\nI use this for medical history and elder security. A huge and expensive disappointment. Tech service is virtually nonexistent and/or useless. After a nonproductive CS phone call on December 26th, I was sent a cut/paste email with links to help with my problem, one of which held no relevance to my inquiry. \n\nUPDATE:  On December 27th I emailed back that the links were not resolving my issue. I’ve yet to here back from anyone. \n\nIf free plan monitoring truly equals 24 hour recording time , then I should have the ability to download anything within that perimeter. To provide less than stated is false advertising and woefully embarrassing to your company. \n\nI will never purchase any Logitech item again!!","updated":"2018-01-04T10:00:02-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"4403374448","userName":"stephjusko","userUrl":"https://itunes.apple.com/us/reviews/id637638985","version":"3.4.3","score":2,"title":"Mérite mieux","text":"Ci joint quelques petites idées ...:\nJ’ai acheté plusieurs caméras Logic circle (9) et j’adore le produit. Seul bémol, l’application qui mérite mieux. J’avais quelques petites idées à vous soumettre :\nLe mode portrait serait vraiment bien pour éviter de tourner à chaque fois son téléphone. \nAvoir les caméras en mode live tout le temps et pouvoir choisir le nombre de caméras par vue, 2 ou 4 ou 6 etc. En tout cela en mode live c’est à dire pas seulement une image fixe comme actuellement. \nEt une chose vraiment importante, le faite de mettre plusieurs caméras sur un groupe et pouvoir changer pour éviter de faire défiler toutes les caméras pour trouver celle que l’on souhaite voir. Par exemple j’ai des caméras pour mes 2 boutiques et pour ma maison donc pas très pratique pour « switcher » d’une localisation à l’autre. Voilà j’espère avoir été assez clair et que vous pourrez faire une mise a ajout dans ce sens là ...\nD’avance merci de vos réponses. \nSteph.","updated":"2019-07-02T19:48:04-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3182922884","userName":"Synthmanic","userUrl":"https://itunes.apple.com/us/reviews/id42468871","version":"3.2.5","score":1,"title":"No HomeKit for Wirefree","text":"Great job concealing this in your marketing. Returning this tomorrow.","updated":"2018-09-12T18:22:53-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"2163064591","userName":"Tanner Drexler","userUrl":"https://itunes.apple.com/us/reviews/id181261831","version":"3.2","score":1,"title":"iPhone X?","text":"Why not","updated":"2018-02-03T09:28:05-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3742805464","userName":"Jovany lara.","userUrl":"https://itunes.apple.com/us/reviews/id683811205","version":"3.3.1","score":1,"title":"Logi cam","text":"Hey logi cam  more Effort Would be Nice.","updated":"2019-02-07T03:29:13-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7668955937","userName":"Uriel.lpz","userUrl":"https://itunes.apple.com/us/reviews/id216147372","version":"3.5.1","score":1,"title":"Trash Basura","text":"Esta cámara y su aplicación Es la basura más grande que pueden vender No la compres para lo único que sirve es de adorno tal cual NO FUNCIONA Y SU APLICACIÓN ES LO PEOR NO PUEDES VER TU CASA NUNCA NO GASTES TU DINERO PERDÍ $250.00 en cámaras por gusto . NO LA RECOMIENDO BUSCA OPCIONES COMO NEST","updated":"2021-08-08T05:18:33-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7901469893","userName":"NoName_456","userUrl":"https://itunes.apple.com/us/reviews/id236437789","version":"3.5.2","score":2,"title":"How come no notification on iOS 14.8 (v3.5.2.62)","text":"What happened to the push notification?","updated":"2021-10-10T22:37:24-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1894893452","userName":"ScipioMD","userUrl":"https://itunes.apple.com/us/reviews/id286574875","version":"3.1.1","score":1,"title":"Does not support iPhone X","text":"Does NOT support iPhone X???","updated":"2017-11-03T10:26:16-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"6539504514","userName":"AnthonyD1978","userUrl":"https://itunes.apple.com/us/reviews/id327296269","version":"3.4.5","score":2,"title":"Can’t create day brief. Support says it’s an app problem","text":"I have had 4 wired Circle 2 cams for about a year.  About a week ago all of them give me an error when I try to create the previous days day brief. Same error on two different iOS phones. One with 13.7 and the other with 14.01 iOS. \n\nDay briefs work fine on desktop browser. Shared all this with Logitech support and they concur its an app issue.","updated":"2020-10-15T18:26:00-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7714566019","userName":"GA1458","userUrl":"https://itunes.apple.com/us/reviews/id37883884","version":"3.5.2","score":1,"title":"What the F is wrong with you people?","text":"You broke the sign on process AND the Smart Location functionality MONTHS ago! Your June software update was total CRAP! After uninstalling and installing the app on several devices, sign on is somewhat functional and it stays signed in. Thankfully. But Smart Location. Turn it on and it turns itself right back off. Lock the app. No effect. It still turns itself off. \n\nIt’s a shame because I’ve had these cameras for several years and they worked fine all that time until June. To get any functionality at all, I’ve had to turn off recording and Smart Location and just leave them on all the time. Otherwise, they remain off until I turn them on and even then, I have to override Smart Location, which doesn’t even work!  \n\nI have submitted a ticket ages ago. It’s still “in process” after being escalated multiple times to the next level, whatever that means. Apparently nothing because that’s exactly what continues to happen - NOTHING. Review after review after review says the same thing, yet after weeks and weeks the problem persists. The lack of responsiveness to this issue is beyond incredible.","updated":"2021-08-20T06:30:26-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7694218182","userName":"crapbag8","userUrl":"https://itunes.apple.com/us/reviews/id11712434","version":"3.5.2","score":1,"title":"App broken","text":"Login loop all the time. App just keeps taking you to webpage to login which goes back to the app which takes you to webpage to login which goes back to the app which takes you to webpage to login which goes back to the app which takes you to webpage to login which goes back to the app which takes you to webpage to login which goes back to the app which takes you to webpage to login which goes back to the app which takes you to webpage to login which goes back to the app which takes you to webpage to login which goes back to the app which takes you to webpage to login which goes back to the app which takes you to webpage to login which goes back to the app which takes you to webpage to login which goes back to the app which takes you to webpage to login which goes and you get the point","updated":"2021-08-14T21:16:38-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7652482302","userName":"David Kar Colorado","userUrl":"https://itunes.apple.com/us/reviews/id102224350","version":"3.5.1","score":1,"title":"App Doesn’t Work Since Update","text":"App constantly crashing. Constantly have to reinstall app. Logitech is trying to collect our IP address and other identifiable information instead of the performance of the cameras we purchased. \n\n Update, 7-24-2021 Again, the latest update fails. App crashes.\n\nUpdate, 8-3-2021 Logitech still does not care that their app does not work correctly. Same issues, app logs out for no reason. Sometimes you can’t log back in depending upon your IP address at the time. Logitech is more concerned with harvesting your data instead of a functioning app.","updated":"2021-08-03T20:12:59-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7648294534","userName":"Mr. Man!!","userUrl":"https://itunes.apple.com/us/reviews/id86059142","version":"3.5.1","score":1,"title":"Horrible and no support","text":"What is the point a security device if it continues to be logged out by software? Vendor support is non existent and support forums says if a tech does respond they recommend an Android device. Worthless company and product.","updated":"2021-08-02T17:34:25-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7591370463","userName":"frost1000","userUrl":"https://itunes.apple.com/us/reviews/id14512280","version":"3.5","score":1,"title":"App constantly logs me out","text":"You need to fix your session management it constantly logs you out, like 3 to 4 times a day! And then when it try’s to log you back in it, it only works 25% of the time requiring you to do it multiple times. You need to revert your latest change and get rid of the new session management and fire the developer who wrote this code!","updated":"2021-07-18T10:47:11-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7555443434","userName":"xrob772","userUrl":"https://itunes.apple.com/us/reviews/id19188254","version":"3.5","score":1,"title":"Update killed the app on purpose so people stop using this discontinued camera.","text":"Ever since the update that added SSO the app logs you off every few hours so every time you open the app its a 3 part process logging into the app to even view camera, notifications are delayed if not absent because total idiot app developer did this on both android and Apple.  I’m throwing away camera very soon.  the app completely useless now    I guess this was Logi doesnt make security cameras anymore.  This was probably a move so people completely stop using the app was a great camera with 0 issues until this update.  Would highly recommend everyone not buy anything Logitech since they are discontinuing a lot their most popular products.  Cameras, universal remotes etc.","updated":"2021-07-08T20:24:46-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7526811528","userName":"Jonny Big Bucks. 😜","userUrl":"https://itunes.apple.com/us/reviews/id575775432","version":"3.5","score":1,"title":"What happen to the Logi Circle App?","text":"I have been pretty happy (for the price) of my Logi Circle cameras for several years. My IPhone must have done an auto update to a new Logi Circle App. Now I am forced to re-log in every time I want to look at my cameras. And even worse, now I can’t log in. I go through the new log in process and it takes me back to the log in page. If this isn’t fixed soon, I will have to look for a different option other than Logi. Logi, please advise. Thanks!\n\nUpdate 7/1/01\nI’m done. I just ordered new Blink cameras. Only about $35 each on Amazon. I hope Logi doesn’t own Blink. My Logi cameras will go in the trash as soon as I get my Blink cameras tomorrow. Bummer. I loved my Logi cameras. 🤷🏼‍♂️","updated":"2021-07-01T05:25:31-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"7472386059","userName":"Harper Till","userUrl":"https://itunes.apple.com/us/reviews/id430559623","version":"3.5","score":1,"title":"06/16/2021 update broke it","text":"The update allowing SSO has completely kicked me out of being able to view my camera. It still sends me push notifications, but I can no longer review the footage through the app. After a few circular tries to log in, I'm stuck on a screen that says \"Logi\" with a green loading wheel.\n\n I'm hoping this will have a bug fix pushed soon.","updated":"2021-06-16T13:40:17-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"6756937174","userName":"26333333","userUrl":"https://itunes.apple.com/us/reviews/id10856970","version":"3.4.5","score":1,"title":"Forced account creation, doesn’t save passwords to keychain","text":"Pretty much any inconvenience available they’ve made sure to integrate it into this app.\n\n My camera is already working on HomeKit… But they force you to create an account and start all over with their app.Oh, they don’t save your password with keychain so yet another app you’ll barely ever use requiring you to memorize a password. When I do successfully login, they tell me there are no cameras associated. Basically your account is invalid until you have a camera attached to it… So I keep going through this loop of logging in and their camera set up fails, login again… But the app isn’t smart enough to connect to my keychain... so round we go.","updated":"2020-12-15T11:52:07-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"6581041160","userName":"amun-re","userUrl":"https://itunes.apple.com/us/reviews/id85832894","version":"3.4.5","score":1,"title":"Avoid this app at all costs!!","text":"The Logitech Circle camera itself is decent, at best. I got it to monitor my car in my condo complex parking lot, though beyond about 10-15 feet, reading license plate numbers or seeing identifiable faces is all but impossible. But it’s unique window mount allows the camera to be placed where other cams wouldn’t work for me. There’s also an incessant rapid clicking noise in the audio, like a playing card being ran over bicycle spokes. Very weird, and just really annoying in general. \n\nThe Logi Circle app itself, though, is really where things go downhill fast. First, the odds of its auto-record feature successfully recording an important event, like, say your car getting broken into, are pretty low. You might get the very beginning or the very end, before it cuts in/out, or a random segment in between. And if you happen to see something occurring in real-time that you’d like to record, then good luck with that same sketchy auto-record, as there’s no option for you to manually start/stop recording something. \n\nThe other issue is trying to scroll back in time to view events from earlier in the day. I have 100/10Mbps internet over WiFi, and it regularly test at or above those speeds. The cam is in the same room as the WiFi router, and all other devices in the House work just fine from it, including an Arlo Q cam, which works much better than the Circle cam. In my somewhat busy parking lot, there might have a dozen to a few dozen events (people/cars going by, etc) auto-recorded per hour, but if you want to scroll much more than 2 hours into the past, then be prepared to wait. You’ll simply see a spinning wheel for every couple hours you want to go back, which won’t stop for about 1-3 mins, and when it does, you may or may not have a play button available to view an actual clip. Count on it taking about 10-15 mins to actually get to the beginning of a 24hr day. By that point you’ve likely given up, reminding yourself to never by another Logitech security camera again. \n\nYou’ve been warned. Unless you must have a camera that mounts to a window, there is absolutely zero reason to ever consider a Circle cam, and it’s embarrassingly bad app, over just about anything else that’s out there.","updated":"2020-10-27T16:41:21-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"6557872024","userName":"Daliguy","userUrl":"https://itunes.apple.com/us/reviews/id436895357","version":"3.4.5","score":1,"title":"Poor customer support","text":"From the time I installed it immediately it was obvious this camera was crap.\nIt is not real time it lags up to 5 Sec. From real live viewing and I contacted the cars for the source code to change to my server since I was paying them while they failed to disclose any and all issues before sale.\nI plan on filling a complaint the the FTC and the FCC . The Fed Trade Comm for non disclosure of defect, and the FCC for failure to disclose the connection and communications non compliance in accordance to regulations that may apply.\nI hope they read this , I will be seeking damages for misrepresentation .\nJack","updated":"2020-10-21T02:07:56-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3049449281","userName":"MIGerlag97","userUrl":"https://itunes.apple.com/us/reviews/id258938862","version":"3.2.5","score":2,"title":"Needs a lot of work!","text":"The physical product (Logitech Circle 2) is fantastic, however this app lets it down severely.\nIf it wasn’t for Apple HomeKit support and being able to view the cameras in the home app I would have already returned the cameras, here’s why:\n\nThe app only talks to the cameras through the Logitech servers over the internet, even if you are in the same network as the camera it won’t talk directly to the camera. You guys need to allow for a LAN connection, if HomeKit can do it so easily then it can’t that be hard to add a simple little toggle for this feature in your app. I’m still waiting for them to connect my fiber, which means I have pretty slow internet and it makes viewing the cameras at home in my own network in this app an extremely slow and a very delayed experience, to the point where it’s unusable!!! If it wasn’t for HomeKit’s ability to view the camera over the LAN network I would have returned the cameras. IT’S A MASSIVE OVERSIGHT!\nThe app is stuck in landscape mode, I don’t like the fact that I’m forced into landscape mode.\nThe UI feels generally awkward and unintuitive, the timeline bubble thing on the side is pretty good but the rest of the app just feels a bit clunky and hard to navigate, it’s mostly to do with being stuck in landscape.\nThere’s no picture-in-picture mode for the iPad, again, Apple HomeKit can do it but your app can’t.\nThere’s no Apple TV app, I hardly use other apps on my Apple TV but being able to view my security cameras on my TV (WITH A LAN CONNECTION) would be brilliant, please fix this app with LAN support and bring it to the Apple TV.\n\nAdditionally the ability to have the cameras record to a local NAS device would be fantastic and make these cameras worth twice the price in my opinion, I know you guys want to sell subscriptions but I guarantee that if you add that functionality you’d sell twice as many cameras as it would appeal to many many more people especially those with with slower internet speeds or capped data plans, not everyone likes the cloud or wants their cameras constantly uploading and using bandwidth, local network recording would take these cameras to a whole new level.\n\nApple’s HomeKit integration is a must, if you’re using these cameras and not using HomeKit you need to try it out, for me it’s the only reason I haven’t returned the cameras, it allows for LAN connections and iPad picture-in-picture support as well as fantastic notifications that allow you to view the camera from within a notification on your lock screen with a 3D Touch hard press, and if like me you have Philips Hue lights you can link the camera to the lights for automation for movement or my favourite little feature is the “light” button under the camera feed when viewed from a notification that will turn on all the lights in the same room as the camera. \n\nI’ve said it multiple times in this review and I’ll say it again. \nHOMEKIT MAKES THESE CAMERAS\n\nThese cameras are nothing without HomeKit, I don’t know what Android users do with these cameras because the logi app fall 500 miles short in terms of functionality and in cases where one has slow internet can make the cameras unusable even at home in the same network.\n\nI’m very happy with the physical hardware, if you have Apple devices and can use HomeKit I would definitely recommend these cameras, but for right now the Logi app is only good for initial setup of the camera and playing back previously recorded footage, nothing else, all other functionality is found in the Home App on iOS with HomeKit. So if you’re an Android user too I’d wait a little while and see if Logitech gets their act together with this app because it’s nowhere near where it needs to be, I’d go as far as calling it half baked and unfinished.\n\nI’d happily re-review this app and give it a 5-Star rating if you fix these issues, they should be sorted out ASAP, more and more people are going to try your products and the app is going to let them down and you will give yourselves a bad name. You guys still have the opportunity to make a big name for yourselves in this section of the market. Sorting these things out is of utmost importance for keeping this product alive, otherwise someone else will come along and do it better and this product will fade away. It’s been out for over a year, it’s long enough, there’s no time left for any excuses these are major oversights that are frankly embarrassing, you’d expect this from some new startup but not a big company like Logitech.\nThe Circle 2 has so much potential, please don’t neglect it.\n\nKind Regards.","updated":"2018-08-11T04:53:56-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"5043264092","userName":"elguapo_real","userUrl":"https://itunes.apple.com/us/reviews/id21775677","version":"3.4.4","score":1,"title":"Frustrating UI. @Apple, how do you let this through review???","text":"App only works in landscape mode, but Apple has designed the iPhone to be held in portrait mode 95% of the time.\n\nDon’t buy.","updated":"2019-10-28T15:30:51-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"4025347852","userName":"Like iPhone","userUrl":"https://itunes.apple.com/us/reviews/id27499076","version":"3.4.2","score":3,"title":"Incorrect version number?","text":"My iOS Circle App says it’s already version 3.4.400 but this new update says it is version 3.4.2. \n\nShould I be “upgrading” from the Apple iOS App Store, will doing that try to “downgrade” my Logi Circle application version?","updated":"2019-04-17T12:28:36-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"4025063952","userName":"marypg68","userUrl":"https://itunes.apple.com/us/reviews/id440580420","version":"3.4.2","score":5,"title":"Issues accessing camera (recently)","text":"UPDATE: The app started working again once it was deleted and reinstalled.\n\nInitial Review: The app has been working fine for a long time. However, I have not been able to access my camera in the last two days using my iPhone. I’m able to view the camera using an Android phone. Therefore, it seems like the issue is with the IOS app.","updated":"2019-04-17T10:39:34-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"3215985392","userName":"Browntown247","userUrl":"https://itunes.apple.com/us/reviews/id295814403","version":"3.3","score":5,"title":"Works well","text":"Works well on both android and iOS from my experience.  Great camera.  Good app.","updated":"2018-09-21T21:48:03-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1501837031","userName":"Deeruckus12345","userUrl":"https://itunes.apple.com/us/reviews/id210005364","version":"2.1","score":2,"title":"Can't download a video clip","text":"I knew this would happen...purchased the camera yesterday, set-up is the easiest thing since opening up a Carton of cereal...however, I tried downloading a clip and it keeps telling me \"can not download clip - internal error\" ugggggghhh...I'm probably going to send it back and look into another camera....","updated":"2016-12-14T09:30:28-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1935138128","userName":"YoMaster","userUrl":"https://itunes.apple.com/us/reviews/id27421513","version":"3.1.2","score":1,"title":"Dead out of the box","text":"Bought a Logi circle 2 from Best Buy. Turned it on and it bricked itself during a 30 minute firmware update.\n\nStay away.","updated":"2017-11-20T07:59:50-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"},{"id":"1308094544","userName":"SlingGuru","userUrl":"https://itunes.apple.com/us/reviews/id6357033","version":"1.5.1","score":5,"title":"Great Home Camera","text":"We bought three of these types of cameras for our home, with the assurance from Best Buy we could return any if we did not like.\nWe are returning the FLIR FX & D-Link HD Pan & Tilt cameras, and exchanging them for Logi Circles. \nGetting started with the FLIR FX & D-Link HD Pan & Tilt cameras were much more difficult and cumbersome than the Logi Circle. \nThe FLIR FX & D-Link HD Pan & Tilt also were significantly more complex to view online with our Apple devices (iPhones & iPads). The FLIR FX required us to switch to its' designated Wi-Fi connection in order to view online!\nAt night, all the cameras reflected their IR lights on our windows' glass, so they did not work so well placed inside the house, looking outside at night. However, we were able to use the Logi Circle camera outside (during both the rain & a rare snow fall in our area, even though it does not say it's rated for outdoor use)! Additionally, the Logi has a magnetic base which I was able to place in more locations securely than any of the other cameras (without having to drill & screw in attachments).\nAll of the controls were simple to operate & all of its' functions worked exactly as we'd hoped!\nFinally, the FLIR FX is $30 more than (and the D-Link HD Pan & Tilt is the same price as) the Logi Circle!\nThe Logi Circle is what we would buy again & recommend.","updated":"2015-12-29T08:16:07-07:00","url":"https://itunes.apple.com/us/review?id=1018340690&type=Purple%20Software"}]