[{"id":"8083585100","userName":"slvrscorp","userUrl":"https://itunes.apple.com/us/reviews/id39108425","version":"8.11.2","score":4,"title":"App work as expected","text":"App occasionally has issues but they are usually fixed within a few days. Been using this app for many years. It works well.","updated":"2021-12-01T06:40:34-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4110580614","userName":"FIX Vimtag App please","userUrl":"https://itunes.apple.com/us/reviews/id538931286","version":"6.4.2","score":2,"title":"Please fix login and screen going off","text":"The app it’s all about the app. App continuing to log me off please fix and before camera screen stayed on now with new  software-update screen locks my app within a minute have to keep refreshing remove ads please... put the ads in the main intro page or have the app revert to the product tab each time we login I understand it’s a business but the app needs to be fixed login cont. etc. because now it’s embedded please either create two apps or give us the options to turn features on off. Also it would be cool if we could turn  on or off a button on the app say “no motion while home button” and a night time motion button as well that way when we connected to WiFi at home or it geo locating us close to home will not continue to send motion alerts while I’m at home.  Overall camera work great please fix this app (the app can solidify Vimtag as the go to home camera suite or it can break you)  this is what users use daily to for security etc. purposes it needs to designed practically. Like around daily uses. I liked the app they way it was although it was very reliable needs extras.  Thank you for listening. God Bless you, Amen.","updated":"2019-05-06T12:06:24-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"7895196330","userName":"cyadams","userUrl":"https://itunes.apple.com/us/reviews/id743118286","version":"8.8.5","score":2,"title":"Why have it","text":"So, buy the camera and told there is a place for a SD card, and there is - but when it never works (no matter how many NEW ones you insert) what’s the point. I gave 2 stars because I have a camera that I can watch live, you know, the things I can watch w/o the camera…I wanted to see what was happening when I’m not here, but that requires actual recording onto SD card. See, it works when I first put it in, up until I close the app, and it picks up here and there. So I know it’s not due to the normal response I get (everything updated, SD card good/new, turn it off and back on < my fav). There’s a cpl conclusions I came to - 1) the app isn’t properly designed and/or updated 2) it’s a greedy way of getting us frustrated so we just buy their cloud - add the fact that the “program” that HAS to be used to see what was recorded isn’t even clickable, much less downloadable, so unusable! Again, creating that frustration! But see, it is returnable!","updated":"2021-10-09T06:01:01-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2729485586","userName":"Tessie Kat 89","userUrl":"https://itunes.apple.com/us/reviews/id162579681","version":"5.5.1","score":1,"title":"Version 5.5.1","text":"The latest version broke the back arrows and the entire settings menu. You have to force quit the app if you click any of the settings. They never load or you can’t edit what settings do load and then you can’t go back to the main setting menu because the back arrows don’t work.\n\nI haven’t been able to edit my Recording Schedule or Alerts for several versions now. The recording schedule I did have is probably messed up as my camera now just records constantly until the SD card is full and then it stops. It doesn’t overwrite the old videos, just doesn’t record anymore. I haven’t gotten an alert/notifications for motion or a snapshot from a detected motion event saved to the SD card in months. And now I can’t even get to the settings to see what the problem is. (I also tried to access the settings on the website’s browser “Live Feed”, but it just will not load on a mobile browser and the website is outright blocked on my work computer.)\n\nMost of these issues with the app should have been caught and solved with testing before app deployment.\n\nThe declining quality of the app, along with just the headaches of the past few versions, has me shopping for a different brand of camera. It’s a shame because the quality of the camera isn’t bad, it’s this interface that isn’t worth the $$.","updated":"2018-06-19T23:51:41-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"7948892466","userName":"Fartfairy","userUrl":"https://itunes.apple.com/us/reviews/id408924539","version":"8.10.5","score":2,"title":"All cameras down","text":"I’ve had these cameras for a few years now and up until recently they have been pretty good. As of 4-5 days ago I cannot connect my cameras to my WiFi, I’ve tried everything in the book to get it to work and there is no solution. I really hope they are working on an update or solution that will get my cameras back up and running as I had bought a couple more just the other week and am waiting to set them up. I’m very disappointed that I’m having this issue as I have an old sick cat at home and the cameras are the only way I can check in on her while I’m at work all day, the cameras not working are making my anxiety sky rocker since I can’t see her. \n\nVIMTAG, PLEASE FIX THIS!","updated":"2021-10-24T06:02:50-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2945180107","userName":"drumbum19","userUrl":"https://itunes.apple.com/us/reviews/id38444397","version":"5.5.1","score":1,"title":"Newest Update is Garbage","text":"I’ve had a camera for just under 2 years now. When I first got it and downloaded the app, it worked flawlessly. Yes the layout of the app was a little wonky, but at least it worked. \n\nNow, I can’t schedule recordings for home or away, my SD card gets full and won’t overwrite previous recordings, sometimes it won’t even record, I don’t get push notifications anymore for motion detection (even though the settings are checked for it), I have to constantly force quit the app to make any settings changes.  \n\nTo the developers of this app: PLEASE FIX THESE ISSUES. Your camera is pretty decent, but the new app update is utterly useless. These problems should have been spotted and fixed prior to release. All of these problems are forcing me to move my business elsewhere.","updated":"2018-07-21T09:01:35-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4090685165","userName":"Relidnit","userUrl":"https://itunes.apple.com/us/reviews/id38593628","version":"6.4.2","score":3,"title":"The screen flip function reverts back weekly","text":"I have 6 Vimtag cameras and there is one nonstop, major irritation in this app. I have three ceiling mounted cameras and there is a setting to flip the image 180 degrees which works fine - for a week or two. Then it reverts and the camera image is upside down. I go into the app, flip the image, “save” and then a week or two later the same thing happens on all three cameras. It’s really annoying.\n\nI heard back from the developer who told\nme to “update the app”. My iPhone is set to auto update apps regularly. It’s not an app update issue - it’s a programming issue. The screens still flip 180 by themselves and have to be reset weekly. It’s still annoying.","updated":"2019-05-02T10:06:00-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2813471167","userName":"blaze.43","userUrl":"https://itunes.apple.com/us/reviews/id43201452","version":"5.5.1","score":2,"title":"Record on motion","text":"Why can I not record on motion sensor like my other cameras. I bought this for the pan and tilt and it says it records. Can I get a refund since it seems you can not fix this issue. As other people have the same problem. As a developer you should be ashamed and I do not recommend anybody buying it his until it is fixed and refunds should be issued to all customers please respond on why you can not or are not trying to fix this issue instead of adding languages. Which is less important that what a surveillance camera is supposed to be for. I was going to get 3 more for my house but if I don’t get a response I would like a refund and I can buy a different brand. Very disappointed. Please advise ASAP.","updated":"2018-07-01T09:23:02-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2070712520","userName":"thesoundman615","userUrl":"https://itunes.apple.com/us/reviews/id201383760","version":"4.12.1","score":2,"title":"Updated App Issues/No Response Tech Support","text":"When WiFi is enabled on the camera, the camera broadcasts an unsecured connection that anyone close enough can connect to and control. I question the wired connection and their security protocols as well. My camera started putting out white noise from the intercom speaker. I informed the company’s technical support with no response. The new update took away the drop down menu to choose between home and out scene modes. After figuring out how to set the auto switch scene mode on, the camera nor the app distinguishes the settings when I am home or out. I am either getting constantly notified or no notifications what so ever. Please fix, thank you.","updated":"2018-01-08T18:23:02-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"7149015842","userName":"khadijah<3","userUrl":"https://itunes.apple.com/us/reviews/id895094423","version":"8.3.7","score":3,"title":"Constant notifications even after turning them off","text":"The camera feed is great but it stopped working for no reason once. App Wouldn’t save my settings changes at first. I turned facial recognition on then back off and now it notifies me of facial recognition every 2 minutes for no reason. Maybe my plant leaves are triggering it but I turned it off so it shouldn’t be doing it at all.....Will be putting an SD card in and setting up recording times ASAP before something else in the app messes up....hope I don’t regret buying this camera..\n\nMY APP IS FULLY UPDATED PLEASE DONT TELL ME TO UPDATE IT","updated":"2021-03-26T19:49:35-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2178398815","userName":"alanpfmt","userUrl":"https://itunes.apple.com/us/reviews/id155703307","version":"5.1.2","score":5,"title":"App crashes often after update!","text":"I agree with another reviewer here. After the most recent update, the motion detector stopped working. Had to reboot (unplug & plug back) the camera to get it to work again. But the most egregious part is the app now keeps crashing when I try to view my snapshots & videos triggered by motion. Relaunching the app only works sometimes. This is a very serious issue. Please provide a fix ASAP.\n2/7/18 Update: Problem fixed. Thank you.","updated":"2018-02-07T07:29:27-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3364908162","userName":"First App Review Joe","userUrl":"https://itunes.apple.com/us/reviews/id103287136","version":"5.10.2","score":1,"title":"Many features of app do not work","text":"I can view live feed well, but I don’t watch it 24/7 so the odds of catching a break in during the few seconds they would be in front of the camera are slim. When I click on “record” in the settings menu, the page continues to try loading, but never completes it so the record settings cannot adjust. The desktop site is no better. This issue has been happening for around 6 months. The website has a box for sending comments about issues, but it only allows you to type, and the send button isn’t activated. \n\nIf you want recording features buy another camera. Use another app.","updated":"2018-10-31T06:16:38-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3209494819","userName":"davidmburns","userUrl":"https://itunes.apple.com/us/reviews/id18227007","version":"5.9.2","score":1,"title":"Edit: doesn’t work with iOS 12.","text":"Edit: stopped working completely. \n\nThe app is pretty terrible. Frequently having to close and reopen the app so the camera will connect is annoying. Any time you navigate away from the app, check your texts, or your phone locks, you’ll have to close and reopen the app to connect the camera. The responsiveness of the camera movements is also poor - often times not moving at all then all of a sudden will make all the movements at once and you just have to wait for it to stop freaking out. If I had to do it over again, I’d probably spring for a higher end Camera with a better developed app.","updated":"2018-09-20T03:18:15-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2996710361","userName":"Hdsteve84","userUrl":"https://itunes.apple.com/us/reviews/id298494198","version":"5.6.3","score":3,"title":"Used to be five star","text":"As I said in my last review what are you guys doing with these updates. 2yrs ago these cameras were simple and reliable -liked them so much I kept purchasing more. Recommended to friends. I have 9 of these in 3 different houses and you now pretty much made them useless. You fixed the back button issue which I’m sure everyone appreciates, but now it’s worse - alarms don’t work at all. What good is having a security camera that motion detection don’t work- can’t sit and monitor these things 27/7. Sorry don’t cut it fix - now.","updated":"2018-07-31T06:52:02-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"8119610226","userName":"NY camera user","userUrl":"https://itunes.apple.com/us/reviews/id193784061","version":"8.12.2","score":3,"title":"Latest ver. 8.11 does not work on iPhone.","text":"After updating to the latest version the APP no longer works on our 2 iPhones. Both phones are running iOS 14 and higher. The APP worked for years but the latest version has made our security cameras inaccessible. Note to developer: Login screen is frozen. Apps on iPad and Windows PC, using older versions, successfully access cameras.\n\nLatest version of app (8.12) fixed the problem .  Works fine now on 2 iPhones running iOS 15.1.","updated":"2021-12-11T11:07:01-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2044927919","userName":"Touch driver","userUrl":"https://itunes.apple.com/us/reviews/id11402378","version":"4.11.3","score":1,"title":"Meh","text":"Cams were designed to be mounted from\nThe ceiling brackets only. When free standing on a table, the amount of tilt downward is very limited. Really a poor design.  And Whats up with all the dongles????  The power adapter doesnt plug straight into the camera but has to plug into the ethernet adapter first ...even if ethernet isnt being used.  Lame.  WiFi range is Terrible.   And who is panning my camera when I am not??!??  And why does the mobile app repeatedly drop my credential and not remember who I am??????!!!!!! Myriad product updates happen monthly and I am forced to reestablish connectivity with the WiFi network each time.    LAME  and SKETCHY product.   Tech support FINALLY replied to a question I submitted MONTHs ago","updated":"2017-12-31T11:24:02-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"7764709507","userName":"megan_sexton1","userUrl":"https://itunes.apple.com/us/reviews/id384111868","version":"8.8.3","score":2,"title":"Has Potential","text":"I love my camera and the app has nice functions such as clear picture and sound. However, I constantly have issues with the camera going offline and sometimes we just have to wait for it to come back on because the camera works on other devices just fine. The app is very glitchy, especially when deleting old SD card videos, or trying to fast forward on the saved videos. It could be a great app and has potential but really needs some bug fixes.","updated":"2021-09-02T20:31:20-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"7339955915","userName":"Mark.L.","userUrl":"https://itunes.apple.com/us/reviews/id31113354","version":"8.4.5","score":3,"title":"Great picture but...","text":"I bought one of these for my house and the picture is great as is the microphone. You can hear conversations clearly from down the street however, when I bought one for my daughters house, i couldn’t get it to connect to the server. I ordered a replacement and it was sent to an address 4,000 miles away from me. I got a refund and another camera but then the mount broke. I called the company and was told that they wouldn’t replace it. :(","updated":"2021-05-14T19:48:19-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4105020430","userName":"ChitownRoundTown","userUrl":"https://itunes.apple.com/us/reviews/id262636319","version":"6.4.2","score":3,"title":"Not as reliable as needed","text":"**Latest app update keeps logging us out of app. PLEASE FIX ASAP!!**\n\nFor a camera app, this NEEDS to be very reliable which is not always the case. It’s not bad, but there are times when I can’t connect...and when you want to check on your baby those times can be very frustrating! On a positive note, it’s nice to be able to check cameras remotely. But as mentioned, sometimes you’ll see the “device offline” for no apparent reason..or just one of cameras aren’t connected.","updated":"2019-05-05T08:53:52-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4345831829","userName":"skies2law","userUrl":"https://itunes.apple.com/us/reviews/id253598174","version":"6.5.1","score":5,"title":"Saved a life","text":"I have these cameras installed in my mother's home so I can monitor her from afar.  She had a health problem and I was able to get help for her. When I had a problem with the camera Mike in support helped me over many days and never made me feel like I was a bother. He took care of my issue and I was up and running.  I love the product and how the company stood by their product!","updated":"2019-06-20T20:37:38-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2050496906","userName":"OOTicus","userUrl":"https://itunes.apple.com/us/reviews/id131189280","version":"4.11.3","score":5,"title":"Current version had major flaw but was fixed","text":"The current update has made it impossible to see our camera on the local lan.  Please fix!!  The local lan access gives better stability and less latency.\n\nUPDATE:  the bug has indeed been fixed and we hadn’t had any issues since!  Thanks for the response!  I can now change my rating to 5 stars.","updated":"2018-01-02T08:09:17-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3939144852","userName":"abaladah","userUrl":"https://itunes.apple.com/us/reviews/id42414179","version":"6.2.1","score":1,"title":"Can’t view video feeds","text":"Had the product for about two years and everything was working fine.  I’m in Asia on a business trip and want to check in on my property, but the stupid app won’t let me view my video feed anymore.  It was working for the past 2 days ago, but suddenly stopped.  I can see that the camera works because I can refresh the feed and view the thumbnails, but I can’t click and view individual feeds or control the camera anymore!!  It’s so frustrating because there is no support and no reason why the app just stopped working!","updated":"2019-03-28T18:18:58-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4615250283","userName":"astcheetah23","userUrl":"https://itunes.apple.com/us/reviews/id40036503","version":"6.7.1","score":1,"title":"Network issue????","text":"I’m not sure why but every time I try to log in, I get an error message stating, “current network is not available. Is network diagnostics performed?” And I will press yes, it’ll run the “diagnostics test” and send Vimtag an email. The issue never gets resolved until I get home, unplug the camera from the wall, and reboot it. This only happens on my phone (iPhone XS) and no one else’s who has the app and views this specific camera. Can anyone help with this? I really don’t want to return the camera, especially because I don’t think it’s a camera issue; it’s an app issue","updated":"2019-08-14T06:03:57-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2830326365","userName":"Blondeelaurie","userUrl":"https://itunes.apple.com/us/reviews/id311705180","version":"5.5.1","score":5,"title":"Update screwed up the App","text":"Up date- Thank You Vimtag!! My app is working great again. Thrilled with your app again\n\nMy Vimtag app was working fine until they did the last update. Now it freezes up every single time I use it to check records, set record times, adjust sensitivity. \nCan’t even use the app anymore.\nPlease HELP get this fixed .","updated":"2018-07-03T15:02:53-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"5235334708","userName":"acemanawc","userUrl":"https://itunes.apple.com/us/reviews/id73010315","version":"6.11.2","score":3,"title":"Please Fix Sign In","text":"December 5, 2019\n\nLatest update presents a splash screen for cloud service. The splash screen appears every time I open the app. Please get rid of this splash screen as it is very annoying and it now takes me a extra second or two to open to my camera. I keep tapping skip at the top right corner  it keeps coming back. I will return 4 stars if u hi ou fet did of this splash screen. \n\nThank you.","updated":"2019-12-05T00:26:15-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4995181191","userName":"JCLGN","userUrl":"https://itunes.apple.com/us/reviews/id388855265","version":"6.8.2","score":3,"title":"App is decent, cameras not so much","text":"Decent app that works well for the most part. Motion detection recording and notifications are not consistent, so stopped using those and just use the main functions. \nThe cameras are a great idea with poor execution. Two out of the six indoor cameras work after three years. That is pretty terrible quality, and back then they were pretty expensive. Looking for a better quality company to switch.","updated":"2019-10-21T18:52:25-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4058819630","userName":"Cybs63","userUrl":"https://itunes.apple.com/us/reviews/id327921131","version":"6.4.1","score":2,"title":"New version bugged","text":"With the latest version, when you click the arrows to make it larger there isn’t an option to return it back to the original size without force stopping the app. Also when I click on my records, it tells me I have no recordings yet. I go on the desktop app, which is a separate bunch of headaches, the recordings are there. Every new version is getting worse. I’ve got 12 cameras that can’t be checked now because of this. Please fix it.","updated":"2019-04-25T08:23:12-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"8134131211","userName":"TPylot","userUrl":"https://itunes.apple.com/us/reviews/id25117479","version":"8.12.3","score":1,"title":"App shows off line when camera shows online","text":"The app doesn’t work with my P-1, v2 camera purchased in April 2021. The green “WiFi” connected light blinks on the camera, but the app shows the camera off line most of the time. It works fine with my older Vimtag cameras. Email customer service back and forth to China is very cumbersome. They used to have a live help desk in NY, but not any more. Gonna have to switch to a different brand of camera.","updated":"2021-12-15T15:21:08-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2053772099","userName":"Routemanj","userUrl":"https://itunes.apple.com/us/reviews/id267724604","version":"4.11.3","score":5,"title":"Can't log in","text":"Worked good until recently. Can't log in to look at anything. Kind of useless if you can't see anything.\n\nUpdate 1-3-18. Everything has been working good for a while. No bugs, doesn’t disconnect, and hasn’t been a headache to use lately.","updated":"2018-01-03T10:00:55-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4763282390","userName":"Disappointed vimtag customer","userUrl":"https://itunes.apple.com/us/reviews/id354141141","version":"6.7.1","score":3,"title":"Works greater than 80% of the time","text":"When it works, it’s great.  However, when it fails, it is useless.  Most days it works fine, but there are days with black screens or unexpected needs for resetting cameras. Not a positive thing for a camera in a nursery.  I’m not rushing in to restart a camera that then makes a loud sound when it turns back on.","updated":"2019-09-11T18:59:39-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4604448355","userName":"MillionMiler17","userUrl":"https://itunes.apple.com/us/reviews/id615137217","version":"6.7.1","score":3,"title":"It’s ok but needs to work on stability","text":"It’s ok for checking in on things but not for long monitoring as the software generally crashes every few minutes and you need to go back in. if they could fix this problem would give it probably a 5. just not something i would trust at this point.","updated":"2019-08-11T18:13:40-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3406217824","userName":"Ossie Kilmister","userUrl":"https://itunes.apple.com/us/reviews/id891558769","version":"5.10.2","score":5,"title":"Find a girl to chat","text":"The cameras are very impressive!! I like the fact you can see the cameras on your phone and can zoom in. You can also get friends and family the app and they can check in as well.","updated":"2018-11-11T06:12:36-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2292914736","userName":"ShaileshModi","userUrl":"https://itunes.apple.com/us/reviews/id222064237","version":"5.2.1","score":1,"title":"Worst app update and UX. Doesn’t work!!","text":"From last 3-4 months, I have been trying to fix the issue with support team that my vimtag camera stopped detecting motion and when it does the app doesn’t send notification at all. After sitting with support team, issues didn’t get resolved. Vimtag team doesn’t accept that Camera is faulty and also the new app update has the worst confusing menu that doesn’t let you select the motion detection or monitoring control.","updated":"2018-03-10T18:25:56-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3583292702","userName":"jotam4","userUrl":"https://itunes.apple.com/us/reviews/id440291728","version":"5.12.3","score":3,"title":"Just ok","text":"The latest fix appears to be stuck while downloading. This happened once before. I don’t like how you have to hold down the microphone button now to speak and when speaking it no longer sounds clear. The speaking function used to work much better when I first got this camera.","updated":"2018-12-28T03:16:34-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4679704572","userName":"Alpharxqw","userUrl":"https://itunes.apple.com/us/reviews/id563829171","version":"6.7.1","score":1,"title":"No fixes ever","text":"The developer had promised to fix the issue where motion detection alarm and motion detection based recording can use different schedules for past three years and have not yet released a fix for it yet. Most terrible surveillance camera company ever!!!! I regret buying 8 of these!\n\nDeveloper asked me as a response to this review to update app but hasn’t fixed the issue yet. Not sure why they promise when they can’t deliver. Typical sub standard Chinese product.","updated":"2019-08-26T20:06:02-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3219625331","userName":"Joenissan","userUrl":"https://itunes.apple.com/us/reviews/id185909763","version":"5.9.3","score":5,"title":"Used to work great!","text":"App doesn’t open since I got my new iPhone XS Max. Needs an undated fast or I’ll have to swap to my EyeCloud camera/app.\n\nEDIT: They listened!! Only hrs after my review, an update fixed the issue with the new iPhone XS and XS Max!! Great job and great camera and app!! Thank you!!!!","updated":"2018-09-22T20:04:49-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2030351624","userName":"42Doris Camp","userUrl":"https://itunes.apple.com/us/reviews/id638873727","version":"4.11.3","score":5,"title":"At home","text":"The Camera program works good but for new customers and promotions your company should release one free camera to new people on the app as a gift for using your app that would bring in more people to use the app","updated":"2017-12-26T16:13:32-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"5471352438","userName":"adstrick","userUrl":"https://itunes.apple.com/us/reviews/id15228587","version":"6.12.2","score":4,"title":"Cameras are great, app is OK","text":"The clarity and functionality of Vimtag cameras are awesome. But the app is just ok. One thing that could be improved- get rid of the Cloud Storage advertisement splash screen. I have to skip it every single time and it’s annoying.","updated":"2020-01-31T11:34:02-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2088662284","userName":"Woodandmusic","userUrl":"https://itunes.apple.com/us/reviews/id28737463","version":"4.12.1","score":1,"title":"Cannot Switch to Out Mode after recent update.","text":"I can also no longer switch to out mode or home mode after recent update as discussed by a similar comment. The down arrow is no longer in the upper right of the app that used to provide this function. Please advise as to how to switch to the out mode or home mode or if this is a bug that needs to be fixed. This is a critical need which was useful to me in the past.","updated":"2018-01-14T07:25:20-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4272585214","userName":"29494829192@3&","userUrl":"https://itunes.apple.com/us/reviews/id117127922","version":"6.5.1","score":1,"title":"App stopped working months ago","text":"Every time I open the app I get a message that the current network is unavailable and to perform a network diagnostic. I don’t know where this goes because I’ve also written the company and never gotten a reply. I constantly reboot the camera and it works while I’m in the house but when I try to use the camera/app from another location I get that message.","updated":"2019-06-06T06:15:21-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3398372498","userName":"Vannessa Thouless","userUrl":"https://itunes.apple.com/us/reviews/id766617907","version":"5.10.2","score":5,"title":"team","text":"Great app. Have had much better experience with this than previous brands I have used. Easy to navigate. Camera setup is SO easy, and navigating the app is simple and works great 99% of the time. ","updated":"2018-11-09T06:09:35-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2580918162","userName":"John john wa","userUrl":"https://itunes.apple.com/us/reviews/id419258468","version":"5.4.2","score":3,"title":"App crashes","text":"Crashes constantly after this latest update.  Terrible. They Completely went back to old format.  Can’t Review more than one video then it crashes every time\n\nUpdated may 21.  Latest rev fixed issue. Too bad it took a month to do so.","updated":"2018-05-22T04:28:34-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3394882772","userName":"Kannin Berthomieu","userUrl":"https://itunes.apple.com/us/reviews/id868029635","version":"5.10.2","score":5,"title":"Great way to meet new people","text":"I have tried several wifi cameras and I was OK with the ones I had purchased before from another brand... Until I came across this cameras.","updated":"2018-11-08T06:38:41-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3406199704","userName":"Elree Balling","userUrl":"https://itunes.apple.com/us/reviews/id837359601","version":"5.10.2","score":5,"title":"Bravo","text":"Love these little cameras. Great quality and features for such a low price. Whatever feature someone would ask about, I’d really only have good things to say.","updated":"2018-11-11T06:07:10-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3097394376","userName":"JosieFB","userUrl":"https://itunes.apple.com/us/reviews/id42959949","version":"5.7.3","score":1,"title":"App is broken","text":"Lost wireless connection awhile back. Finally tried to set it up again. Would not connect wirelessly. I had to use a network cable and plug it into the router. Now thumbnail shows a current view, but when I try to open live feed, it tries to open for a couple of minutes, then says “Network Connection failed. Try again later.” Very frustrating.","updated":"2018-08-21T19:52:57-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2042114238","userName":"Dirtlife7","userUrl":"https://itunes.apple.com/us/reviews/id418252460","version":"4.11.3","score":5,"title":"Updated review great job on all the fixes","text":"Great job on all the fixes with this app. The camera seems to function properly now with no flaws. It is now one of my most responsive caneras.","updated":"2017-12-30T13:08:12-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1807589728","userName":"bumblebee7917","userUrl":"https://itunes.apple.com/us/reviews/id163022926","version":"4.8.1","score":2,"title":"Sound","text":"App crashes frequently. The sounds turns off when you look at another app. So it makes it so you can only use your device for the camera if you need to use it for sound. When receiving a low battery message on phone, the sounds shuts off. You have to frequently check on the sounds.","updated":"2017-09-24T09:08:31-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4105907294","userName":"Lbigrrrl","userUrl":"https://itunes.apple.com/us/reviews/id29628700","version":"6.4.2","score":1,"title":"It was working fine","text":"This app was working fine until they updated it about a week ago. Now the app constantly shuts itself down and every time I open it back up, I’m required to reenter my user name and password.  It’s very frustrating since I’ve been using the app and camera as baby monitors. Hope they fix whatever they broke and they fix it fast! 😡","updated":"2019-05-05T12:56:51-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3394881764","userName":"Ziyan Gravell","userUrl":"https://itunes.apple.com/us/reviews/id868037512","version":"5.10.2","score":5,"title":"Cool people","text":"I got these cameras because they could record locally to a micro SD card, supported WiFi, and are inexpensive. The app interface is pretty decent. The cloud storage is expensive, but not a concern as I will use the local storage. ","updated":"2018-11-08T06:38:21-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2735202326","userName":"Sorenzz","userUrl":"https://itunes.apple.com/us/reviews/id30361847","version":"5.5.1","score":2,"title":"Hitting back arrow in settings not working","text":"When in the settings menu and you click on a menu option, when you are done making change I can't get back to settings menu. Nothing happens when hitting back button multiple times. Maybe a delete and reinstall of app??","updated":"2018-06-20T19:30:00-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2428535627","userName":"funk_drum","userUrl":"https://itunes.apple.com/us/reviews/id3473072","version":"5.3.1","score":4,"title":"Motion detection stopped","text":"At some points in the last week motion detection notification stopped on all cameras. The option for that in the app is gone. Motion detection notification is very important. Please bring it back.","updated":"2018-04-16T00:21:00-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3084408265","userName":"Rae Poundm","userUrl":"https://itunes.apple.com/us/reviews/id886752762","version":"5.7.3","score":5,"title":"Convenient and practical","text":"I like the recording, you could record video and share it with your friends via whatsapp.","updated":"2018-08-18T20:18:47-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3233899830","userName":"MPooper #7","userUrl":"https://itunes.apple.com/us/reviews/id862158628","version":"5.9.3","score":5,"title":"5 stars","text":"The WIFI connection is a bit slow and everything else is fine，","updated":"2018-09-26T17:44:42-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3042748542","userName":"Katharine Ted5o4","userUrl":"https://itunes.apple.com/us/reviews/id704931931","version":"5.6.3","score":5,"title":"This App is very powerful, and it is recommended for everyone to","text":"Alarm works well, got notification from the APP every time there was a movement in our house.","updated":"2018-08-09T20:06:28-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3402258232","userName":"Kush Behrendsen1532319914","userUrl":"https://itunes.apple.com/us/reviews/id868014352","version":"5.10.2","score":5,"title":"Easy money","text":"Really like the easy setup! This will be perfect to see if the in-laws stop over when we are out of town for a few days. ","updated":"2018-11-10T06:34:05-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"5288354542","userName":"fil5th","userUrl":"https://itunes.apple.com/us/reviews/id135858045","version":"6.11.2","score":1,"title":"Works but annoying cloud services adds","text":"Everything works ok but since the new update every time I open the panel with the camera feeds, I’m prompted to purchase cloud services. Very annoying.\nAlso, translation to English in general is very very poor, which makes the app overall look not professional","updated":"2019-12-18T11:36:34-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3254610788","userName":"ELilliel ollipop 612","userUrl":"https://itunes.apple.com/us/reviews/id861263788","version":"5.9.3","score":5,"title":"Awesome","text":"The function of the camera is very hopeful! but the choice of ringtones is very small! I hope to be able to customize.","updated":"2018-10-02T01:08:02-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2419578504","userName":"jwk34psu06","userUrl":"https://itunes.apple.com/us/reviews/id234536678","version":"5.3.1","score":2,"title":"Can’t Record or set Alarm","text":"2 stars because the live camera function works. Other than that the device is useless without the capability to use the Recod or Alarm function in the app. Plus, in-app instructions aren’t in English. You’re selling an expensive product that has many flaws.","updated":"2018-04-13T17:57:10-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3215646198","userName":"rab9499","userUrl":"https://itunes.apple.com/us/reviews/id31523194","version":"5.9.2","score":2,"title":"Help","text":"Just updated to IPhone XSMax with IOS 12.  Tried to open the Vimtag app.  It acts like it is going to open, then blinks to a black screen and closes.  I was able to open this app on my old iphone.  Your product has always worked before the update.  Your help would be greatly appreciated.","updated":"2018-09-21T19:36:34-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2799761678","userName":"Mikeding","userUrl":"https://itunes.apple.com/us/reviews/id127368728","version":"5.5.1","score":2,"title":"Ver 5.5.1 settings screens get stuck","text":"In ver 5.5.1 on iOS 10.3.3 for iPhone, if the cache is full, the settings screens won't go back to the prior screen when you tap the back arrow. Clearing the cache seems to clear the problem temporarily, but it seems to come back when you modify settings again. Very peculiar.","updated":"2018-06-29T17:50:18-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3394778372","userName":"Jeremaih Nial","userUrl":"https://itunes.apple.com/us/reviews/id868179445","version":"5.10.2","score":5,"title":"Thanks","text":"I'm please with the quality of the camera and the night feature is great! And as far as the app for what I think it's main intention was for its great.","updated":"2018-11-08T06:04:32-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"6116189786","userName":"sptiki","userUrl":"https://itunes.apple.com/us/reviews/id713803809","version":"7.4.3","score":3,"title":"Storage space","text":"I have two cameras and the storage box. For the most part they work fine. What I don’t understand is why the app takes up 16.5 GB of space on my phone. Can anyone help or explain why?","updated":"2020-06-24T06:01:12-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3406204207","userName":"Raelle Carlyle","userUrl":"https://itunes.apple.com/us/reviews/id868037392","version":"5.10.2","score":5,"title":"Very good","text":"My family bought 4 cameras a week ago. They loved the pricing and how easy it was to set up accounts and devices.","updated":"2018-11-11T06:08:33-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3084437030","userName":"Sam Cook(e)j","userUrl":"https://itunes.apple.com/us/reviews/id886793291","version":"5.7.3","score":5,"title":"Very good software,","text":"Wifi connection is fast, and easy, the APP tell you exactly what to do step by step, don’t even need to read the manual.","updated":"2018-08-18T20:28:36-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2845447933","userName":"Miafinos","userUrl":"https://itunes.apple.com/us/reviews/id87653665","version":"5.5.1","score":1,"title":"Newest update renders app useless","text":"Newest update renders app useless as most functions within the app interface do not function. Extremely frustrating. Cannot adjust record times, cannot use back button, does not re-record over old video, just plain useless. Why would an update be released with so many elementary mistakes?","updated":"2018-07-05T17:46:52-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4109915451","userName":"MitchITW","userUrl":"https://itunes.apple.com/us/reviews/id49807628","version":"6.4.2","score":1,"title":"Unreliable","text":"1. Required to login every time I use the app, great job on the update.\n2. All my history disappeared, thanks.\n3. Can’t view current motion detection alerts, what good is the alert if you can’t view the video.\nWhat a joke if you try to get app support, everything is vague once you get to the page after being bombarded with new products.","updated":"2019-05-06T08:34:37-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3042861574","userName":"Paul Augustr4b","userUrl":"https://itunes.apple.com/us/reviews/id704931872","version":"5.6.3","score":5,"title":"Easy to use, I hope to continue to optimize and increase more ri","text":"Live video is good, except that sometimes there’s some delay, but could be accepted.","updated":"2018-08-09T20:40:00-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4146138585","userName":"mlarson123","userUrl":"https://itunes.apple.com/us/reviews/id43715943","version":"6.4.2","score":1,"title":"Please fix login issue","text":"Please fix the issue of having to login every time I open the app.  This was not a problem until the latest app update.  Just to let me know you actually read my feedback, please be aware that I have already updated to the latest app version and I do not need an apology for the inconvenience.","updated":"2019-05-13T17:30:58-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3391218045","userName":"Nandana Kinkade","userUrl":"https://itunes.apple.com/us/reviews/id868106394","version":"5.10.2","score":5,"title":"Dates","text":"I just installed two cameras and I am very impressed with the results! The quality of the picture and sound are excellent. ","updated":"2018-11-07T06:09:01-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3042913451","userName":"Harte Brook7bj","userUrl":"https://itunes.apple.com/us/reviews/id704931850","version":"5.6.3","score":5,"title":"Practical and useful","text":"The APP is good generally, all functions work great, would be better if the cloud storage function is ready.","updated":"2018-08-09T20:54:54-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"5616557269","userName":"Samzqh","userUrl":"https://itunes.apple.com/us/reviews/id359625322","version":"6.12.2","score":3,"title":"Very good product, not bad app","text":"When I watch the recorded video it is lagging also I can’t save or share any video the share button isn’t working","updated":"2020-03-04T13:13:34-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3252971435","userName":"Jwayneski","userUrl":"https://itunes.apple.com/us/reviews/id23130666","version":"5.9.3","score":2,"title":"Add the button back","text":"Please add the “Home” and “Away” button back to the front end of the app. It’s very annoying and not a very quick process to activate the alarm when leaving the house or outside of the scheduled settings. That was the best feature in the app; please add it back.","updated":"2018-10-01T14:08:33-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3043059050","userName":"Franklin Kama2xh","userUrl":"https://itunes.apple.com/us/reviews/id704931877","version":"5.6.3","score":5,"title":"The game is good and stable","text":"The good thing about this APP is, you could set a schedule, then the APP will send you alarm only when you want it.","updated":"2018-08-09T21:39:36-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1824977549","userName":"Lani9591","userUrl":"https://itunes.apple.com/us/reviews/id39189300","version":"4.9.1","score":1,"title":"Worst Camera App Ever","text":"This is really the worst camera app I have ever used. 90% of the time I can’t even view my camera feed because I can’t get into my account! Continues to say “Unable to Connect to Server”. Called the service number and the guy didn’t even know how to fix it. About to return my camera if this isn’t fixed soon.","updated":"2017-10-03T09:31:45-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4060530561","userName":"fixthispleaseeeeeeee","userUrl":"https://itunes.apple.com/us/reviews/id765431816","version":"6.4.1","score":2,"title":"Not too happy with most recent update","text":"I can have this app open, go to another app real quick and back to this one and every time I have to log back in again. Also, doesn’t show my recordings for either camera I have.","updated":"2019-04-25T18:24:56-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2008674437","userName":"Amy Bach","userUrl":"https://itunes.apple.com/us/reviews/id680104557","version":"4.11.3","score":5,"title":"Finally found an easy and useful app","text":"Finally found an easy and useful app to watch my dog while I'm away.","updated":"2017-12-19T01:49:22-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"5420327151","userName":"sp341","userUrl":"https://itunes.apple.com/us/reviews/id211457194","version":"6.12.2","score":1,"title":"Cloud advertising","text":"How long do I have to continue to see and be delayed by the cloud advertisement before getting to see my cameras? This is very annoying and unnecessary as I have seen the advertisements and if I wanted to purchase cloud space I would have already.","updated":"2020-01-18T12:17:19-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2033464203","userName":"NUAX_LU","userUrl":"https://itunes.apple.com/us/reviews/id642584780","version":"4.11.3","score":5,"title":"Easy set up! Works great!!","text":"Easy to set up and use. Works especially well would recommend","updated":"2017-12-27T17:00:58-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3402160914","userName":"Cevera Bunten","userUrl":"https://itunes.apple.com/us/reviews/id868006638","version":"5.10.2","score":5,"title":"Dating application","text":"The app works pretty well and the cameras seem to function fine.","updated":"2018-11-10T06:04:36-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3624211681","userName":"Texas pie","userUrl":"https://itunes.apple.com/us/reviews/id507180514","version":"5.12.3","score":1,"title":"Slow app And horrible costumer service","text":"The app is not great but not bad. It’s confusing to find things since there’s so many sub tabs. I had issues with my camera and costumer service team was by far the worse I’ve ever encountered. The camera is decent but not worth the confusing app and crappy service.","updated":"2019-01-07T14:51:04-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"6653738219","userName":"Khs308","userUrl":"https://itunes.apple.com/us/reviews/id133031713","version":"7.10.2","score":1,"title":"Freeze","text":"Can you do something about the latest issue where the feed freezes? This has been going on for over a week now. It basically makes this whole system useless. Thanks much!","updated":"2020-11-16T17:47:56-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4296778012","userName":"NikiC75","userUrl":"https://itunes.apple.com/us/reviews/id42083639","version":"6.5.1","score":1,"title":"Camera is great app horrible","text":"The app is so bad. It never works properly. Example, the alert does not work when it detects motion. The video will be there that it captured movement but no alert is ever sent. Also you can’t set specific times that you want recording or alerts... unless you want on the hour.","updated":"2019-06-10T12:46:33-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4508708880","userName":"Flcobra2377","userUrl":"https://itunes.apple.com/us/reviews/id158165229","version":"6.7.1","score":1,"title":"Garbage!","text":"Whoever thought this was a good final product over the last should be fired! Not only do the pics look like a child picked them but it makes me steer farther away from your products than trust them!\n\nUpdate: the update only shows the people who design this app do not and will not use this app!","updated":"2019-07-23T20:15:41-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4175438978","userName":"Britteknight09","userUrl":"https://itunes.apple.com/us/reviews/id225987823","version":"6.5.1","score":1,"title":"New update is horrible","text":"This new update is so bad I swear! I have to log in every time I open the stupid app, I absolutely hate how I have to turn my phone to zoom in or see anything on my camera! And every since the update, my camera won’t turn right and the screen is freezing up!","updated":"2019-05-19T06:38:57-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3084393379","userName":"Darren Mondj","userUrl":"https://itunes.apple.com/us/reviews/id889267983","version":"5.7.3","score":5,"title":"A very good application","text":"The APP is great, now i could check my house even when i am not home.","updated":"2018-08-18T20:13:53-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3217483374","userName":"cant view baby","userUrl":"https://itunes.apple.com/us/reviews/id190059025","version":"5.9.2","score":1,"title":"App won’t stay open on iPhone XS Max","text":"This worked great in all my other devices but I just got the new iPhone and the app opens and then immediately closes before I can do anything! I have a baby and I need to be able to view her from my phone, it’s the whole reason I got this camera","updated":"2018-09-22T06:31:17-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2419660492","userName":"Aquaokie","userUrl":"https://itunes.apple.com/us/reviews/id628498146","version":"5.3.1","score":2,"title":"Notifications/ Alarm not working","text":"I’ve restarted the app and reset the camera and I’m still not getting notifications, it’s not allowing me active notification button. The alarm tab is blank with I click to active it.","updated":"2018-04-13T18:24:40-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2030389213","userName":"Eve Donne","userUrl":"https://itunes.apple.com/us/reviews/id685219087","version":"4.11.3","score":5,"title":"Best iOS Camera System there is.","text":"Used a baby monitor to keep an eye on guest.  Simple setup. Simple use. Lots of power though. .","updated":"2017-12-26T16:33:12-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3262276243","userName":"tMylit3lecutieW13","userUrl":"https://itunes.apple.com/us/reviews/id861245687","version":"5.9.3","score":5,"title":"Best Free App","text":"I really like the video function！ which makes the camera interesting.","updated":"2018-10-04T03:34:42-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3042897749","userName":"Doyle Kyle9hb","userUrl":"https://itunes.apple.com/us/reviews/id704953325","version":"5.6.3","score":5,"title":"Its practical, and theres room for improvement.","text":"Nice app, smooth streaming and clear video","updated":"2018-08-09T20:50:22-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4440860058","userName":"Allie$","userUrl":"https://itunes.apple.com/us/reviews/id783101899","version":"6.5.1","score":2,"title":"App Issue","text":"The app forces me to login each time the app is opened instead of keeping me logged in. Also neither one of my cameras are accessible through the app. Both cameras randomly and often go off online as well.","updated":"2019-07-10T19:16:14-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3084427437","userName":"Jeff Joel1","userUrl":"https://itunes.apple.com/us/reviews/id886775686","version":"5.7.3","score":5,"title":"Yes, friends like to use this software","text":"I love the APP, it made me feel at home even when i was not.","updated":"2018-08-18T20:25:20-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3008720959","userName":"Agnes Coopery","userUrl":"https://itunes.apple.com/us/reviews/id871262683","version":"5.6.3","score":5,"title":"Very good app!","text":"The APP is great, now i could check my house even when i am not home.","updated":"2018-08-02T19:48:00-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"5099972592","userName":"AndyWillyT","userUrl":"https://itunes.apple.com/us/reviews/id37068119","version":"6.9.2","score":2,"title":"Recent V6.9.2 update crashes!!!!!","text":"App crashes on iPad when you try click the S1 device under account / my album to view a downloaded video from S1 cloud device","updated":"2019-11-07T10:37:54-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3216030333","userName":"Kimbeelr","userUrl":"https://itunes.apple.com/us/reviews/id802017168","version":"5.9.2","score":2,"title":"Doesn’t work with XS Max","text":"This app worked great with all my iPhones except the newest one. The app closes itself before I can even log in on the XS Max even though it worked fine on the iPhone X running IOS 12. Doesn’t really make sense.","updated":"2018-09-21T22:06:02-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4111925434","userName":"mailman1313","userUrl":"https://itunes.apple.com/us/reviews/id1015188678","version":"6.4.2","score":1,"title":"Login since upgrade","text":"Since the last upgrade I have to login every day, and we can only have the login for our camera in one place. It is very frustrating to have to login every time we want to check the camera.","updated":"2019-05-06T19:48:05-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2880240838","userName":"Brad Thorn","userUrl":"https://itunes.apple.com/us/reviews/id145615609","version":"5.5.1","score":1,"title":"Latest Version is Junk","text":"Everything worked great until the latest update. All kinds of problems, save your money and look elsewhere.  Sorry not good enough, how about make an effort to fix the issues and keep customers informed?!","updated":"2018-07-10T13:51:48-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"5924224245","userName":"User5634","userUrl":"https://itunes.apple.com/us/reviews/id496491411","version":"7.4.3","score":1,"title":"Upgraded wifi and now device doesn’t work","text":"I upgraded my wifi to 600mbps and now my device won’t work. I attempted to contact the company, no response. How disappointing on both accounts!","updated":"2020-05-09T09:54:09-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"5582208173","userName":"Mnmnسييييييء","userUrl":"https://itunes.apple.com/us/reviews/id182583215","version":"6.12.2","score":1,"title":"Last update ruined my cam","text":"My cam keeps showing error device is offline check for help.\nWhy you sent this update you have ruined it\nIt was working fine before 😡😡","updated":"2020-02-26T01:46:49-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2936746016","userName":"afc26","userUrl":"https://itunes.apple.com/us/reviews/id225608680","version":"5.5.1","score":1,"title":"Used to be an OK app...","text":"The camera itself is great. However, the latest updates to the app have made it inoperable. \n\nOne - the back arrow doesn’t work. I have to force quit the app and reopen it every time I go into the settings. \n\nTwo - I can no longer tell the app that when I’m “out” or “home” manually. \n\nThree - I’m not even sure the sensor and alarm recording is working anymore. I haven’t had any recorded events for months now. \n\nCan they revert back to the old app and fix these software issues?!","updated":"2018-07-19T18:14:47-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3320955106","userName":"jules728","userUrl":"https://itunes.apple.com/us/reviews/id20835814","version":"5.9.4","score":4,"title":"Does not work on iPhone Xs Max - fixed","text":"App was crashing on login. Issue has been resolved","updated":"2018-10-19T16:33:17-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3084406738","userName":"Eunice Jackx","userUrl":"https://itunes.apple.com/us/reviews/id886771969","version":"5.7.3","score":5,"title":"There is time to look at it.","text":"The best APP for home camera so far, simple yet useful.","updated":"2018-08-18T20:18:16-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3391212593","userName":"Andreona Dubbin","userUrl":"https://itunes.apple.com/us/reviews/id842517452","version":"5.10.2","score":5,"title":"No issues...Great views","text":"It is very easy to use to watch my dog, I even can call him her","updated":"2018-11-07T06:07:15-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3084405324","userName":"Clyde Wyat(t)y","userUrl":"https://itunes.apple.com/us/reviews/id886783612","version":"5.7.3","score":5,"title":"Convenient, good","text":"The APP surely exceed my expectation, very easy to use, all function work well.","updated":"2018-08-18T20:17:49-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4379640093","userName":"wakygy","userUrl":"https://itunes.apple.com/us/reviews/id133944797","version":"6.5.1","score":1,"title":"Can’t connect to WiFi.","text":"Cannot connect to WiFi. I had to restore my camera to factory settings because it kept reading “offline”. Now I can’t connect to the WiFi at all. It keeps saying “failed to connect, please try again”.","updated":"2019-06-27T21:43:29-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"5180646020","userName":"Sanriyadh","userUrl":"https://itunes.apple.com/us/reviews/id647173061","version":"6.9.2","score":1,"title":"Can’t login","text":"I am having issues that I can’t login sometimes and when login can’t open the cameras for the last 3 weeks sent emails to the support but no answers??","updated":"2019-11-22T03:06:50-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4145396272","userName":"AliP25","userUrl":"https://itunes.apple.com/us/reviews/id506462123","version":"6.4.2","score":1,"title":"Crap","text":"Looking for a new camera. Since the latest update it doesn't hold login info, and you have to reset the sound everytime. It's a headache and going on over a week now. It's pointless to have this as it wastes to much time. Used to swear by Vimtag, shame. 😡","updated":"2019-05-13T12:35:59-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3042952603","userName":"Finn Clark7ic","userUrl":"https://itunes.apple.com/us/reviews/id704931812","version":"5.6.3","score":5,"title":"The overall look is more coordinated","text":"Add-up process is good, fast and successful.","updated":"2018-08-09T21:05:54-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3042890010","userName":"Barrett Hunterlnx","userUrl":"https://itunes.apple.com/us/reviews/id704931948","version":"5.6.3","score":5,"title":"All five, like","text":"Audio talk is amazing, i talked to my kids when i was at work.","updated":"2018-08-09T20:48:09-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3006662615","userName":"zacevansphoto","userUrl":"https://itunes.apple.com/us/reviews/id265772193","version":"5.6.3","score":3,"title":"Functional but Clunky","text":"The app is full of typos and what sounds like bad English translations, but it works.","updated":"2018-08-02T08:29:40-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"7911641641","userName":"NPR01","userUrl":"https://itunes.apple.com/us/reviews/id20704058","version":"8.10.3","score":2,"title":"Can’t connect","text":"Working good until latest update 1 day ago. Cannot connect anymore. Frustrating","updated":"2021-10-13T15:41:04-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3369226083","userName":"Kristinatirjer","userUrl":"https://itunes.apple.com/us/reviews/id8971789","version":"5.10.2","score":1,"title":"Repeated “unable to connect to server” error message","text":"Such a piece of junk. I have repeatedly gotten the error message which has essentially rendered the device useless as I cannot access it in the app. Please fix these issues!!!","updated":"2018-11-01T09:52:42-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3013401448","userName":"DaiseyK","userUrl":"https://itunes.apple.com/us/reviews/id229366760","version":"5.6.3","score":1,"title":"Upgrade broke all settings","text":"I can no longer set the alarm, notifications, record settings, etc. I can’t even get to the settings to see what is set. Looks like I’ll have to toss the two cameras I have and get different brands. Total trash now.","updated":"2018-08-03T16:27:06-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2030353281","userName":"55Maurice Nixon","userUrl":"https://itunes.apple.com/us/reviews/id638874276","version":"4.11.3","score":5,"title":"Works great","text":"I get to watch my puppy while at work. Two thumbs up.","updated":"2017-12-26T16:14:22-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2008673366","userName":"Benedict Sheridan","userUrl":"https://itunes.apple.com/us/reviews/id680104282","version":"4.11.3","score":5,"title":"Great app for surveillance","text":"Amazing app for keeping up with your home, car, personal belongings, closet space, etc., S.C. Wisdom!","updated":"2017-12-19T01:48:46-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"6635459914","userName":"Poopsauce2","userUrl":"https://itunes.apple.com/us/reviews/id35896140","version":"7.10.2","score":1,"title":"Freezes after update","text":"Freezes within a minute after latest update.","updated":"2020-11-11T19:43:50-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3084864225","userName":"Oswald Bartl","userUrl":"https://itunes.apple.com/us/reviews/id889335828","version":"5.7.3","score":5,"title":"OK, 5 stars, support","text":"The talk function enables me to shout at my son when he is making a mess, haha","updated":"2018-08-18T22:45:35-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2074225782","userName":"TeachMeAllTheThings","userUrl":"https://itunes.apple.com/us/reviews/id36963730","version":"4.12.1","score":5,"title":"Works great","text":"Easy to connect and use","updated":"2018-01-09T20:53:11-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2015920914","userName":"93Darcy Forster","userUrl":"https://itunes.apple.com/us/reviews/id681867082","version":"4.11.3","score":5,"title":"Great App","text":"This apps is really great helping me monitor the situation at home when I am out.","updated":"2017-12-21T16:40:42-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1922401502","userName":"JP8604","userUrl":"https://itunes.apple.com/us/reviews/id108222665","version":"4.11.1","score":1,"title":"Update broke the app on iPhone X","text":"Last update yesterday causes app to crash upon sign in. Even after deleting and reinstalling, app will crash when signing in with existing account information.","updated":"2017-11-15T02:30:34-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2895070362","userName":"Tenga luvva","userUrl":"https://itunes.apple.com/us/reviews/id14793950","version":"5.5.1","score":1,"title":"App not working.","text":"Is there an update coming soon? \nWhen I go into settings to set up a recording schedule or do anything in settings it won’t come back to the main menu.","updated":"2018-07-12T14:15:48-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3321828524","userName":"Mean mug man 22244435564","userUrl":"https://itunes.apple.com/us/reviews/id247372275","version":"5.9.4","score":1,"title":"All fake reviews","text":"All the 5 star reviews are so fake.  Cameras worked great till a new system update came out in June.  Now nothing records and I’ve tried to get it to work without any success.  Stay away from VIMTAG.  They are horrible.","updated":"2018-10-19T22:29:41-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2030350828","userName":"Wilbur Franklinc","userUrl":"https://itunes.apple.com/us/reviews/id526935286","version":"4.11.3","score":5,"title":"Review","text":"This app is excellent to use my old iPhone.","updated":"2017-12-26T16:13:06-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1792944797","userName":"BravoK","userUrl":"https://itunes.apple.com/us/reviews/id120186027","version":"4.8.1","score":1,"title":"It WAS good","text":"I've had these cameras set up successfully for about 1 year. I checked the app today and all of my cameras have been deleted from the app and I cannot reinstall them. Help! Or it's going into the trash.","updated":"2017-09-16T07:53:11-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4140832262","userName":"Tazzdr","userUrl":"https://itunes.apple.com/us/reviews/id30163064","version":"6.4.2","score":1,"title":"I’m not buying another Vimtag Camera until the App is Fixed!","text":"App used to work well. Latest version is a mess. It now has distracting ads and can’t keep the time zones straight","updated":"2019-05-12T13:41:49-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2451470450","userName":"andrewrodney","userUrl":"https://itunes.apple.com/us/reviews/id204948050","version":"5.3.1","score":2,"title":"Version 4.9.1 is buggy","text":"Alarm GUI non existent on two of my three cameras since this update. Impossible to configure. Tried everything. Used to work. :-(","updated":"2018-04-21T16:20:13-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4146095558","userName":"SebastianKennedy","userUrl":"https://itunes.apple.com/us/reviews/id32508583","version":"6.4.2","score":1,"title":"Please fix login","text":"Since the update, I get logged out everytime and have to relog in each time. Would rather have the previous version back!!","updated":"2019-05-13T17:18:04-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4100081176","userName":"davefro","userUrl":"https://itunes.apple.com/us/reviews/id1014136220","version":"6.4.2","score":1,"title":"Not working","text":"Can’t download the app. After camera went off line could not get it back again    Deleted app and tried to redown load and couldn’t","updated":"2019-05-04T09:30:01-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"7386654297","userName":"Rtpilot1","userUrl":"https://itunes.apple.com/us/reviews/id269017288","version":"8.5.2","score":1,"title":"App crash","text":"App crashes after 1 minute. Have to reload app and then camera to again see it fail. Please fix","updated":"2021-05-25T06:43:53-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3398450649","userName":"Geetika Lopes","userUrl":"https://itunes.apple.com/us/reviews/id773374025","version":"5.10.2","score":5,"title":"Zeraya19","text":"This is a great app and the camera product is excellent. ","updated":"2018-11-09T06:33:56-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2030348741","userName":"Samantha Bess90","userUrl":"https://itunes.apple.com/us/reviews/id685210422","version":"4.11.3","score":5,"title":"It works","text":"Have free version and it works","updated":"2017-12-26T16:12:01-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"6609037639","userName":"Loyal little from pa","userUrl":"https://itunes.apple.com/us/reviews/id15644139","version":"7.10.2","score":1,"title":"New update freezes","text":"My video feed freezes with new update.  Tried restarting I pad closing app.  Keeps happening.","updated":"2020-11-04T11:34:51-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3564213322","userName":"Theloniousmc","userUrl":"https://itunes.apple.com/us/reviews/id203219234","version":"5.12.3","score":1,"title":"Is this a joke?","text":"App doesn’t work. Are your servers down? You’re a joke and have lost all credibility. It’s worth paying money to go with a credible company for cloud camera service. Not this one.","updated":"2018-12-23T09:31:26-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2942835448","userName":"lotzakids","userUrl":"https://itunes.apple.com/us/reviews/id527639928","version":"5.5.1","score":1,"title":"\"update\" has broken the system.","text":"Please fix this ASAP! I use my camera to ensure that my severly handicapped son is well cared for. It no longer records which makes it useless for me and potentially dangerous for him.","updated":"2018-07-20T22:51:31-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2015923334","userName":"Ann Trumanf","userUrl":"https://itunes.apple.com/us/reviews/id681867365","version":"4.11.3","score":5,"title":"Excellent App","text":"Easy to use and consistent.","updated":"2017-12-21T16:42:06-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2134926516","userName":"Buckbuck2dabang","userUrl":"https://itunes.apple.com/us/reviews/id16753968","version":"5.1.1","score":1,"title":"Update","text":"Recent update has turned app into garbage\n\nEdit: Camera itself isn’t bad at all. However the app, recent updates and tech support are pitiful.","updated":"2018-01-27T19:42:49-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2902984023","userName":"shopping in new system☹️","userUrl":"https://itunes.apple.com/us/reviews/id860380652","version":"5.5.1","score":1,"title":"New update is the Worst one yet","text":"Everything tease kat 89 said is completely true\nNo more motion alert no more alarms everything was great until they did this upgrade","updated":"2018-07-13T18:14:26-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3219659449","userName":"Biggiegiles","userUrl":"https://itunes.apple.com/us/reviews/id114897098","version":"5.9.3","score":5,"title":"Vimtag","text":"Works wonderfully","updated":"2018-09-22T20:17:22-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4086943810","userName":"Bonb0nn","userUrl":"https://itunes.apple.com/us/reviews/id299998239","version":"6.4.2","score":1,"title":"No longer records","text":"It’s been days since I’ve noticed that my cameras no longer records on my SIM card. It keeps telling me to reformat. But it doesn’t work.","updated":"2019-05-01T14:36:40-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"6486218312","userName":"TEK325","userUrl":"https://itunes.apple.com/us/reviews/id1214777002","version":"7.7.6","score":1,"title":"Doesn’t work on new iPad running iPadOS 14.0.1","text":"Icon is grayed out and will not open v.7.7.6. Can’t delete app. I guess I am a beta tester for this app.","updated":"2020-09-30T15:07:54-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2852952321","userName":"Suslisi","userUrl":"https://itunes.apple.com/us/reviews/id180743700","version":"5.5.1","score":1,"title":"“Sorry” ????","text":"Why do u keep selling these if app doesn’t work?? And your response to the review that the back arrow doesn’t work is “ sorry”.\nPathetic . Zero stars","updated":"2018-07-06T17:49:49-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3113712075","userName":"Jdh5153","userUrl":"https://itunes.apple.com/us/reviews/id206009063","version":"5.7.3","score":1,"title":"Doesn’t work","text":"Most of the settings no longer work. Time to switch to Ring I guess.","updated":"2018-08-25T13:31:30-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1792733063","userName":"Beason26","userUrl":"https://itunes.apple.com/us/reviews/id480029717","version":"4.8.1","score":1,"title":"Horrible","text":"Doesn't work.  Doesn't allow you to add cameras to the list and cannot connect.","updated":"2017-09-16T05:20:05-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3215507992","userName":"AMC1929","userUrl":"https://itunes.apple.com/us/reviews/id908803485","version":"5.9.2","score":1,"title":"Crashes","text":"App crashes immediately when I try to start it. Using the new XS Max on iOS 12 if that matters","updated":"2018-09-21T18:42:33-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2921389100","userName":"lavan harami","userUrl":"https://itunes.apple.com/us/reviews/id462390036","version":"5.5.1","score":1,"title":"Horrible app","text":"Horrible app always freezes setting don’t work","updated":"2018-07-17T00:02:59-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3214810856","userName":"Computerrebel.pr","userUrl":"https://itunes.apple.com/us/reviews/id43318905","version":"5.9.2","score":1,"title":"Force quits at login","text":"Just upgraded to iPhone XS max and the app doesn’t let you passed login it just crashes!!!","updated":"2018-09-21T13:21:25-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2106366875","userName":"Dermatome123","userUrl":"https://itunes.apple.com/us/reviews/id85269619","version":"4.12.1","score":1,"title":"Update killed my device","text":"I have a CP1 Cool Petcam and it appears the new app doesn’t support this device anymore. What a waste of money!","updated":"2018-01-19T18:16:57-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3207817846","userName":"zebra7474","userUrl":"https://itunes.apple.com/us/reviews/id227357193","version":"5.9.2","score":1,"title":"IOS 12 Fail","text":"No longer works on iPad since iOS 12 upgrade","updated":"2018-09-19T15:18:47-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3214756728","userName":"Djpeetur","userUrl":"https://itunes.apple.com/us/reviews/id101178277","version":"5.9.2","score":1,"title":"Does not work with iPhone Xs","text":"App crashes when loading.","updated":"2018-09-21T12:56:10-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3217885329","userName":"heinekevin","userUrl":"https://itunes.apple.com/us/reviews/id803691726","version":"5.9.2","score":1,"title":"Poor connection","text":"Poor connection!!! The signal is unstable\nSlowly streaming!!","updated":"2018-09-22T08:27:26-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1387866007","userName":"vademecum2017","userUrl":"https://itunes.apple.com/us/reviews/id22034325","version":"3.5.2","score":4,"title":"You'd better delete the app & reinstall to make it work","text":"This app used to be functional with all little inconveniences and imperfections. I respect that all products need time to improve and reach maturity, so no complaints then. But after the latest updates, the app just ceased functioning at all. It takes forever to \"sign in\", if lucky my camera did show up on the interface, it came up with X in the middle and not working.\n\n6/2 update: I deleted the app and reinstalled it after I read some reviews. It's working again! And I can see my camera in the Local section again.","updated":"2016-06-02T07:44:42-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2545096741","userName":"Schaf1216","userUrl":"https://itunes.apple.com/us/reviews/id43742699","version":"5.4.2","score":2,"title":"Fix your app","text":"The camera broadcast flips upside down.  Poorly written/coded app","updated":"2018-05-14T02:16:37-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1921808951","userName":"Jaycoolz","userUrl":"https://itunes.apple.com/us/reviews/id109837290","version":"4.11.1","score":1,"title":"Keeps crashing on iPhone X please fix ASAP","text":"Update on 11/14 keeps crashing on iPhone X","updated":"2017-11-14T19:53:23-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2676845247","userName":"gerybuki","userUrl":"https://itunes.apple.com/us/reviews/id42844776","version":"5.5.1","score":1,"title":"No motion detection configuration possible anymore","text":"From iOS","updated":"2018-06-11T06:37:46-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2030345151","userName":"Kimberley Whyet71","userUrl":"https://itunes.apple.com/us/reviews/id638873998","version":"4.11.3","score":5,"title":"Great app","text":"Love it!","updated":"2017-12-26T16:10:11-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2889256726","userName":"annoyedagain2","userUrl":"https://itunes.apple.com/us/reviews/id754634715","version":"5.5.1","score":1,"title":"Worst app ever","text":"I’ve had these cameras and app for two years now, give or take. It’s always been a horrible app but it’s gone downhill from here making it useless.\n\nWhat’s happening now: \n1. The time somehow registers incorrectly on videos and stills despite being set correctly in settings. Naturally this is bad for many reasons.\n2. I used to get four notifications for every tiny little shift of a sunbeam. They supposedly fixed that and indeed it was better. For a month. In this place, the camera is in a spot where the light barely changes and yet it still takes dozens of pictures of nothing. \n3. The pictures and video thumbnails don't match what the pics and videos actually are but are of much older stills/videos.\n4. The videos are not even a second long and show nothing even when I’m the one that set it off by coming home.\n5. I just got home and checked the feed of while I was gone and out of 10 stills over an hour, all of them were exactly the same: they were all the same image of my hand on the side of the frame. When again, no one was home and it caught no other “movement.” (It feels very Adams Family...)\n6. I get ZERO notifications now. Seriously, no notifications for anything although my settings are the same. \n7. The settings say it’s set to continuous recording (although that’s not what it’s doing) but it won’t let me turn it off. This would explain why my SD card was almost full even though I haven’t used it in awhile.\n\nSo basically, unless I can find another app to interface with my cameras, I’m going to have to spend money I don’t have (read: charge) to buy new cameras from a much more highly-rated company because this is absolutely the worst app I’ve ever used. I’ve only used it this long because it was marginally useful before but now it’s not even that. The only thing it seems decent at is a live view so for like checking in on your dogs. Otherwise, don’t bother.","updated":"2018-07-11T22:33:37-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4713827033","userName":"Lê Minh Đạt","userUrl":"https://itunes.apple.com/us/reviews/id432941320","version":"6.7.1","score":1,"title":"Bad","text":"I can't add my B1-C when update vimtag app.","updated":"2019-09-02T02:00:04-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1602328439","userName":"Ashfoooo","userUrl":"https://itunes.apple.com/us/reviews/id304638336","version":"4.4.3","score":2,"title":"App closes out when trying to view motion events","text":"Update: since this last update, I stopped receiving motion alerts. Looking at the motion logs, it doesn't appear as though they're noticing the motion at all as there are no motion events listed since the 26th when this update went live. Please fix this.\n\nI just set up my new cameras and everything is working well, including the speaker now that it clarifies you need to hold it to speak. My most persistent issue is that the app will close out about a third of the time that I try to open the motion event images and videos. If that happens, it usually takes about two more attempts before I can finally view the images/videos without the app closing. This is still occurring in the new version","updated":"2017-05-01T06:40:30-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1332041464","userName":"Rplieth","userUrl":"https://itunes.apple.com/us/reviews/id104088108","version":"3.1.1","score":4,"title":"Good but no playback controls","text":"App is decent however there are no playback controls at all (Rewind/FF etc) or other option such as to save the recording locally to my phone to playback with some controls.  Makes me wonder if the only option is perhaps to remove the SD card and plug it into a computer to download them.  Would be 5 * if playback were more user friendly.","updated":"2016-02-12T16:36:23-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1600846755","userName":"Clay Ice","userUrl":"https://itunes.apple.com/us/reviews/id141326859","version":"4.4.3","score":3,"title":"Connecting to WiFi is a joke","text":"Could be a great camera, but I wouldn't know because it refuses to connect to my 120 Mbps internet and requires the absolute worst high-pitched, headache inducing sound in order to connect (which I've done 3 times now and still fails to connect). They boast of the easiest setup in the world on their manual and seems to be a nightmare. With such a competitive market, they should be better -- I don't want to say \"don't waste your time with this\", because it might be great.... but if you aren't technically inclined or become irritated quickly at unnecessary LOUD noises.... don't waste your time.","updated":"2017-04-29T12:11:04-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1418470264","userName":"byDavidArriaga","userUrl":"https://itunes.apple.com/us/reviews/id35665354","version":"3.7.4","score":5,"title":"Easy to set up, safety assured!","text":"Extremely pleased with the ease of use on this app as well as hardware setup. It took me exactly 13 minutes to do the whole set up and have my security camera up and running. Make sure to change the settings to your personal preference as I wanted to make sure I was alerted when there was motion in cam (especially when I'm gone) - great app for a great product.","updated":"2016-07-23T09:39:07-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1600263879","userName":"jan5447","userUrl":"https://itunes.apple.com/us/reviews/id43913905","version":"4.4.3","score":5,"title":"Vimtag room monitors","text":"We have two of these for each of the 3 yr old twins rooms. It is extremely easy to set up and share with family. We love that you can move the cam with the app and zoom in for details. It has day/night, photo capture, can video tape too! Love these cams! Perfect & no problems.\n\nWould like it if they included an iPhone watch app too...maybe in the future. 😊","updated":"2017-04-28T21:10:23-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1390191434","userName":"Kvndxn","userUrl":"https://itunes.apple.com/us/reviews/id26797838","version":"3.6.1","score":1,"title":"Failure","text":"Have been using the Vimtag cameras and app for about a year. Although not perfect, it has worked. There have been minor issues, but I've been able to live with them. Now, just out of the clear blue, the app logged me out and will not let me log back in. I have tried rebooting my network, deleting and re-installing the app, and nothing works. I have three cameras and no way to access what they are seeing. I use the cameras to help me keep watch on my dad, who has dementia. For me, this is the end of the road for the Vimtag products. I need a more reliable solution.","updated":"2016-06-06T19:56:53-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1320625406","userName":"Djoelz","userUrl":"https://itunes.apple.com/us/reviews/id4501781","version":"3.1.1","score":4,"title":"Good overall camera, app has a bug that you can't view your feed remotely","text":"All my expectations were met but in the update for 3.1.1 you cannot view the feed from an external network. I know it's setup right because of I log into their website I can see my feed from an external network just not from the app. If they fix this it would be 5 star.","updated":"2016-01-22T12:53:04-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1402649762","userName":"DWOBX","userUrl":"https://itunes.apple.com/us/reviews/id117242093","version":"3.6.2","score":4,"title":"Works okay on iPhone 6S and 6S Plus","text":"We tested the app on an iPhone 6S and 6S Plus and it is currently working. There are still bugs that need to be worked out but we are able to use all the functions. Talking through the phone app through the camera causes excessive echo but using the browser version on a computer works fine and is clear.","updated":"2016-06-29T17:44:33-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1369127697","userName":"1Peter3:18","userUrl":"https://itunes.apple.com/us/reviews/id325456297","version":"3.4.1","score":4,"title":"Fix this app","text":"Everything was great until they updated. Can't get on to see the camera. Been very happy till now and can't see the caregivers with our mother. Help please!","updated":"2016-04-26T06:39:03-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1387846507","userName":"Consistently_Random","userUrl":"https://itunes.apple.com/us/reviews/id507285331","version":"3.5.2","score":2,"title":"Vimtag updated horrible. Use MPIC instead.","text":"The vimtag update broke everything. Did some research and realized MPIC is the original Chinese app. The cameras work well but realize they broadcast your wep encryption key and ssid unencrypted to a Chinese company, Shenzhen Mining so there are many levels where hackers can steal your information, login to your router and take any and all information from your network....i.e. Passwords, credit cards , banking info..etc. these are great pet monitors but the security risks are troublesome.","updated":"2016-06-02T07:03:59-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1573387867","userName":"sonatablack","userUrl":"https://itunes.apple.com/us/reviews/id108974281","version":"4.3.1","score":5,"title":"Great job!","text":"It's nice being able to check on the home when away. The cameras and app work great! I've never had an issue with either. Adding support for Apple Watch would make this totally amazing!!! I'm sure you can do it! Thanks","updated":"2017-03-26T14:55:00-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1405286460","userName":"CelesteSippel","userUrl":"https://itunes.apple.com/us/reviews/id172461513","version":"3.7.1","score":1,"title":"No alert","text":"This product used to work exactly the way it was advertised. Now I am not getting alerts when there is motion. I have tested it several times. I have updated the app. I have unplugged everything and started the set up all over again. This is really frustrating since the whole reason I got it is for training dog with crate anxiety. I need to be alerted to movement so I can respond quickly to break the cycle of anxiety. I am disappointed.","updated":"2016-07-04T06:38:27-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1429415024","userName":"This app bummer deal","userUrl":"https://itunes.apple.com/us/reviews/id179972912","version":"3.7.5","score":1,"title":"App is sketchy","text":"App constantly goes OFFLINE even when I know my Wi-Fi is fine; several times a day. Also camera moves on its own and sets itself against the back wall not facing into the room. Why is there also a Password to access app that has more digits than I set up? Who has aces to my camera besides me???? Picture when working is great but everything else about use and functionality is sketchy and unreliable at best!!","updated":"2016-08-08T12:58:02-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1602069444","userName":"Argeilah","userUrl":"https://itunes.apple.com/us/reviews/id16698333","version":"4.4.3","score":1,"title":"App issue?","text":"While I like the cameras , recently I think there is an app issue. I keep receiving network connectivity issue when I click into the specific camera , however the cameras refresh on the main screen, the network settings are connected and 100%. I restored to factory settings, updated camera firmware, reset my network and still get this error only when clicking into each camera. Help","updated":"2017-05-01T00:06:16-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1438558963","userName":"Nookerdg","userUrl":"https://itunes.apple.com/us/reviews/id15555522","version":"3.1.1","score":5,"title":"Great home security camera","text":"As long as you have good Wi-Fi where your phone is, these cameras work really well! And the customer service was very helpful when I had questions.","updated":"2016-08-24T09:07:24-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1443634633","userName":"arhcm","userUrl":"https://itunes.apple.com/us/reviews/id20553094","version":"3.8.1","score":5,"title":"Love it","text":"I don't know why there's so many negative reviews. I love this ap for my baby and I use it all the time. No problem with log in or motion functions. Alerts work awesome. Great for the price!","updated":"2016-09-02T20:50:59-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1347559025","userName":"Trekkrider73","userUrl":"https://itunes.apple.com/us/reviews/id306999462","version":"3.2.2","score":5,"title":"App works like a charm","text":"App and camera is everything we expected it to be and more. I'd recommend this to anyone who need to keep and eye on anyone or anything they love.","updated":"2016-03-13T20:13:03-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1376660328","userName":"Bearpuppy620","userUrl":"https://itunes.apple.com/us/reviews/id27119695","version":"3.5.1","score":1,"title":"Last update is terrible","text":"After the last update. I am no longer able to view my recordings and when they do populate they come in under the wrong dates or the same recording shows up every time. Please fix this bug. Also ever since the new update everything is so much slower in terms of loading.","updated":"2016-05-10T17:11:25-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1367320950","userName":"Kramonel","userUrl":"https://itunes.apple.com/us/reviews/id284839025","version":"3.4.1","score":4,"title":"Please fix latency and lan connections","text":"Same as the person before me.. Can't see the cameras in lan !!! And ever since latest update and firmware update... I barely can move the cameras around ... Very low latency !!! Please fix asap !","updated":"2016-04-22T18:19:52-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1304126043","userName":"supersebb","userUrl":"https://itunes.apple.com/us/reviews/id43918522","version":"2.11.1","score":4,"title":"Motion Notification Auto Disables","text":"Motion notification are automatically disable everything you don't use the app. \nCan the dev check on this?","updated":"2015-12-21T15:38:51-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1642690710","userName":"aepp626","userUrl":"https://itunes.apple.com/us/reviews/id19268770","version":"4.6.1","score":1,"title":"Constant motion reminders","text":"I was hoping the negative reviews I read on the app would be wrong, however it is literally the most irritating and frustrating apps I have ever encountered. I get motion alerts nearly every 30 seconds when there is no movement at all. I have received 10 in the 2 minutes it has taken me to write this review.","updated":"2017-06-12T23:26:04-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1403253670","userName":"krystalrayl","userUrl":"https://itunes.apple.com/us/reviews/id247261447","version":"3.6.2","score":5,"title":"Vintage","text":"The app is easy to use and has many options for your camera.","updated":"2016-06-30T19:22:57-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1650663932","userName":"Bennyluye","userUrl":"https://itunes.apple.com/us/reviews/id108925469","version":"4.6.1","score":4,"title":"Cannot see my cam","text":"After the update I cannot see anything !!\n\nUpdate: addressed problem really fast ! It's a really good camera to monitor my pets","updated":"2017-06-19T22:55:49-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1526777135","userName":"Mtimmons","userUrl":"https://itunes.apple.com/us/reviews/id124842096","version":"4.1.1","score":1,"title":"Poor intercom quality with iPhone 7 and iPhone 7+","text":"Poor intercom quality with iPhone 7 and iPhone 7+ \n\nWhen using the intercom feature you can see the signal drop drastically. Even on the same wifi network as the camera. The sound quality correlates. Still works great with my daughters iPhone 5s.","updated":"2017-01-20T16:03:32-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1410606403","userName":"BabySpeeks","userUrl":"https://itunes.apple.com/us/reviews/id19412920","version":"3.7.1","score":1,"title":"Thumbs down","text":"This app gets worse after every update. What is up with the video playback? It leaves out entire chunks of the video and just hops around. Video feed is always missing. It's annoying and the videos are pretty pointless when you can't watch them.","updated":"2016-07-12T17:29:43-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1386905830","userName":"NekoNeko_Meow","userUrl":"https://itunes.apple.com/us/reviews/id189405898","version":"3.5.2","score":1,"title":"App is not functional","text":"Having hard time loading the videos. Videos freezes when reviewing. Records showed up in wrong date. Date/time are never corrected using auto sync. Overall this app is useless. Wasted too much time waiting for each loading.","updated":"2016-05-31T08:42:14-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1375647281","userName":"Scr12","userUrl":"https://itunes.apple.com/us/reviews/id7146405","version":"3.5.1","score":4,"title":"Better then the MIPC app it replaces","text":"MIPC last update caused issues but their support told me to use this Vimtag version which does work.","updated":"2016-05-08T15:33:05-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1516687804","userName":"Katzo1","userUrl":"https://itunes.apple.com/us/reviews/id36376852","version":"3.11.2","score":1,"title":"Cannot see over lte after update","text":"What kind of idiots releases a software update that doesn't let u see on a camera for a camera!! Seriously. Have to go buy another product now. Hope someone gets fired on the back of this!!!\n\nJan 6! Still no update. Are you guys bankrupt yet? It's embarrassing.","updated":"2017-01-06T12:48:30-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1489163550","userName":"Gizmo man64","userUrl":"https://itunes.apple.com/us/reviews/id111902218","version":"3.11.1","score":1,"title":"Vimtag App","text":"This has to be the worst app I have ever experienced for a security camera. It makes using the Vimtag Security Camera a real bad ordeal. It is difficult to get security online. Just a cheap app production and it should be upgraded for those of us buying there products and made much simpler to get sync w/camera online..","updated":"2016-11-22T11:56:49-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1434572209","userName":"Bit bot","userUrl":"https://itunes.apple.com/us/reviews/id49473049","version":"3.8.1","score":1,"title":"Why do you keep turning off motion detection?","text":"Every update seems to fix or disable motion detection. It is currently broken again. You can enable it, but when you check back later, it's disabled. I don't get it. I wish there was better software to use with it","updated":"2016-08-17T11:08:46-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1387102273","userName":"Coachjjd","userUrl":"https://itunes.apple.com/us/reviews/id125703843","version":"3.5.2","score":1,"title":"Very frustrated","text":"This app is useless. Which makes the camera useless. I've owned it only 2 weeks and was fairly happy until a couple days ago when it was updated. I hope they fix it soon or this may have been a waste of money!!!","updated":"2016-05-31T19:53:39-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1678464814","userName":"JaelleBeezy","userUrl":"https://itunes.apple.com/us/reviews/id246166742","version":"4.7.1","score":3,"title":"Works in general","text":"The app crashes occasionally when I'm trying to view the recordings. Please fix. It makes it hard to monitor the surroundings.","updated":"2017-07-11T15:17:49-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1521730836","userName":"Chad Nesbit","userUrl":"https://itunes.apple.com/us/reviews/id198008375","version":"4.1.1","score":1,"title":"Update worse than the last.","text":"Cameras are now almost useless as remote monitoring devices. Last version at least worked to a point now can barely get anything to work. Using iPad 2 with latest iOS if that provides any help.","updated":"2017-01-13T23:05:21-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1696716782","userName":"Perrybit","userUrl":"https://itunes.apple.com/us/reviews/id30523533","version":"4.7.1","score":1,"title":"Vimtag software","text":"Not particularly happy with it.\nCamera is Cirrus i8. The camera seems ok, but with Vimtag controls it seems way over complicated and does not stay connected causing multiple resets. Now working again.\nI guess I'll have to spend more to get better products.","updated":"2017-07-24T15:48:02-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1266548856","userName":"Ulysses77043","userUrl":"https://itunes.apple.com/us/reviews/id472759557","version":"2.9.2","score":3,"title":"Simple","text":"Does the job but crashes few times.  They remove the Alarm Action option.","updated":"2015-10-03T17:03:52-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1388039361","userName":"MelOnTheWeb","userUrl":"https://itunes.apple.com/us/reviews/id2657","version":"3.5.2","score":1,"title":"Zero star after the latest update.","text":"Camera will never load on the app since the latest update. I'm hoping they get to fix it soon because until then, the camera is useless.","updated":"2016-06-02T17:45:41-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1622034633","userName":"MamaWindy","userUrl":"https://itunes.apple.com/us/reviews/id33821427","version":"4.5.2","score":1,"title":"Update is terrible","text":"Since the update I can no longer see my images saved to card also my motion alerts have stopped. Those are the two things I bought the camera for. Please fix","updated":"2017-05-23T06:13:48-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1387438646","userName":"ALP1976","userUrl":"https://itunes.apple.com/us/reviews/id184452222","version":"3.5.2","score":1,"title":"Never Works","text":"I've deleted and reinstalled this app 5 times. Still can't get it to pull up video. You would think Vimtag would throw some updates at this non functioning app. Wish I bought a different camera.","updated":"2016-06-01T10:52:38-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1489831448","userName":"Sweethearttx1980","userUrl":"https://itunes.apple.com/us/reviews/id429322380","version":"3.11.1","score":1,"title":"Horrible, horrible app","text":"This is the worst app I've ever used. And now it's completely booted me out with no way to log in. And I'm out of town and worries about my pets. I've had nothing but issues with this app since I got this camera earlier this year.","updated":"2016-11-23T17:09:17-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1513811182","userName":"Pdang2011","userUrl":"https://itunes.apple.com/us/reviews/id108083013","version":"3.11.2","score":1,"title":"Not able to connect through the Internet after update","text":"Please fix the issue. After the update,I can't connect to the camera via my phone's LTE. Works fine with my home WIFI.","updated":"2017-01-02T02:07:13-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1387143682","userName":"slm12488","userUrl":"https://itunes.apple.com/us/reviews/id242894547","version":"3.5.2","score":1,"title":"Doesn't work","text":"I'm lucky if I can get the camera to load. If I can, it certainly doesn't last more than a few seconds before the feed is lost. This is completely unreliable!","updated":"2016-05-31T21:57:57-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1442932765","userName":"Flyincookie","userUrl":"https://itunes.apple.com/us/reviews/id86335215","version":"3.8.1","score":1,"title":"Hate this app","text":"Tried everything. Every few weeks the app logs me out. When I try to log in it tells me invalid user. I have created 6 profiles now. The website lets me log in but this stupid app... Nope! 😡😡😡","updated":"2016-09-01T11:38:08-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1390192378","userName":"TayJo1992","userUrl":"https://itunes.apple.com/us/reviews/id345809571","version":"3.6.1","score":1,"title":"Awful","text":"Every update makes the app worse. Can't log in, slow. Love the camera but when the app won't let you use the camera it's disappointing","updated":"2016-06-06T19:59:28-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1292047527","userName":"Classroom Monitor","userUrl":"https://itunes.apple.com/us/reviews/id480496563","version":"2.10.1","score":4,"title":"Good App - SUGGESTIONS","text":"This app seems more stable.  It works well, but these few small changes will make a BIG difference:\n\nThe feature allowing video clips (includes sound) to be saved to the iPad (not to the mem. on the card)...is fantastic.   It's better than saving to the camera SD card, because in most cases, the person taking the quick clips wants them as quickly available as possible.  Having to log back in the the camera to review them later ....even if they could be transferred to the iPad...would just be an extra ( inconvenient ) step...in most cases. \n\nHOWEVER...Please add the ability for these locally saved video clips to be\"saved to\" the iPad's camera roll.  AND when playing back the video clip, regular video playback controls would be VERY USEFUL (pause / rewind /FF, etc).  currently, you can only press play...and then must wait for the entire clip to play before (if needed) replaying it, in order to review a certain part.\n\nLastly, it would make a huge difference if the audio mute button could be on the bottom tool bar...maybe off to the left edge.  Currently, being embedded / overlaid in the video itself makes it almost impossible to see.  No matter what color it is...it will inevitably just blend in with the given muti-color video scene.  And if it's simply made larger...it will just be in the way.  Having it disappear while the video plays is a problem as well because, often, the user will need to mute/un-mute several times, while a clip is playing.\n\nWith still images....the current function works fine...but, to be honest, on the iPad, it's easier just to use the iPad's built-in screen-shot function...which more quickly puts the image right in the iPad Camera Roll (preferable).\n\nSummary - the app is good...and the image quality is exceptional, but these few changes related to video clip playback would make a Huge difference \n\n(note to support: we spoke on the phone about these suggestions earlier)","updated":"2015-11-26T11:46:17-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1386172168","userName":"Steve1284314","userUrl":"https://itunes.apple.com/us/reviews/id13623392","version":"3.5.2","score":1,"title":"No longer works after update","text":"Your software no longer works! My mistake for using this as a baby monitor! Should have turned off app updates!","updated":"2016-05-29T21:13:39-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1677198564","userName":"HIT jim","userUrl":"https://itunes.apple.com/us/reviews/id189336095","version":"4.7.1","score":3,"title":"Offline","text":"All of my cameras (4) go offline about once a week and cannot get back online w/o having to reboot router. Solutions?","updated":"2017-07-10T17:59:52-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1499347460","userName":"Sunny16935","userUrl":"https://itunes.apple.com/us/reviews/id225330777","version":"3.11.2","score":1,"title":"Cannot sign in after this update.","text":"Used to be good about one year ago. Almost every update made it worse and worse. Really disappointed.","updated":"2016-12-10T05:15:49-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1458110461","userName":"Fonsecafer","userUrl":"https://itunes.apple.com/us/reviews/id17074720","version":"3.9.1","score":1,"title":"Not reliable don't waste your money.","text":"This ap/camera only works when it feels like, when you need it don't work, is money thrown in to garbage, don't waste your money.","updated":"2016-09-29T17:31:39-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1471486958","userName":"zed1310","userUrl":"https://itunes.apple.com/us/reviews/id35951903","version":"3.9.2","score":1,"title":"Nightmare to use. Not worth the hassle.","text":"Hard to log in.\nHard to stay logged in.\nIt will take voodoo sacrifices to help you change your setup if you dare change your wifi name or ISP.","updated":"2016-10-22T22:00:10-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1390213786","userName":"Youngggggk","userUrl":"https://itunes.apple.com/us/reviews/id108831681","version":"3.6.1","score":1,"title":"Whats wrong??","text":"App and camera were working fine until yesterday...and now they dont. Hurry and update the app to solve the issue. Very disappointing","updated":"2016-06-06T20:54:47-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1351333569","userName":"Cheportiz","userUrl":"https://itunes.apple.com/us/reviews/id108607298","version":"3.2.2","score":2,"title":"App needs work","text":"The camera is great but I think the app needs a little more work.  It's not very user friendly.","updated":"2016-03-21T10:26:27-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1388273743","userName":"Dycats","userUrl":"https://itunes.apple.com/us/reviews/id150339815","version":"3.5.2","score":1,"title":"Updated are not good !!!!","text":"Camera works extremely well but after the second update nothing works ...please fix it!!!!","updated":"2016-06-03T05:08:39-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1342364622","userName":"JenMi","userUrl":"https://itunes.apple.com/us/reviews/id28013892","version":"3.2.2","score":1,"title":"Terrible","text":"Have to keep quitting and reopening app as I keep getting a white screen when I return to look at the vid feed. It's a huge pain and I regret being forced to use this app.","updated":"2016-03-03T20:51:39-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1380203075","userName":"Cesmigs","userUrl":"https://itunes.apple.com/us/reviews/id36897363","version":"3.5.1","score":1,"title":"Buggy! It crashes most of the time","text":"It looks like the new updates is buggy. I cant view all the recordings.","updated":"2016-05-17T16:45:39-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1607847126","userName":"Crisaking","userUrl":"https://itunes.apple.com/us/reviews/id476166107","version":"4.5.1","score":2,"title":"Doesn't work since update","text":"App does not work after yesterday's update. Please fix asap!!!!!","updated":"2017-05-07T12:44:18-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1623118642","userName":"clttr","userUrl":"https://itunes.apple.com/us/reviews/id103776146","version":"4.5.2","score":1,"title":"Update has issues","text":"Cannot access stored images. When accessing them, the app shuts down. Please fix.","updated":"2017-05-24T10:36:34-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1461545943","userName":"Aabmg9","userUrl":"https://itunes.apple.com/us/reviews/id217825642","version":"3.9.1","score":1,"title":"Super Crappy","text":"This App is TERRIBLE!!!\nIt's impossible to do anything or see anything without the App completely shutting down and/or logging you out!","updated":"2016-10-05T08:33:42-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1387921939","userName":"Johhny Freedom","userUrl":"https://itunes.apple.com/us/reviews/id162618903","version":"3.5.2","score":1,"title":"Useless","text":"App used to be somewhat decent, maybe passable for the combination of cheap camera and free app. But since the recent update it literally doesn't work. Lame.","updated":"2016-06-02T10:06:38-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1345437738","userName":"CAtlantaNative","userUrl":"https://itunes.apple.com/us/reviews/id34943442","version":"3.2.2","score":1,"title":"Terrible","text":"The screen freezes any time I touch the settings icon, so I cannot set the new app up to work the way I need it to.","updated":"2016-03-09T16:43:51-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1391042522","userName":"Rupert_Piper","userUrl":"https://itunes.apple.com/us/reviews/id220293427","version":"3.6.1","score":1,"title":"Issues with signing in","text":"Your update removed recognition of my user id and password.  Why?","updated":"2016-06-08T08:53:41-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1344075862","userName":"Nickdeli","userUrl":"https://itunes.apple.com/us/reviews/id271634925","version":"3.2.2","score":1,"title":"Useless","text":"Like the title says... Supposed to be an upgrade to MIPC app, and it is worse.  MIPC app freezes and works when it feels like it, this one just doesn't work at all.  👎🏻","updated":"2016-03-06T21:12:03-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1506176905","userName":"bklynny2013","userUrl":"https://itunes.apple.com/us/reviews/id38402070","version":"3.11.2","score":1,"title":"Horrible Update","text":"Cannot access after updating yesterday!","updated":"2016-12-21T07:10:34-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1345956645","userName":"Anastasia Chentsova","userUrl":"https://itunes.apple.com/us/reviews/id196843471","version":"3.2.2","score":1,"title":"It's not working!","text":"I'm trying to log in and it just freezes. I tried deleting the app and installing it again but it DOES NOT WORK","updated":"2016-03-10T18:42:27-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1389047917","userName":"Dano2200","userUrl":"https://itunes.apple.com/us/reviews/id143558938","version":"3.6.1","score":1,"title":"Vimtag","text":"Camera works great, app however cannot log in so I can't see anything.  It's a complete waste of money at this point.","updated":"2016-06-04T16:10:34-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1438613960","userName":"PeachesLov","userUrl":"https://itunes.apple.com/us/reviews/id194262617","version":"3.8.1","score":1,"title":"Awful!!!","text":"App working is hit or miss. Not a reliable system. I do not recommend!! Very frustrating.","updated":"2016-08-24T11:51:08-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1433420899","userName":"Itaintlikethat","userUrl":"https://itunes.apple.com/us/reviews/id126242172","version":"3.8.1","score":1,"title":"Awful","text":"Can't log in and can't reset password.  Awesome.\n\nThis app continues to be awful. Time for a new camera.","updated":"2016-08-15T10:00:30-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1380705732","userName":"3kidsmommabear","userUrl":"https://itunes.apple.com/us/reviews/id262185929","version":"3.5.1","score":1,"title":"No longer connects to wireless","text":"Just stopped working- won't connect wirelessly.   Please fix.","updated":"2016-05-18T18:27:01-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1514281870","userName":"Akifull","userUrl":"https://itunes.apple.com/us/reviews/id542769037","version":"3.11.2","score":1,"title":"Can't view camera on LTE","text":"Since the update, I can't see the camera with LTE. Please fix issue ASAP!","updated":"2017-01-02T19:56:18-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1383569222","userName":"Billotto","userUrl":"https://itunes.apple.com/us/reviews/id506223651","version":"3.5.1","score":1,"title":"P1Cloud Camera","text":"The app will not let me sign in to it on my tablet or phone. Please fix and provide aupport","updated":"2016-05-24T14:31:34-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1368596395","userName":"Holden657","userUrl":"https://itunes.apple.com/us/reviews/id247741418","version":"3.4.1","score":4,"title":"Love it","text":"My wife & I just bought a Vimtag camera off of Amazon & then downloaded this app so we could monitor our dogs throughout the day. I have to say it does more than I was expecting & was super simple to hook up. From unboxing to watching a live stream was no more than 5 minutes. Still playing with it so I'm not sure what all the controls do but so far we love it.","updated":"2016-04-25T05:56:32-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1475802479","userName":"Starbuck07","userUrl":"https://itunes.apple.com/us/reviews/id23622910","version":"3.10.1","score":1,"title":"Poor up keep to app","text":"Used to be good. Now won't stay connected. Sad.","updated":"2016-10-30T08:03:30-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1440365463","userName":"number1canefan","userUrl":"https://itunes.apple.com/us/reviews/id476311958","version":"3.8.1","score":1,"title":"Cannot access my cameras","text":"What is wrong with this app? I can't access my cameras.","updated":"2016-08-27T18:45:20-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1620417191","userName":"$biz$","userUrl":"https://itunes.apple.com/us/reviews/id210486612","version":"4.5.1","score":1,"title":"What happened?!?","text":"App doesn't work anymore!!! Fix it!","updated":"2017-05-21T15:18:18-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1586487434","userName":"Soonernotlater","userUrl":"https://itunes.apple.com/us/reviews/id186345117","version":"4.4.1","score":1,"title":"mic update is a flop","text":"apparently Vimtag changed the mic button and it rarely works.","updated":"2017-04-11T15:31:31-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1344436162","userName":"VFRMann","userUrl":"https://itunes.apple.com/us/reviews/id31512428","version":"3.2.2","score":3,"title":"Lots of Potential But Lacking...","text":"Updating my review for the latest version of the App. Unfortunately, none of this thing I complained about below were addressed, so my review stands as is.\nThe Vimtag app has a few serious omissions from the App that is required to use the wireless security camera. For example, you can purchase a two (like I did) or even three camera bundle. However, the app does not stream more than one camera at a time. Unlike security systems that allow you to stream 4, 6, and even up to 16 channels at once, the Vimtag app can only display one at a time. That means if you want or need to look at a different angle you have to exit the stream screen, go back the camera screen, and select the camera you want. Not an efficient way to utilize multiple cameras.\n\nYou can record video to a micro SD card and the App surprisingly has several recording options, which is great. The videos are recorded in 30 min increments. So even if you set the camera to record 24/7 you end up with 48 individual files per day. Not a big deal, and it actually helps review any recorded video much faster and easier than a single file would be. However, again the app is lacking here. There are no options to fast forward or rewind the video. So if the recording you seek is 20-25 mins into a video clip (as was the case with me) you literally have to sit there and watch 20-25 mins of nothing. There’s also no option to delete video files using the app, although you can format the SD card and wipe everything off of it from the app. \n\nOverall the app is OK, it let’s you setup the camera pretty easily and it let’s you remotely stream (one) video. But there are just too many omissions that hold it back from getting anything more that an average rating.","updated":"2016-03-07T14:58:57-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1394992930","userName":"Wolfmeow","userUrl":"https://itunes.apple.com/us/reviews/id351928327","version":"3.6.2","score":1,"title":"Can't log in","text":"Can't login","updated":"2016-06-15T13:56:05-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"7909875019","userName":"eddy90044","userUrl":"https://itunes.apple.com/us/reviews/id1130742998","version":"8.10.3","score":1,"title":"Despues de actualizar","text":"Inservible","updated":"2021-10-13T05:06:47-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"7571976095","userName":"Mundogmaers1","userUrl":"https://itunes.apple.com/us/reviews/id964029964","version":"8.5.2","score":1,"title":"Mala la cámara","text":"La peor cámara que e comprado no guarda los video no detecta nada no se guarda en el sistema no la recomiendo","updated":"2021-07-13T07:40:32-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"8021706821","userName":"Matthews80","userUrl":"https://itunes.apple.com/us/reviews/id1346521245","version":"8.11.2","score":5,"title":"Works great","text":"I bought a Vimtag camera a few years ago on Amazon. It’s worked great all these years on my Android phone. Recently bought an iPhone and installed the app and works great on this phone too!","updated":"2021-11-13T19:28:49-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4180851080","userName":"800 names later","userUrl":"https://itunes.apple.com/us/reviews/id165116196","version":"6.5.1","score":1,"title":"It was an ok app but now constantly logs me off","text":"First of all, in an age when you need to have different passwords for everything, and you especially should have a complex password for a camera, I have not memorized the password for my VIMTAG app.  In the last two weeks I have been logged out of the app at least 3-4 times and I really needed it today but had to wait to I got home to get my password cheat sheet.  I am done with this app.  And to be honest, the way the cameras save videos is also terrible.  I also have Amazon cameras where you just go to the camera app and can click on the last recorded video.  I still have not figured out yet how to retrieve video from these stupid cameras but it is NOT as easy as just opening the app and seeing a list of your recently saved recordings and clicking on one.  Save yourself the trouble and money and DO NOT BUY THESE CAMERAS.","updated":"2019-05-20T06:06:31-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"4107509618","userName":"Marlorjam","userUrl":"https://itunes.apple.com/us/reviews/id111624576","version":"6.4.1","score":1,"title":"Latest update renders camera useless","text":"Updated 5/5/2019\n\nThe latest updated wiped all recordings from the SD card and now I can't even access anything because the submenus for the recordings pull up one that is all Asian language characters . . It keeps telling me to insert an SD card even though there is an existing one there that clearly has been recorded over because the capacity level. It appears that I'm not the only person suffering from this issue I see another reviewer has the same problem . Every time I try to access the SD card it reverts back to the Asian menu and get stuck and I have to hard exit the app on my iPhone. This company really needs to get their act together because every update that happens is challenging ... customer support is next to zero! I already have four of these cameras in my house but will seriously be researching other companies because this is ridiculous. \n\nOriginal review:\nThis has always been fairly decent camera it was somewhat easy to set up everything as a system. every time there's an update, the cameras are very buggy and it takes a couple of days to adjust. the latest update however has rendered the ability to basically control the camera via the app useless. it takes away the ability to snapshot a motion detection (scene function) and only allows video. The scene function has been taken out of the settings so you can no longer tell your camera system if you're in or out,  which basically voids the ability for you to determine when the camera is going to record. I'll be more than happy to change my review once I'm able to use my cameras for what they were purchased for.","updated":"2019-05-05T21:12:12-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"3218813515","userName":"skibud85","userUrl":"https://itunes.apple.com/us/reviews/id102935338","version":"5.9.2","score":1,"title":"Look elsewhere","text":"Look elsewhere","updated":"2018-09-22T14:28:01-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2702454568","userName":"SafetyO","userUrl":"https://itunes.apple.com/us/reviews/id134126249","version":"5.5.1","score":3,"title":"IOS issue","text":"Seems to be an issue with IOS 11.4. \nWon’t access camera to add camera by scan. Issue with returning to screens within app.  Back arrows don’t work. Have to exit out of app and reload. Annoying. \nWorked before.  Same issue with iPad and iPhone. \n\nMotion settings still confusing when paired with DVR box. Just seems to record without any motion detected. Have adjusted sliders but still questionable results. \n\nI will say that the app seems 90% out of 100%.\n\nUpdate and get extra stars from me.","updated":"2018-06-15T18:32:19-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"2151294496","userName":"Sanghvi5m","userUrl":"https://itunes.apple.com/us/reviews/id134308969","version":"5.1.1","score":1,"title":"Poor tech support and too many probkens","text":"Calling for tech support is big problem you me left messages they never call back there are always constant update the last update killed my unit and they refuse to fix with out charging they want more money to replace unit please don't buy this product \nThee more compatible units with out the hassle for get tech support they constantly asking for reset  to factory setting it is very annoying\nStay away from this co I m reporting to bbb\n\nYou replied to change the network and just add the same networked before this new update , so no need to change the network you should replace the camera for free since this is caused of the new update there is no doubt about this since everything worried for 1 year so it has to be the update\n\nAnother update 1/31/18, more problems, tech support can not fix the issue with new updates, i am waiting now about a week and no solution, they do not check the updates before releasing causing problems\nI am asking to have management staff to contact me and no one has replied\nI wish i did not buy this product","updated":"2018-01-31T15:38:07-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1923068000","userName":"DocSharpie","userUrl":"https://itunes.apple.com/us/reviews/id37780280","version":"4.11.1","score":1,"title":"UNFORGIVEABLY BAD APP!","text":"UPDATE 2017-11-15:\n\nCrashes on startup on iPhone X. Doesn't surprise me, as the developer of this app clearly does not care about keeping up with the latest software/UI developments.\n\nORIGINAL REVIEW:\n\nThis app does the basic job of viewing and controlling the camera, but it has MAJOR flaws that makes it infuriating to use.\n\nFirst, the responsiveness of the video feed will often randomly slow down to unusable levels, even when viewing the camera on the local network. The picture will be delayed up to 10-20 seconds, and slows down in frame rate, which makes controlling the camera in real time nearly impossible. The only way to fix this that I can tell is to reboot the camera.\n\nSecond, if you reboot the camera, any Vimtag client that was previously viewing the stream will NOT automatically attempt to reconnect to the camera when it reboots. The image will just freeze on those clients with not obvious indication that the connection was restarted. We use this camera as a baby monitor, and it's a huge pain to have to always go upstairs to physically restart the Vimtag app on the iPad that we use for viewing the stream. In the grand scheme of things it's not a huge deal breaker, but it's annoying enough to be absolutely infuriating when it does happen, and there should be no reason why the Vimtag app can't detect loss of connection and keep trying auto-reconnect.\n\nThird, you can't download videos recorded by the camera to either your camera roll, or to a computer. Yes, the app claims that you can \"download\" to your iOS device, or to a computer, and both claims are technically true. But from a practical standpoint, the execution of this basic feature simply doesn't work to the expectations of any human who has used any video app in the last 20 years.\n\nIn the case of the iOS app, you can \"download\" a selected recording to your device, but this has several showstopping flaws: \n\n1) It takes FOREVER for a recording to download to your device. The software appears to be doing some kind of on-the-fly transcoding or conversion of the raw camera recordings when it transfers it to your device, resulting in insanely slow transfer speeds.\n\n2) No support for running in the background: While a video is downloading to your device (which can take in excess of 10-15 minutes!), you absolutely CANNOT minimize the app, receive a phone call, close your lockscreen or tap on any notification banners/pop ups from other apps that may appear, otherwise the download silently aborts, without telling you that the resulting download was truncated. \n\n3) If you are lucky enough to download a video to your device in its entirety, you still cannot transfer that downloaded video to your computer, or to your iOS Camera Roll so that you can view it on another device. The video is held prisoner by this atrocious app, and you are forced to watch it ONLY on the device you downloaded it on. There is no \"Open In...\" iOS Share Sheet support, nor are the videos are downloadable via the iTunes File Sharing interface. The next to useless video playback controls in the player interface, which makes it incredibly difficult to navigate and pinpoint specific parts of the video, is the final rotting cherry on top of this dumpster fire of an app.\n\nAnd if you try to download the videos from another computer via the Vimtag web interface, you will experience the same, interminably slow download speeds (even if the camera is on your local network), and there is absolutely no way to \"batch\" download multiple recordings at once. So if you plan to download and archive a day's worth of recordings, you're totally screwed, unless you sit in front of your computer, manually babysitting the download process for many, many hours.\n\nOh, and don't try to pull the SD card of the camera, plug it in to your computer and expect to be greeted by a mountable file system that you can use to simply drag and drop the recordings to your computer. The SD card is formatted to some kind of proprietary file system that neither my Mac or PCs can read. And to add more insult to injury, if you plug the card back into the camera, it will reformat the card and erase everything that was previously on it! It's truly insane, and seems downright malicious on the part of the developer.","updated":"2017-11-15T08:36:35-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1561661487","userName":"benjaminlee904","userUrl":"https://itunes.apple.com/us/reviews/id529525758","version":"4.2.2","score":1,"title":"Two way talking","text":"Please add push bottom It's hard to talk and listen on apple devices. It's make all noise mixed together. but it's good enough for Android devices","updated":"2017-03-10T14:38:57-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1395181870","userName":"Linska01","userUrl":"https://itunes.apple.com/us/reviews/id339579337","version":"3.6.2","score":1,"title":"Update made app/camera unusable","text":"Update 15 June 2016:  two new revisions of the app that were supposed to fix inability to log in, still not successful.  Tech support just says reinstall the app. Whoever is working software development and quality control at Vimtag is really failing. Camera is unusable without the app. I would have returned the cam, but way past 30 days on Amazon. Hope you enjoy my stolen cash...","updated":"2016-06-15T23:03:02-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1394440361","userName":"jessicaann_jones","userUrl":"https://itunes.apple.com/us/reviews/id177096087","version":"3.6.2","score":3,"title":"Can't log in","text":"I can't ever log in. My username and password are both correct yet I can't log in and that is very frustrating. I would like to see what's going on in my home when I am not there. Please fix.","updated":"2016-06-14T13:14:19-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1386937156","userName":"Scubafiend","userUrl":"https://itunes.apple.com/us/reviews/id43192376","version":"3.5.2","score":2,"title":"So much better quality","text":"Just downloaded the new app and the difference in quality with the same camera, network, etc. Haven't done anything but view and pan but I'm happy!\n\nUpdate - 3/30/16 - Latest update is a bomb. Can't even connect to one of my cameras. Brings it up on the \"list\" view, but then won't connect when I select that camera.  Will post another update in a few days in case it is a network issue. Additionally, it is very unresponsive so I end up panning back and forth, over correcting because it doesn't respond. And watching the network speed - it cycles from nothing to decent to nothing. What is that about? Something in between the last two updates made it go from better to much worse. :-(","updated":"2016-05-31T10:10:03-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"},{"id":"1366295382","userName":"Cartsort","userUrl":"https://itunes.apple.com/us/reviews/id70012936","version":"3.3.2","score":4,"title":"New review!!!","text":"Below is my original review. I am leaving it for now... \nI went to the Vimtag website and filled out a tech support form. Tech support called me. I was told that they are making many more changes to the app so (my words here) there will be some more kinks in the road before they get the final product/results that they are looking for but they are making great progress. \n\nI don't understand 100% the new format. If anyone does please post a review here. It will be helpful to everyone. \n\nThe video quality is very good. \nI still miss my still snap shots. \nI don't like having to play all of the video clips so I can save a still but... \n\nI do like the new calendar. You just click on it and all of the videos from that dad are listed. \n\nIt is very strange to me that the 24 hours period goes form noon - noon instead of the normal midnight-midnight. Hopefully that will be addressed soon. \n\nThe tech person told me there is a new devise that can be purchased on Amazon that will hold put to 2 months worth of video recording. That way one does not have to rely on the card in the camera. For now I am not going to purchase it but it sounds really good. Up to 6 cameras I believe. \n\nThe app is finally getting better. \nToday there were some hiccups though with the thumbnails of the recordings. The still had nothing to do with the video clip. The still actually was from other days all together. \n\nOn the other hand, knock on wood, I don't see the great number of black stills & thumbnails that happened far too often with the previous version. \n\nI have not tried working with this upgrade using my computer so I can't share my experience. My experience is with my cell phone and tablet. (Both iOS)\n\nHere is my original review that I gave 1 star for.\n--------------------\nI upgraded one of my 3 cameras. Thank goodness I only upgraded one. I can no longer locate the snapshots! \n\nWhen I click on what used to take me to the recorded still and video snap shot recording list something totally different appears. Y\nThere are 2 icons located at the top right on the screen. One is a calendar. The other I have no clue but it kind of looks like a strange funnel. \n\nClicking on the 'funnel' icon brings up a new screen. There are 2 headings listed. The first is 'category'. Next to it you can select 'EVENT' or 'ALL'. \nThe 2nd heading is 'Duration'.\nClicking on 'all' brings up 3 choices under 'Duration' : 1 hour, 30 min, 5 min. \nClicking on 'Event' the choices are: 1 hour, 30 min, 5 min, Shortest. \n\nI don't understand what all of this is or how it works. I will be calling tech support when the open this morning! \n\nI am very upset and suggest, especially if you only have 1 cam to wait before upgrading!\n\nThis is horrible for me.","updated":"2016-04-20T14:55:44-07:00","url":"https://itunes.apple.com/us/review?id=1025437540&type=Purple%20Software"}]