[{"id":"2616449643","userName":"itsasony","userUrl":"https://itunes.apple.com/us/reviews/id21005918","version":"1.74","score":2,"title":"Updated and app now not accessible","text":"The recent update has left me without access to my configured home sensors while I am out of town away from home for a week and need to be monitoring my home. You chose the worst time for me to break my sensor configuration with an app update. App crashing when opened on a screen that wants to Add a New Home. It already has a home and sensors, it doesn't need a new home. And I am getting warnings and I cannot see what they are, the notifications have no specific detail about whats happening. Out of desired range? How does that help me? Why isnt the number or level mentioned with the notification? Im getting alerts and I cannot find out whats going on with a crashing app. I cannot delete and reinstall the app while I am away from home traveling and lose all my sensor configuration, nor do I have all the home codes to add my sensors while I am traveling.","updated":"2018-05-30T03:57:24-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3184357117","userName":"Jim in Groton","userUrl":"https://itunes.apple.com/us/reviews/id49384770","version":"1.77.1","score":4,"title":"Works out of the box!","text":"I’ve only seen a single review, posted in February, and I got the product and app in September. Maybe the first reviewer had legitimate issues, but I’ve had absolutely none. The alarm was simple to install; three adapters included, one for wire-to-wire installation, plus two other modular plugs for compatibility with other brands. I just opened the breaker for my smoke detector, matched the wire colors and attached with the existing wire nuts. The white and black wires come pre-stripped, but if you want to use the orange interconnect, it will have to be cut and stripped. \nOnce everything was hooked up, shut the breaker and everything powered up fine. Downloaded the app and paired it to the detector. Linked up with HomeKit on my phone without even trying!\nNow I don’t currently have a HomeKit hub at home, so I can’t say whether there are any issues there. \nAs far as interconnect goes, mine is connected to three basic First Alert wired models in other areas of the house (model 9120B), and when I tested the OneLink model, they all went off. You should have seen my cats! It’s nice that the app keeps a history of these tests; I wonder if it will remind me when it’s time to test again?","updated":"2018-09-13T04:01:06-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3546074743","userName":"JustBlessed106","userUrl":"https://itunes.apple.com/us/reviews/id458900551","version":"1.79.3","score":1,"title":"Set up needed......","text":"I really Really don’t know how this company is still around or not completely bankrupt from law suits. My devices have been replaced 4 times and most recently a 5th with their “updated models” for HomeKit. Needless to say both devices, BOTH wouldn’t activate until finally after 4 restores did I get them going, or at least I thought. Now between HomeKit and their own app they need set up, not reachable, pairing needed, you name it, their telling me it needs it. .........(just to throw this in,,,, I’m on the phone with their ‘support’ as I’m writing this, and not one, but 2 different agents couldn’t help me because they couldn’t  distinguish what product I was talking about without giving them the model number. ... I was not  removing them off the wall again..... apparently “ Onelink Smart Smoke & Carbon Monoxide Alarm works with Apple HomeKit, wasn’t enough info for them to figure out what device I had, that one actually had the balls to start asking me to describe its size, shape, and color, for him!!! ARE YOU SERIOUS, so furious that can’t even finish the review.","updated":"2018-12-18T13:24:22-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3521662732","userName":"IcarasX","userUrl":"https://itunes.apple.com/us/reviews/id43051700","version":"1.79.3","score":5,"title":"“Setup Needed” button finally gone. Yay!","text":"After reaching out to customer service just yesterday before this update about my smoke detector alway showing a “Setup needed” button that always hangs when you try pressing it, I was told very promptly that it was a known issue and that they’re team was working on it.\n\nAnd now that the error message has gone away in this update, I’m very happy with OneLink. Also, they’re customer service so far is quick, responsive, and informative. Judging from the low ratings of this app, First Alert is certainly having their fair share of technical hurdles, but so far I’m satisfied with their responsiveness and efforts in trying to fix their app. Keep up the good work and thanks again!","updated":"2018-12-11T23:26:22-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1999849376","userName":"Bigwilly81","userUrl":"https://itunes.apple.com/us/reviews/id31378881","version":"1.69","score":2,"title":"Basic feature doesn’t work - tech support won’t fix","text":"App won’t let me adjust the temperature range for which I want to receive notifications. I change the settings and the app just forgets and doesn’t allow me to adjust it. So when I turn notifications on I’m getting notifications for the default range, not the range I attempted to program in. App also forgets the device it’s connected to. \n\nI have no issues with the HW. It interacts with Homekit and I get all the data I need through the Apple Home app. But this vendor app has issues. \n\nI contacted tech support. They acknowledged it was an issue and, at this point, it’s been about 4 months and no fix available.","updated":"2017-12-15T19:24:46-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"6729141542","userName":"nzer.dh","userUrl":"https://itunes.apple.com/us/reviews/id37065511","version":"1.80.1","score":1,"title":"Not seamless. Alerts unreliable.","text":"Have 4 identical units setup in the house. Each had its own hiccups during the setup process. One of them had to get reset multiple times. The units, like other FirstAlert alarms are prone to false alarms. If you follow their support document online the cause of the false alarms can be anything. When the alarms go off, it’s so loud that one cannot distinguish where the issue is coming from. The App DOES NOT tell you right away there is a problem; in fact it says everything is fine. After a while, it may tell you... and offer to silence the alarm but in my experience that feature has always failed.\n\nWhen you take the units offline to clean, the app does not show you if the unit has power issues; it says everything is ok; even after pulling down on the screen to refresh.\n\nThese things are expensive and yet unreliable.","updated":"2020-12-07T19:01:31-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"5273453980","userName":"Sicilianvirgo","userUrl":"https://itunes.apple.com/us/reviews/id104776122","version":"1.79.19","score":1,"title":"Very clunky to use and multiple issues","text":"App is clunky. Login is tricky. They need to add FaceID support for login. Also sharing access with others in your Home is impossible. You can “manage users” through the app but this is just your HomeKit users you have already shared with. This needs to be fixed. the notifications are not working either. I’m not receiving any and no one else I have shared my home with receive any alerts. That is the only reason I bought this product. I need alerts sent to my phone. I do not receive alerts from the onelink app or the Apple Home app. There is basically no control offered through the Home app at all.  I am very disappointed in this product and app. If an update isn’t made within the next few weeks I will most likely return the alarm because it is essential not more useful than a standard fire alarm.","updated":"2019-12-14T15:17:29-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"6542215328","userName":"1925","userUrl":"https://itunes.apple.com/us/reviews/id31750301","version":"1.79.36","score":1,"title":"Do not use this! Safety features do not work.","text":"I have the wired HomeKit enabled detector which in itself has been poor quality, but relying on this app is a safety hazard. For the past month I had noticed the app saying the device is connected and no issues nor changes. However I finally realized myself that the device had not been powered nor connected and the app said everything was fine! You have to dive into settings and prompt an action for the app to reveal that the device isn’t connected. Worse yet, after stating the device is not connected in a pop up message, the app will not update the status and still says connected and “Hello, everything is OK”. \nWith both the hardware disconnecting often, the app being a safety risk, and poor ratings from others, I will never buy or trust OneLink again.","updated":"2020-10-16T12:34:42-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"6165044538","userName":"AlanRashid","userUrl":"https://itunes.apple.com/us/reviews/id20687385","version":"1.79.30","score":1,"title":"Horrible App and Smoke Detector.","text":"I had to replace the detector after 4 years.  It’s supposed to have a 10 year life.  When I tried to install a replacement every attempt failed.  The app is very unreliable in setting up the Bluetooth connection to the detector, adding the detector to the Apple HomeKit, and especially connecting to Wi-Fi.  There’s no trouble shooting support in the app.  If any step fails you have to start the whole process over from the first step.  It’s particularly annoying that mounting the detector is included in the setup process, so you have to page through those steps every time you have to retry the setup.  Come on, once it’s mounted your done with that.  Do you really need to walk through that 20 times?  I gave up on the setup after 2 hours effort.  Now I’m looking for a better smoke detector.","updated":"2020-07-06T11:00:36-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"7576195543","userName":"JAGart","userUrl":"https://itunes.apple.com/us/reviews/id30543351","version":"1.81.4","score":1,"title":"Needs A LOT of work.","text":"Two glaring problems with this product/app:\n\n1. Better integration with Siri. Let’s face it, HomeKit users are purchasing these because we want them within our smart home eco systems. As such, it floors me that I can not command Siri to either Test or Silence my detectors. At least open the app up to Shortcuts. \n\n2. Dear God please fix the set up routine—“easy setup” my foot. Never have I ever had so much trouble adding a device to my home network. I lost count of how many times I had to reset the device due to it’s failure to connect. All I’m going to say is that I HOPE it’s a result of the app’s software vs. the detector’s hardware, as that would make me worry about getting a notification that my house was on fire while away.","updated":"2021-07-14T09:42:36-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3325817311","userName":"Zhelyazko","userUrl":"https://itunes.apple.com/us/reviews/id86718664","version":"1.77.1","score":3,"title":"Need to include disable button for alexa","text":"I don’t want alexa integration, but if someone spoke the word “alexa” or even worse when having conversation without even saying “alexa”, first alert smoke alarm will tell you that alexa is not setup - I know that already, it is fine to tell me the first time but after that to disable this alert or to have a button to tell that I want to opt out of enabling alexa so it is not going to ask me again - I don’t want alexa integration because when I see that first alert will tell me about alexa integration not set up without even asking “alexa” I don’t like any conversation to be send to alexa without even asking alexa, privacy first please!","updated":"2018-10-20T22:51:47-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"4077134708","userName":"csduncan","userUrl":"https://itunes.apple.com/us/reviews/id26920918","version":"1.79.10","score":1,"title":"Basic architecture of app (and potentially devices) flawed","text":"Answering the following questions reveal major flaws in the app and devices (probably why it’s so difficult to support and has so many 1-star reviews):\n1.) on the main app screen, why download the list of devices from “the cloud” on the main screen when homekit (which users already authorized) gives you access to this data locally (without a web request)?\n2.) If the first alert smart smoke/co detector connects to WiFi, why is Bluetooth range required? I can’t change the brightness of the night light without Bluetooth connectivity, what?!\n3.) when I “Reset Networking” on my iOS device, it requires I re-pair with my first alert devices? Why? (Re question #2)\n\nIn general, it seems this app was built and conceived poorly as several other Homekit device makers who utilize WiFi in the implementation of their homekit devices don’t seem to have any of these issues (ConnectSense, Elgato Eve, iDevices, etc).\n\nThink CAREFULLY before you rely on these first alert devices for your homekit implementation!!!","updated":"2019-04-29T08:40:39-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3230545057","userName":"Alex Di Giacomo","userUrl":"https://itunes.apple.com/us/reviews/id31193061","version":"1.77.1","score":1,"title":"Half baked product","text":"Setup was smooth and straightforward but that's where it ends. Siri integration and homekit work as expected. Alexa responds, however, she doesn't know the status of the device where it is running. It claims there's no device that can answer the question, even though it is listed as a registered device on my account and the onelink skill is properly enabled. And, the options are incomplete, this device does not offer the option to change the wake word, which is a problem because the rest of my echo devices respond to a different wake work. They need to spend time improving the firmware on this product and the companion app.","updated":"2018-09-25T19:55:40-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"6425162456","userName":"Dr. Eyes","userUrl":"https://itunes.apple.com/us/reviews/id35426799","version":"1.79.31","score":3,"title":"Works but with some flaws","text":"Product and app works BUT if you VALUE privacy and do NOT use Alexa (just Apple HomeKit only for privacy concerns) the hallway nightlight function doesn’t work. \n\n*** When you turn off the onelink microphone, the hallway nightlight is STUCK with a red light.  ***  \n\nYou can’t use the other nightlight colors.  Even though I don’t have Alexa installed, I would still PREFER to keep the microphone feature off.   I simply don’t trust having Alexa on a product that could listen to our most private conversations.","updated":"2020-09-13T07:34:55-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3053642763","userName":"Pumasalad","userUrl":"https://itunes.apple.com/us/reviews/id37799790","version":"1.77.1","score":1,"title":"Buggy App with poor HomeKit integration","text":"The app crashes two out of every three times I launch it. When it does run, it reports trouble connecting with the smoke alarms. On the rare occasion that it does connect, it will stop responding for two minutes when you tap a button. When an alarm goes off the app won't silence it, even if you can get it to launch and you hold the button down like it says to. And all it will do in HomeKit is let you look up the serial number of each alarm. We have four of the alarms, and the app forgot which one is which so it just shows a list with \"smoke detector\" in it four times. No help whatsoever in trying to fix it.","updated":"2018-08-12T03:09:58-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"7081340019","userName":"Steve_S","userUrl":"https://itunes.apple.com/us/reviews/id37762058","version":"1.81.4","score":1,"title":"They never get it quite right","text":"I have had two of these for several years. Well i should say two installed but at least 8 different replacements over the years so at least they have been good about that but to be frank the app integration has never worked  very well. I mean when (or should i say if) i get them added to homekit they eventually lose connection. I run a test by holding the button down (in the app) and the app says they passed and has no clue the devices never even activated. \n\nI would not recommend these to even my worst enemy. Stay away!!!","updated":"2021-03-08T16:33:58-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3493851747","userName":"sulzer5rlb90","userUrl":"https://itunes.apple.com/us/reviews/id16906764","version":"1.79.1","score":1,"title":"Setup of the newest Onelink Smoke/CO alarm with this App has software failures.","text":"Very annoying process using my iPhone to board two new Onelink Smoke/CO wired alarms to Cloud. For each device the Onelink App had to be deleted/installed and iPhone powered down after OneLink customer support 2nd tier advice.   Once you upload the second alarm device you have to re-pair the first one!\nThe Hardware installation to replace old wired alarms took 10 minutes each. Software pairing took several hours due to Onelink App software issues for IPhone.   The devices do finally show up on the Onelink App & Apple HomeKit and I do not regret purchase.  I urge First Alert to correct the setup glitch in their App software.","updated":"2018-12-04T14:57:26-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"7675703259","userName":"Libertyforall","userUrl":"https://itunes.apple.com/us/reviews/id32753561","version":"1.81.4","score":1,"title":"Buggy & Missing Key Features","text":"The fresh start process is terrible sometimes takes multiple resets of each detector to add them. False alarms from days ago still show up in the app with no way to remove them. Sometimes my lighting selections do not apply to the detector in the whole system can be rather buggy.\n\nI should be able to see easily at a glance if all of my detectors have the latest firmware update and there should be a button to check for updates. I should also be able to rearrange the order of the detectors in the app.","updated":"2021-08-10T00:07:59-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"6597704569","userName":"mlds networks","userUrl":"https://itunes.apple.com/us/reviews/id86367608","version":"1.79.36","score":1,"title":"Avoid at all cost","text":"The reviews are right. This software and ecosystem do not work reliably. Eg I am second time trying to add the device. Even after rebooting my phone it still fails ether to find the detector or will fail connecting to WiFi.  Why do I have to do a factory reset just because my WiFi changed anyway? Only to figure this out after not getting a push when alarms went off. DO NOT BUY. After years this should be fixed/recalled etc. stick to the non smart models or get nest even though google takes all your data. At least it works.","updated":"2020-11-01T07:24:48-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"2186470878","userName":"NoWiFiOverseasForMe","userUrl":"https://itunes.apple.com/us/reviews/id309095166","version":"1.70","score":1,"title":"Return the alarm while you can.","text":"Seriously. Take the packaging and the receipt back to the store and get your money back. If I didn’t throw out the box, I would have brought it back by now. I’ve tried uninstalling and reinstalling the software five times. I still can’t get it to cooperate over the Wi-Fi. I’ve tried resetting the alarm with the 5 taps. The most recent attempt resulted in connecting to the device but not being able to fully set it up. I’m not able to check the status of the alarm from my phone as a result, so it’s no more reassuring than a less expensive smoke alarm.","updated":"2018-02-09T04:11:47-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"6510751986","userName":"Mizzou Mike","userUrl":"https://itunes.apple.com/us/reviews/id15817182","version":"1.79.36","score":5,"title":"Still working after almost a year!","text":"I’ve had minimal issues with these detectors.  I had to hire an electrician to install them and was able to connect with HomeKit on the second attempt.  Love the ability to remotely check their status.  Although I’m not sure if I’m able to remotely test them!","updated":"2020-10-07T10:02:54-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"4985173221","userName":"Why do I need a nickname????","userUrl":"https://itunes.apple.com/us/reviews/id39138788","version":"1.79.19","score":1,"title":"Just take this thing off the market and call it a day","text":"I wasted an hour of my life trying to install this piece of garbage. As MANY reviewers have stated, it is nearly impossible to get this hunk of crap to connect through the app.  I have a lot of smart home devices.  I'm very experienced at setting them up.  This is the worst.  THE WORST.  First Alert has had variations of this product on the market for years.  YEARS!  Why have the not perfected the set up yet??????  They should change their name from First Alert to Worst Alert. I'm sending this garbage back and buying a different brand.","updated":"2019-10-20T05:06:57-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"2671779726","userName":"SgtChevyFan87","userUrl":"https://itunes.apple.com/us/reviews/id646665121","version":"1.76","score":1,"title":"Scam Gimmick Waste Garbage Lies","text":"This app doesn’t work, it just keeps crashing. Doesn’t even recognize that I have already setup an account and says my username/email doesn’t exist as an account. Tried to setup a new one and it just crashes every time. The $120+ smoke detector doesn’t do anything more than a regular $6-10 one besides talk. It’s not going to give you remote alerts and do what it was advertised to do. Just as the title says, this whole product lineup is all of that. I will be seeking reimbursement / a full refund for my purchase and time wasted with this.","updated":"2018-06-10T07:29:38-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"5218353622","userName":"darkha1f","userUrl":"https://itunes.apple.com/us/reviews/id28531777","version":"1.79.19","score":1,"title":"Before you buy, read the reviews...","text":"This app is horrible. It took me two hours to setup two detectors I bought from Costco on a Black Friday sale. I hope that I’m not putting my loved ones lives at risk because if this app is any indication, these detectors will be very finicky and operate on a 5-minute delay.\n\nThe CEO needs to pay attention to these reviews and invest more in app development because it is impacting top line sales. I was considering replacing four more detectors in my home, but now... forget it.","updated":"2019-11-30T14:47:33-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"2644323909","userName":"ronnycarr","userUrl":"https://itunes.apple.com/us/reviews/id32803441","version":"1.75","score":5,"title":"Huge improvements!","text":"All of the issues I experienced in the past seem to have been resolved with the latest big update. My Environment Monitors are working wonderfully and I am able to update settings without the previous issue of them not saving.","updated":"2018-06-05T01:09:46-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"2614549846","userName":"xHolmeZx78","userUrl":"https://itunes.apple.com/us/reviews/id29985799","version":"1.74","score":1,"title":"Crap update causes immediate crashing","text":"App update from 5/29 immediately crashes when attempting to connect to HomeKit home, which has been configured with this app and multiple OneLink devices for 2+ years without issues.  Restart of phone, force closing app or even uninstall of app, reboot phone and reinstall does not resolve issues either.\n\nPlease do more QA and testing before releasing such crap software.  please also pay attention to your reviews and listen to your customers, before you lose what you have","updated":"2018-05-29T18:05:43-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"5863536583","userName":"SRW0507","userUrl":"https://itunes.apple.com/us/reviews/id35964699","version":"1.79.26","score":5,"title":"Perfect","text":"Worked perfectly. Easy setup and install. I use HomeKit for everything in my home. Supper easy to install on my iOS device and easy Siri setup. I even called support on a Saturday during COVID lockdown and they were there for a quick question.","updated":"2020-04-25T13:57:02-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3736559768","userName":"Douglas Karr","userUrl":"https://itunes.apple.com/us/reviews/id244836747","version":"1.79.8","score":1,"title":"Difficult to set up and doesn’t communicate","text":"I was able to install these without a problem. However, connecting them to my network required at least 5 attempts on each detector. I’d get to the confirmation screen and it would error and I’d have to start all over. \n\nPerhaps the worst part, though, is that the alarms go off after I get out of the shower. The entire house is going off. If I open the app, the app says “Everything is okay” on every detector with no alert or means of silencing the alert. \n\nI bought these so I’d be informed if there were a CO leak or fire and I wasn’t home. So much for that, a total waste of money.\n\nAnd after each shower I have to run around the house and silence each alarm since they’re all connected.","updated":"2019-02-05T08:40:01-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3366917996","userName":"Pest Control Please!","userUrl":"https://itunes.apple.com/us/reviews/id369008930","version":"1.77.1","score":1,"title":"Units work great, but app is buggy","text":"You shouldn’t have to “fix issues” every time the app is restarted. I have deleted & re-added the units to the system multiple times & still have issues connecting sometimes. It just makes me wonder if they will really all work together when they’re really needed in a fire. Should I have to wonder about the safety of my family after installing top of the line units like these?","updated":"2018-10-31T20:23:52-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"7686281698","userName":"miguel6730","userUrl":"https://itunes.apple.com/us/reviews/id1068471761","version":"1.81.4","score":3,"title":"Please make it happen Need a new update","text":"We want to be able to access our smart smoke alarm via mobile  away from home to be able to perform test away from home to make sure everything works well remote access","updated":"2021-08-12T18:14:38-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3463015609","userName":"Onelink Angry Customer","userUrl":"https://itunes.apple.com/us/reviews/id752091610","version":"1.77.1","score":1,"title":"Worst app","text":"We recently purchased 11 Onelink wi fi smoke and carbon monoxide alarms. It was supposed be easy to set up with this app. The voice even tells you “a simple set up”. It has been anything other than simple. It has been the most frustrating and disappointing process. I would not recommend the app and frankly we’re wishing we had not spent $1300 for what is supposed to be the best. If we could give it zero stars we would.","updated":"2018-11-26T07:25:19-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"6511379226","userName":"X.Static","userUrl":"https://itunes.apple.com/us/reviews/id124081509","version":"1.79.36","score":1,"title":"Completely Broken After iOS 14 Update","text":"App will not connect my existing OneLink to my house wifi, no matter how many times I try. App has full access to network resources/bluetooth/etc...if it asked for permissions, I gave them to the app and verified in iOS settings. Absolutely ridiculous that the app devs haven't updated the app to work properly. Time to find new detectors.","updated":"2020-10-07T14:01:27-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3345928792","userName":"johnanfharv","userUrl":"https://itunes.apple.com/us/reviews/id652925488","version":"1.77.1","score":1,"title":"Smoke Alarm","text":"Bought 5 one link smoke alarms, setup was boggy to at best, some had to try several times to get it connected. Kept on complaining about Bluetooth no in range even though I had my phone next to it. After several months, 1 lost battery power, 2 others went offline with no way to reconnect them. Well, this experience tells me to stay away from First Alert equipment, total junk...","updated":"2018-10-26T05:59:55-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"2595555898","userName":"isaac onelink","userUrl":"https://itunes.apple.com/us/reviews/id498239428","version":"1.73","score":1,"title":"Onelink environment monitor","text":"It is an absolutely poor app ever, have tried tons of times, always having issue, for example, trouble of signing up, trouble of adding new device, trouble of searching device, trouble of verifying your email account, Wait! What? \nTired of this product, totally regret to purchase it. I wish I could have seen all of these 1 star comment before considering purchase it","updated":"2018-05-25T12:32:19-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3139434819","userName":"BBBBBBBBBOOOOOOOOOBBBBBBB","userUrl":"https://itunes.apple.com/us/reviews/id135286211","version":"1.77.1","score":1,"title":"Just doesn’t work","text":"Home says that a firmware upgrade is necessary but there is no way to do that. I called the telephone support. He was basically laughing through the process because there was no way it was going to work. He did say there was going to be an upgrade  to their app in a couple of weeks (about a month ago). Makes me wonder if it works as a smoke detector at all.","updated":"2018-08-31T20:59:25-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1951992286","userName":"Tbiz1957","userUrl":"https://itunes.apple.com/us/reviews/id138619638","version":"1.69","score":1,"title":"Omg these things will not shut up","text":"Both my detectors one wired & one wireless have been going off since yesterday nothing will shut them up! I've even pushed the deactivate buttons on back of them and they are still going off!!!! They've been put in a box in the garage in a cabinet and I can still hear them. What the heck is up? Neither one would connect to the app? Help","updated":"2017-11-26T22:07:58-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"2206539259","userName":"KMACTEN","userUrl":"https://itunes.apple.com/us/reviews/id258026000","version":"1.70","score":1,"title":"DO NOT BUY THIS PRODUCT","text":"It’s 2:45am and I just got done smashing this smoke alarm with a hammer because that was the only way to silence it after a false alarm in my 4 year old daughter’s bedroom. Lovely. \n\nSave yourself the work and just light your hundred and twenty bucks on fire before the stupid thing wakes up your whole family and scares our kids half to death in the middle of the night. Complete garbage.","updated":"2018-02-14T02:47:46-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3436271761","userName":"nlongster","userUrl":"https://itunes.apple.com/us/reviews/id937433747","version":"1.77.1","score":4,"title":"Easy installation and usage!","text":"Installation instructions were clear and easy. I love the feature in the app to turn Alexa off. Night light feature is also nice. As a fire fighter I really like that it keeps a log of tests.","updated":"2018-11-19T07:15:45-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3904597758","userName":"bdraco","userUrl":"https://itunes.apple.com/us/reviews/id13630826","version":"1.79.10","score":3,"title":"Performance is improving","text":"Please focus on the startup time, there is a noticeable delay when downloading devices from cloud when the app first starts up.  The app is usable now ... thank you!\n\nPlease keep the performance improvements coming, the app is getting closer to a good state!","updated":"2019-03-20T09:05:54-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"5074335964","userName":"HarleyWarEagle","userUrl":"https://itunes.apple.com/us/reviews/id23290171","version":"1.79.19","score":1,"title":"App went to crap!!!","text":"What happen you all screwed up everything! This use to work fine & now you can’t connect can’t test can’t do anything at all WHY?!!!!!!! This aggravated me to no end if it isn’t broke then why break it & screw it up! To think I was going to buy more of your prom it with the issue you have now! FIX IT NOW & STIP SCREWING AROUND REALLY!!!!","updated":"2019-11-02T15:47:18-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"6868211088","userName":"m00se247","userUrl":"https://itunes.apple.com/us/reviews/id200731883","version":"1.80.1","score":1,"title":"Terrible","text":"Terrible app and terrible product. Do not buy. I’ve been woken up 3 times in the middle of the night by false alarms. You’d think the app would at least he helpful with silencing the alarm but it does not work at all!! Had to get up, find a step stool and manually silence each alarm.","updated":"2021-01-14T02:26:07-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"2013164561","userName":"Jose skrizzle","userUrl":"https://itunes.apple.com/us/reviews/id43678339","version":"1.69","score":1,"title":"Can’t change temp range in app","text":"Like another person mentioned, you are unable to select a temperature range for alerts. Contacted tech support who acknowledged it was an issue and was working on a fix. That was 4 months ago. I’ve asked for another update and have only received radio silence. I’d give zero stars if I could.","updated":"2017-12-20T17:14:20-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"4139369641","userName":"Trueboop","userUrl":"https://itunes.apple.com/us/reviews/id31368753","version":"1.79.12.27","score":3,"title":"Where is Airplay2?","text":"Unlike a lot of reviewers, my units are working fine. However, Airplay2 support was promised by the end of last year. Where is it? And, no, I’m not emailing reviews@... tell us here and tell us now EXACTLY when it will be available.","updated":"2019-05-12T07:27:22-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3721272608","userName":"Angelcali510","userUrl":"https://itunes.apple.com/us/reviews/id31432494","version":"1.79.8","score":3,"title":"Alexa devices","text":"The unit works good, easy to setup and link your alexa account. But!!! I also would like to link my other alexa devices in my bedrooms, at least listen to my music. 5 stars when i can link all devices.","updated":"2019-02-01T10:13:40-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"5328701046","userName":"Devvvvvvvvvvvvv","userUrl":"https://itunes.apple.com/us/reviews/id14386395","version":"1.79.19","score":1,"title":"Garbage","text":"They have had years to correct the failure of an app, but it still has the same issues it has had from the beginning. This is the only HomeKit device that I have that is disconnected more than it is connected.","updated":"2019-12-27T19:12:22-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"6012509824","userName":"Dany Diab","userUrl":"https://itunes.apple.com/us/reviews/id1048124941","version":"1.79.26","score":1,"title":"“Hello, everything is ok”","text":"This app does not work. The pairing was easy, but after the pairing. I wanted to test disconnecting the device. When it happened, the app continued just to say “Hello, everything is ok” when clearly it wasn’t. I would not buy this product.","updated":"2020-05-30T00:21:01-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"2668363600","userName":"KTPett","userUrl":"https://itunes.apple.com/us/reviews/id34505190","version":"1.76","score":1,"title":"Still horrible","text":"Despite putting effort into a new look, the basic operation of the alarm notifications and app are horrible.  I wouldn’t even say it is ready for an alpha test let alone a beta or public release and it has been out for years. \n\nStay away and go with the Halo alarm. It works.","updated":"2018-06-09T16:01:50-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"6588000745","userName":"supernitin","userUrl":"https://itunes.apple.com/us/reviews/id36689397","version":"1.79.36","score":1,"title":"Airplay 2 Mostly Doesn’t Work","text":"I bought 2 of these based on the Airplay 2 functionality. I hoped for over a year that they would make this work properly. It seems to get less and less reliable as time passes.","updated":"2020-10-29T15:46:17-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"8105791195","userName":"fgfgfgfgfdfff","userUrl":"https://itunes.apple.com/us/reviews/id33984952","version":"1.82.6","score":1,"title":"Absolutely garbage","text":"The app doesn’t work. Tried to pair first unit, failed 3 times. 4th try worked. Then wouldn’t connect to Wi-Fi. Then it told me to start over.  I’m returning these to the store. For a life safety product, you can’t have any doubts if it is working or not.","updated":"2021-12-07T12:56:11-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"4963726105","userName":"iseverynictaken","userUrl":"https://itunes.apple.com/us/reviews/id191055591","version":"1.79.18","score":1,"title":"Worst product EVER!  Avoid.","text":"Easily the worst home automation system I have.  This setup constantly fails and loses the settings.  I hope the smoke detectors work well independently because this App is a joke.  As normally happens after a few weeks the app loses at least one device. Sadly the remaining smoke detector is listed but the app says:\nHello, everything is okay.\nSensors OK Battery OK\n\nBut all options result in a failure to communicate.  The self test never completes.\n\nI wish I had never bought the hardware and the app is terrible at managing the devices.","updated":"2019-10-17T21:53:52-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3904941033","userName":"thomasthechan","userUrl":"https://itunes.apple.com/us/reviews/id40298589","version":"1.79.10","score":2,"title":"Works but slow","text":"All available features work through the app, but it takes far too long for the app to open when the smoke detector goes off.","updated":"2019-03-20T11:10:34-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"7540237515","userName":"Will Notbuythiscameraeveragain","userUrl":"https://itunes.apple.com/us/reviews/id120210726","version":"1.81.4","score":1,"title":"Expensive waste of time!","text":"I spent most of the day trying to get this to work. Trying over, and over, and over, and over, and over to get the thing to connect. It refused to work. So, I’m taking it back. Avoid this one.","updated":"2021-07-04T19:38:53-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"2595887287","userName":"ilmkid","userUrl":"https://itunes.apple.com/us/reviews/id181819702","version":"1.73","score":1,"title":"Don’t waste your money!!","text":"After buying 7 of these detectors, spending hours trying to configure and reconfigure all of them over the year or so I’ve owned them, I GIVE UP! They updated the app today so I checked it out and now all of them have disappeared!!\n\nAn expensive lesson learned.","updated":"2018-05-25T14:45:31-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"5248216346","userName":"danceswithtrout","userUrl":"https://itunes.apple.com/us/reviews/id141123475","version":"1.79.19","score":2,"title":"App needs work","text":"The app has a known defect in that it only installs properly on one device.  All other devices say “setup needed”.","updated":"2019-12-08T04:22:31-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"5736790788","userName":"dp917","userUrl":"https://itunes.apple.com/us/reviews/id797922968","version":"1.79.26","score":1,"title":"Poor setup","text":"Latest update removed a smoke alarm. Which then can’t be added back because it errors out with iOS 13 devices, luckily have a iOS 12 device still that can add it back","updated":"2020-03-30T10:50:28-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"5013215286","userName":"BababooeyHTJ","userUrl":"https://itunes.apple.com/us/reviews/id557455856","version":"1.79.19","score":1,"title":"Easily the worst piece of software","text":"I've never had a single piece of software give me so many issues. I'm shocked that brk would put out a product with so little effort. Things seem to have gotten worse since these were released somehow as well.","updated":"2019-10-25T07:44:00-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3577523872","userName":"Eas156","userUrl":"https://itunes.apple.com/us/reviews/id7312404","version":"1.79.4","score":3,"title":"Firmware???","text":"How do I get firmware updates? There is no button to update firmware. I can’t do half of the features because I am so far back on versions. Fix this.","updated":"2018-12-26T17:33:48-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"6363665423","userName":"Gkorkg","userUrl":"https://itunes.apple.com/us/reviews/id182406261","version":"1.79.31","score":1,"title":"Remote silence not working","text":"I don’t know what the point of this smoke detector is. It’s suppose to be homekit capable but it’s not. You’re not able to silence the alarm remotely, unless you’re next to the smoke detector or on the same network. There is no point of homekit","updated":"2020-08-26T10:24:39-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"5287908942","userName":"Shaggy cat","userUrl":"https://itunes.apple.com/us/reviews/id207164201","version":"1.79.19","score":1,"title":"App doesn’t link with the product","text":"Not more to say other than having tried it on three different iPhones to make sure that it wasn’t due to a smartphone issue.","updated":"2019-12-18T09:15:47-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"4860226026","userName":"jsclancy","userUrl":"https://itunes.apple.com/us/reviews/id133210966","version":"1.79.18","score":1,"title":"Zero stars","text":"Can’t connect to HomeKit - no alerts when alarm goes off - randomly goes off - absolutely horrible - I spend so much money and have multiple units hard wired in my house - I just don’t get it - and can’t believe that Apple sells this product","updated":"2019-09-29T07:53:09-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"6382823829","userName":"JamesK212","userUrl":"https://itunes.apple.com/us/reviews/id16612326","version":"1.79.31","score":1,"title":"Not safe at all","text":"I wanted to rey well at night, these alarms make me feel unsafe. They go off randomly, and mostly between 1:00am and 5:00am. This has gone on  and off for two years. \n\nI am taking a hammer to them in the morning. \n\nDO NOT BUY!!!!!!","updated":"2020-08-31T21:45:26-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"6619527148","userName":"GlobalBD","userUrl":"https://itunes.apple.com/us/reviews/id105998985","version":"1.79.36","score":1,"title":"The product simply does not work","text":"I was not able to set it up on my HomeKit. It keeps failing. I feel like I picked up $150\nPaperweight. Deeply disappointed in Apple as well for certifying such a low quality service.","updated":"2020-11-07T09:54:29-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3515509023","userName":"CCfdfdd","userUrl":"https://itunes.apple.com/us/reviews/id37201865","version":"1.79.1","score":1,"title":"Not ready for release","text":"Devices have issues connecting to HomeKit. Will connect and then a few hours later still be in the home app, but this app says they need to be paired again. Then pairing doesn’t work.","updated":"2018-12-10T05:12:57-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3270881668","userName":"Anchorman2626","userUrl":"https://itunes.apple.com/us/reviews/id203168181","version":"1.77.1","score":1,"title":"Untrustworthy devices unsafe be waste of money","text":"This one link app is nothing but a joke not to mention if you want to talk to some people over on the other side of the world customer service is there for you good luck\nWorkers app ever don’t Recommend it to my worst neighbor","updated":"2018-10-06T08:57:13-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"6498290292","userName":"Jstymie","userUrl":"https://itunes.apple.com/us/reviews/id162208546","version":"1.79.31","score":1,"title":"Can’t set up a “Home”.","text":"I keep getting an error saying syncing with iCloud. Will not allow me to go any further after trying all the recommended fixes. Worthless app.","updated":"2020-10-03T21:37:14-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3460436140","userName":"Kholubar","userUrl":"https://itunes.apple.com/us/reviews/id29941889","version":"1.77.1","score":1,"title":"Hot garbage","text":"I saw some of the less than stellar reviews but figured since this is the only HomeKit smoke/co2 it was still worth a shot. \n\nWow was I wrong. I was starting to replace the wired interconnected versions in my home with smart versions. \n\nIt failed on pairing 4 times, the app crashed, and the last alert I got was “your alarm has reached end of life.”\n\nAll inside of 15 minutes. Sadly I’m going back to Nest Protect even though it currently isn’t compatible with HomeKit.","updated":"2018-11-25T14:47:14-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"2933321624","userName":"BravoMike09","userUrl":"https://itunes.apple.com/us/reviews/id36408145","version":"1.77.1","score":2,"title":"Difficult to connect","text":"Took multiple attempts to connect.  Many failures.  Finicky on wifi signals.  Router has to be close.\n\nWhen it did connect it joined the wrong home and I had to delete it and start again.\n\nFinally got it connected but it took almost an hour.\n\nOnce working it seems okay. I’ll update after I use it for awhile.","updated":"2018-07-19T01:34:43-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3564314036","userName":"fxdgear","userUrl":"https://itunes.apple.com/us/reviews/id31393557","version":"1.79.4","score":1,"title":"Garbage app. Garbage product.","text":"The alarm goes off when using a humidifier. \n\nNot only does it go off it goes off repeatedly. 2, 3, sometimes 7 times a day. \n\nI called they sent me 4 replacement units and the new model units won’t connect to HomeKit and get set up. \n\nThis is the absolute worst product I’ve ever seen and used. \n\nMy family is going to die in a fire cause of these faulty smoke alarms. \n\nI can’t believe I wasted so much money on such garbage.","updated":"2018-12-23T10:08:48-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3705914378","userName":"Bret S","userUrl":"https://itunes.apple.com/us/reviews/id35413167","version":"1.79.8","score":2,"title":"AirPlay 2","text":"Where is AirPlay 2 support?\nWhen I purchased the product, it was said to be available Fall of 2018. It is almost February. When will support be rolled out?","updated":"2019-01-28T12:55:55-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"2613711803","userName":"The GrimRocker","userUrl":"https://itunes.apple.com/us/reviews/id36265248","version":"1.74","score":1,"title":"Crash & Burn...","text":"Updated the App and now all it does is crash immediately after opening. It’s also curious why they never offered the ability to automate the night light.","updated":"2018-05-29T12:51:49-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"6401210025","userName":"Wlamont","userUrl":"https://itunes.apple.com/us/reviews/id120760366","version":"1.79.31","score":1,"title":"Barely 1 Star","text":"This app and device is pretty clunky.  The app doesn’t even work on my phone. I can only sign on and use this with my iPad.  Super frustrating.","updated":"2020-09-06T06:07:03-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"5226841191","userName":"hdhfhfufuf","userUrl":"https://itunes.apple.com/us/reviews/id242846847","version":"1.79.19","score":5,"title":"nice 3 in 1 device","text":"mounting the device was more difficult than expected.  setup through the app was fast.  its a nice little speaker.","updated":"2019-12-02T18:09:59-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3595804717","userName":"Dcs194","userUrl":"https://itunes.apple.com/us/reviews/id104976125","version":"1.79.4","score":1,"title":"Not compatible with 5G network","text":"Tried to install but was told the product was not compatible with my 5G Network . Product needs some work . The Alexa skill is a reactive notification. Not what I expected .","updated":"2018-12-31T06:18:36-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"6471240146","userName":"fighter24","userUrl":"https://itunes.apple.com/us/reviews/id22459014","version":"1.79.31","score":2,"title":"Poor design","text":"No option to turn off night lite on smoke alarms","updated":"2020-09-26T09:48:31-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"5466165399","userName":"Andregiant8","userUrl":"https://itunes.apple.com/us/reviews/id184562689","version":"1.79.19","score":1,"title":"Avoid","text":"Continual false alarms all through the night. Will never buy one of their products again.","updated":"2020-01-30T05:22:03-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"5241669502","userName":"musicritic2","userUrl":"https://itunes.apple.com/us/reviews/id156958390","version":"1.79.19","score":1,"title":"Will not work... AT ALL","text":"Tried to create account after downloading this app Won’t even login. Can’t pair with device. This thing is useless.","updated":"2019-12-06T14:32:37-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"5945363229","userName":"weldong","userUrl":"https://itunes.apple.com/us/reviews/id112713281","version":"1.79.26","score":1,"title":"infrastructure for this app not ready?","text":"app showed detector was good.   decided to test detector and app did receive alarm.  could not silence via app.  then app just said something like scanning devices from cloud. (app never got alarm)  apple homekit could see detector fine and saw status (just no option to silence).   internet at house is fine","updated":"2020-05-14T12:18:41-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"5218290512","userName":"Animelover12343","userUrl":"https://itunes.apple.com/us/reviews/id279719212","version":"1.79.19","score":1,"title":"Pairing issues","text":"My one safe and link is on Bluetooth mode and the app won’t recognize, I’m connected to WiFi and the device is flashing blue.......","updated":"2019-11-30T14:21:34-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"6439380567","userName":"angryonelink","userUrl":"https://itunes.apple.com/us/reviews/id572822848","version":"1.79.31","score":1,"title":"What a disappointment","text":"This thing should not be so hard to setup with Apple HomeKit. Apple should distance themselves from this product.","updated":"2020-09-17T12:21:57-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"4966619057","userName":"Jp27472929","userUrl":"https://itunes.apple.com/us/reviews/id520227820","version":"1.79.19","score":1,"title":"You cannot turn off the nightlight","text":"Why would anyone create a device intended for bedrooms that forces users to have a light turned on 24/7?","updated":"2019-10-18T06:50:45-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"2653319508","userName":"ewiles","userUrl":"https://itunes.apple.com/us/reviews/id373163840","version":"1.75","score":1,"title":"Crashes on startup","text":"App used to work. Since the last 2 updates it crashes on startup, every time. It’s no longer usable.","updated":"2018-06-06T19:42:41-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"7803962398","userName":"Shahram1957","userUrl":"https://itunes.apple.com/us/reviews/id1228179270","version":"1.81.4","score":1,"title":"App is Terrible","text":"This app is just garbage. It is not synced up with the one link I mean I have 4 of these and I’m just not happy with the hardware nor the app.","updated":"2021-09-13T20:55:49-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"4599061606","userName":"abake","userUrl":"https://itunes.apple.com/us/reviews/id23081366","version":"1.79.12.27","score":1,"title":"Garbage","text":"Seems like every time I open the app the alarm is missing and needs to be reset / relinked. So annoying. I plan to return it if I can.","updated":"2019-08-10T18:00:09-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"4994986253","userName":"Ngrimes08","userUrl":"https://itunes.apple.com/us/reviews/id151806547","version":"1.79.19","score":1,"title":"Where is AirPlay 2 support!?!?!?","text":"No AirPlay 2 support. They whole reason I bought this over a year ago! Still waiting. False Advertising!!","updated":"2019-10-21T17:40:18-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"2599815300","userName":"Mbaroni","userUrl":"https://itunes.apple.com/us/reviews/id111017248","version":"1.73","score":1,"title":"Crashes","text":"Crashes upon opening on iPhone X since the last update.","updated":"2018-05-26T10:48:20-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"4598043895","userName":"Browns1709","userUrl":"https://itunes.apple.com/us/reviews/id42397345","version":"1.79.12.27","score":1,"title":"Avoid First Alert","text":"Unless you constantly want to try reconnecting to WIFI or to HomeKit, avoid these products like the plague.","updated":"2019-08-10T12:39:22-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"7852380033","userName":"Daverp1","userUrl":"https://itunes.apple.com/us/reviews/id20578978","version":"1.81.4","score":1,"title":"If they detect smoke as good as the app works we are all dead","text":"App is complete trash.  Can’t get anything to work.","updated":"2021-09-27T17:46:14-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3161430145","userName":"Hellfish.Ryan","userUrl":"https://itunes.apple.com/us/reviews/id34326751","version":"1.77.1","score":1,"title":"Garbage","text":"Genuinely a garbage app. You would think that a smoke detector company would understand the importance of a quality product, but NOPE. 4th false alarm in 16 months. Thanks guys!","updated":"2018-09-06T17:14:18-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"2609812594","userName":"iNurseNJ","userUrl":"https://itunes.apple.com/us/reviews/id126002126","version":"1.74","score":1,"title":"Crash City!","text":"After update to version 1.74 the app crashes - unable to open app.","updated":"2018-05-28T16:29:13-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"2616957438","userName":"joski","userUrl":"https://itunes.apple.com/us/reviews/id38817547","version":"1.74","score":1,"title":"No go with 11.4","text":"App keeps crashing immediately after upgrading to iOS 11.4. Worthless!!","updated":"2018-05-30T06:00:07-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"5640933396","userName":"Ronald Ur","userUrl":"https://itunes.apple.com/us/reviews/id456215910","version":"1.79.19","score":1,"title":"What a mess","text":"It doesn’t work. \n$800 in smoke alarms useless\n\nWe called and emailed the developer many times and had to file a complaint with the FTC because it’s a critical piece of home safety equipment.\n\nMy opinion “these people are selling a horrible death”","updated":"2020-03-10T04:05:11-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"2599503637","userName":"meowmeowme279","userUrl":"https://itunes.apple.com/us/reviews/id21463282","version":"1.73","score":1,"title":"App crashes after update","text":"App crashes after update","updated":"2018-05-26T09:07:19-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"2628917260","userName":"Ebaynator","userUrl":"https://itunes.apple.com/us/reviews/id15789652","version":"1.74","score":1,"title":"Unable to open app","text":"Latest update now I am unable to open the app.","updated":"2018-06-01T18:00:26-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"4133739616","userName":"TheRealDodson","userUrl":"https://itunes.apple.com/us/reviews/id17530015","version":"1.79.12.27","score":1,"title":"AirPlay 2?","text":"I was under the impression this was AirPlay 2 integrated. Seems not so. I purchased THREE expecting such. Disappointed. Very.","updated":"2019-05-11T06:19:16-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3101594957","userName":"chris__","userUrl":"https://itunes.apple.com/us/reviews/id18327417","version":"1.77.1","score":1,"title":"The other reviews are no joke.","text":"This software is garbage. If you’re smart, you won’t trust your house to this flaky mess.","updated":"2018-08-22T20:20:59-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"6594231817","userName":"Jroy83732","userUrl":"https://itunes.apple.com/us/reviews/id322071582","version":"1.79.36","score":1,"title":"Can’t connect alarms to WiFi","text":"Can’t connect to WiFi","updated":"2020-10-31T09:00:55-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"4157397771","userName":"jhr4234","userUrl":"https://itunes.apple.com/us/reviews/id119581472","version":"1.79.12.27","score":1,"title":"Garbage","text":"The worst $200+ product I’ve ever used. Complete crap. Won’t even connect to Bluetooth.","updated":"2019-05-15T21:55:03-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3114255971","userName":"LunchboxNYC","userUrl":"https://itunes.apple.com/us/reviews/id33040812","version":"1.77.1","score":1,"title":"Return Your Device NOW!!!","text":"This app deleted my entire HomeKit setup","updated":"2018-08-25T17:23:47-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3627745528","userName":"Mo Bowman","userUrl":"https://itunes.apple.com/us/reviews/id177513610","version":"1.79.4","score":1,"title":"Immediately returned product to store due to poor HomeKit integration","text":"Nest Copy-cat falls short","updated":"2019-01-08T13:52:51-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"4821490055","userName":"samoyedprincess","userUrl":"https://itunes.apple.com/us/reviews/id100670753","version":"1.79.18","score":1,"title":"Bait and switch","text":"Why is there no Airplay 2 support like you promised for the OneLink Speaker?","updated":"2019-09-21T21:01:46-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1497315251","userName":"dameronln","userUrl":"https://itunes.apple.com/us/reviews/id42830031","version":"1.63","score":2,"title":"iOS Home app Onelink smoke/CO alarm NOT SUPPORTED","text":"I have the OneLink First Alert Smoke and CO detector (hard wired). Using Apple's HOME app in iOS 10.1.1 on any of my iOS devices it says \"Not supported. This accessory requires a firmware update before it can be used in the Home app. Try updating it using the manufacturer's app.\" I have the latest firmware provided by the Onelink app.\n\nPlease fix. The smoke/co detector should report on status in the native iOS Home app that comes with iOS 10 and up. It should say whether it found or did not find smoke/CO and should let you adjust the night light level for those of us who have the hard wired devices.\n\nAlso every time you guys update the app, I lose connectivity to my smoke alarm and I have to go through the process of un-pairing and re-pairing.","updated":"2016-12-06T19:38:39-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"6353111262","userName":"Steve Riggins","userUrl":"https://itunes.apple.com/us/reviews/id37858407","version":"1.79.30","score":1,"title":"Setup is unacceptable","text":"I replaced my expiring Nest Protects with First Alert One Links. The Protect's hardware is much nicer in features, user experience and build quality, but it is now owned by Google. Nest’s night light has motion sensor, Onelink’s night light does not.\n\nOneLink’s app is terrible. The app has earned the 1.5 App Store rating. Each alarm  took several setup attempts. On average I spent over 45 minutes setting up each alarm in the app. That does not include the hardware installation, which was simple. For the price, I expect better.\n\nThere were many, many timeouts \"accessing device data\", setting up wifi, etc. The app would often tell me something went wrong, with a button to finish setup. This never, ever worked. It would spin for minutes at a time. I have a video over 14 minutes long of trying to set up the last one, and that was only half the attempts.\n\nIt feels like whomever wrote this software is a contractor. They got paid and are out. Surely there is no way this was written by an in-house team, because if so, they should be asked to set up the current hardware on a vaulted ceiling with this app on a hot day.\n\nThe Onelink PHONE support has been good. I had an issue with one alarm that chirped every minute and said the battery was low. The FAQ said to replace the battery but it was brand new, so I called. The person told me that the alarm had to \"click\" into the mounting plate as there is some  pressure sensor. I reapplied the alarm to the plate and it seemed to fix it, although I also reconnected the adapter. It was nice to get support on a Saturday.\n\nI am able to ask my HomePod \"is there smoke upstairs?\" or \"Is there smoke in the vanity room?\" and Siri responds pretty quickly that no, there is no smoke indicated. So that's a good sign.\n\nBut the setup is simply unacceptable and I cannot recommend this product until First Alert completely overhauls their app. If the hardware is the issue, then the hardware needs updating. But app just spins and spins for multiple minutes with no feedback and then just says an error occurred. It's infuriating compared to how easy the Nest Protects were to set up, and that was seven years ago.  There is no excuse for this poor level of software performance.\n\nI have not had an alarm trigger, as I just installed them so I have no idea how well they function as a smoke detector.\n\nLastly, First Alert needs a light on their hardwired unit that indicates power is on. The night light only works if the night light has been enabled, which it is not while setting up the unit. Knowing that the writing is correct before beginning setup is important.","updated":"2020-08-23T11:55:14-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1529131557","userName":"My_Shado","userUrl":"https://itunes.apple.com/us/reviews/id34519949","version":"1.66","score":4,"title":"23 Jan 17 Updates","text":"Purchased 20 Jan 17 knowing the review problems. The hardware install was easy and the software linking worked fine but just wait for the Onelink software to recognize the hardware. Yesterday, apple's Homelink feature indicated the hardware was not supported and needed a firmware update.  Note, the Onelink app worked fine. Today a firmware update was released and with it installed, now Apple's Homelink works correctly.  The cool thing is the interconnect works great with the other hardware non-smart Alarms. Buy just one smart alarm and the whole smoke alarm system is smart. Only suggestion is v2 hardware which includes a CO2 interconnect alarm, scheduling for the night light, and adding temperature, humidity, CO2 readouts, and maybe two way speaker.","updated":"2017-01-23T18:22:00-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1487055196","userName":"adam.fox","userUrl":"https://itunes.apple.com/us/reviews/id37624670","version":"1.62","score":1,"title":"Boooooooo!!!!","text":"Smoke alarm works fine, I assume. Never had any issues with it but man... first update in I don't even know how long and they don't address the fact that this \"homekit\" (those quotes are there for the purpose of sarcasm) doesn't even work with iOS 10, many months later. The biggest takeaway you should get from this is that FirstAlert is a fine company but launched a product they're incapable of supporting. They jumped on the bandwagon to sell a device but didn't think about the resources needed to maintain it. It may very well be the fault of Apple for opening up a platform to third parties but as far as I see it FirstAlert just simply didn't know what they were getting into. Wish Apple would implement some sort of timely update standard for all these certified devices of theirs because they're really souring the companies reputation.","updated":"2016-11-18T21:53:10-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1332566251","userName":"MPM8010","userUrl":"https://itunes.apple.com/us/reviews/id29033117","version":"1.31","score":1,"title":"Absolutely Awful","text":"Both the hardware and the app are atrocious. I bought two units and setting up each was a prolonged affair. I had to start over at least five times on each unit because the connection process failed at some point. And once you get the units set up it appears you can only access them with the device you used for the setup. You also can't do much with the app other than test the units. Today one of the units started to malfunction, only three months after I purchased it. Not only did it malfunction, I had to take it apart to cut the battery because it was stuck in an endless loop of asking me to start the setup process. I bought these because they were advertised as HomeKit compatible, but other than being able to ask Siri if they were working there's not much else there.","updated":"2016-02-13T15:33:56-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1324038005","userName":"FIVEfingersFIVE","userUrl":"https://itunes.apple.com/us/reviews/id43105725","version":"1.3","score":2,"title":"Not working now","text":"I got a unit the first day they were on sale. It paired and worked ok. Then some app or firmware update killed it. Now can't pair with my original phone. They sent a new one, but the system ( their database ) has got me locked out of it and so now I can't get the second one pair it into the same phone that I had the first one pair into before even though I deleted the first one. I have had home automation since the x-10 days in the mid 80's and lots of zwave and other devices. This is pretty high up on the difficulty to get working scale. Yet it should be so simple.","updated":"2016-01-28T16:50:05-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1289652203","userName":"Don Miguel35","userUrl":"https://itunes.apple.com/us/reviews/id86412077","version":"1.1","score":1,"title":"Should be called \"Last Alert\"","text":"Not only does the interface and app have bugs the unit wouldn't even recognize smoke from a burning paper held in front of the sensors. You can run their app test and the unit says it's wonderful. I really don't trust the unit to protect my family. The first two units I purchased, for $109 each, had problems. One worked for a day and went off when we were boiling water on the stove. So I moved it. The second one was unrecognizable and wouldn't connect on the network. So I moved the first unit to a different location and it to could not be recognized after the move. The company has been responsive and is sending me two new units. I will attempt this again and update my rating.","updated":"2015-11-21T06:40:57-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1627716723","userName":"dathandagostino","userUrl":"https://itunes.apple.com/us/reviews/id17794722","version":"1.68","score":2,"title":"Love it but would like to see more","text":"I would love the possibility to have the nightlight (hardwired alarm) to be off during the day and slowly get brighter as the sun begins to set. So as the sun rises, the nightlight should slowly decrease until 0% then as the sun sets it slowly increases until 100% is reached. Since we already have the ability to set the intensity level this could be done through a firmware update AND/OR set automatically through the Onelink app AND/OR the Home app from Apple.","updated":"2017-05-29T05:39:38-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1299760591","userName":"BrunerMA","userUrl":"https://itunes.apple.com/us/reviews/id42092903","version":"1.2","score":1,"title":"Does this even work?","text":"Picked up a OneLink from Lowe's today and tried the setup...\n\nConfiguration:\n- AirPort Extreme (4th gen)\n- iPad Air\n- iPhone 6s\n- Apple TV (4th gen)\n- Multiple existing HomeKit products (Philips, Elgato)\n\nMultiple failed attempts, went so far as to separate 2.4GHz and 5GHz network SSIDs (OneLink only supports 2.4GHz). Customer support is shipping me a replacement device stating the device must be defective (I'm skeptical). \n\nLike a previous poster, I'm a software engineer, I've provided support my configuration, I've reset my iPhone Network settings as well as my network multiple times, trying varying configurations, all my other HomeKit devices remain unaffected and functional, but I can't seem to even pair the device. \n\nI've followed the \"in-app\" setup, I've even gone so far as to set the device in pairing mode and manually configure it through the Settings -> Wifi app (the device appears here while in pairing mode). \n\nVery disappointed. We'll see how the new shipment works.","updated":"2015-12-12T17:02:15-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1344967262","userName":"Sjb111111111","userUrl":"https://itunes.apple.com/us/reviews/id5144866","version":"1.31","score":5,"title":"I love it","text":"I opened the box and called the support number from anther phone and set it up in 10 easy minutes. I would not try try it alone unless you are an ace with the settings in your phone.  Customer support made it simple so just call. I went with hard wired and it was easy as well. I can't wait to add another one outside of the bedrooms.","updated":"2016-03-08T17:22:56-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1336133562","userName":"Dowcey","userUrl":"https://itunes.apple.com/us/reviews/id201425387","version":"1.31","score":3,"title":"Setup and HomeKit Issues need resolved","text":"Nice hardware and app appears and navs nice. However it has bugs.  Could not attach to my wifi, tried and failed three times. Had to start over, reset device and try again.  Eventually attached to wifi. App should have Siri commands noted for users.   App has limited features.  I'm an expert tech & engineer highly proficient in connected home - wifi issues are not the user.","updated":"2016-02-20T15:02:53-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1515529193","userName":"donsullivan","userUrl":"https://itunes.apple.com/us/reviews/id39649761","version":"1.65","score":2,"title":"Where is HomeKit support?","text":"You say it on the box, the website that it's HomeKit compatible but it's not. Today your representative said publicly (I've seen the video) that HomeKit is available now but it's not. I made the purchase decision for 3 of these based on the commitment but I feel you've not been completely honest with customers.","updated":"2017-01-04T18:44:19-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1570228484","userName":"SketchZN","userUrl":"https://itunes.apple.com/us/reviews/id38831277","version":"1.66","score":1,"title":"DON'T BUY - RETURN","text":"After two weeks of setting this up including multiple error messages and a replacement sent out by FirstAlert, I have determined that this is the most worthless piece of plastic ever, no matter what I do I just get error messages, I have tried everything from trying multiple phones, multiple different routers, and multiple channels for the WiFi, nothing works. I am returning and buying a Nest. I'm shocked Apple lets them put their HomeKit logo on their products.","updated":"2017-03-22T10:07:21-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1371917246","userName":"Picky Piggy","userUrl":"https://itunes.apple.com/us/reviews/id49744314","version":"1.33","score":3,"title":"Works well","text":"I saw a lot of reviews for previous versions of the app that did not go well. Still, I forged ahead and got a unit and downloaded the app. Installation and use has gone literally without one hiccup.\n\nThe unit is working great. Siri works as well, without issue. Granted the Siri commands are limited and the idea of HomeKit is kind of limited by nature with a smoke alarm (I guess), still the HomeKit integration works well.\n\nI am now putting these units throughout the house (replacing older units) since the first install and latest version of the app worked so well for me.\n\nInstalled 11 units without issue and after over a month no false alarms or anything odd at all.","updated":"2016-05-01T10:50:18-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1289938305","userName":"EveryoneIsAnotherYou","userUrl":"https://itunes.apple.com/us/reviews/id32958576","version":"1.2","score":3,"title":"Smoke alarm needs a firmware update","text":"For people who have more than one of these alarms interlinked, we need a few more room and location names in the device's announcement firmware, such as \"Upstairs,\" \"Upstairs Guest Bedroom,\" and \"Downstairs Guest Bedroom\" to better differentiate when alarms sound or error in these locations. Otherwise the app is good and we are happy with our new OneLink wired smoke alarms so far.","updated":"2015-11-21T20:40:52-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1370794647","userName":"podlistener1","userUrl":"https://itunes.apple.com/us/reviews/id32800296","version":"1.33","score":5,"title":"Worked for me","text":"Not sure what the issues are with others, bought one of these and worked fine.","updated":"2016-04-29T11:01:34-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1396673705","userName":"Alien-One","userUrl":"https://itunes.apple.com/us/reviews/id10493405","version":"1.40","score":1,"title":"Pairing Process - Fails on Phone Screen","text":"They are receiving a one-star because the pairing process does not work.  -  The pairing process between my OneLink wifi smoke & carbon monxide alarm is now consistently failing.  The process was problematic before, but now they have made it fail consistently.  The device will pair with my wifi network and then goes belly up when attemtping to pair with the phone.  I tried this 5-6 times and the same result.","updated":"2016-06-18T15:49:26-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1427520745","userName":"Fireball0904","userUrl":"https://itunes.apple.com/us/reviews/id127785991","version":"1.40","score":5,"title":"Keeping our house safe and secure!","text":"Onelink smoke and CO detector was easy to install and sync through the app and has been testing great over the last Six months. It's keeping our house safe and secure!","updated":"2016-08-05T14:49:06-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1514791755","userName":"joshdnp","userUrl":"https://itunes.apple.com/us/reviews/id24512416","version":"1.65","score":2,"title":"Not compatible with iOS Home app","text":"First Alert says they will update to make it compatible with the iOS home app. However this has not happened yet. :(","updated":"2017-01-03T15:44:22-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1614968120","userName":"TheManPAP","userUrl":"https://itunes.apple.com/us/reviews/id11171978","version":"1.68","score":1,"title":"When will this app work with HomeKit?","text":"iOS 10 has been out for 8 months and these devices still say \"Not supported\" in the Home app.  I'm told they need a firmware update in order to work with the Home app.  After 8 months (plus a few months of beta testing) you would think these babies would work with HomeKit.","updated":"2017-05-15T20:26:24-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1340211720","userName":"B B grandma","userUrl":"https://itunes.apple.com/us/reviews/id135286030","version":"1.31","score":1,"title":"Horrible","text":"Great concept followed by horrible product.     Purchased four of 10 year battery alarms.   2 died in a week.    Returned those and got two more.  Within a month all 4 of the battery alarms were dead again.    Wired seem better but what a pain.   I would avoid these till they fix the problems.","updated":"2016-02-28T11:53:29-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1515441079","userName":"f14bugsy","userUrl":"https://itunes.apple.com/us/reviews/id40441379","version":"1.65","score":4,"title":"Home app says 'Not Supported'","text":"Months after the iOS10 release, Onelink still isn't supported by the Home app.  These devices do not work with any other HomeKit devices.","updated":"2017-01-04T14:56:48-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1333639163","userName":"Mikey666999","userUrl":"https://itunes.apple.com/us/reviews/id19163826","version":"1.31","score":1,"title":"Needs Improvements","text":"Installation of the hardware went fine, however the app does not work...most options produce an error.   You cannot set any of the options like 'announce which room' the device is in.   Sure hope First Alert fixes these problems.","updated":"2016-02-15T18:16:58-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1467404313","userName":"Aradel55","userUrl":"https://itunes.apple.com/us/reviews/id288718041","version":"1.40","score":1,"title":"Ugh.","text":"Alarm starting chirping in my blind 95 year old grandmother's room at 4 AM. When I opened the app. it said the battery was dead. The alarm confirmed that it was dead/dying. I just bought it in August (it is now October). I deactivated it hoping it would stop making noise, nope, kept talking. Save yourself the time and aggravation.","updated":"2016-10-15T15:08:21-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1428397655","userName":"CaitMiller87","userUrl":"https://itunes.apple.com/us/reviews/id168553931","version":"1.40","score":1,"title":"When this alarm dies in 6 months remember I told you so.","text":"This thing is the biggest waste of of money died after 6 months. App wouldn't even locate it had to \"permanently deactivate it\" at one in the morning Because it just kept telling us it was time to replace it.","updated":"2016-08-06T22:49:06-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1427474433","userName":"Chutipim","userUrl":"https://itunes.apple.com/us/reviews/id134790474","version":"1.40","score":5,"title":"Fantastic integration with my home","text":"I love I can pair my products and use all the neat features.","updated":"2016-08-05T12:15:23-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1350494966","userName":"Santon Craig","userUrl":"https://itunes.apple.com/us/reviews/id22340079","version":"1.31","score":1,"title":"Everybody is right...Call Support","text":"I started out trying to follow written directions using the software to activate 4 devices but wasted 30+ minutes. Then I called their support number and had success. Bottom line: the software setup is not ready for real time.","updated":"2016-03-19T20:22:37-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1499679095","userName":"Winglet Driver","userUrl":"https://itunes.apple.com/us/reviews/id35126083","version":"1.63","score":1,"title":"Needs lots of work","text":"When the alarm goes off it takes several minutes to notify the iPhone/Apple Watch...way too long. Then you can't silence the alarm for a set period (say 10-15 minutes) to stop nuisance alarms while cooking.","updated":"2016-12-10T18:59:48-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1592655498","userName":"tr83ca","userUrl":"https://itunes.apple.com/us/reviews/id39278697","version":"1.66","score":2,"title":"Never Notifies Me of Smoke Detected","text":"This app never notifies me of Smoke Detected by our alarms.  \n\nOur OneLink alarms will be blaring, but the app NEVER says a thing about it.\n\nAnd the app also won't give me an option to silence the alarm.\n\nDefinitely not ready for customer use, and the whole setup needs more work in a lab testing environment.  Can't believe I paid so much money for something that doesn't work as advertised.","updated":"2017-04-19T07:31:23-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1472484007","userName":"Concerned IOS Citizen","userUrl":"https://itunes.apple.com/us/reviews/id34785681","version":"1.40","score":1,"title":"UPDATE OR ITS GOING BACK!!","text":"If no update for iOS 10 by next week I'm putting this thing back in its box and returning it to the store.  Apple should not allow first alert to use the apple HomeKit symbol until it actually works with HomeKit.","updated":"2016-10-24T18:16:05-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1468589818","userName":"FFranksJr","userUrl":"https://itunes.apple.com/us/reviews/id7386686","version":"1.40","score":1,"title":"Buggy and poor support","text":"I have three units and each took hours of failed attempts to luckily pair and configure. I am a Network engineer and not a novice at these types of things. Gen 1 product for sure.","updated":"2016-10-17T17:47:13-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1470226753","userName":"pdxMattP","userUrl":"https://itunes.apple.com/us/reviews/id16793078","version":"1.40","score":1,"title":"Junk","text":"Save your money and get a non-wifi alarm. Passes all the tests just fine but when the alarm goes off it fails to send an alert to the phone.","updated":"2016-10-20T19:16:11-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1518911395","userName":"cscastello","userUrl":"https://itunes.apple.com/us/reviews/id7254755","version":"1.65","score":1,"title":"Disappointed","text":"This app crashes more often than is works correctly.","updated":"2017-01-09T20:01:37-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1611124005","userName":"g-man423","userUrl":"https://itunes.apple.com/us/reviews/id13913534","version":"1.68","score":1,"title":"Setup again after update","text":"After this update, the app requires that I setup the smoke detector again.  This is frustrating and ridiculous.","updated":"2017-05-11T07:37:39-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1396667051","userName":"c2o2utsw","userUrl":"https://itunes.apple.com/us/reviews/id132596875","version":"1.40","score":1,"title":"Non-functional","text":"I echo everyone's reviews about the inability to pair, despite multiple attempts. Wholly unacceptable.","updated":"2016-06-18T15:25:13-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"6523747388","userName":"jmk12bos","userUrl":"https://itunes.apple.com/us/reviews/id27118781","version":"1.79.36","score":1,"title":"App can edit HomeKit. How did Apple miss this?","text":"This app update from 10/2020 is BAD. It completely “broke” my devices in the sense that they no longer responded even in the OneLink App, never mind the Home app. I had to call FirstAlert because they needed additional setup in the OneLink App and the support rep had me delete the Home in the OneLink App. Low and behold it deleted my Home from the Apple Home app. I ran through some of my own troubleshooting and I confirmed that the OneLink App is capable of CREATING AND DELETING HOMES ON THE HOME APP. I not only lost all of my Home automations, but also had to reset all of my devices and link them back with the Home App - and what a security flaw. Such a huge hole you have to wonder if Apple is even looking at these apps before approval. If Apple is so concerned with privacy this should not have been missed. What are the other security flaws that exist that we do not know about? Are my locks secure? This calls that into question.","updated":"2020-10-11T04:53:20-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"6233032978","userName":"lisamichellefree","userUrl":"https://itunes.apple.com/us/reviews/id602581013","version":"1.79.30","score":1,"title":"Do not buy","text":"I just ordered 3 of the Onelink smoke and fire alarm devices and I cannot get them to hook up to the app. Total wast of my time and will be sending back to amazon for a refund.","updated":"2020-07-23T10:15:58-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"5664725302","userName":"Chiefmanykey","userUrl":"https://itunes.apple.com/us/reviews/id529666505","version":"1.79.25","score":1,"title":"DO NOT Download","text":"If you download this app you will constantly get Spam from Amazon! It is full of malewar! No way to make it stop! After the investment of over 300 they treat you like this!!!!","updated":"2020-03-15T09:22:08-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"5688664211","userName":"CTLAdvance","userUrl":"https://itunes.apple.com/us/reviews/id174796824","version":"1.79.25","score":5,"title":"Safe and Sound with HomeKit","text":"Setup was easy, HomeKit works great and none of this amazon Alexa spam. Latest update fixes issues for HomeKit and adds airplay 2 for safe and sound.\n\nOnly wish the iPad app supported landscape and ability to update firmware from within the app instead of an over the air push (or support both).","updated":"2020-03-20T14:09:10-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"5305446687","userName":"Chinito305","userUrl":"https://itunes.apple.com/us/reviews/id189184850","version":"1.79.19","score":1,"title":"Awful","text":"Waste of time and money. I knew I should have gone with ADT but got “Alexa Capable” component on Black Friday for half off. You can’t connect to Amazon through the app. Have tried numerous times and nothing works.","updated":"2019-12-22T09:42:36-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"5155456962","userName":"ikejv","userUrl":"https://itunes.apple.com/us/reviews/id202743913","version":"1.79.19","score":1,"title":"The negative reviews are accurate","text":"I never rate apps, but took the time after the 7th failed setup attempt. I have over 40 smart home devices in my house and the setup for these is ridiculous. Whomever wrote the code for this app has no idea what they are doing. Nice try, but don’t buy the “smart” smoke/CO2 alarms and try to use this terrible app.","updated":"2019-11-16T20:09:01-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"4129796193","userName":"TrueOpinionated","userUrl":"https://itunes.apple.com/us/reviews/id49026975","version":"1.79.12.27","score":1,"title":"Do not buy!!!!","text":"I bought two of these fire alarms - impulse buy at Lowes.  Got them home, Installed them... and then downloaded this piece of junk app.  I spent hours trying to get them up and running.  This app is a piece of trash.  We have lots of smart home devices... never had an issue like this.\n\nSo, uninstalled and returned the alarms... went to Best Buy and bought the Nest Fire Alarms.  Had them up and running (fully integrated with the Nest App) in about 10 minutes.\n\nTake Home: save yourself a headache and buy Nest","updated":"2019-05-10T10:43:38-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"4456068068","userName":"chitownflyboy","userUrl":"https://itunes.apple.com/us/reviews/id4276871","version":"1.79.12.27","score":5,"title":"Not so bad","text":"Disclaimer...Apple home here so I really wanted HomeKit compatible every thing.  \n\nWhen I learned about this product (onelink sight and sound) I was immediately interested. The price point was a little steep but luckily I found it for 199 on Amazon. They sent me a used one and I sent it back fine no issues. Once I had time to actually install it, And set up the app it wasn’t really that bad. The only issue I knew going into set up was the airplay 2 development issues.  So far so good no issues and I really don’t need to know too much unless my house is on fire so interacting with it via Wi-Fi or Bluetooth is not really the most important thing to me just knowing that it works.  The speaker is rich and good for a normal rooms sound.  Customer service was very helpful in my experience and I am not getting paid to leave this review!  Taking into account all of the bad reviews I would still suggest giving it a try but via Amazon because of their gracious return policy. I definitely agree there should be a more level playing field as far as options but smart homes are expensive and I’m sipping the Apple koolaid so.  I’m giving a 5 in spite of no native airplay 2, because the CS team was so helpful, shout out Abdoulaye.","updated":"2019-07-13T15:11:27-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3643025256","userName":"craig11177","userUrl":"https://itunes.apple.com/us/reviews/id35876219","version":"1.79.4","score":1,"title":"Needs a lot of work","text":"This app is like using an app 10 years ago.  Very poorly written.  It doesn’t use touch id or face id, logs you out constantly and then always fails the first time you log back in.  When it finally does log you in, it crashes on log in so you have to reopen the app.  I dont know who wrote the code for this app, i think a 5 year old could do better.  They obviously dont know how to write code or test it before release","updated":"2019-01-12T14:45:09-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3687734231","userName":"AZ_Doc","userUrl":"https://itunes.apple.com/us/reviews/id29857500","version":"1.79.7","score":3,"title":"Needs TouchID and FaceID signin","text":"The app has become much better and works to show battery life, but one thing that makes it problematic is that for those of us that use very complex passwords and cant remember them regularly the app signs out frequently for unclear reasons and in urgent cases where our children are home alone cooking and contact us the alarm has gone off when we urgently need to check the app we cant login creating a dangerous situation. \n\nIf First Alert doesn’t   know how to code in options for FaceID and TouchID options maybe they can ask Apple for assistance.","updated":"2019-01-23T21:35:05-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3517645274","userName":"NY Customer","userUrl":"https://itunes.apple.com/us/reviews/id38532378","version":"1.79.1","score":1,"title":"Unable to Setup OneLink Model 1042136","text":"I am stuck in a cycle of pairing.\n\nIt complains that setup is needed after finishing the setup.\n\nApp is really worth 0 stars since it does not fulfill its primary purpose of setting up the smoke alarm for WiFi and Apple HomeKit.","updated":"2018-12-10T19:28:25-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"3460879898","userName":"gai-jin","userUrl":"https://itunes.apple.com/us/reviews/id32999911","version":"1.77.1","score":1,"title":"A worthless piece of crap","text":"This is a product you depend your life upon. Yet one link can’t seem to write simple code to keep dish in the sink with Apple HomeKit. You will spend the rest of your time with this product trying to keep it in sync.\nAll it seems to do is say you need to update you need to update you need to update you need to update you need to update. It is simply the most worthless piece of crap I have ever bought in my life.","updated":"2018-11-25T17:51:57-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"2618693109","userName":"AS16567","userUrl":"https://itunes.apple.com/us/reviews/id38935901","version":"1.74","score":1,"title":"Worst product, even worse support if it’s not in FAQ throw it in the garbage","text":"Admittedly I read all the negative reviews and I should have passed but I liked the features and figured I’m more technical than the average user and Amazon would refund if I couldn’t get it right.\n\nWhile I did figure out it’s 2.4 only and that was 90% of the user woes, I use Cisco WLC at home and setup a separate 2.4 only SSID with no fast roam options and this made it work reliably for two months, today their crappy customer service and software caught up with me.\n\nUpdated app, new terms of service hit accept password doesn’t work. Tried reset net with amazon error 32 no such account. I have a cool personal email so it never changes so no other possibilities. I search my account for the original Onelink accept email confirming the correct message. So this is a back end Onelink server issue.\n\nNo email, no text, no blog support group even a reply to the original acceptance email is met with deny message. They obviously don’t want to communicate with customers check their site for contract us, it doesn’t exist.\n\nI’m sure I can create a new account and re program the unit but how long until the backend gets updated again and repeat.\n\nDon’t buy this product if you bought it and are in the return period return it, it will bite you.","updated":"2018-05-30T15:25:44-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"2603734515","userName":"c9night","userUrl":"https://itunes.apple.com/us/reviews/id32110725","version":"1.73","score":3,"title":"It is ok smoke detector","text":"It does connect to Apple HomeKit and alerts when it is going off. But every time the app updates from first alert I have to sync it back to the device. It’s a pain in my butt to get a ladder and go through set up on every app update.","updated":"2018-05-27T08:35:41-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"2509281236","userName":"HeloHead","userUrl":"https://itunes.apple.com/us/reviews/id106896120","version":"1.70","score":5,"title":"So far so good","text":"I was initially concerned about the installation based on previous reviews. I have a complex HomeKit network with a lot of different vendors hardware and have high expectations on how a HomeKit product should work.\n\nI installed two Onelink Environmental Monitors on two different Apple wireless networks with no issues. Fully integrated into homekit with no issues on first attempt and everything worked as expected including remote access via AppleTV 4.\n\nSome things previously complained about are now addressed such as HomeKit code now on power adapter as well as manual. \n\nI cannot speak for others experience but thus far  my experience is positive and inline with my expectations. \n\nThis is not to say the app is perfect. The app on occasion shows a “setup” icon next to each unit instead of temp/humidity/co for some reason. Tapping the setup causes the unit icon to refresh and apox 2 seconds later the units values showup. \n\nIn reality once the unit is setup i have found no real reason to use first alerts application. I either use apple’s home app or elgatos application to manage the unit.\n\nFeatures id like to see in the future application\n\n1. Ability to change wifi network within app\n2. Ability to see full mac address within application","updated":"2018-05-05T13:50:05-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"1526808133","userName":"Lester XR","userUrl":"https://itunes.apple.com/us/reviews/id286116170","version":"1.66","score":1,"title":"Poor decision to purchase","text":"I bought this alarm because of the First Alert name and that it was HomeKit enabled. It is not supported, as others have said.even worse is within their own app there is problems. Twice I have had to install device. Now with new update it shows no devices connected. \nShould have bought a Nest! Need to check return privilege with Amazon. What I have now is nothing more than normal smoke/CO2 alarm....at 5 times the price.","updated":"2017-01-20T17:14:06-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"},{"id":"2195766399","userName":"Zapped 32825","userUrl":"https://itunes.apple.com/us/reviews/id141962633","version":"1.70","score":5,"title":"Design your own Smart smoke detector System","text":"My home is 14 years old and still has the original builder installed smoke detectors. Consumer Reports recommends replacing smoke detectors every 10 years as the smoke sensor becomes less effective or may not function at all, even though the alarm still works and the unit tests fine. So i did my homework via the Internet, then called first alert and spoke with a product specialist. The specialist and I together designed a Home smart system that met my specifications.  1) units that Easily interchanged with my existing hardwired connectors. 2) Voice information from the detectors along with the alarm, so the system will tell me which unit has detected the danger. 3) 10 year sealed lithium battery backup, so I never need to change batteries during the life of the unit. 4) units that detect both smoke and carbon monoxide dangers. 5) when one unit sounds an alarm...they all go off, so if the fire is detected in an area where I don’t hear the alarm, I won’t have to wait for smoke to make it to the detectors closest to me before they go off as well. (I have a 3rd wire that connects my units but I was told they can interface with one another over your home’s wi-fi) 6) the units are smart so they interact with my phone via the Onelink App, so if I’m not at home, I am notified of a detection remotely.  I have pets and this type of notification was a must have for me. I did have a hard time locating AC10-500 hardwired units to purchase. It seemed to me the DC10-500 battery only units were readily available at most retail locations. The battery only units do not need to be hardwired, but it is my understanding that life expectancy depends on number of alerts over the life of the unit, because they’re relying on power from the sealed 10 year battery only. Once I did find the hardwired units to purchase. I easily installed them by myself. The package contained various connector adapters, one of which are used to connect a new unit. Step 1) download the First Alert Onelink app to the device you want to use to set up your system. If your device is connected to iCloud make sure your Keychain is turned ON before proceeding. Step 2) make sure both your Wi-Fi and your Bluetooth turned on. The units use Bluetooth to set up & configure your device and wi-fi for notifications to your device later. Step 3) there is a number and a QR code on the side of the smoke detector make note of that number you will need it to Bluetooth pair the detector with your device. Step 4) twist your old unit to the left and pull it down. Remove the connector by pulling it straight out of the back of the smoke detector. Loosen the screws on the mounting bracket (do not remove them). now you can twist the mounting bracket to the screw slot, pull down and remove the mounting bracket. Step 5) Now turn on your app and login. Step 6) slide on your new mounting bracket over the loose and screws and tighten them down once you have the bracket in a position you like. You may need to use one of the adapters provided to connect between your existing hardwire and the new unit. Plug into the unit on the back making sure the connectors have snapped into place securely. As soon as you connected the unit will come to life and start speaking to you. At this point you will need to enter the unit number to Bluetooth pair OR if you’re close enough to the detector you can scan the QR code with the app on your phone. You will now notice that the unit automatically pairs with your app. Follow the directions on your app at this point remembering to remain as close to the unit as possible. Mostly you just need to hit the next button on the app. There is one screen will you will need to give a name to the unit. This is the name Siri will use when speaking to you during alarms. Once the units are set up you can go back in through the Onelink app later and reconfigure the alarms to customize as needed as long as you are within Bluetooth range of that unit.  I hope my experience is helpful to you. I love my new detectors. By the way they work with HomeKit, Alexa, and Google assistant, but I don’t have any of those just used my iPhone and kept it simple.  Works perfectly!! There is a new very smart Onelink detector, model 1039102, that is an Alexa, a smoke detector, a music speaker and a carbon monoxide detector all rolled into one that is also available for purchase at $250 that will work with these units I just installed. Maybe down the line I will add one or two.","updated":"2018-02-11T08:08:54-07:00","url":"https://itunes.apple.com/us/review?id=1034376317&type=Purple%20Software"}]