[{"id":"6631029716","userName":"Elias1275","userUrl":"https://itunes.apple.com/us/reviews/id20743601","version":"5.1.0","score":4,"title":"Update: Was good but now cannot connect","text":"Update: After a lot of effort I managed to get things to work. I basically had to restart everything including the router and clear the settings on the hardware several times. In any case I finally got it back up and running. \n\nI’m not sure what happened. Everything was working just fine and one day it said that my lights were unreachable. I did a soft reset and a hard reset. I unplugged it, I’ve turned my phone on and off, I have unpaired and now I cannot even pair it back up again. I have no idea what else to do. The hardware works fine but it seems I am unable to connect it back up to my device. I’ve reached out to customer service and still have not heard back. Nice lights if you can keep them connected but for me something broke and I have no idea what I could do to get this back up and running. They are a lot of money for something that just quits.","updated":"2020-11-10T14:48:44-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5991364149","userName":"Jonlovesalex98","userUrl":"https://itunes.apple.com/us/reviews/id302722229","version":"4.0.5","score":3,"title":"It’s time Nanoleaf took its customers serious","text":"Let me start off by saying, I love my Nanoleaf kit. It’s always the life of the party and everyone always wants some for themselves. However, I am not alone in my concerns for how the app is just poorly designed and cared for overall. Some days the panels work and some days they don’t. Sometimes I’m required to connect my phone to WiFi for them to turn on, other times I’m not even connected and they’ll still turn on. As well, the desktop app also has its bugs. When screen mirroring, sometimes the panels will just freeze and stay stuck unless I turn off completely and turn back on again. Sometimes I just can’t get it to connect. There’s just too many “what if’s” involved. Paying $500+ for led panels that you aren’t sure are going to work 100% of the time is quite ridiculous if you ask me. That’s a lot of money, and I think with that, should come excellent app quality. There needs to be more time and effort placed on the app and panel connectivity because it’s too spotty at the moment. If you guys would take time to go to Reddit as well as Facebook, you will see all the complaints and troubles that people are having with your product. Please take us seriously. I love your product, but it’s discouraging to have such a poor quality designed app.","updated":"2020-05-25T03:23:58-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6550153593","userName":"PANdaRUZ","userUrl":"https://itunes.apple.com/us/reviews/id172560802","version":"5.0.0","score":3,"title":"I want to start with: I love the lights...but...","text":"...why must the app be so dang confusing!? I’ve got other smart lights and devices and none come across as befuddling as this app does. I’ve updated to the latest app. I’ve checked and triple checked all of the menus. I’ve swiped, tapped, double tapped, multiple finger tapped, heck I’ve even deleted and re-downloaded the app and it’s still problematic. For starters I can’t for the life of me figure out how to delete rooms I’d previously created. I can’t drag lights to the trash. I can move them from room to room but that’s kinda pointless when I’ve moved twice since owning these lights and no longer have most of those rooms. It’s generally a very plain app that attempts to be simplistic but overly complicated the process of renaming, moving, or creating and deleting rooms and lights. It’s also very inconsistent when it comes to hitting some of the menus as they will sometimes refuse to do anything. That leaves you second guessing as if to if there really is or isn’t an option to access there. \n\nPlease. Simplify this app but keep the necessities obvious. I’m on team nanoleaf. I want you guys to succeed.","updated":"2020-10-18T20:09:29-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6352801040","userName":"khayes1","userUrl":"https://itunes.apple.com/us/reviews/id101429040","version":"4.1.3","score":4,"title":"Good","text":"I like the app and it loads quickly and works reliably for me. There are a few things that would make it better. I’d like if when I came back to the app, it didn’t have to load again. It’s quick so it’s not too bad, but I’d like if it stayed in the memory and ready to go to make a quick adjustment. I don’t like that when I change the animation or color, it automatically changes back to 100% brightness every time. It should stay at the same brightness it’s already at. And I wish there were an option to change the animation speed. It would be nice to be able to slow some of them down for a more relaxed feel and to make it less eye-catching/distracting. Or maybe even speed it up for more of a party environment. Also being able to save more animations would be cool, there is a limit which I understand might be a hardware issue. Loving the Hexagons. Thanks","updated":"2020-08-23T09:55:02-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5373992299","userName":"Keeper of the Keys","userUrl":"https://itunes.apple.com/us/reviews/id33976278","version":"4.0.1","score":3,"title":"Product is cool, but doesn’t always work","text":"The product itself is super cool. I have a playlist that wakes me up every morning, and I love having lights that play to the beat. I don’t have a window in my bedroom, so it’s my source of light. However, they do not always work. There have been numerous times over the few years I’ve had the product where the panels do not connect to the app or cannot be turned off. If the power ever goes out in my apartment, sometimes it takes up to a month and multiple tries to get it working again. And if I can’t turn it off, then there are on all the time, which is annoying if any noise is made when I’m trying to sleep (cause they are noise sensitive). \n\nThe support team is always very friendly, but it can be exhausting getting it working again. The ways I got it re-connect before do not seem to work for the next time it happens.\n\nOverall, I am happy I have the product, really wish it worked better.","updated":"2020-01-07T16:25:46-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6566023065","userName":"//Tozer//","userUrl":"https://itunes.apple.com/us/reviews/id479863447","version":"5.0.0","score":4,"title":"New UI is confusing","text":"Before this new interface update, everything was easy to access and easy to understand and test. Although I like the new feature of the app being able to connect with other smart devices I have around my home I dislike how the discover page and dashboard tile was updated for several reasons although I’ll only mention about the main issue, when I go to preview a scene on my device(s) after selecting the scene I’d like to preview, 7/10 times I will get an error message saying it’s unable to preview the scene on the select device and sometimes the app ends up crashing afterwards. This is very frustrating and my devices are all updated to the newest firmware along with the apps itself. Hopefully you can re attempt at a new UI that’s a lot easier to navigate and not run into issues. Thanks","updated":"2020-10-23T09:38:02-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7697113371","userName":"Carbonbreath","userUrl":"https://itunes.apple.com/us/reviews/id22566134","version":"6.0.0","score":3,"title":"Doesn’t update devices.","text":"I purchase eight Nanoleaf Bulbs and one Light-strip starter kit with extensions on order so my review isn’t about their physical devices but Nanoleaf’s network. I wonder if Nanoleaf is using AWS as many firms today are doing. Reason why I mentioned this is because I spent six hours trying to update 8 new bulbs using their app and only four so far has been able to update. I lost count from all the fails and it’s aggravating having to tap each device to start an update again. Like most other brands it takes only one tap to update all devices but with Nanoleaf you'll spend hours updating each device, however app allows for three devices at a time for updating but their network is so slow I can only update one device at a time which fails a lot! Nanoleaf please allow more bandwidth and update you app for one tap updating all devices so we can continue living our life instead babysitting your application.","updated":"2021-08-15T15:32:44-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6541735191","userName":"polyport","userUrl":"https://itunes.apple.com/us/reviews/id85747410","version":"5.0.0","score":1,"title":"Really Bad Redesign.","text":"The new redesign now tries to be a bad replacement for the Home app. When I run the Nanoleaf app I want to control my Nanoleaf devices. The app now presents a list of your rooms by default, and you have to hunt and scroll for your Nanoleaf panels. I have full home automation with 10+ rooms and multiple lights and devices in each room and the only reason I open the app is to manage what my panels do, which now is a major task to find the panels first. Figured I’d remove the rooms I don’t care from the app but that deleted them *from my HomeKit setup*. I now have to re-add my rooms and devices. \nI get it, Nanoleaf, your new essentials stuff needs a home too, but the extra steps you added to your app to pick some options for my panels basically mean that I now have fancy hue lights I can dim and set the color because I won’t hunt in your app for my lights. There are better apps for basic lighting control than the Nanolead app. How about you have an app for just programming the panels in addition to your new ambitions of controlling all HomeKit lights...","updated":"2020-10-16T09:43:52-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5862659629","userName":"PiggyBlubber","userUrl":"https://itunes.apple.com/us/reviews/id941965803","version":"4.0.5","score":4,"title":"Love it but a few issues","text":"My Nanoleaf light panels are so worth my money! I do have a small problem with the light panels themselves. They make a light buzzing sound. I don’t have anymore sets connected to them. Nanoleaf, if you’re reading this, can you please tell me why they’re buzzing? Back to the app itself, I have nearly no problems. It’s just that when I’m creating a dynamic scene for my lights, the colors always go back to the preset colors. So when I try to set a color pallet, it automatically goes back to the rainbow. I don’t know if this is just mine or if other people have the same problem. Other than that, I love these lights and like I said, SO WORTH THE MONEY!","updated":"2020-04-25T09:15:02-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7969804335","userName":"CYE Noob","userUrl":"https://itunes.apple.com/us/reviews/id342598849","version":"6.2.0","score":2,"title":"Unreliable Connectivity, Very Slow Response From Customer Support","text":"The Colors and Scenes are plentiful and imaginative. The problem is the frequent (read daily) connectivity issue.  There’s a frequent problem with adjusting the brightness of grouped devices, Colors or Scenes, After tapping the (teardrop-shaped) icon to access this adjustment screen, there is no visual response to this selection, requiring REPEATED restarts of the app to finally access this screen. Unless you’ll be using automations ONLY, be prepared for a frustrating experience of using the app to adjust Colors, Scenes, Brightness or change any of these options for a group (I have 4 lights max in any given room) of lights.  \n\nI’ve submitted two requests for assistance with connectivity problems with the Shapes (Triangles) product. Both responses came two days or more after I submitted a request for help.  \n\nI got these specifically (and pretty much only) because of the embedded Thread support, but the daily problem with adjusting the lights combined with lengthy response times to requests for help, make this purchase not work the trouble.  This otherwise enjoyable product is simply overshadowed by the constant issue of maintaining reliable connectivity with all your lights. \n\nI do NOT Recommend the purchase of any Nanoleaf products (I have the Shapes, Lightstrips and several Essentials bulbs) unless or until these issues are resolved.","updated":"2021-10-30T05:13:08-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6976272942","userName":"DJ UPBEAT","userUrl":"https://itunes.apple.com/us/reviews/id43775764","version":"5.2.0","score":2,"title":"Too many problems. Not reliable.","text":"I have the essential light bulb A19. When I purchased I was excited. \n\nHowever, set up was a hassle. You should notify us that lights will flicker before connecting so we don’t freak out or think it’s not working. \n\nI've had for several days already. I’ve had it randomly start flickering while it’s on and steady. I’ve come home and tried turning it on through the Nanoleaf app or Apple Home and had situation it didn’t turn on or flickered.  \n\nI have to constantly delete the light bulb from my device setting and reset it (doesn’t always reset) and reconnect. Usually that’s still a hassle and can still flicker or most likely not connect at all like right now. Writing this review because I can’t connect my device again. \n\nHome app integration slow when turning on or off. \n\nApple Watch home app control also slow or not recognizable. \n\nThe new feature that came out a day or two ago for the light to turn on and off by recognizing my device proximity when I get home or leave does not work. \n\nThis is a home product. Stuff like this are supposed to work without interruptions and problems. Instead of relaxing I have to deal with this and can’t even fix it the way it’s supposed to be fixed. Whether it’s a software or hardware problem I don’t even know. Software side definitely has lots of problems though.","updated":"2021-02-09T22:35:00-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7639540721","userName":"ayyyyyyy non","userUrl":"https://itunes.apple.com/us/reviews/id294068913","version":"6.0.0","score":2,"title":"Constant Connection Issues","text":"I’ve had my Nanoleaf light panels since the end of 2019 and they were great until they released their massive app update last year. The UI/UX was pretty bad, but more importantly, my light panels no longer were staying connected. I hadn’t moved the panels or my router at all, yet had to constantly factory reset them and try to reconnect them to the app. Every time the connection was lost within a week, and then it got to the point where the app just froze and wouldn’t load whenever I did try to connect them again. Thankfully the panels still remember the scenes I set up when I could still access the app, so I just cycle through those and for about 7 months now I have completely given up on trying to use the app. It’s disappointing to see the other reviews of the app all saying the same thing, and knowing that this has been an issue for almost a year now with no changes.","updated":"2021-07-31T08:28:59-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8042815542","userName":"RobertoC-73","userUrl":"https://itunes.apple.com/us/reviews/id29128419","version":"7.0.1","score":3,"title":"Tunable White should not be this hard","text":"Unfortunately nobody is making HomeKit-compatible smart bulbs with tunable white lighting without the extra RGB. Therefore I was stuck buying Nanoleaf Essential light bulbs. It’s okay, you can ignore the unnecessary RGB colors if you want and use them as tunable white bulbs, right? Not so fast.\n\nThe Nanoleaf app makes it hard to remove RGB presets and replace them with tunable white presets. I was able to make presets for 2400K, 2700K, 3000K, 3500K, 4100K, 5000K and 6493K - Nanoleaf doesn’t do 6500K. But achieving these presets took A LONG TIME and extremely precise swipes in a color wheel. There’s no reason it has to be this hard. There should be an option for the user to type the exact color temperature they are looking for. To add insult to injury, presets don’t synchronize across devices so after going through all that effort on my iPhone, I had to do it all over again on my iPad.","updated":"2021-11-19T22:18:45-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7185540762","userName":"Jobe Dingasi","userUrl":"https://itunes.apple.com/us/reviews/id1108361407","version":"5.2.2","score":1,"title":"App","text":"The app is horrible. Anytime I use it, it will work for 5 minutes or so and then it just starts to have random glitches. When you click preview on a preset in discover, nothing happens. Then you click it a couple times because maybe the app isn’t registering your click, and then a minute later it will send 15 messages, each one 10 seconds apart from the last that say “failed to select preview on all devices”, each of which you have to click “ok” on. It is so annoying after a while to deal with stuff like this. And the editing or making new scenes makes absolutely no sense, and I have yet so successfully do it with the new update. Also for some reason it will just not back up my previous scenes. I have had these panels for a year, and have probably spent 4+ hours total in troubleshooting and getting “unreachable” or dealing with some other problem that interferes with me being able to enjoy the panels normally.","updated":"2021-04-05T00:15:41-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6159189086","userName":"rigggggg","userUrl":"https://itunes.apple.com/us/reviews/id1146000173","version":"4.1.2","score":3,"title":"Beautiful product, decent app","text":"Set up when you get your lights isn’t the worst. The has a really nice dashboard you can design layouts with. The preview / download feature is pretty amazing, I find new lighting fixtures people make everyday for my panels. The Nanoleaf product is absolutely incredible and worth every penny. 3 stars is for the app’s functionality or rather lack of consistency. Sometimes it connects to my panels right when I open, sometimes it says not connected and will randomly connect after closing and restarting the app a few times. Same goes for previewing / downloading light fixtures off the discover / explore pages, sometimes it works seamlessly and sometimes it is so unresponsive it will make you worry. I just think the app need to be more consistent with the actual functions of turning the lights on / off and changing fixtures.","updated":"2020-07-04T23:22:25-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"2477834512","userName":"Chadnerma","userUrl":"https://itunes.apple.com/us/reviews/id101514439","version":"2.3.2","score":5,"title":"The app is bugged out","text":"It takes a long minute for the app to actually load and bring you to the home page! It’s so glitchy, upon opening the app, when the name loads up onto the screen the graphics freeze! Then when it’s done thinking about it and comes back to life you are unable to do anything yet because now the home screen is frozen. 30 seconds (a long time in this situation) must pass for it to pop back to life. Ok, now that we have life I must say that it’s a bit confusing on how to create your own patterns. I do love love love these lights, I just wanna have more fun with them. And in order for that to happen the glitches and confusion must go away! Lights make me so happy, and that is my goal.","updated":"2018-04-28T01:22:11-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6652428488","userName":"nduran87","userUrl":"https://itunes.apple.com/us/reviews/id155138687","version":"5.1.0","score":5,"title":"Great lights, software needs help","text":"I’ve had these lights for several years now. They are great lights and I use them for everything from mood setting to general light of the room. With the most recent update it has messed up everything. I’ve had to delete out all my lights and remote and re-add them only to find they don’t we add. If you use Apple home this works great because the software loves to pair with Apple home. Are use Google and while it works it won’t let me cloud sync without an apple home profile. Please fix these little bugs like using a google home profile or actually being able to delete things off my Nanoleaf profile","updated":"2020-11-16T09:04:14-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3926504184","userName":"Not a fitness geek","userUrl":"https://itunes.apple.com/us/reviews/id198584256","version":"3.3.1","score":1,"title":"Terrible experience","text":"\"Smarter by design.\" I have never laughed so hard at a company slogan before. I've had absolutely nothing but bad experience after bad experience in using both the app and the product, especially together. The app is horribly designed and layed out, designed to look nice but functionally it barely works. Connecting to the device is extremely slow and that's if the device can be connected to at all. Attempting to use the app with a Nanoleaf account does not make things better. I have been signed out of the app every time I close it and now attempting to log into my account it say it doesn't exist. Attempting to make a new account, regardless of what email is used, I am told the account already exists. This is an absolutely atrocious user experience that no one should have to deal with, especially for $200 plus. For that type of money it should work at least half of the time. Do NOT buy this product.","updated":"2019-03-25T13:40:59-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6863044419","userName":"lemme telya bouda ting","userUrl":"https://itunes.apple.com/us/reviews/id399916178","version":"5.1.4","score":1,"title":"Did not enjoy that set up process one bit","text":"Why do the directions tell me to connect the Light Panels to my Home app on my phone first when in reality having done so would actually then prevent me from connecting the Light Panels to this app? Since the Panels can only connect once (which conveniently isn’t even indicated anywhere, determined thru trial/error) and then need to be Reset before it can be connected to anything else...\n\nThen it took me forever to get the Panels Reset since neither the manual in the box, nor the website indicate which button in which on the Controller... found a video but it shows a different type of Controller, fiiinally found a different video showing the correct Controller where I eventually found out that the Toggle button apparently refers to the Brightness + Up symbol (not the Play > button or the Shuffle >< button as would seemingly make far more sense)","updated":"2021-01-12T17:43:35-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7877930255","userName":"kt adam","userUrl":"https://itunes.apple.com/us/reviews/id1032807993","version":"6.2.0","score":1,"title":"Nanoleaf seriously needs to fix its buggy software","text":"I have a degree in computer science so I know my frustration is not just a lack of expertise. The entire experience is frustrating and full of bugs. Every so often the device will become unreachable for no reason. Both the Nanoleaf and my phone are connected to my wifi, but they can’t communicate until I reset the Nanoleaf and set it up from scratch. Each time it takes like 30 minutes before it successfully pairs, and it erases all the new patterns I’ve downloaded. The panels are pretty but the experience is deeply frustrating. \n\nNot to mention the confusing UX in the app. I couldn’t figure out how to delete my device for the longest time, because the instructions online are inaccurate and the actual way to delete it is to swipe left on the device in the settings, which is very unintuitive.","updated":"2021-10-04T11:55:20-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4508105322","userName":"Grantasaurusrex","userUrl":"https://itunes.apple.com/us/reviews/id128304886","version":"3.4.0","score":5,"title":"When it works it great.","text":"This app is a lot of fun to play with. My wall looks pretty killer with my 50 piece set. My controller panel has been a little flaky though, and there have been instances where the app and my wall have connectivity issues which results in me taking the time to restart the device. It’s kind of a pain. I spent $1,000 bucks for some lights, I expect them to work well. With that said, the app is open to creativity, and is a great outlet to share and download ideas and designs. It’s really fun and I can’t wait to show my guests. All in all, despite the setbacks, the app is a hit. Also, the layout tool saved me. There’s no way I would have got my design up first try without it.","updated":"2019-07-23T16:42:53-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5460506537","userName":"Tonos10","userUrl":"https://itunes.apple.com/us/reviews/id361409041","version":"4.0.2","score":1,"title":"Don’t get!!! 2 years of issues","text":"I have had this since it came out and it has not worked for months. Customer support is VERY confusing. They have lost my account in their system. Emails, account everything. Here is an example of a page long troubleshooting process.....🤯 and I am not sure of all the steps. All of my 17 other smart devices work flawlessly.......except Nanoleaf it doesn’t even register the products I purchased from them 💩👎\nFor Alexa and Smarthings, you need to login using the same email you signed up in the Nanoleaf app for it recognize and discover your devices. \n\nIn Google please ensure your email that you setup your Nanoleaf account should show up as a registered email in the app. This is required also to send voice commands.\nie in Google (Settings>home members> your Nanoleaf email should be registered in there)\n\nFirst, ensure in the Nanoleaf app Cloud Sync has been enabled so your device is on cloud and can communicate with Google/Alexa. To do this, go to the Nanoleaf app> Settings in the menu> go to MY ACCOUNT, CHOOSE CLOUD SYNC TURN OFF/THEN ON. This will give you a new timestamp for today! If you don’t see the option to turn off/on cloud sync there, then hit the right > next to home while in this menu and then turn if off/on","updated":"2020-01-28T18:04:02-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4296402441","userName":"$&75'bt","userUrl":"https://itunes.apple.com/us/reviews/id266838264","version":"3.3.2","score":1,"title":"STOP NOW AND RETURN BEFORE ITS TOO LATE!","text":"I got those because they look fantastic, spent 4 1/2 hours trying to set it up and literally 3 minutes after it's all set up it disconnects and stops working and will not reconnect at all making it useless and unable to function or control the lights! And even worse it only works on 5ghz networks so that definitely doesn't help either! Also I forgot to mention...it uses over half your battery life! I have about 45% battery at the end of the day usually and it's at 28% after 45 minutes of messing with this app and it still not working! Really really doesn't help at all! Could have been an amazing product but it does t work very well with this app that's complete garbage and literally no customer support either and that makes it even worse. It could have been such an amazing product but they made it bad so frustrating they did that!","updated":"2019-06-10T10:48:39-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6620683214","userName":"Paddy Mac 123","userUrl":"https://itunes.apple.com/us/reviews/id18042400","version":"5.0.0","score":3,"title":"NanoLeaf App","text":"The lights look amazing dont get me wrong, I love the Customizations and variety of colors, and the fact that it reacts to sound makes it a lot cooler to look at. The only thing I absolutely hate about these lights is the stupid app, Half the buttons on it looks like you’re able to press them but you can’t, The settings are dumb and when you do want to look up a tutorial on how to use it their videos are outdated and lack any detail. Fix your dumb app, they are literally lights like common they dont have to be this complicated. Make the layout easier to understand, make the settings page actually have settings in it and make repairing them to a different wifi easier. lights are a 5/5, app is a 3/5 at best.","updated":"2020-11-07T17:34:54-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6753203706","userName":"justn82","userUrl":"https://itunes.apple.com/us/reviews/id124094186","version":"5.1.2","score":2,"title":"What happened?!","text":"The last update totally revamped the app. The update looks pretty but removes the great functionality I loved previously. It’s no longer a simple task trying to find new scenes anymore. It is such a chore trying to find popular/new scenes. The previous version had a tab that had separate sections for rhythm and whatever else you were looking for. Now you have one convoluted list that can’t even be sorted by newest or popular anymore. I love the layout but absolutely have that the practicality has taken 10 steps back. I miss being able to go through new scenes and seeing what I liked to add as my new favorite. I do hope you all are working to bring that back as it was essential to the experience. Now it is just hard to explore new creations.","updated":"2020-12-14T10:28:26-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5906877128","userName":"im rocklobster","userUrl":"https://itunes.apple.com/us/reviews/id220569131","version":"4.0.5","score":4,"title":"Quality product,minimal issues","text":"I’ve had the Nanoleaf light panels for a little over a year, they still work great and there’s nothing else on the market like it. I have experienced a few connectivity issues with them but mostly due to internet outages, however the problems are easily fixed. I would really like if they added a widget ability for iPhones to make it easier to turn on manually. Overall amazing product even if it is expensive.","updated":"2020-05-05T10:51:38-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5269372747","userName":"PádraigS","userUrl":"https://itunes.apple.com/us/reviews/id13563052","version":"4.0.0","score":1,"title":"Great until the recent update","text":"When I first got the starter kit and panels, I was excited to try everything out.  Downloaded the app and everything just worked flawlessly.  I downloaded scenes and had everything set up nicely on my dashboard.  \nUnfortunately, they recently updated the app and it’s caused nothing but problems.  I’m having multiple issues connecting to the panels, the dashboard is gone and cannot find any of the scenes I had downloaded (Even though in itself cloud sync it can still see I downloaded them).\n It’s a huge mess and incredibly frustrating having to try and connect to my panels for over an hour until giving up completely.  If the company was smart they’d roll back to the last update until they can fix what was going on with the recent one, but it’s highly doubtful.","updated":"2019-12-13T16:21:16-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6622935333","userName":"LuckysGirl","userUrl":"https://itunes.apple.com/us/reviews/id10504421","version":"5.0.0","score":3,"title":"Needs Work","text":"First of all let me say I love my Canvas.  I have no problem with it not working.  The problem I do have is with the app.  There are so many scenes that I cannot preview and/or download.  It is very frustrating.  If it was just a download issue it wouldn’t be too bad but I cannot even preview multiple scenes.  It wasn’t too bad in the beginning but it is happening more and more.  This needs to be fixed.  Also, the problems other people are having with their lights not working at all at times.  Time for an update. These issues NEED to be addressed ASAP.  When you pay as much as we do for these lights we expect them to work as advertised.  You need to take care of us!","updated":"2020-11-08T08:35:30-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5517729832","userName":"ercable","userUrl":"https://itunes.apple.com/us/reviews/id212503066","version":"4.0.2","score":2,"title":"Horrible Support","text":"The product works decently, but I purchased this in large for its compatibility with Apple HomeKit - which is not working properly.  More specifically, using Nanoleaf Canvas with HomeKit automation is not working.  This may be some configuration needed (though I doubt it) or a firmware update, but Nanoleaf support team is horrible, so I don’t know.\n\nAnd that may be the worst part about this device - it’s support system. They don’t have anyone you can talk to live. They enforce emails to convey technical issues. I spend two weeks and four emails to spin in circles just trying to communicate my problem.  Apparently, they just get bored and stop replying to my emails.  \n\nThis product is too expensive for shoddy support and for an advertised capability not to work","updated":"2020-02-11T08:40:16-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3281842667","userName":"Ecsdesignsvfx","userUrl":"https://itunes.apple.com/us/reviews/id172823526","version":"3.0.0","score":1,"title":"Elaborate app that doesn’t do the 1 thing it needs to","text":"I got the Nanoleaf panels and set up the app - but the app seems to be trying to be waaay more than just programming these panels, it’s really deep with home/room/shopping/etc.   But...any tab I can figure out to be associated with just the Nanoleaf panels don’t seem to work.  In my “Dashboard” is a “Basic - Color - Rythm - Group” set of tabs across the top, but the pages are completely blank.  Color calibration, my panels don’t show up, panels don’t show up anywhere despite successfully pairing and nowhere to attempt to pair or setup again.\n\nSetup was a little confusing as it kept asking about some “home” systems that I’ve never heard of and wanted me to setup some “shop” account in addition to the new Nanoleaf account I just created. Maybe trying to bypass that messed something up. no response through their feedback/help.","updated":"2018-10-09T06:05:03-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"2722307859","userName":"alicedollhouse","userUrl":"https://itunes.apple.com/us/reviews/id258654887","version":"2.5.0","score":1,"title":"Unusable App, Flakey Device Connectivity","text":"This app is terrible, not well designed and the device itself is almost always unreachable. I have to believe most of these positive reviews are fake, as if you go online most of what I see are complaints. I had this for maybe two days before it had to be reset. For this much money your product should be at least decent instead of broken more than 95% of the time. I have a stable WiFi network and no other accessories with these types of problems. Both myself and my partner work in IT fixing issues with tech all day, I can assure you it is not human error. The app looks like it was designed by engineers instead of actual designers who understand UX, and it’s also ugly as sin. Go with Hue where there’s some actual support and reliability. I’d never buy anything this company makes again. Utter garbage.","updated":"2018-06-18T22:28:01-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6612254487","userName":"Brandon Siegel","userUrl":"https://itunes.apple.com/us/reviews/id16807109","version":"5.0.0","score":2,"title":"Awful UI “update”","text":"The new UI is worse in every measurable way. Filter scenes by type? Now you have to go to a different search page to do that. Oh and the scene list only gets to use 30% of your screen, the rest is wasted space. No problem, I love scrolling long lists when they the only 200 pixels high. Want a new scene? You have to back out two levels to get to where you can select the Discover tab, and now you can see the same stuff as before except no wait you can’t filter or order them, and you can’t see details like how many installs etc. Want to preview one? It fails most of the time. Or maybe it crashes the app. At least it keeps you guessing! The UI designers for this “new” app should be fired.","updated":"2020-11-05T10:10:04-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5919877470","userName":"ascar","userUrl":"https://itunes.apple.com/us/reviews/id34149196","version":"4.0.5","score":3,"title":"Love the lights but this app is a headache","text":"The lights themselves are 5 star worthy. This app is 1 star. Here’s why...\n\nIt never seems to want to recognize my light panel anymore. After spending a half hour resyncing them last night and updating with some cool new light patterns, the app seems to have forgotten all about the hard work we spent together last night. Now, it won’t recognize it again. The only way I can cycle through all the patterns now is by manually clicking on the button on the panel itself. Super annoying. \n\nIt’s 2020 and all these smart devices seem to be quite dumb still. I love the lights, just wish they didn’t have all these sync problems with the app!","updated":"2020-05-08T09:33:15-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3828350470","userName":"CoreyPattakos","userUrl":"https://itunes.apple.com/us/reviews/id179139057","version":"3.2.2","score":1,"title":"RETURNING!","text":"All of my smart lights and plugs connect without a problem, I spent $1200 on these panels 3 days ago and still can not connect them to my phone, my iPad, my work phone or work iPad. I have 2 different routers one for work and one for personal, both with 2G options and these lights will not even show as a accessory, I’ve uninstalled the apps 10+ times, tried different networks etc. I’ve turned off my firewall on both routers and still nothing. This app or panels are absolutely junk if they cannot connect to a phone!!! $10 China made lights connect without a problem Nanoleaf!! LIFX was bad, so i bought these but wow these are 10x’s worse. Anyone reading this, save your money. ALSO these WILL rip your paint off, so be prepared to touch up spots. Problem with LIFX was they wouldn’t stick and their app was very complicated but at least connected!!","updated":"2019-03-01T05:56:54-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7401653828","userName":"dadafatsax","userUrl":"https://itunes.apple.com/us/reviews/id1267348764","version":"5.3.1","score":5,"title":"Unreachable","text":"They worked great and then all of a sudden said unreachable and every time I tried to open the app it’d get as far as the screen changing then it’d close again. Maybe a half a second then the app would close itself again. I uninstalled and am about to reinstall. If this doesn’t work I’m gunna have a rager and we’ll play smart light dodge ball until all the “balls” are smashed and try a new brand when I get more. I’m hoping this reinstall won’t work so keep your Phalanges crossed","updated":"2021-05-29T03:10:57-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5631367216","userName":"bryanbates27","userUrl":"https://itunes.apple.com/us/reviews/id144223031","version":"4.0.2","score":5,"title":"Lights are no longer responding after latest update","text":"This is a really cool app and set of panels but the latest update (or firmware update or both, not sure) has caused my leaf panels to stop responding with the app. I’ve reset my phone, the panels, the WiFi, and I still cannot get the panels to connect for more than 5 min (I have to reset each time). This app was working perfectly before, so I’m said I’m that I’m having to give it 1 star for now because of this. I hope you guys can fix this issue!","updated":"2020-03-07T21:56:47-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8119989933","userName":"lacrossefreak22","userUrl":"https://itunes.apple.com/us/reviews/id42568750","version":"7.0.3","score":2,"title":"Great lights, App performance is just lacking","text":"Like most people have already stated… let me start off by saying I love my nanoleaf lights. \n\nThe biggest problem I have is that the app constantly disconnects from the lights and never recognizes them as being available. Connected to the same wifi, lights are on, standing right next to them, etc.. still nothing. Manually input the code/id for the lights and it still can’t find them. I have no problem using the lights through the Apple home kit, it’s literally just this app. After a while it gets incredibly annoying to have to restart everything just to get them to show in the nanoleaf app.","updated":"2021-12-11T13:48:45-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5731728902","userName":"Estebangil86","userUrl":"https://itunes.apple.com/us/reviews/id170094861","version":"4.0.3","score":2,"title":"Panels are great. New app not so much","text":"I’ve owned these for a while and have never had any issues at all. Panels look great and are bright enough for any condition I throw at them. \n\n Unfortunately, I’m not sure why the developer decided to completely redo the app. It’s by far one of the prettiest, yet least intuitive, least functional apps I’ve ever used. Definitely not user friendly at all. It seems like they were more concerned about the overall look of the app and not at all concerned about usability and ease of use. \n\nIf I was looking to buy this product today and knew how not user friendly the app is, I would not purchase it.","updated":"2020-03-29T09:49:58-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7072416538","userName":"Fan767","userUrl":"https://itunes.apple.com/us/reviews/id276204444","version":"5.2.1","score":4,"title":"Overall, a good app! But having one issue","text":"The app overall is useful! One issue I’m having, however, is downloading. In the discovery part, I can see all the scenes that other users have created, but when I tap the play or download buttons, nothing happens. I have the A19 bulb, so I’m not sure if the issue is compatibility of the scene with the bulb…or if there is a bug preventing the action. I hope it’s just a bug, because I’m seeing quite a few scenes I would love to download!","updated":"2021-03-06T07:42:23-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6542552856","userName":"djStace","userUrl":"https://itunes.apple.com/us/reviews/id31816134","version":"5.0.0","score":1,"title":"Bad update","text":"I love my Nanoleaf products but the latest version of the app is a bit of a disaster. The UI is mush less organized than the previous versions and requires endless scrolling both horizontally and vertically. Most importantly why would you ever try to duplicate all the home app functions in the Nanoleaf app AND force it on us as the Home Screen. If I am going to open the Nanoleaf app it is to control my Nanoleaf not other devices (there are better ways for that with better UI) Now to make a quick adjustment to Nanoleaf I have to sift though rooms and all my other non Nanoleaf devices to get to the screens to do anything with my Nanoleaf. Stick to app that focuses on your devices!!!","updated":"2020-10-16T15:07:02-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5801249826","userName":"Joe Eat","userUrl":"https://itunes.apple.com/us/reviews/id43474019","version":"4.0.5","score":3,"title":"Mediocre app","text":"I really enjoy the product for what is and the versatility I get with it. However, the app is dismal in comparison... functionality and usability are a function I would expect but have yet to find here. \n\nAfter the steep learning curve though, I could get the app to work for me and I do enjoy the schedule feature quite a bit! It allows me to utilize color and light intensity to make for a pleasant time waking up or going to bed. \n\nAll in all I am satisfied with the product, it is quite enjoyable! Just be prepared to resync everything after an update!","updated":"2020-04-12T07:59:54-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6304892532","userName":"HisWoman777","userUrl":"https://itunes.apple.com/us/reviews/id101148535","version":"4.1.3","score":1,"title":"Lights Are Great: APP IS AWFUL","text":"Please fix this terrible app. I’ve had these light panels for almost a year now and they worked really well when I first got them. They still work great, except that I can’t use them 95% of the time because the app keeps having trouble connecting. It’s so frustrating! If you can’t fix the issues, please at least revert to an earlier version of the app that actually worked while you figure out what’s wrong with this version. I was going to buy another set for my office, but I definitely won’t as long as the app continues to be like this. It’s a shame to have such a cool product that you can’t use because of a terrible app.","updated":"2020-08-10T21:47:57-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5410933852","userName":"daddychuloxd","userUrl":"https://itunes.apple.com/us/reviews/id561440727","version":"4.0.2","score":5,"title":"App works gr8","text":"Overall the app works great even though it might be tedious to get it to connect though, if it doesn’t connect just reset it (search videos up on how to reset nanoleafs) and just connect it. If it still doesn’t work than return it, but back to what i was saying, there’s nothing wrong with the app, and it’s cool on how you can download others “scenes” and use them, it’s pretty enjoyable and the app never crashes.","updated":"2020-01-16T06:14:54-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6487111946","userName":"Bshorb9","userUrl":"https://itunes.apple.com/us/reviews/id258248616","version":"4.1.5","score":4,"title":"Love the product! The app crashes.","text":"The lights are amazing I have the rhythm kit and the way the lights react to the music is too notch! I also love all the user generated modes. However the app does seem to have a glitch where it tells me all my panels must be reachable to preview a mood even though everything is hooked up correctly. That is the only reason I subtracted a star. Other than that amazing product and a pretty decent app.","updated":"2020-09-30T21:11:36-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"2127314070","userName":"ivorypale","userUrl":"https://itunes.apple.com/us/reviews/id32181983","version":"2.2.2","score":1,"title":"Don’t waste your time and money","text":"If you love wasting two or more hours troubleshooting, setting the lights back to factory reset, deleting and redownloading the app, resetting up the device and reprogramming your lights after every app update, this is the product for you! \nThe lights stop working in some way every time there is a software update. This time it was the scheduling. Last time they wouldn’t turn on. The time before that all my scenes were deleted. Support is nonexistent and their site’s copyright hasn’t even been updated in two years. Their only QA appears to be crowd sourced. Buy a Hue LED strip- it’s cheaper and it’ll actually work without giving you years of headaches like this does.","updated":"2018-01-25T19:13:44-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7981877151","userName":"1726473918273$37;!,&/92","userUrl":"https://itunes.apple.com/us/reviews/id1156268287","version":"7.0.0","score":3,"title":"Randomly disconnects whenever it feels like it","text":"Sometimes when I open the nanoleaf app to turn on my lights, it will randomly act like I’ve never paired my lights before. I try everything the manual says about hard and soft re-setting, WiFi, etc. Usually it never works and I just end up turning them off for the day. The next day when I turn them on I’m normally able to pair them easily, but this gets extremely annoying very fast. \n\nWhenever it doesn’t do this they work perfectly.","updated":"2021-11-02T11:35:59-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4871108269","userName":"xtragummy","userUrl":"https://itunes.apple.com/us/reviews/id138507682","version":"3.5.0","score":2,"title":"Bad user experience","text":"Functionally, this app works to change the colors and themes. However there are big drawbacks that for some reason still exist even though this app has been out for a long time.\n\n* No global brightness setting - all default themes are set at a blinding 100% and it’s not clear how to keep brightness at a certain % at first - you have to save the scenes... however\n* Saving scenes take many actions and is hard to find the save button. In addition it’s not intuitive what everything does unless you fiddle with it. On top of that, every scene you save - regardless if it’s just a simple theme or a rhythm pattern with motion - will get saved to the color category. This is super confusing as it removes the motion setting from the available pool of motions for the rhythm controller. To get that rhythm back, the only way is to re download it from the explore tab\n* Per scene orientation settings? Why not have a global setting?\n* Devs, please add useful global settings for the app!","updated":"2019-10-01T17:19:54-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5349231099","userName":"llllllgfdhfdhjfddghdchbdcvh","userUrl":"https://itunes.apple.com/us/reviews/id914538691","version":"4.0.1","score":1,"title":"Great concept but not stable","text":"I bought 2 different Nanoleafs, one that is a 9 piece and another that is 16.  Have done countless hard and soft resets on both   Even added a different router to set up a mesh to see if the problem was that, nope.   Of the 2 devices I have gotten them to pair once successfully.  It did a firmware update and 15 minutes later I lost control of the Nanoleaf.  I did several factory resets, deleted the device... bla bla bla followed everything over and over and it never pairs.  Found a windows version of the Nanoleaf app hopefully it doesn’t use HomeKit.  \nUPDATE:  Windows app works, uninstalling this app.   Please stop using homekit for this app!","updated":"2020-01-01T18:37:32-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7485083841","userName":"paultran72","userUrl":"https://itunes.apple.com/us/reviews/id401113850","version":"6.0.0","score":3,"title":"It’s alright","text":"The product is good but after power outages it takes an hour to reconnect to WiFi and also the colors are really dark but the white light is very very bright. I’d probably like the product better if it had a bridge like Philips Hue instead of being connected to WiFi since my WiFi is very bad. And it doesn’t connect to google home. And also the colors won’t save in the app which is very frustrating for me. Can please fix these? Thank you.","updated":"2021-06-20T00:51:02-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6589651800","userName":"MMMALatif","userUrl":"https://itunes.apple.com/us/reviews/id120639827","version":"5.0.0","score":1,"title":"One of my worst experiences","text":"Unfortunately I bought 2 x 15 panel starter kits with the rhythm controller for each. It took me over 10 trials to add each controller  into the app. Upgraded the firmware to the latest. I like the led lights and the colors very much. The issue is that the controller losses connection for an unknown reason. It takes lots of trials to get it back online only to loose the connection again in few minutes. I just don’t understand how Nanoleaf can not get the basic connectivity right. My house lighting is fully automated from several companies. I have never experienced such frustration.","updated":"2020-10-30T04:12:13-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7659731547","userName":"BxckWoods","userUrl":"https://itunes.apple.com/us/reviews/id1159667264","version":"6.0.0","score":4,"title":"Okay so","text":"I love Nanoleaf their devices can make a boring room pop with color…..that is when you can actually connect to your $300 pretty lights. I’ve owned Nanoleaf stuff since their original triangles, and since then I’ve had problems with connecting the devices to the app which is a big headache. Good job on the actual products but your connection issues gotta be fixed for me to get more.","updated":"2021-08-05T17:54:30-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5272998420","userName":"Spek.t85","userUrl":"https://itunes.apple.com/us/reviews/id15039158","version":"4.0.0","score":2,"title":"Latest Update - Can No Longer Connect","text":"The holidays are here and in the spirit, I purchased another set of panels.  I saw an update for the app, and promptly downloaded it.  Now, I can’t connect to my original panels and I don’t want to open my new set to find they won’t pair either.  I have tried repeatedly to pair my original set, but after about 20 minutes of trying and following all the FAQs and troubleshooting, I’ve given up.   I hope Nanoleaf takes a look at the problem and offers a fix.  For now, at least my panels turn on.","updated":"2019-12-14T12:10:28-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7319194750","userName":"Dununguy","userUrl":"https://itunes.apple.com/us/reviews/id39517045","version":"5.3.0","score":1,"title":"Terrible software, terrible product","text":"I should have read the reviews. Why didn’t I read the reviews? While the lights are vibrant, it does no good when you can’t connect to the software. You can’t even control the lights without connecting to the software. There are buttons on the controller, but alas, it does nothing. This product is way too expensive to have something like this happen from the get go.  Save your money, buy a competitors brand. Given how long this has gone on, a slump in sales may be the only thing to get them to address these issues.","updated":"2021-05-09T15:07:00-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3490740955","userName":"Brae2k","userUrl":"https://itunes.apple.com/us/reviews/id123957053","version":"3.2.0","score":5,"title":"Astounding","text":"This app is essential for the true essence of these lights to work. I’d give another star if it was possible. Had the lights for about a month now and thinking about taking out all lighting systems in my house and replacing with these! They bring life and emotion to an other wise dull setting and create with it an aura of feelings that’s literally controllable at your fingertips. This is a for sure pick up if you don’t have it.","updated":"2018-12-03T17:32:06-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"2087535844","userName":"Gr8rscott","userUrl":"https://itunes.apple.com/us/reviews/id190282770","version":"2.2.1","score":4,"title":"Only needs one major tweak...","text":"So far, so good.  These lights are awesome, and so far the app works well to control them, save for one thing: the color picker.  The color wheel and the brightness slider are so close together that often my trying for a darker green or blue becomes a bright red or orange.  It’s maddening, especially when trying to set a number of those cooler colors in a palette.  Please tweak the color picker or the UI to make it easier and better defined; then it’d be a great app!","updated":"2018-01-13T23:58:00-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7997630782","userName":"jebertimes","userUrl":"https://itunes.apple.com/us/reviews/id37286520","version":"7.0.0","score":1,"title":"Latest update BEWARE","text":"Been using Nanoleaf for several years. App has worked good until a couple days ago.  It prompted me to login as if I had never used the app or had any devices. So I reset one of my most used devices to try to reconnect it since it was no showing up. Now there is NO way to connect it and it’s dead. This need ma to be fixed ASAP and I see others are having the same issue.  I even tried adding a new set of lights thinking something was wrong and it was not able to be added either. Very upset and this app was not thoroughly tested. Wow!","updated":"2021-11-06T23:44:41-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6649004025","userName":"TechNTools","userUrl":"https://itunes.apple.com/us/reviews/id21284700","version":"5.1.0","score":1,"title":"App still feels like an Alpha product.","text":"The latest update made me laugh. I’m going to use this app to control all of my lighting? This app can barely control the nanoleaf lights it was designed to control. Til this day the lights go on at random times even though I deleted the schedule. Always great to be awoken from a sound sleep for no reason other than my lights are on at 100%. Also there is no way to permanently change the brightness.  A level of 50% is good for me. Also you cant assign a specific light setting within alexa routines. It’s fun but far from primetime ready.","updated":"2020-11-15T10:00:19-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"2808358761","userName":"Ken Is Somewhere","userUrl":"https://itunes.apple.com/us/reviews/id35210076","version":"2.5.1","score":4,"title":"Firmware update broke it","text":"Edit: The staff has been very responsive in helping us get things back on track.  New firmware pushed through seems to have fixed things for us.  Appreciate their help\n\nAfter updating to 3.0 the panels are almost unusable. As others below have said it constantly becomes unreachable from the app and freezes or turns bright white out of the blue. Hope you guys get this fixed ASAP.","updated":"2018-06-30T20:53:33-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7785558141","userName":"Heartburst","userUrl":"https://itunes.apple.com/us/reviews/id445677330","version":"6.1.0","score":1,"title":"Amazing lights but NEVER stay connected 😡","text":"Although I absolutely LOVE the light panels when they are working , they NEVER stay connected and function correctly for more than an hour or so. They have literally become the most frustrating device I’ve ever experienced. I’ve spent hours upon hours troubleshooting and trying to find a solution but nothing has worked. I have contacted nanoleaf and they have sent me THREE new controller modules but this never helps anything. \nI would give the panels 5 huge stars if they actually stayed connected and working.","updated":"2021-09-08T14:44:21-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5289472400","userName":"Bob23455","userUrl":"https://itunes.apple.com/us/reviews/id172700893","version":"4.0.0","score":1,"title":"“Not Connected”","text":"I love the way the panels look. Unfortunately turning them on involves unplugging them, waiting for them to reboot, opening the slow to open app, and if you get lucky and they connect, then you can select a scene. I tried everything from hard resets to changing router settings, talking with tech support etc... they finally sent a new controller which had the exact same issues. I have a $25 smart bulb that is always connected. Panels look great but the software makes that a moot point unless you schedule some time to connect them first.","updated":"2019-12-18T19:17:01-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8137438098","userName":"random dude in san jose","userUrl":"https://itunes.apple.com/us/reviews/id386129627","version":"7.0.3","score":1,"title":"Robots Will Destroy Us All","text":"Ever wonder what would happen if you let AI run the world? Start your education by letting Nanoleaf control your lights.  How hard can it be to get 3 lightbulbs to be the same color? To put a TIMER on your lights? To get them to sync and not reset into some unwanted unsynchronized nonsense? To show you if they are on or not? \n\n\"I see that my lights are on. Why is Nanoleaf telling me that 2 are off and why wont let it me change the color or turn them off?\"\n\nNanoleaf is what happens when some engineers get together with some marketing guys and they are all idiots.","updated":"2021-12-16T14:11:03-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5285258454","userName":"Tomeristo","userUrl":"https://itunes.apple.com/us/reviews/id155328932","version":"4.0.0","score":2,"title":"Beautiful product horrible app","text":"Good: \n- The product looks amazing. \n- The concept is wonderful and works well. \n- Lots of different functionalities and settings. \nIt’s just really cool\n\nBad: \n- The user experience on the app is horrible. More times than not you are looking for how to get to basic functionalities to work. Not intuitive at all. \n- Set up of the app is not friendly and setting integration to HomeKit works well but also not friendly\n- Integration to Alexa simply doesn’t work. I thought i was doing something wrong until i read all the reviews and saw the score of the skill (1.7 out of 5) to realize it doesn’t work. So you can only use the app \n\nGood news are that all the bad things relate to software. If they completely redo the app and sort out the Alexa skill to actually work my review could go up to 5.","updated":"2019-12-17T17:49:04-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4862771050","userName":"CalvinLiu411","userUrl":"https://itunes.apple.com/us/reviews/id231092018","version":"3.5.0","score":1,"title":"So many problems","text":"The nanoleaf has so many problems. It can’t work on 5ghz internet, it occasionally stops being connected to your phone and then you need to reset it, there was 1 bug where the power button didn’t even work, it doesn’t connect to Siri and google home half the time. I can’t believe this has 4.5 stars. It’s actually such a lie and must be inflated. If I’m paying 300$ for these then I expect it to not work like a gimmicky Chinese knock off. Hire real developers and engineers. These have to be 1 of my most regretful purchases and I’m letting everyone in my life know it’s 100% not worth it.","updated":"2019-09-29T18:45:07-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5314915137","userName":"Applykations","userUrl":"https://itunes.apple.com/us/reviews/id32610464","version":"4.0.1","score":1,"title":"Last update completely messed up my canvas","text":"I don't need to explain. Worked perfectly. And yesterday it's stopped working. What happened? Hoping developer is listening. Really bad move for the holidays.\n*Update: Developer admitted last update busted controller. After much back and forth sent a new one. It works. But re-installing it took a lot of effort. Peeled wall. No additional linker in package didn't help. Also Minimum stickers. Had recommended this item to many. No more. Beware. Way too expensive for an item that developer destroys remotely and supports poorly.","updated":"2019-12-24T13:22:31-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8062475807","userName":"Globetrekker99","userUrl":"https://itunes.apple.com/us/reviews/id330301716","version":"7.0.2","score":5,"title":"“Nanoleaf” Smart Lights  have easy to use setup instructions","text":"Set up and use of “Nanoleaf” smart lights work exactly as prescribed in the setup directions. Initially, I skipped reading the set up directions, and got things working by trail and error. Then I read the setup directions with the codes on the setup paper-  and setup became quick and easy.","updated":"2021-11-25T10:30:34-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5175655613","userName":"Tjovian","userUrl":"https://itunes.apple.com/us/reviews/id41065275","version":"3.5.3","score":1,"title":"Pretty, but hard to maintain","text":"I have several Aurora sets in my home and any time I reset my router they all stop being responsive. I’ve had to restore them back to factory settings to get them useable again more times than I’d care to count over the past few years. Initially they seemed like a great investment, but over the past two years I think this company has moved on to its newer panels and left these Aurora devices as a part of planned obsolescence to move on to more expensive units even though these original panels were over-priced to begin with.","updated":"2019-11-20T23:51:06-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7423224967","userName":"Jacob 496","userUrl":"https://itunes.apple.com/us/reviews/id1007290359","version":"6.0.0","score":4,"title":"Very cool lighting but overly expensive","text":"The light panels do not disappoint and are very bright (depending on your settings). They look cool and serve as my night lights. \n\nMy only complaint is every time they update the app, it logs me out and keeps me from being able to reconnect to the light panels via the app. I’ve had to factory reset several times. Kinda irritating. Lighting shouldn’t be a hassle lol","updated":"2021-06-03T15:27:57-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3354136160","userName":"You_Thot","userUrl":"https://itunes.apple.com/us/reviews/id661533401","version":"3.1.0","score":5,"title":"Like a charm","text":"I had one problem setting up the lights to connect with the app. I tried everything and kept getting the same message \"iCloud backing up\". Tried on my iPad, same thing. It wasn't until I redownloaded the home app that it was able to work. 🤦🏽‍♂️ besides that the app works great, it doesn't crash on me or drop out of connection","updated":"2018-10-28T07:35:56-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6446830144","userName":"page moss","userUrl":"https://itunes.apple.com/us/reviews/id541303862","version":"4.1.4","score":5,"title":"Great Product and App","text":"I thought $200 for a starter kit was a little steep, however when I installed and tested them, I found out that not only could these lights simulate Browns and Dark Reds but that the music syncing is better than any off the shelf LED light strip. The only improvement that would elevate the experience is if this app had widgets.","updated":"2020-09-19T14:30:28-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5684440520","userName":"Calc User 101","userUrl":"https://itunes.apple.com/us/reviews/id873051378","version":"4.0.3","score":2,"title":"Lights are great. App is terrible","text":"Took over an hour to pair and figure out. Takes even longer if you want to make a custom color mode that doesn't flash or change. Anytime you want to change the brightness of a color it automatically changes it to black / white. There is no back button if you mess up a color. My lights changed order in the middle of creating a pain staking gradient pattern. Only shows 5 colors when you have a minimum of 9 panels","updated":"2020-03-19T17:52:00-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3270937533","userName":"Viperv8","userUrl":"https://itunes.apple.com/us/reviews/id154986695","version":"3.0.0","score":5,"title":"Fix this now","text":"Update has made this app into total 🐂💩 got my new iPhone everything transferred fine including my Apple Home settings but when I try to set up my nanoleaf app I’m stuck on add home no matter what I do I get error but yet i can control my light kits threw the apple home app with all my scenes. Tried signing in and skipping it but same add home screen.","updated":"2018-10-06T09:14:45-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3617081020","userName":"Jimmy Again","userUrl":"https://itunes.apple.com/us/reviews/id32255456","version":"3.2.1","score":4,"title":"Please remove the slash screen","text":"It is a fine app, but operating a superb product. \nPlease eliminate the “nanoleaf” splash screen every time I load the app. If I quickly go from one app to the other, I have to view the splash screen animation every time before I can control my lights. The app is in the RAM, I can see showing the splash screen every time it reloads or is opened for the first time, but not every time I switch apps.","updated":"2019-01-05T17:16:17-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"2851895359","userName":"Dougdi","userUrl":"https://itunes.apple.com/us/reviews/id212302350","version":"2.5.2","score":4,"title":"Happy now","text":"At first it took several hours to get up and running. I did get immediate help online and they stuck with me.\nMy router was set to 5Mhz, after I got dual mode set I finally got a connection. The app is fine, I hope to see improvements and new functions. I rarely ever need the app, I cycle through my presets both downloaded and user made. The panels are incredible!","updated":"2018-07-06T13:19:40-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4655117386","userName":"MadMadMikey","userUrl":"https://itunes.apple.com/us/reviews/id33649971","version":"3.4.1","score":1,"title":"BUYER BEWARE","text":"I would never have purchased these lights if I knew what headaches they cause. This app constantly updates and the problems get worse with each update. Out of nowhere, all the lights turn solid white. The only way to correct this is to disconnect and reconnect them, but in a few hours (sometimes minutes) they all turn white again. Don’t just take my word for it. Go to reddit and search the Nanoleaf subreddit. These are amazing when they work, but they just don’t, and every attempt they make to correct the problem makes them worse.","updated":"2019-08-22T07:36:53-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6245317217","userName":"MJ4424MJ","userUrl":"https://itunes.apple.com/us/reviews/id31791637","version":"4.1.3","score":2,"title":"Having a hard time connecting...","text":"I have the modem supplied by the cable company (not an additional modem) and perhaps this is the problem, but I’ve connected a house full of other smart devices without issue but for some reason, even after multiple soft and hard resets I cannot get it to connect.  I would be a 5 star review if I could because they look beautiful. Unfortunately I have 20 tiles sitting in a box because the master won’t link.","updated":"2020-07-26T14:24:45-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5340516722","userName":"Mohammed1900","userUrl":"https://itunes.apple.com/us/reviews/id827696254","version":"4.0.1","score":5,"title":"Problem","text":"I have a problem with connected every time when I leave and I'm came back I won't work tell me you cannot connected with your device so I have shut it off and open the Bluetooth and do connect every time when I'm leaving came back","updated":"2019-12-30T16:00:36-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"2795903755","userName":"Kseghs","userUrl":"https://itunes.apple.com/us/reviews/id335884292","version":"2.5.1","score":5,"title":"Love it, app is much improved","text":"I couldn't stand how many times I've had to reinstall my device in the beginning. Too many to even count. I lost all kinds of settings repeatedly. \n\nUpdate: Nanoleaf has made many advances with the app and I no longer run into the same problems. I really enjoy this product and app now.","updated":"2018-06-29T04:53:15-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6543154801","userName":"TheRapCat","userUrl":"https://itunes.apple.com/us/reviews/id277588221","version":"5.0.0","score":1,"title":"Worst app update ever","text":"This app is seriously flawed. The screenshot previews in the App Store aren’t even of the current app. That’s how short sighted this launch was. You can no longer control just your Nanoleaf devices. They are hidden among your dozens of other home kit devices on this app. It is trying to replace the Home App but does much worse and also fails to provide basic easy access to your Nanoleaf devices.  The very devices that brought you to this app. Would recommend returning your products. That’s how bad it is","updated":"2020-10-16T19:41:49-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6757332370","userName":"KatyRogersArt","userUrl":"https://itunes.apple.com/us/reviews/id147002394","version":"5.1.2","score":3,"title":"Love the lights, app needs improvement","text":"I absolutely love the nanoleaf lights and the endless customization within the app. However, the app falls short because it’s a little clunky.  \n\nFor instance, I don’t like how the bottom menu icons open up to have their name come up, causing unnecessary visual clutter since the menu name is already displayed at the top. It’s over stimulating when there are already so many things to do within the app - the app feels over crowded. \n\nWhen the lights themselves have so many features to offer, the app should feel simpler and easier to navigate. Less is more.  \n\nI enjoy everything the app offers just wish it was designed to be more simplistic and sleek.","updated":"2020-12-15T14:40:51-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6546361810","userName":"1283'","userUrl":"https://itunes.apple.com/us/reviews/id807553103","version":"5.0.0","score":2,"title":"Would be perfect if they actually connected","text":"Every week my panels just randomly disconnect and it is the most long process to reconnect them sometimes taking over an hour. I paid over $200 for these and to see the connection issues not be taken care of after 2 years is just not okay at all. These things bring me mor stress then joy and I just don’t see them actually working on fixing these issues.","updated":"2020-10-17T17:26:03-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5973667788","userName":"FatWhitePanda","userUrl":"https://itunes.apple.com/us/reviews/id588061434","version":"4.0.5","score":5,"title":"Honest Review","text":"Honestly after purchasing my Nanoleaf. This is by far the best app when it comes to managing the lights. I love the ability to customize your lights how you want. Honestly there is so much this app provides and I recommend it for anyone! I never write reviews but this deserves it! Recommend!","updated":"2020-05-21T01:01:08-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6819902987","userName":"snik snak snikt","userUrl":"https://itunes.apple.com/us/reviews/id24031556","version":"5.1.2","score":1,"title":"Abysmal setup experience.","text":"Go online. Read other reviews. Unless your WiFi is ancient and unsecured, you’re going to run into issues pairing the panels. In the end, I held both buttons down on the controller for 45 seconds to have the controller initiate its own hotspot. Then I was able to pair. This comes with the disadvantage of having to be connected to the device. \n\nFor the record, I’m running 2.4ghz with all protocols (a/b/g/ac), but without UPnP enabled (security risk).\n\nWhy does it need UPnP? Why can’t I just use Bluetooth for that matter? I have buyers remorse.","updated":"2021-01-01T17:12:28-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6978369959","userName":"samiamiam13","userUrl":"https://itunes.apple.com/us/reviews/id1258830174","version":"5.2.0","score":2,"title":"I want to like these essential light bulbs","text":"This latest update seems to have broken two of my three bulbs. I have three bulbs that wouldn’t update to the latest software. Nanoleaf told me to do a bunch of stuff to get them to update. But now I can only get one of the three lights connected to the app to be able to use them as smart bulbs. This needs to be fixed and they need to get in touch with me ASAP to fix this issue. Not happy.","updated":"2021-02-10T10:13:54-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8081121162","userName":"electrikshepherd","userUrl":"https://itunes.apple.com/us/reviews/id249409924","version":"7.0.2","score":3,"title":"Not buggy, but not intuitive","text":"Completely unintuitive interface. I've been using it off and on for years and still sometimes need to Google how to do things in it. In the past I've at least been able to say it's completely bug-free, but lately it's been freezing up a lot and I've had to kill it and restart it.","updated":"2021-11-30T13:52:50-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6858420033","userName":"Waynegfx","userUrl":"https://itunes.apple.com/us/reviews/id35885774","version":"5.1.3","score":5,"title":"Amazing features","text":"If you own Nanoleaf lights this is THE go to app to use.  There are too many features to even try to name, but being able to see recently added color schemes submitted by users is one of the best.  I highly recommend this app ⭐️⭐️⭐️⭐️⭐️⭐️","updated":"2021-01-11T12:59:48-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3356060987","userName":"redcity11","userUrl":"https://itunes.apple.com/us/reviews/id49340801","version":"3.1.0","score":5,"title":"Can’t turn off!","text":"For some reason I can no longer turn off my lights with the off button on iPhone XS Max. Every time I hit the button it goes to edit mode. And how about every time I open the app I don’t have to see the Nanoleaf logo. I paid good money for the things. Don’t need to be reminded every single time.","updated":"2018-10-28T20:28:50-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"1950757488","userName":"igoapps.com","userUrl":"https://itunes.apple.com/us/reviews/id28836645","version":"2.1.6","score":4,"title":"Overall nice","text":"I love the lights and the app is decent. My biggest problem with the app is only one device is able to be hooked up to it. So if my wife or kids want to change it up or if I want to use my iPad instead I can’t. The app also has a few problems with staying connected to the lights. Overall though i really like these lights.","updated":"2017-11-26T09:44:50-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6638764717","userName":"scrumbdy34","userUrl":"https://itunes.apple.com/us/reviews/id33768080","version":"5.1.0","score":4,"title":"Love my panels, need portrait mode!","text":"Love my panels, had them for several years and always enjoy this dynamic piece of art on my wall.  \n\nThe app needs portrait mode on iPad, it’s very annoying to have to pick it up from watching something to change the lighting, instead of just opening the app and just using it.","updated":"2020-11-12T17:57:14-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7881067169","userName":"bartledoo2","userUrl":"https://itunes.apple.com/us/reviews/id38431388","version":"6.2.0","score":3,"title":"No landscape mode","text":"Landscape mode on iPad is needed for people like me who have iPad on a stand. It’s a hassle to have to turn the iPad with the wires I have connected to it and then turn it back to landscape when I’m done with the app. \n\nAlso, the interface for modifying scenes is a pain. I have to go through many multiple steps to change the scene speed, for example.","updated":"2021-10-05T07:32:07-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6031794632","userName":"LinkRemembered","userUrl":"https://itunes.apple.com/us/reviews/id41105432","version":"4.1.0","score":4,"title":"Please add landscape support for iPad","text":"The app does what it’s supposed to do well, except I would love to be able to use it on my iPad in landscape mode. It would be awesome to be able to use it with the Magic Keyboard without having to turn my head sideways or remove the iPad itself. Great product overall though!","updated":"2020-06-03T16:17:33-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7313215250","userName":"PPPPRESTON","userUrl":"https://itunes.apple.com/us/reviews/id509916188","version":"5.3.0","score":3,"title":"Declining with Age","text":"This used to work flawlessly when I first got it last summer (2020). However, as time has gone on, I have had to reset it by deleting all my settings and unpairing them completely and re-add them back as new. I’ve lost my settings countless of times and had to rely on memory to determine which light settings I’ve had before.","updated":"2021-05-08T08:25:11-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5971942724","userName":"unonuto","userUrl":"https://itunes.apple.com/us/reviews/id623180969","version":"4.0.5","score":1,"title":"App never connects","text":"I have everything set up correctly and have even done multiple hard and soft resets of the panels and deleted and reinstalled the app. The panels are up to date and so is my OS. Even after this, it always says that the panels are not responding even though I can turn them on manually. \n\nI like the lighting a lot but the app and panels need to have little to no connection issues for a better review. \n\nI spent 200$ on these lights so I fully expected to have no issues.","updated":"2020-05-20T15:11:46-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4577892560","userName":"Justin ocean","userUrl":"https://itunes.apple.com/us/reviews/id150067353","version":"3.4.0","score":5,"title":"Seventh sense","text":"So so amazing I need to upgrade to the canvas I need 1000 panels connected. Somehow, you can hear it, see it, smell it, feel it, taste it, understand it, and empathize with the light panels. You develop a sort of 7th sense when you put up a 30 panel nanoleaf aurora set up, that allows you to become one with with the brilliance of the light display.","updated":"2019-08-06T09:54:06-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"1862158924","userName":"Redhood79","userUrl":"https://itunes.apple.com/us/reviews/id403335753","version":"2.1.3","score":4,"title":"Awesome but 1 slight issue","text":"I have had these lights for about 2 months now and they work great. One issue is for the alarm schedules, even when they are turned off, they still turn on. I have one set for 6:00 am and for week days it works but weekends it gets annoying. This may be user error but if not please fix this.","updated":"2017-10-20T07:32:20-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4633711257","userName":"YourMom84","userUrl":"https://itunes.apple.com/us/reviews/id531662448","version":"3.4.1","score":1,"title":"Garbage","text":"I can’t even begin to describe what a piece of garbage this is. I will never get back the hours I’ve spent trying to connect this thing and on top of that, the double sided stick tape they give you to install them is a complete joke. The app barely connected less than 9 months ago, but off and on with software glitches. Now it’s completely useless, and I HATE this thing for being such an expensive ripoff. For $10 you can buy a light strip and battery pack for all the backlighting you could possibly want.","updated":"2019-08-17T18:40:22-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7982500349","userName":"mcfinnipoop","userUrl":"https://itunes.apple.com/us/reviews/id1282729718","version":"7.0.0","score":2,"title":"Great app, except the schedule feature doesn’t work at all","text":"Not sure if it’s just the A19 Bulb, but it’s listed in the devices, I can control and change the lighting, but when trying to add a schedule i just get a pop up saying “Add a device”.\n\nThe response time and color change is fast, and the lights are great… but being able to schedule the on/off was mainly the reason I got the bulbs.","updated":"2021-11-02T16:10:58-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6872992011","userName":"Mysticblade","userUrl":"https://itunes.apple.com/us/reviews/id41978587","version":"5.1.4","score":2,"title":"I’m lost with the latest UI","text":"The original UI felt so much easier to navigate and more intuitive. I understand that they wanted to add your entire smart home to the UI but now it feels messy. It is not easy to find settings to adjust the light panels themselves, you have to keep digging through several options. I have trouble just finding where to turn on or off specific panels.","updated":"2021-01-15T07:10:35-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8011275390","userName":"Mr. BMF","userUrl":"https://itunes.apple.com/us/reviews/id393684146","version":"7.0.0","score":1,"title":"Update caused all lights to fail 95% of the time","text":"I love my Nanoleaf products, however, the last update caused so many issues. The app required me to sign in and re-sync, and since then the connectivity is extremely unreliable. The lights are “updating” or fail to respond to commands from the Nanoleaf and the Home app. Siri is surprisingly more responsive but also struggles 85% of the time. Please release a fix! I’ve had nothing but problems with this previously reliable app.","updated":"2021-11-10T22:52:04-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5238629460","userName":"Fclhwoj78492","userUrl":"https://itunes.apple.com/us/reviews/id541648389","version":"3.5.3","score":2,"title":"So many bugs","text":"I’ve had minimal issues with my nanoleaf until recently. The rhythmic northern lights motion barley changes colors at all anymore like it used to, no matter the color palate. Had to do a hard reset of my panels after they wouldn’t connect out of nowhere.  When I create a new scene it never gives me an option to save it. Will be a lot happier with it once the app works the way it’s supposed to.","updated":"2019-12-05T20:45:03-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6853662225","userName":"J.U.1","userUrl":"https://itunes.apple.com/us/reviews/id141791526","version":"5.1.3","score":1,"title":"Getting frustrated","text":"These lights are way too expensive to have this much trouble getting them and keeping them connected to my network and syncing. It should at least be able to connect to its own app. I've reset the settings way too many times. The problem with rebooting the router is then other devices I have have trouble connecting, then once I get those back connected the nano isn't working again","updated":"2021-01-10T08:04:28-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7629611071","userName":"Mathias-","userUrl":"https://itunes.apple.com/us/reviews/id1313984611","version":"6.0.0","score":4,"title":"Good but one problem…","text":"This has been an amazing eye candy to my bedroom and it even works with Siri and is so fun to use. Although one problem i have is when I switch the lighting pattern mode in the app it flashes to maximum brightness which hurts my eyes a lot. Other than that this is great!","updated":"2021-07-28T19:21:01-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6311626115","userName":"NickC1589","userUrl":"https://itunes.apple.com/us/reviews/id178271551","version":"4.1.3","score":1,"title":"Garbage.","text":"I purchased a nanoleaf about 3 weeks ago and have tried connecting it to this poorly developed app. The device connected ONCE for a total for 45 minutes after TWO HOURS of trying to set it up. I’ve tried absolutely EVERYTHING. Nothing works. I’ve tried contacting this stupid company SIX TIMES with no responses and no actual customer support. I am infuriated. I hope those that read these reviews are weary of how useless the device is without this dumb app.","updated":"2020-08-12T12:35:19-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6187666270","userName":"not atlas","userUrl":"https://itunes.apple.com/us/reviews/id636437212","version":"4.1.2","score":5,"title":"WORTH THE INVESTMENT","text":"I LOVE THESE LIGHTS!!!! I’ve seen them for years and always wanted them and as you can tell end up buying the Nanoleaf canvas; they are absolutely GORGEOUS and set literally any mood in seconds, the app is easy to use and works wonderfully with HomeKit. 10/10 would recommend 🔥","updated":"2020-07-11T20:49:03-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5465080687","userName":"GloryLou","userUrl":"https://itunes.apple.com/us/reviews/id12218338","version":"4.0.2","score":4,"title":"Nanoleaf","text":"I love being able to set a mood or just play with the lighting of my Aurora Nanoleaf. It have a full range of color, disability, and responds to sound nicely. It’s only limited by your imagination!\n\nI would love if the devs would let me be able to have more functionality. Unlimited control of every aspect would make this a five star product. \n\nPros:\n\nFull color range\nDimmable\nScenes\nSound responsive\n\nCons:\n\nUnable to make multiple/simultaneous scenes at same time (zone creation).\nLimited scene creation storage\nLimited scene styles\n\nOverall all a great product for both adults and children’s rooms.","updated":"2020-01-29T23:17:47-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6688329407","userName":"djnodis","userUrl":"https://itunes.apple.com/us/reviews/id26481831","version":"5.1.1","score":5,"title":"Crashes every time I use it","text":"This app is infuriating. Every time I use it, it crashes. And once it does, it will keep crashing until it doesn’t. The slogan for this company is Smarter By Design! CMON! We have paid so much for this stuff...","updated":"2020-11-26T08:50:55-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6642441212","userName":"DMB Fan 36","userUrl":"https://itunes.apple.com/us/reviews/id38943900","version":"5.1.0","score":2,"title":"Love the devices","text":"The app is necessary to get the full amazingness of the devices but man is it frustrating. \n\nHorizontal scrolling with two rows on the scenes panel when 2/3 of the screen is empty? Why not normal vertical scrolling. Why not standard nav instead of the terrible horizontal scroll??! \n\nThe devices are sensational, but the app would be 1000% better if it were more iOS native and less weird hard to use stuff.","updated":"2020-11-13T18:11:12-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6543020715","userName":"pete_le","userUrl":"https://itunes.apple.com/us/reviews/id450901255","version":"5.0.0","score":3,"title":"Works fine, new app update is horrible","text":"The most recent update makes it difficult to choose the lighting modes that I downloaded. The previous app version wasn’t perfect, but this is a backwards step. For me the new app update is not user friendly in regards to just choosing the lighting modes that I already downloaded.","updated":"2020-10-16T18:42:55-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4726607781","userName":"Teejay2323","userUrl":"https://itunes.apple.com/us/reviews/id85249709","version":"3.4.1","score":4,"title":"Latest update created a issue","text":"I love the Nanoleaf and the app, but the latest firmware update created a issue where the light panels will randomly go all white and get stuck in some kind of update mode it happens multiple times a day till I just unplug it.I hope they notice this and fix it soon!","updated":"2019-09-04T09:54:31-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4435775583","userName":"Batman_98","userUrl":"https://itunes.apple.com/us/reviews/id430042898","version":"3.3.3","score":1,"title":"Connection issue","text":"Overall the product and application is great but have a daily issue with the device being “unavailable” on my Apple device home kit connection, Alexa device and application. Even after I reboot both mobile device and lights I still encounter the issue often as well for the Alexa smart home. I also have high speed internet, which should help improve such connection issues. I encourage a future update that may resolve this connection issue.","updated":"2019-07-09T16:06:46-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8136985146","userName":"Garrett Woodford","userUrl":"https://itunes.apple.com/us/reviews/id120946924","version":"7.0.3","score":1,"title":"Bad UI","text":"Set up my bulbs through HomeKit. HomeKit said there was an update and I needed to download the app to install it. Get the app, open it, get told to pair my bulbs again. Hit ‘skip’ get a warning that I need to pair a device first. Try to pair a bulb again and get an infinite wait spinner. Hit the skip button again and my bulbs are already listed. \n\nThe boxes for the bulbs also open from the bottom instead of the top like every other product in existence.","updated":"2021-12-16T10:49:30-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7569421495","userName":"HollyKitten","userUrl":"https://itunes.apple.com/us/reviews/id422295282","version":"6.0.0","score":1,"title":"😭🤦🏼‍♀️waste","text":"With the amount of times I have to reconnect this thing almost evertime it’s used has been a HUGE pain in the @**! Bought 2 sets, owned them for a couple years and never really had tooo many problems (other then they dimly flicker at night) but now they’re more a haste.. can’t even connect them anymore🤦🏼‍♀️\nI’d give no stars if I could.. complete waste of money-it would even pair-literally dumped money into fancy white light triangles\n🤦🏼‍♀️🔥💰","updated":"2021-07-12T14:53:46-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5328323615","userName":"ditkaman","userUrl":"https://itunes.apple.com/us/reviews/id17698227","version":"4.0.1","score":5,"title":"Setup","text":"Lights look nice, setup is a chore. It looks for the lights to pair but never finds them. I’ve done the factory reset, the softy reset. The app just seems broken. I have LIFX light bulbs in my house and set them up in seconds. I’m on hour two of trying to pair these Canvas lights.","updated":"2019-12-27T17:01:17-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7641149666","userName":"12jfg","userUrl":"https://itunes.apple.com/us/reviews/id1314977131","version":"6.0.0","score":2,"title":"Terrible app","text":"One of the worst apps I have ever used. Constantly loses connection to device, resets or complete deletes my alarms randomly. There is no consistency with this. Not to mention the lag between modes when the app finally works properly. The actual hardware is phenomenal and the color spectrum is beautiful so I do put up with the app for that reason alone. Please update this app to be more efficient","updated":"2021-07-31T20:07:37-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6972123248","userName":"DavidQ1970","userUrl":"https://itunes.apple.com/us/reviews/id43155905","version":"5.2.0","score":1,"title":"Product Is Great-App Has A Major Problem","text":"Let me start by saying I love the Nanoleaf products and I am excited about their future for smart homes. I also rarely use their app because I can control the Nanoleaf devices in the Apple Home app.  Where this app fails, and this is HUGE, is that I cannot get the app to update firmware for the Nanoleaf products. I just keep getting a “Retry” error after a few seconds. You all need to fix this and quickly.","updated":"2021-02-08T21:25:51-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6783781722","userName":"Nobody858","userUrl":"https://itunes.apple.com/us/reviews/id85019768","version":"5.1.2","score":2,"title":"Full Of Bugs","text":"The lights are super cool! Unfortunately, the mobile app was written by a contracting firm that’s hires a bunch of cheap SW engineers who spent a month learning Swift and haven’t got a clue how to write unit tests. \nThe app is a necessary evil to experience the awesome features of the lights. Hopefully, Nanoleaf will eventually take some of their profit and reinvest in to a quality app that takes full advantage of what’s possible with the hardware. Until then, grin and bare it.","updated":"2020-12-22T23:01:54-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6743587725","userName":"salty pikl","userUrl":"https://itunes.apple.com/us/reviews/id422129318","version":"5.1.2","score":3,"title":"Good, but annoying","text":"Now, the lights. 10/10. The app, 5/10. Why does it disconnect so often, you should add a ‘restart’ option. I don’t want to have to delete, and tell the pin, maybe get it to connect to the device when the search for device works every. Single. Day. Or make the pairing 10x easier to do","updated":"2020-12-11T20:00:40-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6664778768","userName":"Nevadaville","userUrl":"https://itunes.apple.com/us/reviews/id25990438","version":"5.1.1","score":1,"title":"Extremely clunky app","text":"It’s as though the app team actually had a meeting and said “how could we make this dysfunctional interface even HARDER to use?” \n\nI have never encountered such a cool product with such a god-awful user interface. Zero ability to accomplish basic tasks. A screen that barely displays any of the necessary information at once and crashes any time you want to edit a color palette. It is absolutely horrendous.","updated":"2020-11-19T19:36:38-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5738269138","userName":"AltrdPrcptn","userUrl":"https://itunes.apple.com/us/reviews/id461505302","version":"4.0.3","score":1,"title":"Doesnt work and customer service is weak","text":"Device won’t link to the app and I reached out to customer service where I received nearly no help. The first response was simple things like resetting the device and trying a hard reset. When neither of those options worked, I was told it’s a firmware problem and my case was closed. I’ve got 15 tiles that haven’t been able to turn on in months. Huge waste of money.","updated":"2020-03-30T18:32:42-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4148557759","userName":"TruckerMike","userUrl":"https://itunes.apple.com/us/reviews/id43986306","version":"3.3.2","score":2,"title":"App has become horribly bugged","text":"I first purchased these about a year ago and everything worked fine. Over time it’s gotten worse and worse. The panels are often unreachable and even when it works it takes a solid minute to connect. Too bad this product used to be good but I can no longer recommend them due to the poorly designed app that just gets worse with time.","updated":"2019-05-14T04:53:55-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3207667506","userName":"webba","userUrl":"https://itunes.apple.com/us/reviews/id29366276","version":"3.0.0","score":5,"title":"Great companion to absolutely stellar hardware","text":"Solid app if a bit rough in some UX spots — took me a couple crashes to realize my panels were lighting up as a download indicator. \n\nDesign function is great. Wish “Add to Favorites” wasn’t defaulted when pushing to HomeKit, but that’s a minor gripe. Ties the whole experience together very well.","updated":"2018-09-19T13:57:19-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6750689353","userName":"julianboolian","userUrl":"https://itunes.apple.com/us/reviews/id631386192","version":"5.1.2","score":2,"title":"App","text":"As for most people here, love my lights but the app is just horrible.\nHad my lights for about 3 weeks now, added them to home kit and fell in love with them.\nAll of a sudden one day went to change my scene and boom, app crashes on open. Restarted my phone, reset my lights, updated my iOS. Removed from Home Kit, every possible fix you could think of.\nEvery time I open the app, even after redownloading 10 times it just crashes.\n\nCan’t even change the color of my lights now that they’re removed from home. I’ve just unplugged them and I’m out like $450 until there’s some sort of fix.\n\nThanks guys,\nHopefully something can come from this.","updated":"2020-12-13T17:27:40-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3689613625","userName":"le_saltimbanque","userUrl":"https://itunes.apple.com/us/reviews/id38902449","version":"3.2.2","score":1,"title":"Worst account creation screen in a long while","text":"Haven’t made it past is yet...\nAnd like many here, I’ve been filling out forms on the internet for a long time now - the app does not tell you at first, their own specific rules for how elaborate they want your id & passwords to be (I have a password manager, and can adapt to anything) but somehow, 15 minutes later, still now way to create an account, now matter how well you jump through their hoops, you still hit a brick wall.\nGreat design...","updated":"2019-01-24T08:50:09-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8140125843","userName":"Reviewed By Again","userUrl":"https://itunes.apple.com/us/reviews/id641413509","version":"7.0.3","score":1,"title":"IMPOSSIBLY BAD","text":"The app is just as bad as the bulbs. Creates multiple random HomeKit homes. Bulbs update 4 at a time and the app has to be restarted multiple times to finish FW updates. 4 out of 30 bulbs were defective right out of the box. Support did NOT want to replace them and made it EXTREMELY difficult to do so. Process took over 5 months and required 27 emails. Have since removed all nanoleaf products from my home. Will NEVER EVER use a nanoleaf product again.","updated":"2021-12-17T08:45:52-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7361568526","userName":"Block1411","userUrl":"https://itunes.apple.com/us/reviews/id1075335512","version":"5.3.0","score":4,"title":"Can We Please Add Landscape Support for iPad?","text":"I use the magic keyboard on my iPad Pro, and this app only works in portrait orientation which makes creating complex scenes for photo shoots a little annoying. It would be nice to interface with the application in landscape using my trackpad.","updated":"2021-05-19T09:14:33-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7960973694","userName":"Justchillinhere","userUrl":"https://itunes.apple.com/us/reviews/id43317734","version":"6.2.0","score":5,"title":"Great products and great service!","text":"I couldn’t be happier with the products or the customer service from Nanoleaf! Absolutely amazing! We have two of their Canvas sets and we love them! Hope to buy more!","updated":"2021-10-27T18:02:56-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6079870224","userName":"Johnny Appleseed's cousin","userUrl":"https://itunes.apple.com/us/reviews/id44011323","version":"4.1.1","score":1,"title":"Please keep working on this.","text":"There have been updates. But there is more to do. The customization and product is amazing. What falls short is this app when it comes to connecting. More than half the time it can find the lights... I have to hard reset the lights and try re-syncing and even that only works sometimes. Nothing more annoying than excellent hardware that’s held back by a buggy/faulty software/app.","updated":"2020-06-15T11:34:39-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5313113350","userName":"Tall-K","userUrl":"https://itunes.apple.com/us/reviews/id174093391","version":"4.0.1","score":1,"title":"Firmware very poor handling","text":"Open the package and Somehow my firmware was not up to date.. I connected my product every way  possible, followed all instruction , rebooted , uninstalled, unplugged and the product would still not pop up a firmware update... emailed company and told me exactly what it says on the website that I already followed.. nothing was solved returning product.  The item is cool but could not connect to the app software this company partners with.","updated":"2019-12-24T04:39:35-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7580645668","userName":"iamtherealtsk","userUrl":"https://itunes.apple.com/us/reviews/id1247026031","version":"6.0.0","score":3,"title":"Needs to be improved","text":"I love the lights! But the app is surprisingly not reliable. Most of the time they are unreachable, and yes I’m in my home. Seems this app needs a serious updateConsidering these luxury lights are luxurious and don’t seem to act that way through the app I’ve had these lights for three years I’m not new to the app","updated":"2021-07-15T14:12:27-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6799599320","userName":"Deadseadooley","userUrl":"https://itunes.apple.com/us/reviews/id148303479","version":"5.1.2","score":1,"title":"Broken","text":"I’m not sure if anyone else has had this problem but I woke up this morning to the app crashing as soon as I open it. It was working fine 2 days ago and now I can’t even get into the app. Im running on the latest version of iOS on my 11pro max and I’m not sure what’s wrong with the app. I even tried reinstalling the app and resetting my phone and nothing has changed. Please see if you can fix it!","updated":"2020-12-27T06:56:10-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5194066578","userName":"dougEzero","userUrl":"https://itunes.apple.com/us/reviews/id111783409","version":"3.5.3","score":2,"title":"Gets worse with every update","text":"Seems like the app gets worse with every update. Originally (about a year ago), the app worked great and without issues. But now, it seems like every update introduces bigger issues. \n\nIt started with intermittent connection issues, but now I can't even get past the logo. Now it locks up when the logo appears.","updated":"2019-11-24T20:32:04-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7950249858","userName":"dstulic","userUrl":"https://itunes.apple.com/us/reviews/id323045194","version":"6.2.0","score":1,"title":"Disappointed","text":"I have 2 sets of light panels. They are few years old. I've hooked them up to my Google home system. They work fine.\nRecently I switched to an iPhone device. iPhone app cannot connect to the light panels. iPhone app requires Apple home sync.\nSo now I'm stuck with lights that can't be updated. I can't load any of the fancy presets from the app. I can do the basic colors via Google home app..\nDisappointing...","updated":"2021-10-24T13:47:07-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7431964274","userName":"AdamL222","userUrl":"https://itunes.apple.com/us/reviews/id459434970","version":"6.0.0","score":5,"title":"One of THE best HomeKit remotes for lights.","text":"This is a great remote for any HomeKit lights. \n\nWorks great for Nanoleaf lights of course.\n\nIt’s super easy to change the color or turn off entire rooms at once, which the default home app can learn from! Simple and easy.","updated":"2021-06-05T21:29:53-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8110054222","userName":"SandSnip3r","userUrl":"https://itunes.apple.com/us/reviews/id119134424","version":"7.0.2","score":4,"title":"Good but needs UI work","text":"In the dashboard, when I only have 1 room, I shouldn't see this larger multi-room view. I have to always go through extra steps. Could you reduce the buttons pressed for the common user use cases?","updated":"2021-12-08T18:59:53-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5598881816","userName":"Deadly_penguin","userUrl":"https://itunes.apple.com/us/reviews/id236628308","version":"4.0.2","score":5,"title":"Good but needs improvement","text":"My nano leaf can’t stay connected to my phone for more than a day. Everytime I come home and I have reset connecting my panel's to my phone and it’s getting annoying","updated":"2020-02-29T16:21:40-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8094198445","userName":"NikoGk","userUrl":"https://itunes.apple.com/us/reviews/id29733920","version":"7.0.2","score":1,"title":"Persistent annoying bug…","text":"This would almost be a perfect five if it weren’t for two persistent bugs regarding scenes and palettes.\n\nA few minutes after creating a scene on an Element device (light strip), the app renames the scenes on its own. For example my Forest scene now say Christmas scene.\n\nAlso, I have yet to find a way to delete a Palette created by a scene after the scene has been deleted. There are no answers on the website or on forums.","updated":"2021-12-04T06:18:58-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7499837059","userName":"KissMy55","userUrl":"https://itunes.apple.com/us/reviews/id1302750123","version":"6.0.0","score":2,"title":"Connectivity","text":"Nanoleaf has been a very prominent company with their light panels, but the fact that they lose connection every day is unbearable. I’d give it 0 stars, but when connected it’s a wonderful app. (And yes I have changed wifi channels, turned on various modes within the router etc etc) still has those connection issues daily.","updated":"2021-06-24T00:59:20-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7179680023","userName":"solo99999","userUrl":"https://itunes.apple.com/us/reviews/id415734744","version":"5.2.2","score":3,"title":"This is the most confusing app I have","text":"No hardware issues but the app albeit being pretty is not logical. I am not sure if the ui was built by engineers but things just don’t make sense. The whole Nanoleaf cloud sync but via iCloud is just bizarre. The functionality is actually all there, its just poorly implemented.","updated":"2021-04-03T10:44:11-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6814395897","userName":"Created for God's glory","userUrl":"https://itunes.apple.com/us/reviews/id109840600","version":"5.1.2","score":3,"title":"Love the product hate the app","text":"Product is great but very limited since the app will not open and crashes each time I try.  Without an app I would not recommend this.\n\nBefore you reply with the canned FAQ language yes, I restarted my iPhone, I reinstalled the app and I made sure I was updated on my iOS.","updated":"2020-12-31T06:22:01-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3392908666","userName":"Rcaps3","userUrl":"https://itunes.apple.com/us/reviews/id274697578","version":"3.1.1","score":1,"title":"I’m beyond P.O.!!","text":"Liked the rhythm edition so much I bought 3 sets. The first set is the only one that allowed me to connect. The other two are unresponsive. I spent 3 1/2 hours yesterday trying to get the panels to work. I factory reset the panels, uninstalled and reinstalled the app, uninstalled and reinstalled apples Home app (because this doody app forces you to connect to Apple Home), reset the WiFi router, reset my phones connection to the WiFi, soft reset the panels, toggled the settings and permissions on my phone - - AND NOTHING!!!","updated":"2018-11-07T17:52:30-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6515156224","userName":"1midtom","userUrl":"https://itunes.apple.com/us/reviews/id354010552","version":"4.1.5","score":4,"title":"They’re great!","text":"Panels are fun and easy to set up! Only complaint is that they will disconnect from the control app every once in a while. This means I have to set it up as a new device every time that happens. Overall I am happy with them.","updated":"2020-10-08T17:09:29-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6725412486","userName":"Tuanster","userUrl":"https://itunes.apple.com/us/reviews/id85871016","version":"5.1.1","score":1,"title":"The app is a critical failure","text":"The app use to be intuitive to use and now it is completely confusing and awful. Did you guys let go of your UX employees or did only programmers make this without running it through a UX test. It’s like the devs who made this don’t use their own product. My panels were once a joy to use. Now I wouldn’t recommend them to anyone. Great product ruined by badly designed app. A shame.","updated":"2020-12-06T17:21:39-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4146397688","userName":"LamboDepot","userUrl":"https://itunes.apple.com/us/reviews/id85253478","version":"3.3.2","score":5,"title":"works just fine for me.","text":"I did have to un-pair and re-pair the panels after a firmware update but otherwise I’ve had zero issues using the app and panels. I was worried after reading the reviews here but it just works fine for me.","updated":"2019-05-13T18:41:14-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5285027468","userName":"wigchop98","userUrl":"https://itunes.apple.com/us/reviews/id540743525","version":"4.0.0","score":2,"title":"AWFUL UPDATE","text":"I never leave reviews. That being said I loved this app and I loved my tiles and playing around with them. However after this last update they made it nearly impossible to create the scenes I want to create. Please go back to the old way that actually makes sense. This new app breaks every rule UI developers are suppose to follow....not for the better.","updated":"2019-12-17T16:11:20-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4508283371","userName":"Elroy66","userUrl":"https://itunes.apple.com/us/reviews/id9844449","version":"3.4.0","score":2,"title":"Great Product","text":"This is one of the best things I’ve purchased for my new home. Put up a 21 light array above my kitchen and it is so much fun. Gets compliments from everyone. My kids and I have dance parties with the sound based settings. When I want to set a mellow mood for a dinner party... done. Don’t bother with a cheap imitation. This is worth the investment. I’m already planning to expand the set or put up another array. Really great product.","updated":"2019-07-23T17:49:41-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6766354487","userName":"byenaqtrbee3","userUrl":"https://itunes.apple.com/us/reviews/id938235780","version":"5.1.2","score":2,"title":"Cant connect light panels to app","text":"I just bought these nice lighting extensions to give my room a theme which suits my likings. I downloaded this app as the box cover suggested and tried to pair it with my panels for 1 hour. I have done everything like rebooting and turning the power off and on and still the same issue \nI really hope this gets fixed ASAP","updated":"2020-12-18T04:05:31-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6543184373","userName":"CookieZe","userUrl":"https://itunes.apple.com/us/reviews/id471462853","version":"5.0.0","score":1,"title":"Connectivity issues","text":"Again with more connectivity issues. Was terrible when I first got them fixed it by doing something with the channels on my wifi, this update you pushed out broke it again. As soon as I opened the app they stopped working now I can't add them back to the app. They have been out for how long? And y'all still can't get these issues nworked out?","updated":"2020-10-16T19:54:54-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5274424699","userName":"JasePanda","userUrl":"https://itunes.apple.com/us/reviews/id18473394","version":"4.0.0","score":1,"title":"New app is terrible","text":"The user interface just doesn’t work like you want it to. I tried making a new scene and editing colors in the palette, but they don’t actually show in the scene preview. And then I tried making a playlist. It brought me to the Choose Scenes list. I chose the scenes that I wanted. All I could choose was the Back button, and then it backed me out of the Playlist creator. This new app is complete crap.","updated":"2019-12-14T21:31:07-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4005130696","userName":"ashandnoe","userUrl":"https://itunes.apple.com/us/reviews/id983813541","version":"3.3.2","score":3,"title":"Hate and love","text":"I absolutely love this product I love everything that it does BUT the only gripe I have is that the app doesn’t want to connect once closed it’s a hassle to get it back connected. This product would be a 5 start if the app can be fixed, for $200 the app should atleast do the most simplest task and CONNECT! Please fix the app connectivity!","updated":"2019-04-12T18:18:58-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3810804794","userName":"deadeye616","userUrl":"https://itunes.apple.com/us/reviews/id36269936","version":"3.2.2","score":5,"title":"Panels work great, setup can be lengthy and troublesome.","text":"Just got these panels. The app setup was somewhat of an issue, but once everything loaded and synced(which was about 30 minutes or so of trail and error) everything worked great!","updated":"2019-02-24T13:47:58-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7981297154","userName":"ThePenguin888","userUrl":"https://itunes.apple.com/us/reviews/id206838970","version":"7.0.0","score":2,"title":"Unstable and Poor User Experience","text":"This app started off clean and simple, but over the last year the UI changes have made it messy and confusing. Nowadays I only use this app to turn the panels on/off. \n\nOn each update, I lose connection to my panels and have to spend a day reconnecting it to my other smart devices like Alexa.","updated":"2021-11-02T08:01:38-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5368662845","userName":"Cole jenkins","userUrl":"https://itunes.apple.com/us/reviews/id371445536","version":"4.0.1","score":4,"title":"Fix this bug","text":"Lately it’s stuck at the screen saying select your home and it’s selected but I can’t leave the screen. So In turn I can’t edit or add any news scenes.","updated":"2020-01-06T07:45:37-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6443894396","userName":"<sammy15>","userUrl":"https://itunes.apple.com/us/reviews/id217376706","version":"4.1.4","score":5,"title":"Cool Lights!","text":"I love my nanoleafs, yeah there is definitely glitchiness with the app and connectivity, but it’s not over baring. I did notice after updating to iOS14 it severed the connection to my lights. Nanoleaf may need to add functionality to the new software.","updated":"2020-09-18T19:55:57-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5273288606","userName":"Nate591","userUrl":"https://itunes.apple.com/us/reviews/id41978576","version":"4.0.0","score":5,"title":"Hard to access scenes now","text":"The old default home screen was infinitely better. It’s hard to pull up the scene you want with the new update.","updated":"2019-12-14T14:09:15-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5122174537","userName":"MSC531","userUrl":"https://itunes.apple.com/us/reviews/id41116543","version":"3.5.3","score":5,"title":"Much better NOW","text":"Started out as a bit of a hot mess, however, patience has been rewarded and both system and software both work well now.","updated":"2019-11-11T00:06:09-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3771327008","userName":"scizzorhands","userUrl":"https://itunes.apple.com/us/reviews/id40640629","version":"3.2.2","score":1,"title":"What’s up nano leaf???","text":"Are you ever going to fix this ongoing issue since the 3.0 update. Seriously, go backwards. App was fine before you updated it. We spent money on 30 panels. Can someone get this fixed. You started out with a good product. Would hate to see you guys lose your business. Leaving a negative experience with user interaction is very damaging to your future as a company. You are losing your edge and losing trust from the customer.","updated":"2019-02-14T22:18:19-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8046186935","userName":"Jakemd13","userUrl":"https://itunes.apple.com/us/reviews/id250013692","version":"7.0.1","score":3,"title":"Honestly pretty buggy.","text":"I have very good and reliable internet, so I can confidently say that the Nanoleaf lights are semi-reliable. I’ve had them for awhile now and definitely enjoy them aesthetically but the connect issues are starting to both me quite a bit.","updated":"2021-11-20T19:32:54-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7284516937","userName":"mountainlifeShizzy","userUrl":"https://itunes.apple.com/us/reviews/id550605716","version":"5.3.0","score":5,"title":"Been using it 6 months","text":"I use it every day. I love it.\nI encourage you to make your own colors. \nIt’s hard to find just what you’re looking for. \nMany of the pre made ones were jarring. \nIt also takes a bit to figure out how to make what you expected to make. \nI made one called “Sky” by tiny_flower_979.\nIt’s just what I was looking for. \nI think you can only find that by making your own.","updated":"2021-05-01T03:48:10-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6562194037","userName":"claymus","userUrl":"https://itunes.apple.com/us/reviews/id29578951","version":"5.0.0","score":3,"title":"A few glitches","text":"Seems to have a hard time pairing with Alexia - device is unresponsive, and can’t seem to add my daughter as another user even after sending a invite. Would love to be able to have both of us use this. Help.","updated":"2020-10-22T07:33:37-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5412609049","userName":"Popo koko guy","userUrl":"https://itunes.apple.com/us/reviews/id143195837","version":"4.0.2","score":1,"title":"Terrible product and terrible UI on the app","text":"If you just recently purchased nanoleafs I recommend to return them to the store immediately. This product has never worked properly. I have to deal with resetting the product weekly. Terrible product if I could buy all the nanoleafs in the world I would throw them in a fire because they are worthless","updated":"2020-01-16T16:12:25-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5199581988","userName":"👿👿😈👿😈👿👿👿","userUrl":"https://itunes.apple.com/us/reviews/id430013833","version":"3.5.3","score":2,"title":"Buggy","text":"This is a fantastic product, I personally love it but there is one slight issue. If you ever switch your wifi on the device that controls the light to a different WiFi, in my experience gives a chance for the lights to stop working entirely. If this was fixed I would give it five stars.","updated":"2019-11-26T06:07:04-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7272054103","userName":"Brett_Bartlett","userUrl":"https://itunes.apple.com/us/reviews/id1283792637","version":"5.3.0","score":5,"title":"Amazing product","text":"My wife got me these as an anniversary gift and I couldn't  be happier! They look stunning and were easy to set up! 10/10","updated":"2021-04-27T20:05:13-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6749475381","userName":"eafzali","userUrl":"https://itunes.apple.com/us/reviews/id87256889","version":"5.1.2","score":1,"title":"Buggy buggy buggy","text":"Horrible update. I can’t find anything in the app anymore. My remote keeps unpairing with my panels. I can even find in the app where to pair them again for 100th time, and then remove the the stupid random scene assignments on them every single time. \nAnd it keeps messing my HomeKit scenes and setting. I think I just gonna throw all my Nanoleaf stuff out my window for good.","updated":"2020-12-13T09:00:16-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6636326215","userName":"KSteel98K","userUrl":"https://itunes.apple.com/us/reviews/id471453976","version":"5.1.0","score":2,"title":"Terrible App Update","text":"I’m not sure who thought this update was good but they need to undo it! It’s messy, cluttered, disorganized and a pain. Nothing makes sense. Why?? Loved my Aurora, never had an issue. Until this update. Now it doesn’t switch scenes anymore automatically. Please put it back. I don’t need all my HomeKit stuff in your app. Just Nanoleaf.","updated":"2020-11-12T02:32:21-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8067319336","userName":"Archie Norris","userUrl":"https://itunes.apple.com/us/reviews/id143346976","version":"7.0.2","score":1,"title":"Sharpie?","text":"Barcode Scanning is near to  impossible, please invest in some better ink. Took me hours to figure out what the problem was but nothing a sharpie won’t fix. Good luck to the next. Try my little trick. You have to be very precise though good luck.  P.S don’t even try the Bluetooth scanning that’s never worked for any Apple products at the watch and the AirPods , good luck once again.","updated":"2021-11-26T18:55:40-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6637893413","userName":"Artis_H","userUrl":"https://itunes.apple.com/us/reviews/id123645640","version":"5.1.0","score":1,"title":"Latest update broke connection","text":"Lights had been working fine for almost 2 yrs after a bumpy and unsupported initial set up.  Then out of the blue, I open my devices to turn on the lights and a new app update is forcing me to sign in and repair everything.  Annoying but fine....wait... nope, can’t actually reconnect to the lights.  The panels work but the app won’t cooperate on phone or iPad.","updated":"2020-11-12T11:46:50-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6917186765","userName":"YourBuddyLucas","userUrl":"https://itunes.apple.com/us/reviews/id1237119645","version":"5.1.4","score":2,"title":"Panels are great, app is HORRIBLE","text":"I have never felt such a polarizing way about a single product. I love my nanoleaf panels and I think they look great. However, pairing them and having the app work is a legit nightmare. Such a garbage experience that always takes far longer than it should just for a subpar app once you get in there.","updated":"2021-01-26T14:31:08-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6647224775","userName":"MeloMcFLY","userUrl":"https://itunes.apple.com/us/reviews/id49536455","version":"5.1.0","score":5,"title":"Love These Light Panels","text":"New app update works fine for me. If it prompts you to reconnect your panels after updating, press ‘skip’. My old settings were still there","updated":"2020-11-15T00:46:34-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5661793187","userName":"rcv2020","userUrl":"https://itunes.apple.com/us/reviews/id897766520","version":"4.0.2","score":5,"title":"Hard to reset and move to other locations","text":"Very time consuming","updated":"2020-03-14T17:27:11-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"2292273463","userName":"JSN Tunes","userUrl":"https://itunes.apple.com/us/reviews/id142288293","version":"2.2.6","score":5,"title":"Amazing Product !","text":"The Nanoleaf Panels are Amazing !  They are bright, saturate, flexible, interesting lighting and decor for any living space. They are literally plug and play, if you follow the directions. Work easily with HomeKit and Siri. The Rhythm Module translates your music into a variety of visual delights.","updated":"2018-03-10T13:41:32-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8108245132","userName":"Zeric from Grindr","userUrl":"https://itunes.apple.com/us/reviews/id295655358","version":"7.0.2","score":5,"title":"Best lights ever","text":"I’ve never instantly loved a product so fast… and the fact that I can add to it at any time 😻😻😻 absolutely amazing, and super user friendly","updated":"2021-12-08T06:28:58-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8041445556","userName":"Krisrose711","userUrl":"https://itunes.apple.com/us/reviews/id262528363","version":"7.0.1","score":5,"title":"App won’t open","text":"I love this app! But, I guess since the update, I cannot open it. It just loads and loads and loads. Any ideas how I can fix this?","updated":"2021-11-19T12:26:50-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6971472882","userName":"C63AMG 507","userUrl":"https://itunes.apple.com/us/reviews/id33436818","version":"5.2.0","score":3,"title":"Can’t install new update 1.4.29","text":"I have tried to install the new update number 1.4.29 without success. Any help will be appreciated.  I have 4 nano leaf essence e19 bulbs. They respond fast and are reliable using Siri and HomeKit. I also have 4 iPod nano’s through the house and at close distance of the bulbs.","updated":"2021-02-08T17:16:17-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6547129420","userName":"Tumble Dry","userUrl":"https://itunes.apple.com/us/reviews/id35559022","version":"5.0.0","score":3,"title":"What the hell is this update?","text":"I’ve had Nanoleaf lights since the company came on the scene and invested thousands of dollars. This update is the worst. I can’t do anything   Can’t program new scenes. Can’t edit existing scenes. I’ve gone from a fabulous art piece to a wall sized flash light.","updated":"2020-10-17T23:22:39-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4648603056","userName":"mlujan27","userUrl":"https://itunes.apple.com/us/reviews/id448760014","version":"3.4.1","score":5,"title":"Capability","text":"Only wish the device also with 5GHz. I have to toggle between both 2.4 and 5 just to use the lights and some times I have to reset them all together","updated":"2019-08-21T00:02:17-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7886388479","userName":"zbeckman","userUrl":"https://itunes.apple.com/us/reviews/id32888964","version":"6.2.0","score":2,"title":"Buggy","text":"So buggy. Interface makes little or no sense. Try to schedule something, app tells you to add some devices. Click the plus to add some devices, it says it can’t. And I already have 15 devices in the app. Bugs bugs bugs. Almost, but not quite, useless app.","updated":"2021-10-06T19:09:42-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4863919885","userName":"ZEROs0000","userUrl":"https://itunes.apple.com/us/reviews/id519185681","version":"3.5.0","score":1,"title":"Trash","text":"Will not allow me to delete panels, will not download new panels for me. Rhythm does not work and plugging my auxiliary cable into it so it syncs with music doesn’t work. Takes about 5 minutes to load the app which is inconvenient when I want to turn it off at night; sometimes it won’t even allow me to turn it off at night even when I ‘tapped’ to turn it off.","updated":"2019-09-30T00:47:02-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7335322894","userName":"racke88","userUrl":"https://itunes.apple.com/us/reviews/id86196162","version":"5.3.0","score":2,"title":"Worked well I could beginning I have become super glitchy","text":"I can get the nano leaf to connect to my network and it works fine until I leave the app next time I come into the app there once again unreachable. I’ve done this multiple times with no success.","updated":"2021-05-13T15:54:14-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5273039010","userName":"Expedy","userUrl":"https://itunes.apple.com/us/reviews/id39765880","version":"4.0.0","score":5,"title":"Update FAILS","text":"Nothing much works since update. Signing in says I don’t have an account.  Tutorial crashes...could go on and on...","updated":"2019-12-14T12:26:48-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8094774800","userName":"miah_moore","userUrl":"https://itunes.apple.com/us/reviews/id26118067","version":"7.0.2","score":1,"title":"Can’t control “Essential” Light Bulbs","text":"I’ve had these for a bout a week. Turned them off with Siri when I went to bed last night, this morning I can’t control the lights. I just see a spinning circle in the app, says “updating” in Home app. I factory reset each light, deleted and RE downloaded the app, restarted my router. Nothing works, just normal light bulbs now.","updated":"2021-12-04T09:22:27-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8023902001","userName":"D12341102","userUrl":"https://itunes.apple.com/us/reviews/id1228793988","version":"7.0.0","score":2,"title":"They just stopped connecting","text":"They just randomly stopped connecting to my network and HomeKit. I tried to reset but keep getting a message saying they’re unable to connect to HomeKit. These are way too expensive for me to have connection issues likes this.","updated":"2021-11-14T09:25:01-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6622859619","userName":"claystation","userUrl":"https://itunes.apple.com/us/reviews/id37832819","version":"5.0.0","score":1,"title":"Nanoleaf Remote","text":"I purchased the Nanoleaf remote to activate HomeKit scenes and devices. Which works well some of the time, but not constant enough to justify keeping it. The problem maybe the remotes firmware which I have spent hours trying to update. I have tried everything I have researched online to get it to update but I think it is time to give in and return it.","updated":"2020-11-08T08:09:38-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6497621495","userName":"Godxavier","userUrl":"https://itunes.apple.com/us/reviews/id108866977","version":"4.1.5","score":1,"title":"Hardly works","text":"I can never turn on the app with the confidence that everything will work the way it’s supposed to work. Majority of the time the app never recognizes the panels. I just end up flipping the remote over for it to turn on. (I change my phone to 2.4ghz before launching the app)\n\nAlso the app layout has been made worse.","updated":"2020-10-03T17:03:32-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5718626406","userName":"Obscenile","userUrl":"https://itunes.apple.com/us/reviews/id499791856","version":"4.0.3","score":2,"title":"App is glitchy","text":"The panels are great, the app is horrifically bad. Almost never starts correctly and leaves me looking at the splash screen for minutes before the app itself loads. App crashes often, unresponsive. They really need to work this out because it has been like this for years","updated":"2020-03-26T18:06:21-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5280329536","userName":"TacidBlue","userUrl":"https://itunes.apple.com/us/reviews/id10103851","version":"4.0.0","score":3,"title":"The app is not as good as it should be.","text":"Syncing the panels to the app is somewhat hit and miss. Like today, why don’t I have my control panel? That is because, somehow, it became unpaired. No power outage, nothing!   Lighting is great but the software is not. Don’t push an update that causes things to be unpaired.","updated":"2019-12-16T09:12:07-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5982086667","userName":"Artista2104","userUrl":"https://itunes.apple.com/us/reviews/id531074180","version":"4.0.5","score":1,"title":"Doesn’t work","text":"For as many cheap things out there with apps that are functional it’s really annoying for something like this which is not cheap to also not have a functioning app. You just can’t connect to anything, I’m sure the panels are cool if they work but that’s a big if. Just fix your app, it’s really not that hard","updated":"2020-05-22T21:42:12-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5524051586","userName":"elekzbua","userUrl":"https://itunes.apple.com/us/reviews/id205791812","version":"4.0.2","score":1,"title":"Was great until it stopped","text":"This thing won’t stay connected to my WiFi for more than 10 min at a time. Then it won’t show up as detectable for 30 min. I followed all the soft resets and hard resets and network resets, deleting and downloading the app, toggling WiFi, resetting phone and nothing. Can’t even connect to panels to check for firmware update.","updated":"2020-02-12T20:39:52-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3442341585","userName":"475876","userUrl":"https://itunes.apple.com/us/reviews/id583517137","version":"3.1.1","score":4,"title":"Ema","text":"My device doesn’t give me very many problems I was only logged out once and now I need an update but I can’t get to the update so I can’t use mine right now but other than that mine works all the time.","updated":"2018-11-20T23:13:59-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6067751449","userName":"ndw dnakjsns","userUrl":"https://itunes.apple.com/us/reviews/id756070324","version":"4.1.1","score":4,"title":"Good, not great","text":"5 stars when working as intended. There seems to be connectivity issues where it just won’t turn on or be responsive at all.","updated":"2020-06-12T10:59:26-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7919682631","userName":"nano garbage","userUrl":"https://itunes.apple.com/us/reviews/id31760424","version":"6.2.0","score":1,"title":"App is non functional garbage","text":"I swear all these apps wanna control ALL the lights in your house but this app can’t even control the lights it was made for, I’m constantly resetting the lights, unplugging, replugging and MAYBE it works for a month or two and then forgets those lights ever existed as it tries to then control my hue bulbs, for the cost of these lights, they are terrible,…look elsewhere","updated":"2021-10-15T22:29:31-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7177676304","userName":"Fateskarma","userUrl":"https://itunes.apple.com/us/reviews/id365493505","version":"5.2.2","score":2,"title":"Good app, too bad it’s only for some stuff","text":"I think the app is great. What I don’t understand is why nanoleaf released a bunch of other products that you can’t even download scenes with. I purchased some bulbs and the strips and am unable to get scenes to work with either of them. Please fix this!","updated":"2021-04-02T23:24:58-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6445649015","userName":"whecncf","userUrl":"https://itunes.apple.com/us/reviews/id902753178","version":"4.1.4","score":3,"title":"50/50","text":"This app is great when it works but it doesn’t always work. Spending 200 dollars on led panels and the app works 50% of the time is very discouraging. If this app would work 100%of the time it would be a 5 star, but they don’t always work.","updated":"2020-09-19T07:40:28-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6580769959","userName":"@@@@@@@@----","userUrl":"https://itunes.apple.com/us/reviews/id253566636","version":"5.0.0","score":1,"title":"Garbage app","text":"The actual panels are awesome, but seeing how the starter kit is 200$ You would think they could build an app that didn’t crash constantly. I’ve had my new shape panels for about 45 minutes and I want to throw them out the window because of how buggy and broken this app is. Fix the app or no one is going to use this garbage.","updated":"2020-10-27T14:38:47-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6866284543","userName":"beeeeechuuuu","userUrl":"https://itunes.apple.com/us/reviews/id1121345109","version":"5.1.4","score":5,"title":"Great product","text":"Looks soooo good in my room!!\n\nPlease keep this updated so we can have the full and best use of this awesome device!","updated":"2021-01-13T13:47:23-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5192056143","userName":"kev838364","userUrl":"https://itunes.apple.com/us/reviews/id175407120","version":"3.5.3","score":1,"title":"Constantly unresponsive, frustrating","text":"I like my lights but this app almost always has issues connecting. It is super frustrating because my leaves are the main light in my room, so when they don’t connect 50% of the time I am constantly walking through the dark to manually turn them on","updated":"2019-11-24T08:47:37-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3444322309","userName":"cjboffoli","userUrl":"https://itunes.apple.com/us/reviews/id40576279","version":"3.1.1","score":1,"title":"Overpriced junk","text":"Don’t waste your time and money on these way overpriced colored lights and their crappy app. This product was a huge disappointment. Never really worked right. Kept disconnecting and requiring setups. Even when they worked they were underwhelming. The tech support couldn’t be more arrogant and unconcerned. I could not wait to dump these and will never buy another Nanoleaf product. Good riddance.","updated":"2018-11-21T11:12:32-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5789439857","userName":"OMNIVISIONELITE","userUrl":"https://itunes.apple.com/us/reviews/id101473294","version":"4.0.4","score":2,"title":"Wish the scene changes actually worked","text":"Was great until the last update. Now I cant change scenes anymore with the voice commands. Use to work perfect. Every update seems to get worse. Hopefully someone from the team can respond and help me.","updated":"2020-04-09T22:49:48-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6902298137","userName":"jenkins_kent","userUrl":"https://itunes.apple.com/us/reviews/id7507701","version":"5.1.4","score":2,"title":"Confusing setup instructions.","text":"Two stars for the instruction, “if you are having problems you can always soft reset the Controller (sic)”. There is no help or link to what this means. \n\nOn top of this, since I had already set up the Nanoleaf, I didn’t have to do it again.","updated":"2021-01-22T19:08:46-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7323652832","userName":"S_B_Moon","userUrl":"https://itunes.apple.com/us/reviews/id24273312","version":"5.3.0","score":1,"title":"App is Garbage","text":"The bulbs are lots of fun but the app is worthless garbage. In order to use it I have to delete the app and reinstall it multiple times a day. This has been reported all over the internet and Nanoleaf just… doesn’t care. I opened a ticket with them which was ignored. It’s bizarre that they can’t be bothered to make their app work.","updated":"2021-05-10T18:46:16-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6796577791","userName":"Gcchfgfgncnc","userUrl":"https://itunes.apple.com/us/reviews/id100663533","version":"5.1.2","score":1,"title":"Good product, abysmal app","text":"This has got to be one of the worst apps I’ve ever had the inconvenience of dealing with in my life. I’ve wasted an upward of 5 hours trying to get it to pair, and finally after I get it past the login screen it takes me to a number pad that is halfway across the screen. Would not buy again","updated":"2020-12-26T11:14:39-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6629431495","userName":"HibachE","userUrl":"https://itunes.apple.com/us/reviews/id483416503","version":"5.0.0","score":1,"title":"App redesign is awful","text":"I genuinely love my Nanoleaf panels but my goodness this recent update to the app has ruined it. It’s no longer easy to set up schedules and control colors and brightness. A bunch of extra touch screen presses that only serves to irritate than be useful. Please revert it back to the old design, or, optimize this iteration and make it more user friendly","updated":"2020-11-10T05:33:41-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5881434910","userName":"starwatcher2904","userUrl":"https://itunes.apple.com/us/reviews/id879229209","version":"4.0.5","score":4,"title":"Update can’t be found","text":"Loved all the colors and scenes but when it said update is available, I can’t find out we’re to go to update the app","updated":"2020-04-29T17:18:49-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8047627498","userName":"Angry Depressed Student","userUrl":"https://itunes.apple.com/us/reviews/id478074313","version":"7.0.1","score":4,"title":"iPad Landscape Mode","text":"The app is great. My only qualm is that when using the iPad version, it only works in portrait mode, which can be an inconvenience when using a keyboard…","updated":"2021-11-21T04:55:08-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"2966760088","userName":"adam.gardea","userUrl":"https://itunes.apple.com/us/reviews/id34388722","version":"2.5.3","score":1,"title":"Beautiful panels, trash app","text":"The light panels are stunning and an absolute conversation starter but this app is absolute garbage. Never works. The layout manager is a joke and half the time, the device is considered unreachable when I’m right next to it. And the colors do not respond. I’ve discovered so many different recipes yet will never see what they look like because one or two colors never appear.","updated":"2018-07-25T04:52:03-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3690733502","userName":"betoesp28","userUrl":"https://itunes.apple.com/us/reviews/id630216923","version":"3.2.2","score":4,"title":"Fix Schedule","text":"The product (Nanoleaf Light Panels) are really good. The app is not so great. When you create a scene it will delete it and have to make it again so it can save. The schedule also does not work.","updated":"2019-01-24T16:44:20-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6678652374","userName":"Brooksc17","userUrl":"https://itunes.apple.com/us/reviews/id30650516","version":"5.1.1","score":2,"title":"Clunky","text":"The app has some work to become more efficient. Doesn’t respond to turning off the lights in a room. Not very intuitive as to how to do something (like downloading a scene). I can see it being something fun and easy to navigate, but this one ain’t it","updated":"2020-11-23T14:55:55-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6242047019","userName":"CRINGY PICKLE","userUrl":"https://itunes.apple.com/us/reviews/id604578590","version":"4.1.3","score":3,"title":"great lights but app barley works","text":"the lights are great and there’s nothing wrong with them but the app doesn't always work. The app will always say it’s not connected but sometimes it works sometimes it doesn't","updated":"2020-07-25T17:53:11-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5328146086","userName":"JB Holidays","userUrl":"https://itunes.apple.com/us/reviews/id1115383633","version":"4.0.1","score":5,"title":"Must get this app.","text":"I just can’t believe how awesome the nanoleafs and the nanoleafs app is. This is so cool! Works perfectly fine. This, is a must buy product","updated":"2019-12-27T15:55:09-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5272553319","userName":"Echovald","userUrl":"https://itunes.apple.com/us/reviews/id199710561","version":"4.0.0","score":1,"title":"The new app design is horrible","text":"The old app design at least let you change your nanoleaf individually. The new design is so bad you can’t even do that without creating a group and scene. What the heck? Used to love nanoleaf and was planning on getting more but with an impossible to use app, I’m not longer planning on getting more panels.","updated":"2019-12-14T09:30:42-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7708330940","userName":"how embarrassing","userUrl":"https://itunes.apple.com/us/reviews/id1308449218","version":"6.1.0","score":1,"title":"Poorly Designed","text":"This app doesn’t function 95% of the time. The desktop app is somehow even worse.  Don’t bother spending hundreds of dollars on nano leaf panels because you will not even be able to use them. This app is by far the most poorly designed app I’ve ever had the misfortune of using.","updated":"2021-08-18T14:06:30-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7132641030","userName":"Tony Kruse","userUrl":"https://itunes.apple.com/us/reviews/id85818035","version":"5.2.2","score":1,"title":"Pretty lights, app is terrible","text":"The app works for me like 20 percent of the time. Changed internet providers so had to do a hard reset. Followed the video from Nanoleaf online. Now it doesn’t work. And when I try to delete the device for another reset, it’s just sits there with “deleting” on the screen. So displeased with the app.....","updated":"2021-03-22T12:12:13-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"1996022452","userName":"Nxkejlendlznd'x'","userUrl":"https://itunes.apple.com/us/reviews/id516629888","version":"2.1.8","score":5,"title":"Great","text":"This app is really good to be able to control your smart nanoleaf products. The best think is that they keep on working on the app by adding great stuff to the updates!! Realllyyyy Great !!","updated":"2017-12-14T07:26:30-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8013662987","userName":"qustodio is trash","userUrl":"https://itunes.apple.com/us/reviews/id1160368483","version":"7.0.0","score":1,"title":"waste of money","text":"i’ve had my nanoleaf s for about a year now and i gave up on them a couple months ago. I tried everything, I contacted their customer service and they never work. they don’t pair anymore and just stay white. I don’t even use them anymore. don’t buy the lights","updated":"2021-11-11T13:42:07-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7815951813","userName":"bryan121","userUrl":"https://itunes.apple.com/us/reviews/id27194779","version":"6.1.0","score":1,"title":"Poster child for inscrutable design","text":"A great example of an app that has no text clearly indicating what buttons do, but only vague icons so you have to press each one to figure out what it does. Everything constantly shifts around so it’s difficult to do that. It used to be better and I absolutely hate using it","updated":"2021-09-17T08:45:04-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5585724210","userName":"ajroch","userUrl":"https://itunes.apple.com/us/reviews/id391648985","version":"4.0.2","score":5,"title":"I’ve never written a review before in my life","text":"I’ve never written a review before in my life and I chose to for your panels that’s how wicked cool they are.  I want 1000.   Dreams.....","updated":"2020-02-26T20:55:11-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5363395989","userName":"huyemp","userUrl":"https://itunes.apple.com/us/reviews/id600745348","version":"4.0.1","score":1,"title":"Barely works","text":"Barely works without having to climb up on the wall and manually use it. Getting this thing to connect is an absolute nightmare for the price. If it wasn’t too late to return it, I would. Their customer support doesn’t really appear to care, if I could do it again, I’d save my money","updated":"2020-01-05T01:22:21-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8056442580","userName":"ibigmike","userUrl":"https://itunes.apple.com/us/reviews/id32942837","version":"7.0.2","score":2,"title":"A hassle to manage","text":"They’re great when you set them up, but the scenes are an absolute nightmare to manage. Why should I have to rename scenes after every change? This whole app UI could use several good design improvements.","updated":"2021-11-23T17:24:28-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5871127478","userName":"KalibS1376","userUrl":"https://itunes.apple.com/us/reviews/id831787753","version":"4.0.5","score":1,"title":"Horrible app","text":"Works for a few hours then disconnects. I’ve tried all troubleshooting options zero work. Just have to delete the app then reinstall and start all over. It will stay connected for a few hours then is shot. The app ruins the lights. Wish I wouldn’t have bought them","updated":"2020-04-27T07:55:07-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5849212850","userName":"hdhshdhdhxch","userUrl":"https://itunes.apple.com/us/reviews/id894075566","version":"4.0.5","score":5,"title":"Great lights","text":"They are big and bright and brilliant. Once you stick it it’s hard to take off but these lights are amazing idufhcjdnx","updated":"2020-04-22T11:07:43-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5269671506","userName":"Miscn","userUrl":"https://itunes.apple.com/us/reviews/id3592327","version":"4.0.0","score":1,"title":"Horrible","text":"New update is the worse. I’ve always had issues with the app and have had to do hard resets in the past, but this new updates is the worse. Have tried deleting the apps and settings multiple times now and still won’t work. Get it together Nanoleaf!!!","updated":"2019-12-13T18:09:12-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5265718526","userName":"metalfan83","userUrl":"https://itunes.apple.com/us/reviews/id37108044","version":"4.0.0","score":1,"title":"Most recent update is garbage","text":"I had about twelve or so scenes saved for my canvas. I updated it and they'll all deleted. Dashboard is confusing. Creating scenes is confusing. Finding scenes that were downloaded is confusing. This update ruined the simplicity of this previously loved device. Please fix this useless update","updated":"2019-12-12T17:54:16-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4678239375","userName":"situatuoo","userUrl":"https://itunes.apple.com/us/reviews/id111809842","version":"3.4.1","score":3,"title":"Product good. App is junk","text":"The product is awesome. Vibrant, bright and cool motions make these lights a great addition to any home. Unfortunately, the app has a hard time connecting for me. I’ve had to reset it several times and still doesn’t work.","updated":"2019-08-26T11:00:42-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3609656372","userName":"Cal Buzz","userUrl":"https://itunes.apple.com/us/reviews/id216586955","version":"3.2.1","score":4,"title":"Takes Time","text":"I just got a Rhythm kit of Nanoleaf and am really impressed!  The only issue I have is the app is a bit confusing for custom setting the lights yourself. In time I’m sure I’ll get better at it.","updated":"2019-01-03T19:46:31-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8081177263","userName":"PeterDrier","userUrl":"https://itunes.apple.com/us/reviews/id13190030","version":"7.0.2","score":2,"title":"Buggy app, poor experience for the price","text":"Spending a few hundred on some light panels should come with a relatively good experience. \n\nMore hours than I care to count later, my panels have upgraded themselves to a version (6.0.5) which doesn’t even exist in the release notes. \n\nIf I try to preview a new scene, it freezes so bad I have to delete/soft reset/add it back to the WiFi just to make it usable again. \n\nDecent idea, lights are pretty, the software is certainly the weakest link here. Sad.","updated":"2021-11-30T14:18:38-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6595488220","userName":"bowlendown","userUrl":"https://itunes.apple.com/us/reviews/id35857438","version":"5.0.0","score":2,"title":"Expensive and not smart.","text":"App and lights break down more than my car. \n\nInstalled a Halloween light setting and the app stopped working and every time I open the app it just re-closes. Had to shut it down and restart. \n\nA number of other people have had issues getting the thing to pair to their phone and other  devices.\n\nFinely got it to work for a few minutes before it somehow lost connection again.  Nice lights but the software just doesn’t work.","updated":"2020-10-31T17:25:43-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3540883353","userName":"xuanvuz","userUrl":"https://itunes.apple.com/us/reviews/id131848554","version":"3.2.0","score":4,"title":"Apple watch app or widget","text":"Please add an Apple Watch or iPhone Widget. I'd like to be able to at least turn the light on/off or so some basic scene changes without opening the nanoleaf app on the phone. Thanks.","updated":"2018-12-17T03:46:28-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8010597733","userName":"Fiskdgs","userUrl":"https://itunes.apple.com/us/reviews/id368005143","version":"7.0.0","score":1,"title":"Good job complicating a light bulb","text":"I got some nanoleaf bulbs, and with this app it has ridiculously over complicated a simple light. Firmware updates fail, the UI is ugly, and it is designed so that you’ll spend more time managing home appliances than you should. And your personal data gets funneled into their servers for your enjoyment. ZERO STARS.","updated":"2021-11-10T17:36:46-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6754057466","userName":"Skyywalk","userUrl":"https://itunes.apple.com/us/reviews/id33141179","version":"5.1.2","score":5,"title":"Screen Landscape","text":"Love the app and your products but not sure why the app doesn’t support landscape on iPad.","updated":"2020-12-14T16:38:48-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5298445844","userName":"Xtreme56","userUrl":"https://itunes.apple.com/us/reviews/id21830784","version":"4.0.1","score":2,"title":"New UI","text":"The latest update changed the UI layout which it terrible. Why did you do this?\nThis has made navigation useless and hard to locate multiple lighting. Please return the layout back to how it was.","updated":"2019-12-20T21:29:36-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5269075678","userName":"thepbqueen","userUrl":"https://itunes.apple.com/us/reviews/id496070489","version":"4.0.0","score":2,"title":"The lights are cool, but are VERY rarely connected.","text":"I can barely even use the lights because the lights themselves refuse to actually stay connected to our phones. I just want to be able to use the lights considering how expensive they all are. 😭","updated":"2019-12-13T14:18:34-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4508667474","userName":"This Boe","userUrl":"https://itunes.apple.com/us/reviews/id547801467","version":"3.4.0","score":5,"title":"Quality","text":"Worked most the time","updated":"2019-07-23T20:00:45-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7313273450","userName":"Teleted","userUrl":"https://itunes.apple.com/us/reviews/id33121699","version":"5.3.0","score":3,"title":"Not fully accessible for the blind","text":"I wish this app was fully accessible with voiceover. There are so many buttons that simply say button so I have no idea what they do. Disappointing","updated":"2021-05-08T08:38:42-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7259519489","userName":"impulseSV","userUrl":"https://itunes.apple.com/us/reviews/id12616061","version":"5.2.3","score":5,"title":"Thanks!","text":"This thing is totally awesome me and my friends are enjoying it soooooooo much while we’re gaming.  Again, thanks so much it’s soooo cool!","updated":"2021-04-24T11:10:55-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5281271638","userName":"AddieRags","userUrl":"https://itunes.apple.com/us/reviews/id36765750","version":"4.0.0","score":1,"title":"New update is AWFUL","text":"This last update made the app completely unusable and unintuitive. AVOID updating... I can no longer simply find or turn on different scenes and the interface is clunky and confusing. Really disappointed and wish I could revert to the last apps version.","updated":"2019-12-16T15:55:45-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5288623439","userName":"Bajabeetle","userUrl":"https://itunes.apple.com/us/reviews/id8891557","version":"4.0.0","score":4,"title":"Easy to use app","text":"There are a lot of features and possibilities. Pay attention to your network, it MUST BE 2.4ghz or the app and light won’t talk.","updated":"2019-12-18T13:24:28-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6999716815","userName":"Af303562","userUrl":"https://itunes.apple.com/us/reviews/id1255233788","version":"5.2.0","score":2,"title":"Neat idea, awful execution","text":"Really liked how these panels looked but they simply aren’t worth the hassle. If the panels somehow get unplugged or lose power, I’m disconnected from the panels permanently and cannot control them without deleting and redownloding the app, completely resetting the panels.","updated":"2021-02-15T20:48:49-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6559464689","userName":"PhxJay","userUrl":"https://itunes.apple.com/us/reviews/id85781367","version":"5.0.0","score":1,"title":"New version 5 Crashes frequently and can’t edit scenes?","text":"New app version crashes all the time on an iPhone 11 Pro Max.  Also you can no longer edit a scene like the speed or direction or color palette of the running scene?  Why would you remove this important functionality?","updated":"2020-10-21T11:30:55-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5844786597","userName":"Not Clark Kent","userUrl":"https://itunes.apple.com/us/reviews/id405515133","version":"4.0.5","score":1,"title":"Update causing a lot of problems","text":"My nanoleaf have been working fine for over a year, but the past couple days I couldn’t connect and the app wouldn’t load. I did a hard reset and tried reinstalling the app, and now I can’t even create scenes with motions.\nPlease fix this!","updated":"2020-04-21T12:01:04-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4683572734","userName":"mutesheet21","userUrl":"https://itunes.apple.com/us/reviews/id961421947","version":"3.4.1","score":5,"title":"Not user friendly","text":"It took me three hours just to get it connected to my phone but they are dope though","updated":"2019-08-27T18:20:02-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7965186262","userName":"StinkySlinky","userUrl":"https://itunes.apple.com/us/reviews/id41439406","version":"6.2.0","score":1,"title":"Don’t waste your money","text":"Worked great for about 8mo. No response from developers after reporting 2 of their Essential A19 bulbs failed to update firmware. Only 1 of these lights connect consistently with the Home app and this app.  Will looking to get a refund and see about their warranty. Really sorry I spent money on these.","updated":"2021-10-29T00:07:49-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7912601050","userName":"TF0321","userUrl":"https://itunes.apple.com/us/reviews/id281489624","version":"6.2.0","score":3,"title":"Double tab gesture","text":"Double tab gesture was removed in the recent update. It’s a useful function and please bring it back. I use Canvas as the light at entrance and double tap to turn it on/off.","updated":"2021-10-13T22:52:55-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5202393323","userName":"ScreenwriterJeb","userUrl":"https://itunes.apple.com/us/reviews/id24597740","version":"3.5.3","score":1,"title":"Great product in the rare instance that it works. Which is almost never.","text":"Have had less than a year and I’d say it spends about 80% of the time crashed or bugging out.  It constantly disconnects from Alexa or even my own phone.  \n\nSUPER buggy.  Wish I could recommend but honestly I can’t.","updated":"2019-11-26T23:06:19-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4582122061","userName":"Splatfennec","userUrl":"https://itunes.apple.com/us/reviews/id7996193","version":"3.4.1","score":5,"title":"Ok","text":"Would be great if the troubleshooting video or reset directions link worked on their site. Otherwise, they’re really neat!","updated":"2019-08-07T08:26:21-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7582006124","userName":"trainwreck1243","userUrl":"https://itunes.apple.com/us/reviews/id1185400825","version":"6.0.0","score":3,"title":"Fix your product","text":"I wake up in the middle of the night because these turn on, fix it.","updated":"2021-07-15T23:42:48-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6995074880","userName":"Devoooo0","userUrl":"https://itunes.apple.com/us/reviews/id186595830","version":"5.2.0","score":1,"title":"Lights can never stay connected","text":"For lights that depend on an app but can never stay connected and then once they disconnect they can never find the light or else to reconnect just makes the product useless. Customer service only opened from 9-5 Monday-Friday is a joke. Save your money","updated":"2021-02-14T15:49:42-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6801554296","userName":"AdamHog123","userUrl":"https://itunes.apple.com/us/reviews/id202922276","version":"5.1.2","score":5,"title":"Simple yet functional","text":"Easy to navigate and setup. No problems at all. Love it","updated":"2020-12-27T19:02:14-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3798448535","userName":"miss_alli","userUrl":"https://itunes.apple.com/us/reviews/id923713299","version":"3.2.2","score":1,"title":"Completely Useless","text":"This app is useless on iOS. Nothing works and if you try to use their “help” content it has videos that aren’t mobile responsive so you are then directed to click a link for written instructions but of course that page is a 404. Expensive light fixture secured to my wall that I can’t control. Awesome.","updated":"2019-02-21T15:10:40-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8136474446","userName":"rtieder","userUrl":"https://itunes.apple.com/us/reviews/id25766994","version":"7.0.3","score":2,"title":"Don’t waste your money","text":"The bulbs worked all right when I first installed them, but I lost power once and now they do not work as before.  The dim switch now only changes the color.   The bulbs are good. The nano leaf app is horrible","updated":"2021-12-16T07:33:22-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6553447583","userName":"Edgar J.","userUrl":"https://itunes.apple.com/us/reviews/id34248628","version":"5.0.0","score":1,"title":"What the....","text":"The new update is pretty bad. Not because it’s a different UI, but because it now includes all smart lights in my home - I don’t need this clutter. Please add an option to only view Nanoleaf lights. Also, I’m not seeing a tab to just see Rythm scenes, they’re all just mixed in now on the same list.","updated":"2020-10-19T19:18:32-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5267879158","userName":"dwaters12186","userUrl":"https://itunes.apple.com/us/reviews/id43813621","version":"4.0.0","score":1,"title":"Garbage as usual","text":"This new app update is still buggy and barely works. I can’t even access my main light panel screen to make changes to my lights, it’s now stuck on the welcome screen despite my lights showing up in settings. Good job turning an already mediocre app into garbage.","updated":"2019-12-13T06:52:23-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7414274742","userName":"Shrikke","userUrl":"https://itunes.apple.com/us/reviews/id118657172","version":"5.3.1","score":1,"title":"Love the Nanoleaf, hate the app","text":"App is useless now.  I’m so glad I set my scenes up years ago before the app became so bad, useless, confusing and as poorly designed as any app I’ve ever used.\n\nStill no landscape mode for a very expensive set of hardware.\n\nI love my hardware but won’t ever buy any more because of this lame app.","updated":"2021-06-01T08:21:58-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7249609321","userName":"Crimsonw0lf","userUrl":"https://itunes.apple.com/us/reviews/id226670139","version":"5.2.3","score":4,"title":"Great lights","text":"It’s great for lights and awesome graphics the only thing that would be it better if we could use 5G for it","updated":"2021-04-21T21:30:51-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6331899296","userName":"Aden j hernandez","userUrl":"https://itunes.apple.com/us/reviews/id1085313415","version":"4.1.3","score":5,"title":"Awesome","text":"It’s awesome the light work super well and everything is easy to do and it’s not hard to do what u wany with the panels","updated":"2020-08-17T18:35:16-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7831763843","userName":"Cope380","userUrl":"https://itunes.apple.com/us/reviews/id486760687","version":"6.1.0","score":1,"title":"DO NOT BUY","text":"literally nothing but trouble. should be perfect for some $300 lights, but are no better than $20 ones. they may look cool but they seriously never work, connect, or function properly. don’t even get me started on the app. stay far away from nanoleaf","updated":"2021-09-21T20:36:02-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6715127162","userName":"ElinmuskISnotHere838484","userUrl":"https://itunes.apple.com/us/reviews/id394093982","version":"5.1.1","score":1,"title":"Pairing is terrible","text":"Update completely broke my ability to use the nano leaf — impossible to pair. Every single time there is an update I’m stuck for several hours trying to fix my device. They also drastically change their GUI to be unrecognizable. Terrible GUI and terrible pairing.","updated":"2020-12-03T20:35:09-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5297001509","userName":"Shenbob","userUrl":"https://itunes.apple.com/us/reviews/id118264652","version":"4.0.1","score":5,"title":"The fixed the new app","text":"Works great after the fix!","updated":"2019-12-20T12:46:42-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3528014479","userName":"nallen34","userUrl":"https://itunes.apple.com/us/reviews/id428847404","version":"3.2.0","score":1,"title":"Pairing issues","text":"Lights are very cool with the rhythm add on but the app seems pretty useless. I have installed and uninstalled the app several times, reset my phone, updated my phone, reset my router etc. All I wanted was an app to go along with my $200 set of lights which doesn’t seem like a lot to as for. Not to satisfied with the app. But the light are kinda cool.","updated":"2018-12-13T18:19:31-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"2733589210","userName":"S T R ID IE R","userUrl":"https://itunes.apple.com/us/reviews/id135208692","version":"2.5.1","score":5,"title":"Love it!","text":"Not sure why anyone is complaining, app is great and has a lot of customizable options.","updated":"2018-06-20T12:50:28-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4510956417","userName":"Smguardian","userUrl":"https://itunes.apple.com/us/reviews/id42848146","version":"3.4.0","score":2,"title":"Alexa integration is awful","text":"Disconnects frequently, and after the latest update (which I had to factory reset multiple times after) it always turns on to a dark yellow. It has set that color as the default and won't retain settings.","updated":"2019-07-24T08:12:34-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7978304079","userName":"April King","userUrl":"https://itunes.apple.com/us/reviews/id115491256","version":"7.0.0","score":3,"title":"AR broken in layout assistant","text":"The AR function asks for camera permissions and then just never works after that. Very frustrating, as it really helps with a new setup.","updated":"2021-11-01T11:03:24-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"2351360816","userName":"HistoryRider","userUrl":"https://itunes.apple.com/us/reviews/id43348210","version":"2.2.6","score":1,"title":"Not As Advertised","text":"So the lighting is cool but incredibly limited as far as programming. It will not allow you to set them on a timer to turn off. If you use Apple Home Kit, even if you have a timed feature turned off, it will activate anyway.\n\nAlso the “WiFi” adapter loses connection on a regular basis and you have to perform hard resets to connect it back.\n\nI pulled it down because it finally lost connection, even though it was still detected within the app.\n\nSave your money or invest in Philips Hue instead, this is just a stupid gimmick gadget.","updated":"2018-03-27T01:15:23-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7984784234","userName":"wildlyimprobablenick","userUrl":"https://itunes.apple.com/us/reviews/id35366635","version":"7.0.0","score":2,"title":"App needs some love","text":"The UE of the app is slightly below mediocre. Rigid flows and poor placement of icons could be fixed with attention to detail and watching a few subjects use the app. Love the actual product, but please improve the app.","updated":"2021-11-03T08:02:13-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6696202347","userName":"Jahnman28","userUrl":"https://itunes.apple.com/us/reviews/id43362486","version":"5.1.1","score":2,"title":"Unable to update firmware.","text":"Overall very buggy app. Haven’t been able to update any firmware since I bought anything. It’s a shame the hardware is so expensive and this app is so buggy","updated":"2020-11-28T11:14:03-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6108164002","userName":"diyrobot","userUrl":"https://itunes.apple.com/us/reviews/id23832148","version":"4.1.1","score":1,"title":"Poorly arranged","text":"Have to constantly pair hub again but process is difficult and hard to understand in this app.  More concerned with getting me to the store to purchase more product then be able to control my current lights.","updated":"2020-06-22T05:40:11-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5302487488","userName":"Ryguyjoo","userUrl":"https://itunes.apple.com/us/reviews/id104590688","version":"4.0.1","score":1,"title":"App/product don’t work","text":"I’ve used multiple iPhones and nothing seems to get the app to see the lights. HomeKit can’t connect either no matter the listed instructions. After several hours wasted I’m about done with this product.","updated":"2019-12-21T18:33:06-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6296477916","userName":"depressed student.","userUrl":"https://itunes.apple.com/us/reviews/id483769501","version":"4.1.3","score":1,"title":"Meh","text":"When they work it’s amazing but the fact is it is such a hassle it is annoying to connect every single time you leave the app for 20 minutes it’s nothing but difficult don’t recommend","updated":"2020-08-08T16:24:02-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5309050620","userName":"Eighty59","userUrl":"https://itunes.apple.com/us/reviews/id39545311","version":"4.0.1","score":5,"title":"*Edited*","text":"I threw a temper tantrum previously but the developers fixed it -peace has been restored to the kingdom. Thank you!!!","updated":"2019-12-23T07:01:27-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5286320264","userName":"BEn809786","userUrl":"https://itunes.apple.com/us/reviews/id114753152","version":"4.0.0","score":1,"title":"Update RUINED Product","text":"Honestly, this software wasn't even put through a proper beta or they would have caught these glaring issues. \n\nIt would be sad if it weren't so embarrassing for Nanoleaf. If this isn't fixed before the new year, I'm selling all systems and moving on.","updated":"2019-12-18T01:09:36-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5088111932","userName":"Snnsnd","userUrl":"https://itunes.apple.com/us/reviews/id380505750","version":"3.5.3","score":1,"title":"Bad","text":"Constantly updating and doing firmware updates that render the panels unusable.  Now they simply will not connect and the Indicator on the control just stays lit up white.  Do not buy not worth the money always something wrong.  Customer support isn’t much help at all as well.","updated":"2019-11-04T23:10:54-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4972733972","userName":"nickehe","userUrl":"https://itunes.apple.com/us/reviews/id450237840","version":"3.5.2","score":5,"title":"Glitching and I spent 700$","text":"Can’t get it to connect to my phone again, just stopped working","updated":"2019-10-18T22:57:23-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5274840082","userName":"Mothabo","userUrl":"https://itunes.apple.com/us/reviews/id13375960","version":"4.0.0","score":5,"title":"Worst update ever","text":"I can’t find anything anymore...","updated":"2019-12-15T00:12:27-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6669317161","userName":"ronie678","userUrl":"https://itunes.apple.com/us/reviews/id183941144","version":"5.1.1","score":3,"title":"Not updated","text":"A lot of the features just don’t list or work for the new essentials line for the light strip and bulb. This needs to be updated soon!","updated":"2020-11-21T02:15:44-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3945730022","userName":"ishaS17","userUrl":"https://itunes.apple.com/us/reviews/id637650232","version":"3.3.1","score":2,"title":"Keeps getting unpaired","text":"My phone keeps getting unpaired or disconnected from the app and it’s such a pain to set it up again because I’ve to do to hard and soft reset all over again. Wish it was smoother. Love the lights otherwise!","updated":"2019-03-30T03:21:02-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7832094014","userName":"Dudjdndjsmsksmdkdk","userUrl":"https://itunes.apple.com/us/reviews/id34536144","version":"6.1.0","score":1,"title":"Doesn’t work","text":"“Warning: your device will not work. Click here for details. Details: no warnings. Everything is fine. Warning: everything is broken..” If this sounds like your idea of a fun Saturday night please buy these panels.","updated":"2021-09-21T23:16:51-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7764087221","userName":"canyoureadmenow2020","userUrl":"https://itunes.apple.com/us/reviews/id22031148","version":"6.1.0","score":1,"title":"Scheduling","text":"I’m not sure what’s going on but the preview saying you can schedule the lights to turn off and on is not an option that I can find on this app. Only giving one star to get dev attention for this bug fix. Thank you!","updated":"2021-09-02T15:56:57-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6619765058","userName":"taylrbrwr","userUrl":"https://itunes.apple.com/us/reviews/id117141492","version":"5.0.0","score":1,"title":"Only works 1/4 of the time....","text":"Why does this lose connection everytime I open the app? The app crashes and isn’t stable! I spent $400 on this product. It’s ridiculous. I’ve gone through resetting my phone, router, and nanoleaf 3 times. Still nothing...","updated":"2020-11-07T11:16:49-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6096416985","userName":"Heywardjr","userUrl":"https://itunes.apple.com/us/reviews/id29022320","version":"4.1.1","score":5,"title":"Love the light panels!","text":"In this day and age of web conferences, I love having a wall of light behind me at times for fun.","updated":"2020-06-19T08:08:03-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6690585241","userName":"Matthew Daniel","userUrl":"https://itunes.apple.com/us/reviews/id33862603","version":"5.1.1","score":3,"title":"Hate the app like the product","text":"The product is amazing if the app didn’t stop working every three days.","updated":"2020-11-27T00:54:10-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6613171995","userName":"Guarrr","userUrl":"https://itunes.apple.com/us/reviews/id110377277","version":"5.0.0","score":1,"title":"App always crashes","text":"Can’t believe I spent $600 on these lights and I can’t even add the device on the app because the app doesn’t work and crashes when I click add device. Tried uninstalling and restarting my phone, I have an iPhone X btw. Crap.","updated":"2020-11-05T16:29:34-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7096340446","userName":"Rachelelelel","userUrl":"https://itunes.apple.com/us/reviews/id101878869","version":"5.2.1","score":1,"title":"WORST set up process EVER","text":"These flipping lights have caused me more stress and concern than 365 days of quarantine.  Please do not waste $200 on these pieces of crap.  They look cool but they’re SO cheap and they don’t even give you enough pieces to properly set them up.   HORRIFIC business model and customer service.","updated":"2021-03-12T17:49:58-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6846994427","userName":"JayJayXDCool","userUrl":"https://itunes.apple.com/us/reviews/id1034357769","version":"5.1.3","score":3,"title":"it’s nice but","text":"None of the other things on the app work with the light it only works with the touch light i would like the same lights for the A19 lighg","updated":"2021-01-08T15:51:30-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"1914398220","userName":"Seattle Bosque","userUrl":"https://itunes.apple.com/us/reviews/id22024946","version":"2.1.5","score":5,"title":"Amazing!","text":"Really wonderful product, can’t recommend enough.  Looks great, easy to configure, fun home lighting sculpture!!","updated":"2017-11-11T16:52:07-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5468135912","userName":"Presandthea","userUrl":"https://itunes.apple.com/us/reviews/id25019610","version":"4.0.2","score":1,"title":"Sad","text":"Such a great product but what it lacks is simplicity to operate. It’s very complicated to operate it . Still cannot figure out how to synchronize music with it . Also you cannot take it off the wall it will rip off your paint. Make it more simple to control.","updated":"2020-01-30T17:35:37-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"2431551151","userName":"_____fg","userUrl":"https://itunes.apple.com/us/reviews/id195955589","version":"2.3.1","score":2,"title":"Bright","text":"Can't figure out how to set default brightness to NOT 100% which is blinding bright.  You can turn individual sets down but if you change scene it goes right back to max bright.  Really limits rooms we can use this in","updated":"2018-04-16T19:53:26-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6068295294","userName":"J-ninja-Edwards","userUrl":"https://itunes.apple.com/us/reviews/id291916197","version":"4.1.1","score":5,"title":"Nanoleaf for the win","text":"Beautifully accents my computer/game room.  No need for a lamp.  Let Nanoleaf set the mood","updated":"2020-06-12T14:35:37-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6521984556","userName":"Jungleman22","userUrl":"https://itunes.apple.com/us/reviews/id176148009","version":"4.1.5","score":2,"title":"Can not identify?","text":"Nano leaf could not identify the wifi out of the box... it looks cool at first but it’s pretty frustrating not being able to figure out what’s wrong. It just keeps saying can not identify...","updated":"2020-10-10T16:00:47-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"2605841692","userName":"jesky","userUrl":"https://itunes.apple.com/us/reviews/id40655340","version":"2.3.2","score":1,"title":"So... you have to use keychain now?","text":"The last update made it unusable as many others have said. Seems to bug out during setup. It was fine before this. Why did you have to ruin the entire (expensive) product with an app update?","updated":"2018-05-27T20:54:46-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5379108159","userName":"Hang08","userUrl":"https://itunes.apple.com/us/reviews/id202440353","version":"4.0.1","score":2,"title":"Could be better","text":"Love the colors and the light but hate the app. when i try to turn it on, it says “unreachable” when I’m literally right there. & the loading logo, I could careless.","updated":"2020-01-08T20:40:10-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5031789553","userName":"Jonesy974","userUrl":"https://itunes.apple.com/us/reviews/id409302366","version":"3.5.2","score":1,"title":"Broken firmware updates","text":"Idk how people can rate this app highly. Sure the features and customization work, but the firmware updates they keep needlessly pushing out only hurt the products. Latest firmware just bricked my brand new $50 remote for the panels","updated":"2019-10-27T03:14:06-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4583467580","userName":"RSR93","userUrl":"https://itunes.apple.com/us/reviews/id282544243","version":"3.4.1","score":1,"title":"Still doesn’t resolve remote even with the new update.","text":"Prior to the newest update of the app, my Nanoleaf lights somehow became unresponsive when paired with the Alexa app. I ask Alexa to turn them on but she responds by saying “sorry nanoleaf is not responding” but yet they still come on. Is there any way to resolve this bug in the future.","updated":"2019-08-07T15:25:33-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8040723394","userName":"True Vitality","userUrl":"https://itunes.apple.com/us/reviews/id1181385042","version":"7.0.1","score":5,"title":"Ambiance","text":"I like the scenes that I can adjust or download preset schemes for a nice bouquet of light and color.   This is a good app.","updated":"2021-11-19T07:42:32-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5608753226","userName":"Jerks Hans she'd","userUrl":"https://itunes.apple.com/us/reviews/id439466252","version":"4.0.2","score":1,"title":"Bad, don't buy the lights in the first place","text":"The app NEVER works with my lights, it always says that they're unreachable.  I have tried all of the troubleshooting I can find and they still won't respond.  Ridiculously overpriced, regretting my purchase.","updated":"2020-03-02T19:22:24-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6772870307","userName":"musicide","userUrl":"https://itunes.apple.com/us/reviews/id25647626","version":"5.1.2","score":1,"title":"App won’t even stay open anymore","text":"My device and app are both up-to-date, and the app won’t even stay open for more than a second. All of my panels have been rendered dumb single-color lights.","updated":"2020-12-19T20:50:55-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5545400227","userName":"Taino the Panda","userUrl":"https://itunes.apple.com/us/reviews/id575879155","version":"4.0.2","score":1,"title":"Not good","text":"I have issues with the Nanoleaf not responding every so often this will be my 3rd time resetting it in 6 months and I want to buy another one but the bugs are stopping me other then that it’s great when it’s working","updated":"2020-02-17T15:29:08-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6925893274","userName":"average tech joe","userUrl":"https://itunes.apple.com/us/reviews/id409783309","version":"5.1.4","score":2,"title":"A19 Bulbs","text":"Really like the bulbs overall. Just don’t like the response time in HomeKit. Very slow to respond. Also would like to set scenes for for the A19 bulbs as that is not an option in the app for them.","updated":"2021-01-28T16:16:18-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6646574530","userName":"Mr ton ton","userUrl":"https://itunes.apple.com/us/reviews/id324446010","version":"5.1.0","score":1,"title":"This app is total garbage.","text":"The layout assistance crashes a few seconds in, idk how this app keeps getting progressively worse. Nothing has changed in the past years.\n\n1/10 don recommend.","updated":"2020-11-14T20:02:16-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5845148392","userName":"Trshpl7","userUrl":"https://itunes.apple.com/us/reviews/id29817976","version":"4.0.5","score":1,"title":"Bug me for a review, will you?","text":"Make the app ROTATE, at least on an iPad.\n\nAlso, fails in its basic job to update the firmware.  Sees 3.0.8 on 1.6.2 hardware and says \"Up to Date\" even though that's from 2019 and here's the Release Notes that say 3.3.4 from 2020 is the latest.","updated":"2020-04-21T13:55:57-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5174099292","userName":"JYBak5034","userUrl":"https://itunes.apple.com/us/reviews/id768012304","version":"3.5.3","score":1,"title":"Review","text":"This app and the company is the dumbest and the worst company that I have ever seen. Nobody can make something worse than this. I’m pretty sure baby can make these things better than the company. You guys should work harder!!!","updated":"2019-11-20T13:29:06-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5286520819","userName":"Unhappy302","userUrl":"https://itunes.apple.com/us/reviews/id474072253","version":"4.0.0","score":1,"title":"Who is responsible for this update?","text":"How can the function to control the lights be programmed out of the app that is supposed to control the lights?\n\nWho every programmed this and internal have the okay to release this update should be immediately fired.","updated":"2019-12-18T02:26:16-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3365039102","userName":"karloma712","userUrl":"https://itunes.apple.com/us/reviews/id120712313","version":"3.1.0","score":1,"title":"Lights are amazing...the app does not work!","text":"This is a SMART light I shouldn’t have to get up to turn it on. Very simple premise you go to the app and turn on the lights/themes that’s it. The app is never connected to the light. They say if it is on the same internet network it will work....lies.....the app is terrible.","updated":"2018-10-31T06:55:07-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7023192132","userName":"xxy0323","userUrl":"https://itunes.apple.com/us/reviews/id238501562","version":"5.2.0","score":1,"title":"Unable to connect","text":"One day it just quit by itself and I could never got it connected again. Stupid app just can’t find my accessory no matter which way I use. Very disappointed.","updated":"2021-02-21T16:15:04-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6125968064","userName":"Boardis Waxman","userUrl":"https://itunes.apple.com/us/reviews/id4005020","version":"4.1.2","score":5,"title":"Best thing","text":"Easily one of the best things I own!","updated":"2020-06-26T17:47:32-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6508890486","userName":"Djdnfhjrn","userUrl":"https://itunes.apple.com/us/reviews/id539541709","version":"4.1.5","score":2,"title":"Connection","text":"Been an issue since my purchase 2 years ago no difference in software honestly dissatisfied","updated":"2020-10-06T21:37:04-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6164690932","userName":"Mad Pokemon go player","userUrl":"https://itunes.apple.com/us/reviews/id78021358","version":"4.1.2","score":3,"title":"UX can use some work","text":"Downloading new scenes has too many steps and is frustrating.","updated":"2020-07-06T09:00:59-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5324349642","userName":"Falore","userUrl":"https://itunes.apple.com/us/reviews/id224096475","version":"4.0.1","score":1,"title":"Product absolutely awful","text":"No support.   No instructions included.  Parts missing. Have to completely set up entire system each time you use it.  Massive money waste.","updated":"2019-12-26T19:01:57-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3450287730","userName":"Adrian Heur","userUrl":"https://itunes.apple.com/us/reviews/id582353968","version":"3.1.1","score":1,"title":"App doesn’t work","text":"The product is a really good idea; however the app doesn’t work at all. It’s stuck at “error, data sync in progress”. Will be returning the product that I purchased. Shame they don’t work like I want them too. What a $230 disappointment.","updated":"2018-11-23T02:02:38-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6751425386","userName":"Kenkong09","userUrl":"https://itunes.apple.com/us/reviews/id110765319","version":"5.1.2","score":1,"title":"Device Not Found","text":"My Nanoleaf Canvas was fun at first, but I have encountered connectivity issues too many times to love this anymore. It is a headache to connect to now. I don’t know why that is and I’m not the only one with this issue. \n\nPLEASE DO NOT BUY THE CANVAS!!!\nSave your money!","updated":"2020-12-13T23:21:11-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6728578324","userName":"Jmlockness02","userUrl":"https://itunes.apple.com/us/reviews/id214111634","version":"5.1.2","score":1,"title":"Set-up ISSUES","text":"Can’t even enjoy the product because we cannot set up.  Ordered two starter kits, both aren’t working on eero wireless internet....have reset both (soft and hard)...rebooted our router, and still can’t connect.  \n\nBEYOND FRUSTRATING","updated":"2020-12-07T14:58:29-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6642188375","userName":"Amazing App Worth Free","userUrl":"https://itunes.apple.com/us/reviews/id309875956","version":"5.1.0","score":1,"title":"Update erased and disconnected everything","text":"After the most recent update, my lights have disconnected and won’t pair again. Also all of my scenes have disappeared and my lights are unusable. This is incredibly upsetting","updated":"2020-11-13T16:32:05-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5336805493","userName":"Dave2020SD","userUrl":"https://itunes.apple.com/us/reviews/id175033157","version":"4.0.1","score":1,"title":"App doesn't connect","text":"What a terrible app. There's only so many times I  can try to reset and pair this thing. Once it actually works there are some nice patterns. But I haven't actually had scene selection in months.","updated":"2019-12-29T17:58:18-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5502088093","userName":"glyph!","userUrl":"https://itunes.apple.com/us/reviews/id432931490","version":"4.0.2","score":3,"title":"Keeps asking me to write a review when i want to turn on my lightsm","text":"Maybe this will stop it","updated":"2020-02-07T20:55:22-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5323436241","userName":"montaukmonster","userUrl":"https://itunes.apple.com/us/reviews/id37878103","version":"4.0.1","score":1,"title":"Worst app ever","text":"For a company who makes the coolest light panels in the world I am stunned how bad this app is. The app started out bad a few years ago and now this update is even more unintuitive than before. They should look to the Phillips Hue app for simplicity.","updated":"2019-12-26T13:35:04-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3969925132","userName":"JTheJoker27","userUrl":"https://itunes.apple.com/us/reviews/id544209596","version":"3.3.2","score":1,"title":"Yep. This is the app you’re looking for.","text":"Have so much fun trying to figure out how it works, don’t get too attached to your panels, because you won’t stay connected to them for long. Don’t update your panels if you want the ability to use them.","updated":"2019-04-04T14:19:15-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8118915244","userName":"ledrgb","userUrl":"https://itunes.apple.com/us/reviews/id1284512301","version":"7.0.3","score":1,"title":"Not good at all","text":"Who are you guys hiring to improve you app?? A bunch of retarded people I guess. Making everything useless and just annoying. I hate it.  Hire people who actually know what they do. I hate it know","updated":"2021-12-11T07:09:06-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7155634003","userName":"Retro-Classic-Rover","userUrl":"https://itunes.apple.com/us/reviews/id19643764","version":"5.2.2","score":1,"title":"Confusing","text":"This app is terrible. Trying to change settings is confusing. Better off buying something else!","updated":"2021-03-28T11:09:38-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8032383235","userName":"Nebula4476","userUrl":"https://itunes.apple.com/us/reviews/id394562517","version":"7.0.0","score":1,"title":"Never connected","text":"Every time I leave the WiFi it disconnects and have to go to wireless settings and manually make sure WiFi is on channel 1 redicoulously annoying","updated":"2021-11-16T21:59:14-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6878303766","userName":"frjps","userUrl":"https://itunes.apple.com/us/reviews/id27808719","version":"5.1.4","score":1,"title":"Light bulbs not available","text":"Have been trying for several weeks to order the thread light bulbs but no one has them in stock, not even Nanoleaf. Terrible planning on their part. Please don’t blame COVID like everyone else.","updated":"2021-01-16T14:29:17-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6715805675","userName":"I3ullet4UrAss","userUrl":"https://itunes.apple.com/us/reviews/id457252870","version":"5.1.1","score":1,"title":"Trash","text":"Ever since they updated it I can’t connect the app to my lights no matter how much I reset them. They used to work perfectly but now it’s just trashy triangles on my wall that I can’t even use.","updated":"2020-12-04T02:11:24-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6934546662","userName":"Liveforkidcudi","userUrl":"https://itunes.apple.com/us/reviews/id242221755","version":"5.1.4","score":5,"title":"It’s really an essence","text":"Beautiful and easy to set up","updated":"2021-01-30T18:23:29-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6125754137","userName":"TheRival456","userUrl":"https://itunes.apple.com/us/reviews/id692704748","version":"4.1.2","score":5,"title":"Great experience","text":"App is easy to use!","updated":"2020-06-26T16:15:37-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6848089802","userName":"Kubira","userUrl":"https://itunes.apple.com/us/reviews/id43036654","version":"5.1.3","score":1,"title":"Nanoleaf remote is unreliable","text":"Could not get a BRAND NEW Nanoleaf remote to pair with Shapes and after contacting customer service, was given some of the most awkward, basic, backwards fixes I’ve ever encountered. And they wanted of video to boot! No thanks. Returning to store ASAP","updated":"2021-01-08T23:06:54-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6613643577","userName":"TakenApparently","userUrl":"https://itunes.apple.com/us/reviews/id120602021","version":"5.0.0","score":1,"title":"Not worth the money.","text":"Panels are ok but the software is pathetic. Will not let you set a schedule and when you save a scheduled time it does not appear on the app. Fix the app it should not take this long.","updated":"2020-11-05T20:03:58-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5433373598","userName":"florida999999","userUrl":"https://itunes.apple.com/us/reviews/id102354283","version":"4.0.2","score":2,"title":"Doesn’t stay connected","text":"Wish I could give it a 5 but it just doesn’t stay connected","updated":"2020-01-21T20:22:45-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3848156463","userName":"n8thegreatt","userUrl":"https://itunes.apple.com/us/reviews/id266596375","version":"3.2.2","score":3,"title":"Schedules is not working","text":"Not able to save any schedules with new firmware update. Otherwise, the product is great. Will revise to 5 stars once resolved.","updated":"2019-03-05T22:09:10-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7943457269","userName":"Toominator05","userUrl":"https://itunes.apple.com/us/reviews/id555867449","version":"6.2.0","score":1,"title":"So bad","text":"If y’all are gonna charge $160 for lights maybe make your app a little better. Constant issues and just not worth it at all. Child labor could make better lights.","updated":"2021-10-22T18:24:51-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7498033384","userName":"TaWeeni","userUrl":"https://itunes.apple.com/us/reviews/id152867273","version":"6.0.0","score":3,"title":"Omg","text":"I WENT OUT OF TOWN FOR TWO WEESK AND THERE WAS A BLACKOUT. Now I can connect to it anymore I’ve tried everything! But it’s beautiful to look at  even tho I cant make changes","updated":"2021-06-23T11:51:11-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7183636707","userName":"ALRASHED.m","userUrl":"https://itunes.apple.com/us/reviews/id184449204","version":"5.2.2","score":2,"title":"WiFi","text":"It would be much better if it works like LIFX no need to be on the same WiFi so I can change the light","updated":"2021-04-04T11:07:19-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6889421429","userName":"Snicer","userUrl":"https://itunes.apple.com/us/reviews/id33422420","version":"5.1.4","score":1,"title":"Scenes are broken","text":"I can’t download scenes to my light strips. No place to get support. Can’t utilize the light strips fully because of this. Please fix this issue and soon and maybe I’ll change my review.","updated":"2021-01-19T10:46:34-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6633201474","userName":"731345yeamane","userUrl":"https://itunes.apple.com/us/reviews/id389385282","version":"5.1.0","score":2,"title":"Updates","text":"PLEASE STOP UPDATING! Every single update or UI change has broken this app. Now it’s reset my leaves for the 3rd time and I can’t connect them back smh...","updated":"2020-11-11T05:50:38-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6653130972","userName":"People merge","userUrl":"https://itunes.apple.com/us/reviews/id26663514","version":"5.1.0","score":5,"title":"So nice","text":"Very nice products, work great, impeccable customer support","updated":"2020-11-16T13:31:18-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7944223916","userName":"Bav1to","userUrl":"https://itunes.apple.com/us/reviews/id148956369","version":"6.2.0","score":1,"title":"Terrible","text":"Updated the firmware and now cannot connect. This is terrible for an expensive product. How could the software engineers release such an update?","updated":"2021-10-22T23:53:31-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5247433349","userName":"roachlawyer22","userUrl":"https://itunes.apple.com/us/reviews/id43264731","version":"3.5.3","score":5,"title":"Lights lights lights!!!!","text":"Awesome addition to my home!!!! I love it!!!\nJust what I was searching for!","updated":"2019-12-07T23:45:42-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6573361388","userName":"MW3bEaSt23","userUrl":"https://itunes.apple.com/us/reviews/id206906843","version":"5.0.0","score":1,"title":"Horrible update.","text":"Since the 5.0 update, my light panels can’t even be recognized by the app. I want the $800 back that i’ve spent on your product if the software won’t even work...","updated":"2020-10-25T11:04:38-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5281015748","userName":"DblJBird","userUrl":"https://itunes.apple.com/us/reviews/id109864389","version":"4.0.0","score":1,"title":"What happened? Helllooo?!?","text":"Both my wife’s system and mine... poof, gone. \n\nCanvas/Rhtyhm and dozens of other devices disappeared off my dashboard. No seemingly possible way to get them to return. I can go into settings and see them. I was even able to do an update on both the Rhythm and Canvas, but I can’t control them if they disappeared off the dashboard?!?  \n\nAlso states my account doesn’t exist. Perfect. \n\nWhat’s up?","updated":"2019-12-16T14:07:24-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7919650625","userName":"Nate isaman","userUrl":"https://itunes.apple.com/us/reviews/id319362681","version":"6.2.0","score":1,"title":"Unusable","text":"I can’t even pair them anymore. It kept saying undisclovered abs then I tried unpairing and now I can’t use them at all… just fishing for a 200+ dollar product","updated":"2021-10-15T22:15:26-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7669509325","userName":"NerdShowAndTell","userUrl":"https://itunes.apple.com/us/reviews/id958716253","version":"6.0.0","score":1,"title":"I don't want to use homekit","text":"I use hubitat, and other smart home devices.  I do not want to enable to use homekit.  The app keeps trying to activate homekit and then that shows up everywhere I don't want it to.","updated":"2021-08-08T08:08:35-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6610336708","userName":"Eggo222","userUrl":"https://itunes.apple.com/us/reviews/id437314127","version":"5.0.0","score":1,"title":"Not pairing","text":"Not pairing.. my wifi sees it, phone sees it, app sees it.. going through pairing process.. keep getting “unknown error occurred”  after reset factory reset deleted from HomeKit and restarted all that stuff. Still not working.","updated":"2020-11-04T21:39:23-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7339880033","userName":"greatjobdave!","userUrl":"https://itunes.apple.com/us/reviews/id86000093","version":"5.3.0","score":5,"title":"Lightstrip Firmware Update","text":"Love the update! Stoked that my lightstrip gets color cycling!","updated":"2021-05-14T19:23:22-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5201765580","userName":"Noah TheGamer","userUrl":"https://itunes.apple.com/us/reviews/id326823005","version":"3.5.3","score":1,"title":"App is really bad and seriously needs work connecting to devices","text":"It’s really a pain to connect a device and the app doesn’t make it too easy","updated":"2019-11-26T19:08:23-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3200533622","userName":"Illogicalcat","userUrl":"https://itunes.apple.com/us/reviews/id110526257","version":"2.5.4","score":1,"title":"Can no longer pair...","text":"My lights stopped responding after the last update, I can’t even pair them up even after removing them. Love to have expensive things not working and stuck to my wall like an eyesore","updated":"2018-09-17T12:53:49-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6760806799","userName":"Vinni DiBlasio","userUrl":"https://itunes.apple.com/us/reviews/id1221197633","version":"5.1.2","score":1,"title":"App crash on start when you allow homekit access","text":"Please fix the lights are practically unusable until this is resolved.","updated":"2020-12-16T14:02:30-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6753087235","userName":"4x lover","userUrl":"https://itunes.apple.com/us/reviews/id208922264","version":"5.1.2","score":1,"title":"Update made me lose everything","text":"I don’t know what you guys did with the update to the app, but I had to set up my Nanoleaf from scratch and lost all my custom displays. Thanks a lot.","updated":"2020-12-14T09:42:28-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6471332802","userName":"secoleckod","userUrl":"https://itunes.apple.com/us/reviews/id344971352","version":"4.1.4","score":2,"title":"I love the lights but the app is not very good","text":"Took me like 3 hours to set it up and took another hour to connect with my new wifi","updated":"2020-09-26T10:19:02-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5949515215","userName":"Teslaguycph","userUrl":"https://itunes.apple.com/us/reviews/id519455501","version":"4.0.5","score":1,"title":"Very difficult","text":"I’ve changed the WiFi at home. I can’t get it to reconnect even though I have tried every trick as described. It’s really sad the device is so difficult!","updated":"2020-05-15T10:22:21-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7479513145","userName":"Chas is bae","userUrl":"https://itunes.apple.com/us/reviews/id300625650","version":"6.0.0","score":1,"title":"Connecting","text":"Haven’t been able to connect the Nanoleaf panels to my phone after trying maybe 30 times","updated":"2021-06-18T12:09:43-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6469257427","userName":"i am the enemy","userUrl":"https://itunes.apple.com/us/reviews/id40587600","version":"4.1.4","score":3,"title":"lackluster","text":"pretty clunky app for a physical product that otherwise looks and seems to be well-designed. tutorials are too long and didn’t leave me feeling confident enough to tell my wife how to use it. have learned more through trial and error. *sigh*","updated":"2020-09-25T20:59:35-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6115873147","userName":"nonameNH","userUrl":"https://itunes.apple.com/us/reviews/id225603508","version":"4.1.1","score":1,"title":"Inconsistent","text":"One phone can link to the canvas, others cannot. We tried hard in the beginning but eventually gave up.","updated":"2020-06-24T04:16:37-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"1917246060","userName":"1st chair, 20k","userUrl":"https://itunes.apple.com/us/reviews/id86137836","version":"2.1.5","score":1,"title":"Terrible","text":"I’ve used my lights for a while now but since a recent update when it went to keychain I can’t connect to my lights and haven’t been for a month and I’ve reset everything. Renders my $300 lights useless. Great","updated":"2017-11-12T21:03:11-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7855779936","userName":"$550InJunkSquares","userUrl":"https://itunes.apple.com/us/reviews/id929685308","version":"6.2.0","score":1,"title":"Canvas Constantly Unpairs from the app.","text":"For how expensive it is you’d think they could at least provide decent software / customer service.","updated":"2021-09-28T15:42:58-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7014623932","userName":"AEC31277","userUrl":"https://itunes.apple.com/us/reviews/id1011204054","version":"5.2.0","score":1,"title":"Unusable","text":"Had canvas for a year and never have been able to connect them. Serious problems with this app.","updated":"2021-02-19T12:27:22-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6863356389","userName":"RoweIAGE","userUrl":"https://itunes.apple.com/us/reviews/id41708190","version":"5.1.4","score":1,"title":"Incredibly buggy app","text":"This app has bugs - lots and lots of bugs.\n\nI can’t reliably download scenes, apply scenes, edit scenes or delete scenes.\n\nThe app also seems to randomly edit my scenes when it starts up.\n\nI also can’t reliably update my panels (some are stuck on an old version).\n\nThis app may have features that work reliably but if it does, I haven’t yet found them.","updated":"2021-01-12T19:49:48-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7320052456","userName":"mxzuss40","userUrl":"https://itunes.apple.com/us/reviews/id1240291656","version":"5.3.0","score":5,"title":"Good app to control A19 light","text":"I like controlling my house 😏","updated":"2021-05-09T20:36:39-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6689204445","userName":"WillyTaz5","userUrl":"https://itunes.apple.com/us/reviews/id1206416195","version":"5.1.1","score":1,"title":"Crap connection","text":"This panels constantly lose connection to wifi and I need to soft/hard reset them all the time. So much promise but so many dumb issues.","updated":"2020-11-26T14:32:09-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5344360623","userName":"Instrumented H","userUrl":"https://itunes.apple.com/us/reviews/id117122792","version":"4.0.1","score":2,"title":"Problem with invites","text":"Poor sync and sharing.  Permissions are unmanageable and invites don’t work.  Documentation and  many resets have had no effect","updated":"2019-12-31T15:04:18-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4240829069","userName":"Mine-O-Saur","userUrl":"https://itunes.apple.com/us/reviews/id33161999","version":"3.3.2","score":1,"title":"The App Doesn’t work so therefore...","text":"The product doesn’t work. I guess that’s what I get for dropping $200+ on these lights. Will not be purchasing Nanoleaf again. Save yourself time and money - pass on this product.","updated":"2019-05-31T07:54:34-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"2020892237","userName":"MRBoliek","userUrl":"https://itunes.apple.com/us/reviews/id278130708","version":"2.2","score":1,"title":"Setup is TERRIBLE","text":"The lights themselves are great. But the set up is truly not worth the hassle of the product. Ive reset my wireless network, deleted and reinstalled the app and hard reset trying everything i know to reset and it’s still garbage","updated":"2017-12-23T08:28:42-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6768971622","userName":"ronc215","userUrl":"https://itunes.apple.com/us/reviews/id1239967969","version":"5.1.2","score":1,"title":"Confusing","text":"Somehow they made the app worse. Very confusing and sometimes it doesn’t even work at all","updated":"2020-12-18T20:09:46-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5324507377","userName":"sisoul","userUrl":"https://itunes.apple.com/us/reviews/id24731612","version":"4.0.1","score":1,"title":"Not connected","text":"Great in concept but terrible in execution. Initially worked and now the app states no connection. I’ve tried soft and hard resets. Nothing works. A total waste of time and money.","updated":"2019-12-26T20:00:47-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7287844431","userName":"VD0966","userUrl":"https://itunes.apple.com/us/reviews/id100101029","version":"5.3.0","score":1,"title":"Optician","text":"Terrible!!!  Difficult pairing,  and keep on and off lights by itself.   Reset twice but the problem still exists.  Very annoying!!!","updated":"2021-05-01T22:57:07-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5605236855","userName":"BenjiFromTX","userUrl":"https://itunes.apple.com/us/reviews/id112267019","version":"4.0.2","score":1,"title":"Horrible app, the Windows 95 of iOS.","text":"I moved and now my panel will not respond even after a factory reset. App pretends to connect then does absolutely nothing even after reinstall.","updated":"2020-03-02T00:15:08-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7844056559","userName":"TomDenver77","userUrl":"https://itunes.apple.com/us/reviews/id30523089","version":"6.1.0","score":1,"title":"Latest app doesnt work. Do not upgrade","text":"After upgrading to the latest iOS app, it stopped working. It just sits there spinning at start. Restarting and reinstalling don’t help","updated":"2021-09-25T07:43:43-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6543033775","userName":"Steve Hordinski","userUrl":"https://itunes.apple.com/us/reviews/id289492290","version":"5.0.0","score":5,"title":"Love it","text":"Makes my house come alive","updated":"2020-10-16T18:48:34-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4564829726","userName":"qwerty page","userUrl":"https://itunes.apple.com/us/reviews/id900553294","version":"3.4.0","score":5,"title":"QWERTY","text":"It is quality working Ernest reliable timeless youth Nanoleaf has all of these","updated":"2019-08-03T18:09:01-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5791594737","userName":"Kaalmang","userUrl":"https://itunes.apple.com/us/reviews/id16251003","version":"4.0.4","score":1,"title":"4.0.4 Broke Home app in iOS 13","text":"Please, fix the problem with the Home app. Everything works fine until last update.","updated":"2020-04-10T08:32:31-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8134553901","userName":"cay cove","userUrl":"https://itunes.apple.com/us/reviews/id165899505","version":"7.0.3","score":1,"title":"Morons","text":"This is the worst user friendly app I have ever dealt with. Everyone working on it must be mentally retarded. Half the buttons don’t work on my app and I am unable to pair anything.","updated":"2021-12-15T18:30:13-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7545441419","userName":"TheGamingArt","userUrl":"https://itunes.apple.com/us/reviews/id158271774","version":"6.0.0","score":1,"title":"What a terrible UX","text":"I’m not even sure what to say. It’s like the company doesn’t understand mobile and the company doesn’t understand their product..","updated":"2021-07-06T05:41:14-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5723914707","userName":"I<3ices8ing","userUrl":"https://itunes.apple.com/us/reviews/id275972928","version":"4.0.3","score":1,"title":"Eh","text":"The app is very useful but it disconnects from my lights like every 2 seconds so i rarely end up using it, the developers really should look into fixing it","updated":"2020-03-27T19:25:09-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3690094822","userName":"alecantoci","userUrl":"https://itunes.apple.com/us/reviews/id42049212","version":"3.2.2","score":1,"title":"Has never functioned properly, and never will.","text":"Absolute garbage. Went through phone calls emails hours of time of customer support doing nothing to help. Complete trash.","updated":"2019-01-24T12:12:02-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7746700160","userName":"hyperconsumer","userUrl":"https://itunes.apple.com/us/reviews/id778958917","version":"6.1.0","score":2,"title":"Frustrating","text":"Why are you doing this to me","updated":"2021-08-28T22:08:05-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6743397746","userName":"clive_man","userUrl":"https://itunes.apple.com/us/reviews/id752347800","version":"5.1.2","score":1,"title":"Connection problems","text":"You must power down to connect to the panels. I'm tired of doing this every day!\nThe application does not see the panel!","updated":"2020-12-11T18:43:56-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6732314394","userName":"Nargathor","userUrl":"https://itunes.apple.com/us/reviews/id1077679341","version":"5.1.2","score":1,"title":"Redesign","text":"The new redesign is absolutely terrible. Don’t update if you still have the older UX. The app is so cluttered now that even trying to setup a new panel is mind boggling annoying.","updated":"2020-12-08T16:47:26-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6640231012","userName":"steve787102","userUrl":"https://itunes.apple.com/us/reviews/id1044700470","version":"5.1.0","score":1,"title":"Broken App","text":"The app does not even work when pairing to anything. It’s honestly worth buying another program then this","updated":"2020-11-13T04:36:20-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4150091308","userName":"BeeFree22","userUrl":"https://itunes.apple.com/us/reviews/id507326272","version":"3.3.2","score":1,"title":"App issues","text":"I have been having issue after issue with connecting the app to the panels. App does not let me have access to the lights due to “cloud sync in progress”, update the app.","updated":"2019-05-14T11:41:57-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"2735214292","userName":"MWPrice","userUrl":"https://itunes.apple.com/us/reviews/id24465301","version":"2.5.1","score":1,"title":"Bricked my panels","text":"This update bricked my panels.  Attempted both soft and factory reset.  Endless loop of panels becoming unreachable, deleting and re-adding, updating, unresponsive, all panels going white and then unreachable again.  Lost all color schemes, schedules, etc. \nVery disappointed.","updated":"2018-06-20T19:32:42-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7228796878","userName":"Opr775","userUrl":"https://itunes.apple.com/us/reviews/id1165577606","version":"5.2.2","score":1,"title":"Hardly ever works","text":"Half of the time when I go to change the lighting it says my device is unreachable","updated":"2021-04-16T07:50:47-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6239860502","userName":"jeff648274","userUrl":"https://itunes.apple.com/us/reviews/id960105044","version":"4.1.3","score":1,"title":"Home sync update","text":"When they added home sync capability it rendered my nanoleafs completely useless. They were pretty cool for a month though.","updated":"2020-07-25T04:19:42-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6170201221","userName":"Byron from MD","userUrl":"https://itunes.apple.com/us/reviews/id106784622","version":"4.1.2","score":1,"title":"Pairing process is bad","text":"The pairing process should be easier and not have to download extra apps just to connect to the lights it’s too much!!!","updated":"2020-07-07T18:01:24-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3667596566","userName":"Djmeeko13","userUrl":"https://itunes.apple.com/us/reviews/id252261164","version":"3.2.2","score":1,"title":"Unreachable","text":"Just got this light set today and it’s not working. I keep getting the unreachable error. I have did all the resets in book and still nothing. I’m close to taking it back tomorrow","updated":"2019-01-18T21:18:17-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7376326131","userName":"BoggChicago","userUrl":"https://itunes.apple.com/us/reviews/id42601735","version":"5.3.1","score":1,"title":"Too many bugs still","text":"The shuffle through scenes does not work.","updated":"2021-05-22T18:28:04-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4633199294","userName":"HaLoRoCkEr","userUrl":"https://itunes.apple.com/us/reviews/id39702783","version":"3.4.1","score":1,"title":"App won’t connect","text":"The app can never connect, it has been a problem since day one. I have dozens of smart products. This is the only that can never connect","updated":"2019-08-17T16:22:35-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4948748866","userName":"sossauce","userUrl":"https://itunes.apple.com/us/reviews/id34182527","version":"3.5.1","score":5,"title":"Fantastic","text":"Well done","updated":"2019-10-14T17:50:31-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7902659143","userName":"ChillinQuillen","userUrl":"https://itunes.apple.com/us/reviews/id191176039","version":"6.2.0","score":1,"title":"Last update bricked","text":"Last update bricked my canvas.  Can’t get them to connect and beyond frustrating.  5 factory resets and still unresponsive.","updated":"2021-10-11T06:43:35-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7841139293","userName":"brice silva","userUrl":"https://itunes.apple.com/us/reviews/id771631061","version":"6.1.0","score":1,"title":"Doesn’t pair","text":"It’s either impossible to pair these lights with my new cell or the task is such a hardship that these things aren’t worth it. Make it easier to pair please","updated":"2021-09-24T12:19:27-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5904246547","userName":"david 172749","userUrl":"https://itunes.apple.com/us/reviews/id573449616","version":"4.0.5","score":2,"title":"Terrible product.","text":"Terrible app. Idiotic app. Extremely counter intuitive and idiotic. Don't buy. Don't use. Return. Don't gift. It's horrific.","updated":"2020-05-04T20:04:40-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7352452556","userName":"dj hk7","userUrl":"https://itunes.apple.com/us/reviews/id1149114324","version":"5.3.0","score":5,"title":"Great app","text":"Amazing great lighting possibilités new lights new life","updated":"2021-05-17T13:54:28-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"2345738426","userName":"Wanglicious","userUrl":"https://itunes.apple.com/us/reviews/id101004506","version":"2.2.6","score":2,"title":"Home sync in progress","text":"Keep getting this error when I try to set up. Why no progress bar?","updated":"2018-03-25T10:39:59-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8138217555","userName":"Auntnai","userUrl":"https://itunes.apple.com/us/reviews/id470795878","version":"7.0.3","score":2,"title":"Device not connecting","text":"Cannot get device to connect in app","updated":"2021-12-16T20:05:20-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7951434344","userName":"ToxicManChowder","userUrl":"https://itunes.apple.com/us/reviews/id32557676","version":"6.2.0","score":1,"title":"Nanoleaf App is Horrible","text":"If I could rate it a zero I would.  Nothing on this app works correctly. And most frustrating is trying to make schedules. Omg. Pure frustration!","updated":"2021-10-24T23:24:08-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6287675402","userName":"mike_OiiiO","userUrl":"https://itunes.apple.com/us/reviews/id569157623","version":"4.1.3","score":2,"title":"Stupid","text":"I bought the 4 tiles but it didn’t come with the power supply and I had to buy a kit the light are good tho","updated":"2020-08-06T10:22:48-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"2531051849","userName":"Ianisdabest","userUrl":"https://itunes.apple.com/us/reviews/id509152131","version":"2.3.2","score":1,"title":"Garbage!!!","text":"The app will say “cloud data sync in progress” and won’t let you connect. I’ve tried everything to fix it but nothing works!","updated":"2018-05-10T23:00:13-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"2037016316","userName":"Someone334","userUrl":"https://itunes.apple.com/us/reviews/id312129983","version":"2.2","score":1,"title":"No “off” schedule setting","text":"Seems like a critical feature the app is missing. No way to schedule the lights to turn off at any time.","updated":"2017-12-28T21:04:08-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7979398007","userName":"Narotoy","userUrl":"https://itunes.apple.com/us/reviews/id237042320","version":"7.0.0","score":1,"title":"Cannot update the firmware","text":"And got no response after submitting a ticket to the support! Terrible products and service!","updated":"2021-11-01T18:56:55-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6803823023","userName":"Gavinisagodatlife","userUrl":"https://itunes.apple.com/us/reviews/id949875254","version":"5.1.2","score":1,"title":"Not very good","text":"So just a question- why does it always say “device is unreachable” and never connect or work. Some solutions would be great.","updated":"2020-12-28T09:51:04-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6646092911","userName":"Derekooooooo","userUrl":"https://itunes.apple.com/us/reviews/id241697350","version":"5.1.0","score":1,"title":"App is broken","text":"App closes every time I try to open it. Lights won’t connect without the app opening, so it’s pointless","updated":"2020-11-14T16:59:35-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3775379084","userName":"lagitrealdeal","userUrl":"https://itunes.apple.com/us/reviews/id467263067","version":"3.2.2","score":1,"title":"Joke of a product this makes me want to kill my self it’s so frustrating","text":"Joke of a product this makes me want to kill my self it’s so frustrating","updated":"2019-02-15T23:03:40-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"2385571755","userName":"SDmusic","userUrl":"https://itunes.apple.com/us/reviews/id31422169","version":"2.3.0","score":1,"title":"App has stopped working","text":"Great product overall, but the latest app update has stopped working. I can no longer control the lights with the app.","updated":"2018-04-04T23:35:35-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5352520767","userName":"Jeff Holyfield","userUrl":"https://itunes.apple.com/us/reviews/id778053807","version":"4.0.1","score":3,"title":"Idk","text":"Old ui layout was better","updated":"2020-01-02T12:58:35-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6556988009","userName":"Blacjak21","userUrl":"https://itunes.apple.com/us/reviews/id156205540","version":"5.0.0","score":1,"title":"New update","text":"This update is horrible can’t sync anything. Can’t restore scenes. Can’t download scenes. Always crashing! Seriously what is this.","updated":"2020-10-20T18:49:18-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8033726598","userName":"Markcito","userUrl":"https://itunes.apple.com/us/reviews/id37074513","version":"7.0.0","score":1,"title":"Does not work with my HomeKit System","text":"Took a chance with this though I recognize that HomeKit is not a well implemented system. Total failure.","updated":"2021-11-17T06:48:40-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6979435377","userName":"Youcangowiththis","userUrl":"https://itunes.apple.com/us/reviews/id34428605","version":"5.2.0","score":1,"title":"This last update wiped out all of my scenes","text":"My wife’s, too. Seriously, this is the only thing you can’t botch for an app like this.","updated":"2021-02-10T17:09:37-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6190130006","userName":"laggasf","userUrl":"https://itunes.apple.com/us/reviews/id948694148","version":"4.1.2","score":1,"title":"Nanoleaf","text":"My Nanoleaf is connected to the WiFi but won’t connect to the app unless I delete this app and reinstall it to use it for for 5 mins","updated":"2020-07-12T11:31:07-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5976421006","userName":"unknown addict🥵","userUrl":"https://itunes.apple.com/us/reviews/id631125826","version":"4.0.5","score":5,"title":"🤩","text":"great product! beyond my expectations:) might seem bit privy but i would say its worth what ur getting.","updated":"2020-05-21T15:30:09-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4044625984","userName":"Taymizu","userUrl":"https://itunes.apple.com/us/reviews/id121384752","version":"3.3.2","score":1,"title":"Needs fixing","text":"Do not buy this product. Way too many software issues for how much it costs","updated":"2019-04-21T23:04:40-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3670362101","userName":"whb52ford","userUrl":"https://itunes.apple.com/us/reviews/id207137297","version":"3.2.2","score":1,"title":"Can’t set up","text":"Tried to set up and it stops because I don’t have keychain on.  Don’t even know what keychain is.  Why do I need a credit card to use my nano light?  Deleting app.","updated":"2019-01-19T10:46:13-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7956799549","userName":"Snodripple","userUrl":"https://itunes.apple.com/us/reviews/id24133060","version":"6.2.0","score":1,"title":"Non responsive on iOS 15.1","text":"I can no longer connect through HomeKit or the Nanoleaf app to the Nanoleaf products. All are on the latest firmware.","updated":"2021-10-26T12:15:37-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6765615737","userName":"soundsOK","userUrl":"https://itunes.apple.com/us/reviews/id28759186","version":"5.1.2","score":1,"title":"Keeps crashing","text":"Latest version will not run. Keeps crashing! iPhone 12 Pro Max","updated":"2020-12-17T22:56:33-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6688553917","userName":"Macbones","userUrl":"https://itunes.apple.com/us/reviews/id36995258","version":"5.1.1","score":1,"title":"Connection losses","text":"Looks like my log-in data lost again, which means I’ll have to re- Pair my lights from scratch.","updated":"2020-11-26T10:02:05-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6268922416","userName":"crustycornholio","userUrl":"https://itunes.apple.com/us/reviews/id120151675","version":"4.1.3","score":1,"title":"Awful","text":"Ruins the product. Slow, cluttered, search does nothing, unresponsive ui. Returning $400 worth of product because the app is such garbage.","updated":"2020-08-01T16:16:18-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6790634928","userName":"h0b0byter99","userUrl":"https://itunes.apple.com/us/reviews/id1241887243","version":"5.1.2","score":5,"title":"Great app, great light panels","text":"This app makes controlling the light panels a piece of cake.","updated":"2020-12-24T20:49:37-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5279431800","userName":"0xjiva","userUrl":"https://itunes.apple.com/us/reviews/id49347919","version":"4.0.0","score":1,"title":"Can’t control my Nanoleaf anymore","text":"Why tf did you make such a drastic ui change. Not to mention I can’t control my lights now","updated":"2019-12-16T04:21:57-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7936093218","userName":"greggman","userUrl":"https://itunes.apple.com/us/reviews/id42866322","version":"6.2.0","score":1,"title":"should not need an account to use light bulb","text":"It's ridiculous that you need to register and create an account just to use a light bulb!! No!!!!!!","updated":"2021-10-20T15:52:01-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6808556878","userName":"Cirrusflyer","userUrl":"https://itunes.apple.com/us/reviews/id42180024","version":"5.1.2","score":1,"title":"Crashes at launch","text":"C’mon devs.  Latest version crashes at launch and it’s been reported for weeks.","updated":"2020-12-29T16:31:28-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6668885268","userName":"EB4418","userUrl":"https://itunes.apple.com/us/reviews/id266746629","version":"5.1.1","score":1,"title":"Never update","text":"Upgrade is horrible wish I never updated","updated":"2020-11-20T23:22:13-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6253772269","userName":"Some Unchosen Nickname","userUrl":"https://itunes.apple.com/us/reviews/id26407460","version":"4.1.3","score":1,"title":"Frustrating","text":"Always doesn’t work.\n\nFrustrating as hell.","updated":"2020-07-28T19:46:59-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5273588318","userName":"RobertV2","userUrl":"https://itunes.apple.com/us/reviews/id5806556","version":"4.0.0","score":1,"title":"Can’t access panels","text":"Since this update out of three panels I can only access one.  Did you bother to test this?","updated":"2019-12-14T16:12:13-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4078784182","userName":"Peter5346","userUrl":"https://itunes.apple.com/us/reviews/id107768904","version":"3.3.2","score":1,"title":"Nice panels, trash app","text":"This product used to work just fine. Now you are forced into using HomeKit for no apparent reason and the app wants to control your other devices.","updated":"2019-04-29T18:49:23-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7143637238","userName":"yae02","userUrl":"https://itunes.apple.com/us/reviews/id720335656","version":"5.2.2","score":1,"title":"Lights unreachable","text":"My lights have been unreachable for days, I’ve tried to fix them but nothing works.","updated":"2021-03-25T09:54:46-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6465025659","userName":"SmellyReview","userUrl":"https://itunes.apple.com/us/reviews/id813497624","version":"4.1.4","score":1,"title":"Nothing connects.","text":"This app is god awful.  Awful UI and horrible functionality. Never connects and rarely pairs new devices.","updated":"2020-09-24T15:58:09-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3944874531","userName":"Djhgfdsa","userUrl":"https://itunes.apple.com/us/reviews/id30406842","version":"3.3.1","score":1,"title":"DISCONNECTS ALOT","text":"For the love of God, PLEASE fix this garbage app. I can’t even use my lights properly because it disconnects my device every 24 hours. Ive never had to troubleshoot lights to such an extent. What a waste of my time.","updated":"2019-03-29T22:55:16-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6336074619","userName":"fhebcnf","userUrl":"https://itunes.apple.com/us/reviews/id887761214","version":"4.1.3","score":5,"title":"Amazing","text":"I love the pulsing pop beats and they are amazing","updated":"2020-08-18T21:09:36-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6557090023","userName":"The Great GoldenJoe","userUrl":"https://itunes.apple.com/us/reviews/id203889281","version":"5.0.0","score":1,"title":"No landscape support? Is this real???","text":"It’s literally just the iPhone app blown up huge. Awful. I would give it zero stars if I could.","updated":"2020-10-20T19:34:42-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3597648446","userName":"Damageinc84","userUrl":"https://itunes.apple.com/us/reviews/id105244084","version":"3.2.1","score":1,"title":"The whole system is terrible","text":"It all used to work fine but now I can’t even get it to pair in the app. Selling this junk.","updated":"2018-12-31T18:13:42-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7226717243","userName":"poperdogg","userUrl":"https://itunes.apple.com/us/reviews/id358741903","version":"5.2.2","score":1,"title":"Setup not easy","text":"Horrible setup. There are instructions how to hard reset and troubleshooting instructions are terrible.","updated":"2021-04-15T17:42:10-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6750419707","userName":"@@encee$$","userUrl":"https://itunes.apple.com/us/reviews/id152054971","version":"5.1.2","score":1,"title":"App crash","text":"App constantly crashes when I try to open it","updated":"2020-12-13T15:24:30-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6560509941","userName":"595659","userUrl":"https://itunes.apple.com/us/reviews/id105818368","version":"5.0.0","score":1,"title":"CHANGE BACK PLEASE","text":"This update is garbage.. super messy, everything seems hidden, extra clicks required to find scenes, change it back!!!!","updated":"2020-10-21T19:20:24-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6828413441","userName":"Geo Sal","userUrl":"https://itunes.apple.com/us/reviews/id340686471","version":"5.1.2","score":5,"title":"Nanoleaf","text":"Really nice lighting accent with many possibilities!!!","updated":"2021-01-03T19:52:59-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5273769205","userName":"Condition zero","userUrl":"https://itunes.apple.com/us/reviews/id177211758","version":"4.0.0","score":1,"title":"Most complicated UI","text":"Hands down the worst UI i have ever seen on an app! So many useless and confusing tabs!","updated":"2019-12-14T17:24:23-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5272645266","userName":"matt.mayo","userUrl":"https://itunes.apple.com/us/reviews/id40518257","version":"4.0.0","score":2,"title":"Update lost my devices","text":"Can’t find my light panels on the app anymore ☹️","updated":"2019-12-14T09:59:09-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4949455172","userName":"HotOrNotUser17","userUrl":"https://itunes.apple.com/us/reviews/id969626978","version":"3.5.1","score":1,"title":"Sync didnt work","text":"App did not sync with prior settings on new phone nor did the app UI make it possible to edit even though the dash","updated":"2019-10-14T21:59:24-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6613273100","userName":"hsoksbxchakwkxhxkxhxhkwmd","userUrl":"https://itunes.apple.com/us/reviews/id471781485","version":"5.0.0","score":1,"title":"Horrible","text":"Don’t buy! Invest your $$ elsewhere. Product is a great concept, but user interface and app connectivity is hopeless.","updated":"2020-11-05T17:14:52-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4512518166","userName":"Garnett25689433690","userUrl":"https://itunes.apple.com/us/reviews/id199321722","version":"3.4.0","score":1,"title":"Panels are always disconnected on app","text":"Every day I go into the app and the panels are “not connected” so I have to unplug them and plug them back in. I’m ready to take them back.","updated":"2019-07-24T17:17:50-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6540912604","userName":"charlesA222","userUrl":"https://itunes.apple.com/us/reviews/id124973352","version":"5.0.0","score":3,"title":"Cause ipad owners don't deserve landscape.","text":"Still no landscape for iPads. Seriously?\n\nPriorities guys, priorities","updated":"2020-10-16T05:17:22-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6008911529","userName":"Meichowchow4","userUrl":"https://itunes.apple.com/us/reviews/id206366088","version":"4.0.5","score":3,"title":"not easy to navigate","text":"it is a very hi tech app but its also very confusing. took me forever to understand how to connect music and how to create certain scenes","updated":"2020-05-29T04:45:11-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5486327262","userName":"CrownDaWolf","userUrl":"https://itunes.apple.com/us/reviews/id462246220","version":"4.0.2","score":1,"title":"Horrible","text":"These lights only work half the time, I’m constantly having to reconnect them etc. worst 250$ I’ve ever spent.","updated":"2020-02-04T02:16:09-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5236643152","userName":"fahadleaf","userUrl":"https://itunes.apple.com/us/reviews/id171736363","version":"3.5.3","score":1,"title":"Very bad","text":"Im so disappointed! I cant connect my devices it keeps disconnecting the wifi by itself !!! Very weird and disturbing","updated":"2019-12-05T07:21:22-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8046629726","userName":"Forrest Wilkins","userUrl":"https://itunes.apple.com/us/reviews/id46210704","version":"7.0.1","score":1,"title":"Incredibly buggy app","text":"I love the lights and the different modes but the mobile app on iOS is basically un-useable","updated":"2021-11-20T22:33:15-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7311656112","userName":"T. Toomer","userUrl":"https://itunes.apple.com/us/reviews/id180721890","version":"5.3.0","score":1,"title":"Horrible","text":"It’s so stupid that we need 2.4 WiFi to connect to Nanoleaf. Some WiFi phones never connect to 2.4","updated":"2021-05-08T01:43:13-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5273983618","userName":"VersedSoul","userUrl":"https://itunes.apple.com/us/reviews/id686026865","version":"4.0.0","score":1,"title":"Roll it Back","text":"Roll back the update. Absolutely terrible user interface, broken “tutorials”.","updated":"2019-12-14T18:43:36-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7573103983","userName":"staciaxoxo","userUrl":"https://itunes.apple.com/us/reviews/id350224438","version":"6.0.0","score":1,"title":"Garbage","text":"Spent hours trying to connect my light panels and it wouldn’t work. Returning this junk to the store.","updated":"2021-07-13T14:31:33-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7403893733","userName":"JRKottom","userUrl":"https://itunes.apple.com/us/reviews/id217366384","version":"5.3.1","score":1,"title":"Have fun pairing","text":"Great idea, pairing is a pain. It doesn’t have to be this hard and I am about ready to put these into retirement.","updated":"2021-05-29T16:13:42-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5246243792","userName":"Simulated","userUrl":"https://itunes.apple.com/us/reviews/id43671382","version":"3.5.3","score":1,"title":"Never stays connected","text":"This app and Laos never stay connected. I’m constantly resetting the device.","updated":"2019-12-07T16:20:25-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4504773621","userName":"IWANTTOBE_A_DJ!","userUrl":"https://itunes.apple.com/us/reviews/id27949325","version":"3.4.0","score":1,"title":"Takes way too long to connect","text":"I’ve lost hours of my life connecting to this app","updated":"2019-07-22T23:14:15-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8081707825","userName":"Donotbuytrash","userUrl":"https://itunes.apple.com/us/reviews/id1252157991","version":"7.0.2","score":1,"title":"Horrible do not buy.","text":"This garbage connects only when it wants. Money wasted.","updated":"2021-11-30T18:10:19-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4556107612","userName":"kvn_ptrck","userUrl":"https://itunes.apple.com/us/reviews/id27454638","version":"3.4.0","score":1,"title":"Constant issues","text":"Light are great to look at but there are so many bugs and glitches.","updated":"2019-08-02T07:15:43-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7051005128","userName":"Jesse12777","userUrl":"https://itunes.apple.com/us/reviews/id1265100572","version":"5.2.0","score":1,"title":"Terrible company","text":"My devices always disconnect, and then they never pair again","updated":"2021-02-28T18:19:13-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8038314965","userName":"swappy g","userUrl":"https://itunes.apple.com/us/reviews/id954141766","version":"7.0.1","score":1,"title":"Can’t get my Nanoleaf to stay paired","text":"Every time I connect it I can’t keep staying connected","updated":"2021-11-18T14:51:45-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7663684992","userName":"elon420690","userUrl":"https://itunes.apple.com/us/reviews/id588327323","version":"6.0.0","score":1,"title":"Terrible- never works","text":"Always disconnects from my lights","updated":"2021-08-06T19:12:25-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4556928488","userName":"OBreezie","userUrl":"https://itunes.apple.com/us/reviews/id979462581","version":"3.4.0","score":1,"title":"Connectivity problems","text":"It always disconnects, and there is no solution to fix it","updated":"2019-08-02T10:32:09-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6465755901","userName":"ipd?","userUrl":"https://itunes.apple.com/us/reviews/id24061289","version":"4.1.4","score":1,"title":"no widget","text":"it’s Sept 2020 and there’s no ios widget yet. I mean come on. Even the most rudimentary widget support should be here by now and yet nothing.","updated":"2020-09-24T21:31:09-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3593330827","userName":"quiksilvababe","userUrl":"https://itunes.apple.com/us/reviews/id105217069","version":"3.2.1","score":1,"title":"Horrible frustrating - rarely works","text":"Woof! What a clunky horrible design. It looks nice, but it rarely works or reacts to selecting a new scene. Extremely frustrating.","updated":"2018-12-30T15:41:23-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8051656334","userName":"xmossflowerx","userUrl":"https://itunes.apple.com/us/reviews/id401304334","version":"7.0.1","score":1,"title":"App non responsive","text":"This app is non responsive at best. \n\nI’m about it ready to return this product.","updated":"2021-11-22T07:51:36-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5683357358","userName":"darknd","userUrl":"https://itunes.apple.com/us/reviews/id590791775","version":"4.0.3","score":4,"title":"?","text":"Not easy to setup with app","updated":"2020-03-19T11:57:32-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7992407749","userName":"fbdksldbdidbxb","userUrl":"https://itunes.apple.com/us/reviews/id1236069205","version":"7.0.0","score":1,"title":"Cant Connect","text":"I’ve tried every avenue to connect 0 stars if I could","updated":"2021-11-05T12:40:22-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7336238794","userName":"Darsix6","userUrl":"https://itunes.apple.com/us/reviews/id244663785","version":"5.3.0","score":2,"title":"Fix update for better review","text":"The update rendered this app meaningless","updated":"2021-05-13T22:17:23-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5269593316","userName":"leafuser133","userUrl":"https://itunes.apple.com/us/reviews/id478798911","version":"4.0.0","score":1,"title":"The latest update DEC2019 killed all functionally","text":"Can no longer use the app.","updated":"2019-12-13T17:43:09-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5396798577","userName":"frankeeb699","userUrl":"https://itunes.apple.com/us/reviews/id1121660672","version":"4.0.1","score":1,"title":"Problems","text":"It constantly stops working the app is horrible. I have excellent wi fi and 21 panels. Horrible app","updated":"2020-01-12T19:53:03-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3002116708","userName":"BroMilk","userUrl":"https://itunes.apple.com/us/reviews/id86471242","version":"2.5.3","score":1,"title":"Why?!","text":"I don't want to use homekit but it forces you! Why!? Terrible design. I spend over $600 for this in an office environment and now can't set it up.","updated":"2018-08-01T10:08:18-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6379106925","userName":"Chikara1988","userUrl":"https://itunes.apple.com/us/reviews/id132407675","version":"4.1.3","score":1,"title":"Pairing is horrible","text":"Took forever to get the device to pair with my phone.","updated":"2020-08-30T18:50:33-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5986315692","userName":"utrimque","userUrl":"https://itunes.apple.com/us/reviews/id42875859","version":"4.0.5","score":1,"title":"Hard to set up","text":"Insane hard to set up","updated":"2020-05-23T21:19:46-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3928311024","userName":"TonyRicc82","userUrl":"https://itunes.apple.com/us/reviews/id708214377","version":"3.3.1","score":4,"title":"Awesome app for an amazing set of lights","text":"I was nervous after reading all the negative reviews concerning the app and its functionality...and upon downloading was hit with the “Error:Sync in progress” message. Repeatedly. Spent the first night thinking my new smart lights were pretty dumb. \n\nSo I Googled what to do, and it turns out I deleted the Home App from my iPhone which is essential here. So I downloaded Home, and made sure that Keychain was enabled. After resetting Home, and doing a hard reset on the panels, my phone was able to discover them finally. Once that happened it took me approximately 5 minutes to set everything up including linking to Alexa. Easy stuff. \n\nThe app is key to these lights especially if you skipped on the remote like I did, since I plan to rely on voice to control. And the app once connected is really fantastic. Changed my entire outlook on these panels and now I’m obsessed, especially with the rhythm addition. \n\nTons of customization...limited only by your imagination to be truthful. Other than the clunky and very specific setup, the app is pure gold. It’s because of the setup that I docked a star, but other than that it’s perfect. \n\nI see some people questioning the positive reviews as fake...please let me assure you, I in no way work for this company nor do I have any reason to write a fake review. I’m a disabled tech nerd that has had these sitting in a closet for four months, and am genuinely excited by the product now that I have set it up. 100% recommended.","updated":"2019-03-26T01:50:04-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7361475085","userName":"Khandfw","userUrl":"https://itunes.apple.com/us/reviews/id358731937","version":"5.3.0","score":1,"title":"Lights stops responding","text":"The lights responding do not respond to this or any other apps I have integrated.","updated":"2021-05-19T08:50:40-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5279781828","userName":"MountainBoy 44","userUrl":"https://itunes.apple.com/us/reviews/id37114153","version":"4.0.0","score":1,"title":"Unusable","text":"My devices are inaccessible. To the developers: Did you field test this? Please fix ASAP.","updated":"2019-12-16T06:06:00-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4948918348","userName":"Tins1618","userUrl":"https://itunes.apple.com/us/reviews/id40546471","version":"3.5.1","score":1,"title":"Never works right","text":"Programing is constantly breaking and going to all white. Nice idea, annoying in application.","updated":"2019-10-14T18:49:48-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6564418256","userName":"ivia4444","userUrl":"https://itunes.apple.com/us/reviews/id814121768","version":"5.0.0","score":1,"title":"New update","text":"the new update is god awful, it looks and feels terrible, and is SO disorganized.","updated":"2020-10-22T23:35:42-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"4489366464","userName":"nelsoncaswy06","userUrl":"https://itunes.apple.com/us/reviews/id520665319","version":"3.3.3","score":1,"title":"Worse","text":"Every love the canvas but i can’t get my canvas to pair no matter what i do orbit doesn’t work soon i will be returning this","updated":"2019-07-19T21:31:52-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"3591917897","userName":"Moffittk","userUrl":"https://itunes.apple.com/us/reviews/id28779764","version":"3.2.1","score":2,"title":"No Ipad","text":"Works great with Iphone\nWONT pair with Ipad\nWants me to open work ticket for help that is longer than a tax form.","updated":"2018-12-30T07:00:22-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8076168074","userName":"RadiantLife5","userUrl":"https://itunes.apple.com/us/reviews/id14380441","version":"7.0.2","score":1,"title":"very bad app","text":"Very poorly designed and performing app.  Ome of the worst apps as  it is very slow and unresponsive majority of thr time.","updated":"2021-11-29T05:07:06-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7042606921","userName":"otown nam","userUrl":"https://itunes.apple.com/us/reviews/id86557544","version":"5.2.0","score":1,"title":"Can’t pair anything","text":"App and device connectivity is terrible","updated":"2021-02-26T15:48:06-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"2414175557","userName":"iSayRwar","userUrl":"https://itunes.apple.com/us/reviews/id284889610","version":"2.3.1","score":1,"title":"Unusable bug","text":"No matter what, all panels will occasionally instantly flash white for a split second before returning to normal","updated":"2018-04-12T09:11:23-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6986269354","userName":"Anthony Sokacz","userUrl":"https://itunes.apple.com/us/reviews/id971731586","version":"5.2.0","score":1,"title":"Paring","text":"Can’t pair at all, it’s been almost 4 hours and still can’t pair...","updated":"2021-02-12T10:38:28-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6319252924","userName":"Obfuscated","userUrl":"https://itunes.apple.com/us/reviews/id48854931","version":"4.1.3","score":1,"title":"Loses connection constantly","text":"Router is 1 foot from panels. \nI am 1 foot from panels. \n\nStill loses connection. \nBig sadness :(","updated":"2020-08-14T10:34:13-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6225747495","userName":"Naytskayt","userUrl":"https://itunes.apple.com/us/reviews/id450238173","version":"4.1.2","score":1,"title":"Used to be great. Wish I never updated.","text":"New update and now my panels barely ever respond to the app. COOL!","updated":"2020-07-21T16:25:21-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5130532298","userName":"Jasper13333","userUrl":"https://itunes.apple.com/us/reviews/id158073025","version":"3.5.3","score":5,"title":"Router makes it obsolete!","text":"The review is in the title!","updated":"2019-11-12T21:33:55-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7979408216","userName":"dannieSays","userUrl":"https://itunes.apple.com/us/reviews/id108892205","version":"7.0.0","score":1,"title":"Update erased settings","text":"Careful with the update. It deletes your setup and have to pair again.","updated":"2021-11-01T19:01:19-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6750865490","userName":"Creoleheaven","userUrl":"https://itunes.apple.com/us/reviews/id413031228","version":"5.1.2","score":3,"title":"just ok","text":"doesn t work as well as i expected . the bulb doesn t always respond . its just ok.","updated":"2020-12-13T18:47:06-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6576554575","userName":"wojovox","userUrl":"https://itunes.apple.com/us/reviews/id244523643","version":"5.0.0","score":1,"title":"App will not open","text":"Indefinite loading wheel on iPad Pro.  App is up to date.","updated":"2020-10-26T09:59:13-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6861458626","userName":"kwhitney1988","userUrl":"https://itunes.apple.com/us/reviews/id1193348231","version":"5.1.4","score":1,"title":"Cant pair my lights","text":"Been trying fir days and can’t pair and it says unreachable","updated":"2021-01-12T08:02:09-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7679319583","userName":"Your Girl Bianca","userUrl":"https://itunes.apple.com/us/reviews/id868727288","version":"6.0.0","score":1,"title":"Love this lights, hate the app","text":"Love the lights but the app is so difficult. Get it together please. Thanks :)","updated":"2021-08-10T22:13:49-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8120593877","userName":"Kineticolive","userUrl":"https://itunes.apple.com/us/reviews/id31685167","version":"7.0.3","score":1,"title":"Unreachable","text":"For a week. I'm not the only one. Check Reddit. I have shapes and Aurora","updated":"2021-12-11T18:11:42-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5339590234","userName":"daxonmax","userUrl":"https://itunes.apple.com/us/reviews/id1113086931","version":"4.0.1","score":5,"title":"So long","text":"Mia","updated":"2019-12-30T10:02:21-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5808688563","userName":"Connectttttttttt","userUrl":"https://itunes.apple.com/us/reviews/id999359894","version":"4.0.5","score":1,"title":"Connecttttttt","text":"Horrible doesn’t want to connect","updated":"2020-04-13T22:16:26-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5361170539","userName":"yeet meme gagayeet","userUrl":"https://itunes.apple.com/us/reviews/id744267141","version":"4.0.1","score":1,"title":"Can’t set up","text":"I can’t set my nano leaf to device","updated":"2020-01-04T12:01:10-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6003073760","userName":"Gjvthjkk","userUrl":"https://itunes.apple.com/us/reviews/id434940548","version":"4.0.5","score":1,"title":"Can’t connect to Alexa","text":"My Alexa can’t even find my Nanoleaf device.","updated":"2020-05-27T20:19:54-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7755812706","userName":"itfloater","userUrl":"https://itunes.apple.com/us/reviews/id475152528","version":"6.1.0","score":1,"title":"Requires homekit","text":"Only going to be using with google assistant and razer software…","updated":"2021-08-31T09:18:55-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6303108621","userName":"Emma's robot","userUrl":"https://itunes.apple.com/us/reviews/id104164018","version":"4.1.3","score":3,"title":"It is good but could be spot on","text":"First, I like it and am not returning it. \nIt is more like 3.7 stars rt now. \n\nFOR STARTERS, the initial instructions are not adequately step by step to connect the smart device app with the squares. \nOnce I sat back and thought more mechanistically about it, then I sorted it out myself. But it wasn’t well presented—stepwise—in the initial app-to-unit link-up. \nAnd nobody wants to have ten more minutes sucked out of their day when the company should have already worked this out better w/a focus group and some trouble shooting with the initial app setup is needed. \n\nNEXT, probably the touchscreen buttons on the squares are hard to know when you are pressing hard enough or too hard. \n\nNEXT, why not make the connectors at every side, symmetrically? Then the options for patterns are greater. \n\nNEXT, the instructions in the box are fairly (overly) scant and lack a reasonable amount of detail for initial set up. \n\nLASTLY, simply downloading the app went well but then it requires I register twice. The first registration didn’t work. When I tried later to sign on it said I didn’t have the right email and/or password. After verifying both (I had only done them just twenty minutes or so earlier) I finally gave up and re entered the  initial registration, again. \n\nNow that it works I am impressed. For a product that is clunky as far as ease of initial setup, app registration (and the above problems) it is still move and stylish. \n\nThe price point is a little much also. \nBut that’s a longer ‘editorial’ that I’m not in the mood to write at the moment. \n\nYes I would buy it twice. \nBut why not try to make it a fully 5-star product with a little bit more smoothness in registration, set-up, user-friendliness??","updated":"2020-08-10T09:58:12-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7030287184","userName":"hrjeosoxoso78282","userUrl":"https://itunes.apple.com/us/reviews/id339839404","version":"5.2.0","score":1,"title":"my wall is ruined","text":"put them up and wanted to redo them in a different shape, followed directions for removal and didnt just take my paint off- tore the entire wall :)","updated":"2021-02-23T12:27:46-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7003736811","userName":"Kj love","userUrl":"https://itunes.apple.com/us/reviews/id295354815","version":"5.2.0","score":1,"title":"led strip","text":"why can’t i sync the cool designs everyone has made?? only for the new touch things? nothing will work, disappointed","updated":"2021-02-16T20:21:53-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6853866484","userName":"OneRenegade","userUrl":"https://itunes.apple.com/us/reviews/id126714945","version":"5.1.3","score":1,"title":"Layout assistant is unusable","text":"Can’t angle this to actually face a wall","updated":"2021-01-10T09:06:08-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7979254247","userName":"ryanden531","userUrl":"https://itunes.apple.com/us/reviews/id25921237","version":"7.0.0","score":1,"title":"Have to re-add devices after app update?! 😡","text":"😡😡","updated":"2021-11-01T17:54:53-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5959538982","userName":"rds555555","userUrl":"https://itunes.apple.com/us/reviews/id608523347","version":"4.0.5","score":1,"title":"Yuk","text":"Way to hard to set up","updated":"2020-05-17T20:00:42-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7787913288","userName":"dama137","userUrl":"https://itunes.apple.com/us/reviews/id596288858","version":"6.1.0","score":1,"title":"Set up is convoluted with no troubleshooting info out there","text":"No good","updated":"2021-09-09T07:26:24-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6756366450","userName":"dahliaesque","userUrl":"https://itunes.apple.com/us/reviews/id232652528","version":"5.1.2","score":3,"title":"Fantastic Product; Awful support","text":"The product itself is very good.\n\nTHOUGH THE ADHESIVE MOUNTING STRIPS INCLUDED WILL NOT ADEQUATELY SUPPORT THE NANOLEAF CANVAS - EVEN UNDER IDEAL CONDITIONS.\nI don’t know how they could have possibly messed up such a simple thing.\n\nALSO SUPPORT IS IMPOSSIBLE TO REACH. \nWhich kind of puts the whole 2 year manufactures warranty into the “useless” category.\n\nThe nanoleaf App is a disaster. Though there’s little choice but to use it for setup. \nOnce I got everything linked to my HomeKit I haven’t really had a problem. \nBut the scenes and colors are all messed up if I get the scenes via the nanoleaf app, which is really the only option I’ve found. They work, but it’s a careful balance to ensure that you control as much as possible through the Apple Home interface. - which unfortunately is a bit limited for the Canvas.\n\nIt’s a cute product. The adhesive strips failed, under perfect conditions within 36 hours. The manufacturer has been utterly unresponsive. I only received a “we will escalate this” auto message/effectively, b/c even though there was at some point a person’s signature - with no actual individual contact information or phone number; after attempting to reach them through various means my response was “call me [my number included]” and they never did. BUT I ONLY RECEIVED ANY SORT OF REPLY *AFTER* I INITIATED A COMPLAINT THROUGH MY FINANCIAL INSTITUTION.\n\nHad the mounting system not failed (or if I had initially used something better - I’ve discovered that the Velcro type adhesives, including those for mounting framed artwork to walls) sold at hardware stores are wonderfully effective.\n\nOnce the mounting system failed, and thank you to my cat for being the cushion that the control tile and several other’s landed on *sarcasm*. \n\nThe company is fortunate that this happened in the middle of the night and I was too asleep to immediately drive her to the vet, or photograph the fallout. Including the panels that actually broke and I cut myself on. Cat seems okay. But you never know. And depending on how a**inine Nanoleaf is going to be about not contesting at this point the demand for a full refund, since 4 months of non-response - and I did “locate” a number for them, not that it did much use but added proof to my claim that I have done everything possible to contact the manufacturer.\n\nEven Apple tried on my behalf to facilitate communication with the manufacturer, since I purchased it through the Apple Store (which was utterly not something Apple was responsible for, but Apple is utterly awesome in that way. I do my best to purchase all on my electronics through them even the non Apple brand ones, not only due to the good pricing; but also b/c they have never failed in being exceptionally helpful above and beyond their actual responsibilities, especially for non-Apple products.  SO KUDOS APPLE; and to my financial institution for dealing with a very much non-standard case for full refund).\n\nAll that being said. Even though the panels did suffer in the fall, the ones my cat did not “catch” didn’t survive; but the surviving ones, although on some colors they are clearly not as evenly bright as they were prior to ‘utter failure of included mounting system’ they do a nice job of being mounted (as opposed to floor or desk lamps) lighting for my bedroom. They respond well to Siri verbal commands, and HomeKit automations, and at 100% on pure white, they are certainly brighter than any other lighting in my bedroom, and a lot less of a hassle, both in that they are mounted on the wall and I don’t have to physically switch anything on. For an approximately 10’ x 15’ room, in the near vicinity they are more than sufficiently bright for any task requiring good lighting (reading, sewing, makeup application, etc.); for the room as a whole, at the aforementioned setting, I only require additional lighting if I need to do or search for something very detailed at the other end of the room. (And I like things bright-bright, as in I use 1000+ lumens lightbulbs for my desk lamps, not easy to find).\n\nMounting system failure aside - which is very much a manufacturing fault. \nAppearance wise, I expected them to look a bit more solid, they’re reminiscent of shoji screen paper like  appearance. Not so much as they are pictured on the manufacturer’s site.\n\nI highly recommend using a level when mounting them; and I can see how maybe you can get 12 or so squares setup into some interesting pattern - although if you want it to look proper, it does require a level, pre-marking things on the wall, etc. I cannot imagine a full wall display setup, even if it’s square to square; it just takes a lot of precision to get them placed just right (and not misaligned or “sloppy looking”)\n\nThe included connectors, are ... cheap p.o.c., but they *do* work; although it takes care and attention to get everything in place, as you can’t pre-connect, and then mount. Although I was somewhat surprised that when the mounting system failed, and it all came crashing down, only one of the plastic connectors was in any way damaged. \n\nBUT THE APP IS A DISASTER, and HomeKit integration, while - once you get it up and running - is fantastic, there is a limit of what you can do - in terms of the more fancy stuff, including (I’m assuming, I’ve never found a way to make this actually work) music/TV integration - which seems to be the Nanoleaf App failure. \n\nTHE APP REALLY IS UTTER CR*P.\n\nI’m hoping their newer product line is more solid; it seems from the specs they did pay some attention to the fact that the canvas just failed to deliver.\n\nTHOUGH I SURE AS H*** AM NOT GOING TO TRUST ANY ADHESIVE STRIPS THAT THEY INCLUDE FOR WALL MOUNTING. \nThat and the new heavy-load Velcro-type mounting systems, aside for actually being strong enough to hold up very large items (I’ve a 3’x4’ heavily framed artwork, that’s hanging just fine on my walls with zero issues); it’s also far easier to reconfigure how everything is set up. \n\nBUT SHAME ON YOU NANOLEAF.","updated":"2020-12-15T08:32:11-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7335831426","userName":"toni sov","userUrl":"https://itunes.apple.com/us/reviews/id155838547","version":"5.3.0","score":1,"title":"Terrible","text":"This is a terrible app, not intuitive cumbersome and not userfriendly.","updated":"2021-05-13T19:17:10-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"7047376974","userName":"hspbail","userUrl":"https://itunes.apple.com/us/reviews/id344775330","version":"5.2.0","score":1,"title":"Ok","text":"Not going well to start","updated":"2021-02-27T20:15:59-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5349956375","userName":"Dontbuythisterribleappever","userUrl":"https://itunes.apple.com/us/reviews/id197988537","version":"4.0.1","score":1,"title":"Terrible. Own over $16k. Barely syncs","text":"Never syncs how it should. Adhesive falls off. Garbage.","updated":"2020-01-01T22:54:34-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"8045854289","userName":"1872shayshay","userUrl":"https://itunes.apple.com/us/reviews/id838652258","version":"7.0.1","score":1,"title":"Ugh","text":"Always saying that my nanoleaf is unreachable","updated":"2021-11-20T17:21:06-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5215248600","userName":"S¥stem","userUrl":"https://itunes.apple.com/us/reviews/id31636801","version":"3.5.3","score":2,"title":"Horrendous pairing","text":"Horrible pairing experience","updated":"2019-11-29T23:14:04-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6472667545","userName":"SBS in WA","userUrl":"https://itunes.apple.com/us/reviews/id122840807","version":"4.1.4","score":1,"title":"Disconnects from iPhone app","text":"Inconsistent connection.","updated":"2020-09-26T19:55:29-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6850995451","userName":"PBHarryPlayzyt","userUrl":"https://itunes.apple.com/us/reviews/id1215407241","version":"5.1.3","score":1,"title":"Frick  u","text":"Most complex anonnysing thing every","updated":"2021-01-09T15:37:09-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"5724414751","userName":"Superduperloverlover","userUrl":"https://itunes.apple.com/us/reviews/id105966068","version":"4.0.3","score":1,"title":"Whyyyy","text":"My app never stays connected to my unit","updated":"2020-03-27T22:01:51-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"},{"id":"6746994045","userName":"TheDustinPeters","userUrl":"https://itunes.apple.com/us/reviews/id144624387","version":"5.1.2","score":1,"title":"Miss the old app version","text":"Title","updated":"2020-12-12T17:15:18-07:00","url":"https://itunes.apple.com/us/review?id=1049333656&type=Purple%20Software"}]