[{"id":"5398746083","userName":"NickKafkalas","userUrl":"https://itunes.apple.com/us/reviews/id136719052","version":"1.7.1","score":2,"title":"Honeywell doesn't integrate","text":"So my smart vents can't integrate to my Honeywell home and t9 smart thermostats.  The Nest and Escobee links seem to work in order to sign in but Honeywell doesn't do anything at all.  A spinning wheel then nada.  Not sure why that is.  I have notified them about this issue and get the standard response about how they have notified the engineers about this issue with no timetable whatsoever.  If I had known about this issue beforehand I might not have purchased.  All I want to do is integrate the 2 systems which I was informed I could do quite easily.  Maybe I have to wait for an app update to fix this.  I don't know.","updated":"2020-01-13T07:07:27-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"4933086941","userName":"Roughnose","userUrl":"https://itunes.apple.com/us/reviews/id101128265","version":"1.7.1","score":1,"title":"Bad app","text":"This app is full of bugs. I’ve had the Keen system for about a year now. Running three vents and two temperature sensors,  connected to Nest thermostat. As others have said, the vents are constantly disconnecting. The app is just about impossible to use. I’ve been on with tech support multiple times to get temperature sensors to connect. Turns out I had beta hardware. They did send me a new temperature sensor and it connects now. However they never did get my keen hub to update firmware. They said it’s my ISP.  Of course ISP says it keen. Never got anywhere with that. In the app trying to set the temperature for the vent to close or open it just resets to original value. I had to do it prob 9 or 12 time to get it to stick. One vent I had to reset to get the app to set the close temp.  Constant issues. Going to try SmartThings hub next and see if it works better. When it all works it’s great and does exactly what is advertised. The problem is it rarely works for long. Have to mess with it 2 to 3 times per week. It’s a real pain.","updated":"2019-10-12T11:45:07-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"3403207146","userName":"Bens Soft Pretzels","userUrl":"https://itunes.apple.com/us/reviews/id179781762","version":"1.7.0","score":3,"title":"Eventually I think the devices will work fine.  Very close","text":"I integrated the keen with ecobee.  Couple of issues that I see. 1.  It works with the Ecobee remote sensors for each room, but it doesn’t utilize the thermostat sensor to control the vents in he same room as the thermostat.  2. What is the Exclamation mark on connected device in the app?  3. Seems to work once I scheduled the occupied room and it go’s through the next cycle. As long you don’t manually touch the controls.... it appears to automate with the ecobee sensors. \n\nI haven’t played enough with the automation and smartthings. I would like to see if the home hits an average home temp then the keen vents open with the ecobee whole house fan starts running with all the ceiling fans executing instead of the A/c kicking on.  Especially if the window sensors are open.","updated":"2018-11-10T11:48:15-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"5758201254","userName":"djcozmik","userUrl":"https://itunes.apple.com/us/reviews/id107477796","version":"1.7.1","score":1,"title":"Broken - Buyer Beware!","text":"Update: the app, or possibly Keen’s server(s), have been down for days now with. Support has been unreachable. The vents are now unusable, with no indication of a fix.\n\nPrevious review:\n\nGreat Idea, but Half Baked\n\nThese vents are a great idea, and it's clear that some time has been spent on the hardware. Unfortunately, the iOS app and corresponding software seems to be half baked. The interface leaves a lot of interpretation to the user - does +1 degree in a room mean that it's a degree hotter than it should be, or that you want it a degree hotter? You can schedule 'occupancy' times for rooms, but the settings are too coarse - and the weekend settings would probably make more sense if they allowed you to set up late nights on Friday and Saturday. Instead it's Saturday and Sunday, which are indeed the weekend days but not necessarily the right days for this application.\n\nAlso the app's 'Auto' mode, which should really be its top feature, hasn't worked for about a month. Tech support from Keen stopped responding to messages - but they seem more than happy to post updates about their attempts to recruit investors for the company.\n\nStay away until there are signs of life from the development team and improvements to the software!","updated":"2020-04-03T16:34:06-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"6448705880","userName":"realDAN_VAN","userUrl":"https://itunes.apple.com/us/reviews/id155272603","version":"1.7.1","score":1,"title":"I agree with ‘Bad App’ review","text":"I’ve had my smart vent since the beginning of the Pandemic. I purchased it since I’d be working from home and need a better way to assist airflow as opposed to a yard stick. The yard stock is better. This thing is a joke. It works great for a few days then it disconnects. It works great for a few days and it starts becoming possessed by opening and closing non stop. It works great for a few days and then you have to delete the room and reset everything and repair. I’ve tried manual mode without the auto temp, it does what it wants to. I tell it to open, it closes. I put it to 50% it goes to 45 or 58. I manually close it and have it set to closed and it will open back up. \n\nKenn support is a joke. Contact them through their chat and it’s days later off at all you hear back. Same goes with email contact. \n\nI’m really tired of theirs and this devices nonsense. They’ve advised one time it is my ISP causing a connection issue. I tried my MiFi I use for when I travel and it still has the same issues. I’ve reset these devices I don’t know how many times. I’m about to go back to the yard stick and manual vent. \n\nAvoid this company like the plague.","updated":"2020-09-20T03:50:47-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"5053736207","userName":"michael sd md","userUrl":"https://itunes.apple.com/us/reviews/id203220514","version":"1.7.1","score":1,"title":"What Happened","text":"I honestly had no problems with the system since installing it over two years ago. It performed beautifully and integrated seamlessly with my Ecobee thermostats. Then 4 days ago I came home and noticed the loud rushing of air upstairs only to find all the vents closed except one closes to the air handler. The door of the handler closet was blowing open because the force of he air split open the plenum. I sent an email with the problem on Tuesday and received a reply which was no help. The system is no longer automated opening and closing vents to balance the temperature throughout the house. It’s now more than 24 hours since my last reply with no solution and no support to call or call back as I requested. The app hasn’t had an update in 9 mos. Expensive vents that don’t work!","updated":"2019-10-30T20:13:43-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"2818744036","userName":"jfbloom22","userUrl":"https://itunes.apple.com/us/reviews/id30902074","version":"1.5.5","score":4,"title":"Great hardware","text":"I am really impressed by the quality of the hardware of these vents. The software has been a bit of a let down. Originally they tried to use an internal temperature sensor to help automatically adjust the vent. This never worked very well and I always wondered how the vent would measure accurate ambient temperature in the room. The sensor placement would be better if it was where the people live. Now the app no longer has this feature. It has a simple schedule for occupancy of the room. I really like how easy this is and wish it was like this from the beginning. If I want automatic adjustments, I’ll buy some of the temperature sensors.","updated":"2018-07-02T03:24:34-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"6490029145","userName":"overpoweredbyfunk","userUrl":"https://itunes.apple.com/us/reviews/id32484773","version":"1.7.1","score":1,"title":"Don’t Waste Your Money","text":"I’m an early adopter of smart home products and have a high tolerance for half baked products, but Keen is the worst IoT app and product I own.\n\nThe app is extremely buggy. Try going to the support page. I’ll wait. Then try leaving the support page without closing the app. It can’t be done! \n\nBack in March I my system had a communication issue. Nobody at Keen would help be troubleshoot it, but for some reason in May they sent me all new vents and bridges and sensors. Sounds great, right? Well, turns out I just needed a single bridge replaced—something they easily could have figured out had they spent a few mins on the phone with me. \n\nThen the quest to Mail all the crap back to them started. I was assured a return label was going to be emailed “tomorrow” then a week went by. Then another week. Then an assurance that someone would call me. Then a few more weeks. Finally, I was asked to mail it back to them at my own expense and get reimbursed. I laughed at this request and was again told I would get a call. It never came and I finally got rid of the vents after being Keen’s warehouse for 2 months.","updated":"2020-10-01T16:02:25-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"3571805891","userName":"rchasea","userUrl":"https://itunes.apple.com/us/reviews/id203656297","version":"1.7.1","score":5,"title":"Very impressed","text":"The main reason we purchased this product is because we have a large family room that never felt warm in the winter. Keen has 100% solved that issue. My wife and I are very impressed. \n\nBy far the most impressing part of Keen is the hardware. The vents are beautiful. Solid aluminum air blades and a well engineered battery pack for easy battery replacement. \n\nI can understand the poor reviews because there are some bugs in the app but I worked through these bugs with their chat support feature in the app. In about a week of back and forth Keen is running perfect and has been for a few months. They have some small kinks to work out which is expected on such a new and innovative product, but the 1-2 star reviews are unwarranted and coming from people who don’t know the proper channels to submit feedback/feature requests. \n\nKeep up the good work. Excited to see what’s ahead for keen.","updated":"2018-12-25T07:56:25-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"2063584065","userName":"RandySK","userUrl":"https://itunes.apple.com/us/reviews/id38027439","version":"1.5.5","score":1,"title":"Does not work as advertised - Poor support","text":"I bought this vent system 2 years ago.  It was supposed to use temperature sensors in the vents to open and close them to balance the temperature across rooms and make heating and air conditioning more efficient.  It has never done this.  The automatic system has been ‘beta’ the entire time and does not work.   The vents often go offline, requiring the batteries to be removed and reinserted.  They sent out new battery packs with padding around the batteries, which hasn’t helped.   Now they are plugging external temperature sensors you need to buy.   They are supposed to be using the ones built into the vents, but those apparently don’t work either.  I would avoid this system until the software is out of beta and working as promised.","updated":"2018-01-06T12:19:19-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"7226848976","userName":"Brightstarbeing","userUrl":"https://itunes.apple.com/us/reviews/id38341496","version":"2.0.1","score":3,"title":"Finally!!!","text":"They’ve finally updated the app!  Unfortunately, that’s not saying much. The app went from completely unusable (especially for ecobee owners) to usable and as far as I can tell, FAR less buggy. Don’t expect any long awaited new features, but at least the vents can now perform their basic functions. And look! You can ACTUALLY close the support page now! How precious! Their customer service still doesn’t have a phone number and it’s still atrocious though. Three stars for doing the bare minimum, chaps! I was convinced you were a dead company!","updated":"2021-04-15T18:37:05-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"6713305833","userName":"El-neto","userUrl":"https://itunes.apple.com/us/reviews/id100725319","version":"1.7.1","score":1,"title":"UPDATE: RETURN THIS PRODUCT!!!","text":"No updates on the app for over 6 months. Vents are not synchronized with the app at all. \nEven in the app itself vent may say 100% open, when you click on room it says 0%, when you go see it it may be either.\nI spent over 2K$ in vents for my home and app makes them almost useless. Might as well use manual vents (at least it’s easier to tell if open or closed).\n\nThis is now 2020.\nAfter a couple of years finding workarounds on every issue, dealing with support, absolutely NO APP UPDATES since who knows when. Worst ecobee integration (if you want to call it that) ever. All of which I’m sure would be better if they had added HomeKit support (which keen app developers are in denial about based on their own documentation on their website).\nJust don’t bother. I regret spending the money, I thought this would be a good idea, purchased 16 of these cents for my home. I really cannot think of a bigger mistake when it comes to home improvement. \nJust don’t... return it... buy something else.","updated":"2020-12-03T07:40:42-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"5807089220","userName":"mrswitters","userUrl":"https://itunes.apple.com/us/reviews/id44066141","version":"1.7.1","score":1,"title":"Worked well until it didn’t work at all","text":"These vents paired with two Ecobee thermostats solves the uneven temperature issues we had in our home. For about 3 months. Then two vents in my home office stopped working, and despite multiple messages sent to their support over a month, they didn’t fix it. Turns out that they now seem to have a global issue where the entire system is malfunctioning (which they refer to as a “slight interruption” on their website, ha ha) and none of my vents (or anyone else’s) are working. They’ve stopped responding to support requests. I wonder if the company has failed and they just haven’t let anyone know yet. Don’t spend a cent with this company.","updated":"2020-04-13T13:43:19-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"1879577768","userName":"ScienceSurfer","userUrl":"https://itunes.apple.com/us/reviews/id20954362","version":"1.5.3","score":2,"title":"Balance function is buggy","text":"When trying to adjust room temperature differentials in the balance mode, the app allows you to select a temperature adjustment up or down for a given room, but this setting resets to its previous value after a short interval. This bug has persisted across updates.","updated":"2017-10-27T16:24:39-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"7176590007","userName":"Joe186","userUrl":"https://itunes.apple.com/us/reviews/id167742818","version":"2.0.1","score":4,"title":"Version 2.0.1 works with ecobee again","text":"Just downloaded the new update and my ecobee now connects again. It has been awhile, so it may be my imagination, but it seems the vents respond quicker to change made in the settings. Hopefully they are back on track, as my system worked pretty well until it didn’t.","updated":"2021-04-02T16:15:03-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"3686797683","userName":"loanflyer","userUrl":"https://itunes.apple.com/us/reviews/id36543966","version":"1.7.1","score":4,"title":"App needs improvement","text":"I revised my review as they updated the app:\n\nThe system works well. You can schedule registers to open/close, or they can open/close based upon temperature. \n\nManual control is a little more challenging and some aspects are a bit confusing. However, they’re making progress. I definitely recommend and I raised my rating from a 2 star to a four.","updated":"2019-01-23T15:37:40-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"6097615702","userName":"VRod007","userUrl":"https://itunes.apple.com/us/reviews/id349631191","version":"1.7.1","score":1,"title":"Open-source Software","text":"Before you crash & burn as a commercial entity, please open source your software that others may keep their Keen software updated! Please don't abandon your customers who've helped turn your dream into a reality & spent small fortunes trying to just feel more comfortable & save money over time with their HVAC systems! If at all possible, leave instructions for customers to run their own local servers to keep their investments from becoming a loss! Do unto others as you would have them do unto you!","updated":"2020-06-19T14:20:16-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"7177085136","userName":"George/Lynne S.","userUrl":"https://itunes.apple.com/us/reviews/id28720008","version":"2.0.1","score":5,"title":"Very helpful support","text":"When ecobee added two-factor authentication, Keen Home app stopped connecting to it.  I reported it, and they stayed in constant communication with me, having me test parameters and send results; eventually they identified the authentication issue and resolved it with version 2.0.1.","updated":"2021-04-02T19:26:06-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"6942866808","userName":"wax trax! fan","userUrl":"https://itunes.apple.com/us/reviews/id37936373","version":"1.7.1","score":1,"title":"Buyer Beware","text":"I really wish I had bought Flair vents before they sold out, I installed the Keen app, and I created an account, signed in, and it crashes after the first question.  It crashes if you wait and don’t answer the question or crashes after you do.  Do not buy Keen Smart Vents.  This app may be the worst smart home app in Apple’s App Store.  A total disgrace.   The support section of Keen’s site is useless.  Truly unconscionable how they allow this.","updated":"2021-02-01T19:24:50-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"6991828648","userName":"downlink","userUrl":"https://itunes.apple.com/us/reviews/id32635100","version":"1.7.1","score":1,"title":"No updates in 2 years","text":"This app has not been updated in 2 years. It doesn’t really support the new iPhone (12 Max) screens correctly. The app has lots of bugs. I have contacted support about getting it to work with my ecobee smart Thermostat, 3 different times now, and they don’t respond. I would be cautious of buying the “smart vents” when the developers clearly isn’t updating the app anymore...","updated":"2021-02-13T20:29:29-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"2878880593","userName":"Butchie71","userUrl":"https://itunes.apple.com/us/reviews/id27712561","version":"1.5.5","score":4,"title":"Great support and consistent improvements","text":"These vents work for what I need.  I have a bonus room that is tough to heat and cool and, along with the Ecobee integration, the Keen Home vents have dramatically improved the comfort in that room.  And, they have/are making improvements to the App allowing it to be more stable and functional!","updated":"2018-07-10T08:32:49-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"3491339621","userName":"yas375","userUrl":"https://itunes.apple.com/us/reviews/id167763933","version":"1.7.0","score":3,"title":"Good idea, but software implementation doesn’t look good","text":"Have the time I manually change “openes” of the vent in the app it ignores it and remains on previous value without letting me know why. It trains me not to trust it. \n\nLow hanging fruit: use same rounding method everywhere in the app. E.g. on the list of rooms it shows “85% open”, while on room details screen it shows 86%.","updated":"2018-12-03T21:43:38-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"7208269114","userName":"Rhys82","userUrl":"https://itunes.apple.com/us/reviews/id36640013","version":"2.0.1","score":4,"title":"Thank you for updating the app!","text":"Ecobee integration works again, hopefully this addresses long standing challenges authenticating.  I hope they continue updates, would love more advance me control and HomeKit, Siri shortcut compatibility.","updated":"2021-04-10T18:00:39-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"5452350150","userName":"ET:","userUrl":"https://itunes.apple.com/us/reviews/id105495728","version":"1.7.1","score":1,"title":"Tired of Messing with it","text":"Iv’e been patient for years thinking these were going to get better. Don’t waste your time. They are completely unreliable. \n\nI have 7 vents, and extender hub and ecobee temp sensors.\n\nA simple notification that a vent has gone offline would help a TON... but the only notification I have had is my daughter waking me up in the middle of the night because she is freezing.","updated":"2020-01-26T12:56:10-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"6707183596","userName":"flibitijibibo","userUrl":"https://itunes.apple.com/us/reviews/id26317957","version":"1.7.1","score":1,"title":"Out of Business","text":"Keen Home was absorbed into another company and effectively closed up shop - they have just enough running to get more user accounts and sell the last of their inventory, but don't expect any support from the fake employee accounts in the app. Buy some vents for a few bucks and flip them on/off with a yardstick that has \"SMART APP\" written on it.","updated":"2020-12-01T13:20:02-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"2030946162","userName":"Doumitb","userUrl":"https://itunes.apple.com/us/reviews/id120305622","version":"1.5.4","score":3,"title":"The latest update no longer showing temp","text":"The latest update is no longer showing the temp next to the ecobee sensor icons associated with the rooms.  In addition when the vent is no longer connected the App does not show this.\nPlease fix both issues \nThank you","updated":"2017-12-26T20:51:31-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"2072706936","userName":"MW109","userUrl":"https://itunes.apple.com/us/reviews/id37331290","version":"1.5.5","score":3,"title":"Issue if you use Ecobee - Updated review","text":"I suggest not updating to latest Keen app if you’ve integrated your Smart Vents with Ecobee temperature sensors. Mine were working ok (with occasional reauthorizations) but haven’t worked since the app upgrade.\n\nUpdate - got it to work by deleting two phantom Keen temperature sensors “seen” by the updated app.","updated":"2018-01-09T09:00:23-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"6705237660","userName":"BerryvilleDuo","userUrl":"https://itunes.apple.com/us/reviews/id472399477","version":"1.7.1","score":1,"title":"Never quite delivered on the promise","text":"No real Dev effort has gone into this app in years. No meaningful updates and the last beta 2 years ago was never released which had enough features to keep me at the time. Moved on to Smartthings to control vents directly leveraging Ecobee with Yves Racine’s “Smart Controller for Ecobee & smart vents” which just works and works well.","updated":"2020-12-01T01:20:50-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"4307324028","userName":"Writtenbyangela","userUrl":"https://itunes.apple.com/us/reviews/id16658676","version":"1.7.1","score":2,"title":"App rarely works","text":"The app rarely works.  I try to open the vents and the app shows open, but the physical vent remains closed.  I have to go back and forth, opened and closed, before it will finally work (and sometimes not even then).","updated":"2019-06-12T20:45:56-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"4032833333","userName":"BigRoad user","userUrl":"https://itunes.apple.com/us/reviews/id102065365","version":"1.7.1","score":1,"title":"Their product doesn’t work!!! Beware!!!","text":"Their product does not even work the vents do not automatically close by themselves. They claim it’s possibly a server issue but it’s been a while now. They are slow at responding to messages also they don’t even have a customer service number so shows how little they care about their customers.","updated":"2019-04-19T07:04:31-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"5932183907","userName":"jungledrew64","userUrl":"https://itunes.apple.com/us/reviews/id109155131","version":"1.7.1","score":1,"title":"Save your money.","text":"I spent a few hundred dollars on these smart vents thinking that the apps short comings would be ok as long as the vents worked with the cloud. I was wrong, if the app is broken, the whole system is broken. I will have to resort to using some other utility to meet my needs because the app simply does not work.","updated":"2020-05-11T09:10:24-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"3378269721","userName":"GRAYGOOSE714","userUrl":"https://itunes.apple.com/us/reviews/id85969531","version":"1.7.0","score":1,"title":"Nope, not ready.","text":"Don’t waste your money. This app is very out of date, their product could be insanely nice but one again programming and software are holding them back from being great. I am shocked that for something that is suppose to take over something “dumb” and be “smart” they sure are frustrating. Please update your software!!!!!","updated":"2018-11-03T19:16:00-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"6512310306","userName":"carimer","userUrl":"https://itunes.apple.com/us/reviews/id23633550","version":"1.7.1","score":1,"title":"The app crashes 100% of the time","text":"I’m running iOS 14.0.1 and the app simply won’t work. It crashes about 4 seconds after opening. I’ve restarted the iPhone and it does not help.\n\nNo update in a year? Come on Keen, that’s unacceptable by any standard. How about building an app that can open and remain stable.","updated":"2020-10-07T21:12:50-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"5198856646","userName":"TheGadgetinator","userUrl":"https://itunes.apple.com/us/reviews/id47651966","version":"1.7.1","score":1,"title":"Needs major update ASAP","text":"Please update Nest integration to work with Google login. \n\nThe scheduling feature doesn’t work at all, it needs a total overhaul. \n\nNeeds better logic and automation. Such as smart scheduling like the best thermostat, which builds a schedule based on how you use it.","updated":"2019-11-26T02:08:53-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"4305169184","userName":"Jokeen84","userUrl":"https://itunes.apple.com/us/reviews/id282328567","version":"1.7.1","score":2,"title":"App keeps closing on me","text":"Got my new keen home vent and installed it. Connected it to my SmartThings system no problem. However the keen app is really bad, keeps shutting down when try to select the mode of the system. Also my email and password won’t work either even after I reset it.\n\nKeen home please fix you app it is going to cause a lot of people issues and they will go somewhere else for smart vents if this issue lingers. \n\nThe vent is awesome thou works great with SmartThings!!!!\n\n-JOJO","updated":"2019-06-12T08:51:37-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"1616247754","userName":"Originator 88","userUrl":"https://itunes.apple.com/us/reviews/id314157208","version":"1.4.1","score":2,"title":"Missing analyze and demo features","text":"If it has the analyze my house and demo features it claims to have in the FAQ, I can't find them. Also it shouldn't force you to create an account if you're only ready to demo the app.","updated":"2017-05-17T04:34:23-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"3109892987","userName":"Bamaboiler","userUrl":"https://itunes.apple.com/us/reviews/id122091431","version":"1.5.5","score":1,"title":"Good idea","text":"But it never works.  The hub has a range of about 5 feet and I have to power cycle everything almost daily.  I gave up a long time ago.  If it had worked this would have been a solution to a lot of my issues, but unfortunately, it caused more headaches.","updated":"2018-08-24T16:48:35-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"3969484707","userName":"Memphis1968","userUrl":"https://itunes.apple.com/us/reviews/id203038159","version":"1.7.1","score":1,"title":"Stopped returning emails.","text":"I need to return the items and with email as the only option for customer service they have stopped responding as soon as I requested an RMA. Not sure what’s up.\n\nFollow up. Products not responding to server. Won’t help rectify problem. Terrible customer service.","updated":"2019-04-04T11:28:38-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"1808276183","userName":"Prometheas","userUrl":"https://itunes.apple.com/us/reviews/id24303147","version":"1.4.1","score":3,"title":"Decent","text":"I'm only a week in, but so far the iPhone software and events themselves seem to be behaving as advertised.\n\nI really wish this app both supported HomeKit and actually featured iPad support.","updated":"2017-09-24T18:45:07-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"7019436138","userName":"jaybc11","userUrl":"https://itunes.apple.com/us/reviews/id301835056","version":"1.7.1","score":1,"title":"Cant even use","text":"Installed several vents and downloaded the app. Created an account to start setting up the vents. App crashes 10 seconds into opening repeatedly. Had such high hopes for these. Great concept, poor execution.","updated":"2021-02-20T17:29:34-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"2792325568","userName":"Dale121557","userUrl":"https://itunes.apple.com/us/reviews/id440185335","version":"1.5.5","score":2,"title":"Support","text":"Support fails in helping in replying back. There no way to get help on a phone calling. Needs a phone number to help with problem.","updated":"2018-06-28T18:56:48-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"5161511412","userName":"LeviZell","userUrl":"https://itunes.apple.com/us/reviews/id411716496","version":"1.7.1","score":1,"title":"Broken","text":"Worst maintained software - support responds but nothing is ever updated. The hardware is good but the vents constantly disconnect, you can no longer connect with Nest thermostats, and the apps don't open and choose when they should.","updated":"2019-11-17T15:34:07-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"1904129573","userName":"rmspecialized","userUrl":"https://itunes.apple.com/us/reviews/id41740471","version":"1.5.3","score":1,"title":"Serious crashes","text":"What is going on the more updates the less it works. I have had these for awhile now and it sets my rooms to 25% and has blown my capacitor on my hvac twice now. I am worried it will ruin my system. Why would they have it do that?","updated":"2017-11-07T08:12:53-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"5769205092","userName":"dvpva","userUrl":"https://itunes.apple.com/us/reviews/id34313017","version":"1.7.1","score":1,"title":"Ecobee Integration No Longer Works","text":"The integration with Ecobee seems to no longer be working.  I am unable to authenticate with Ecobee to get room temperature readings.  Please update this as it seems like it may be as simple as redirecting to a new login page.","updated":"2020-04-05T20:54:19-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"2936475135","userName":"chuckhenderson007","userUrl":"https://itunes.apple.com/us/reviews/id22939132","version":"1.5.5","score":1,"title":"System doesn’t work","text":"After waiting 6+ months and then being sent the wrong size of vents we finally got them and the worked for about a month.  The app is filled with bugs.","updated":"2018-07-19T16:43:47-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"4450365366","userName":"CJSlim2001","userUrl":"https://itunes.apple.com/us/reviews/id25245777","version":"1.7.1","score":1,"title":"Crashed 4 seconds after loading","text":"How are you supposed to do anything when the app won’t stay open longer than 4 seconds? Makes their “Smart Vents” nothing more than expensive duct plugs.","updated":"2019-07-12T17:03:15-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"6690023795","userName":"chauhansv","userUrl":"https://itunes.apple.com/us/reviews/id170859810","version":"1.7.1","score":1,"title":"Poor app features","text":"The app is terrible. Samsung SmartThings integration was a blessing but then now after a year the vents are failing one by one. Tried new batteries but they don’t even power up. Support is a joke.","updated":"2020-11-26T20:38:16-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"6991770990","userName":"wildasswilson","userUrl":"https://itunes.apple.com/us/reviews/id110158142","version":"1.7.1","score":1,"title":"Buuuugs","text":"I can’t get the app to stay open long enough to get past the first pop-up. Can someone fix this? Did the company go out of businesses","updated":"2021-02-13T20:06:55-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"6096758959","userName":"pvs100","userUrl":"https://itunes.apple.com/us/reviews/id29168266","version":"1.7.1","score":1,"title":"Worst mess ever.  App crashes and won't let set up system","text":"Don't spend your money and run.   No way to call support.  Waiting to get my money back.","updated":"2020-06-19T09:43:38-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"2535723479","userName":"Angrybird killer","userUrl":"https://itunes.apple.com/us/reviews/id114784942","version":"1.5.5","score":1,"title":"Don’t waist your money! Total scam!","text":"Wait forever for your system, never works right. Tech support is super slow and all they do is hook you for more money buying products that don’t work!","updated":"2018-05-11T23:16:59-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"1643480481","userName":"Doug5","userUrl":"https://itunes.apple.com/us/reviews/id85507066","version":"1.4.1","score":2,"title":"Scheduling","text":"Need ability to finer tune scheduling","updated":"2017-06-13T18:13:55-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"7228698118","userName":"RyZau","userUrl":"https://itunes.apple.com/us/reviews/id34053876","version":"2.0.1","score":1,"title":"Awful","text":"Absolutely a waste of money. Product doesn’t work, app is terrible, customer service non existent.","updated":"2021-04-16T07:22:27-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"7313186380","userName":"SS14141414141414141","userUrl":"https://itunes.apple.com/us/reviews/id857126010","version":"2.0.1","score":1,"title":"Liquidating","text":"This company cares more about its new Meli product “keen home pro.” They’ve taken your money from a discontinued product in order to fund their new scam","updated":"2021-05-08T08:18:41-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"1890279590","userName":"DJ Abell","userUrl":"https://itunes.apple.com/us/reviews/id28581490","version":"1.5.3","score":1,"title":"Never works","text":"The system has potential but software/ app very buggy and does not work.","updated":"2017-11-01T10:32:24-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"5929255314","userName":"Quezon eu","userUrl":"https://itunes.apple.com/us/reviews/id314849071","version":"1.7.1","score":1,"title":"App stop working","text":"App stopped working and deleted my login information","updated":"2020-05-10T15:40:21-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"6635558818","userName":"69Jonas69","userUrl":"https://itunes.apple.com/us/reviews/id8072154","version":"1.7.1","score":1,"title":"No updates in a year","text":"Robert Herjavec doesn’t support this project any more and there is no customer service.","updated":"2020-11-11T20:31:09-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"3859261454","userName":"California Float Concepts","userUrl":"https://itunes.apple.com/us/reviews/id517985765","version":"1.7.1","score":1,"title":"Waste","text":"Don’t waste your time with this bug filled app.  Equipment is horrible too, they need to go back to the drawing board.","updated":"2019-03-08T19:08:46-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"3339576307","userName":"OldManNiko","userUrl":"https://itunes.apple.com/us/reviews/id31389898","version":"1.7.0","score":1,"title":"Crashes","text":"This app crashes immediately. Very bad start to an install.  Any alternatives?  I’m stuck in the water.","updated":"2018-10-24T14:24:29-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"5205715859","userName":"mlouderb","userUrl":"https://itunes.apple.com/us/reviews/id157226836","version":"1.7.1","score":1,"title":"substandard app and company","text":"worst app and product used to date. poor app integration and constant connection and logic failure. \n\ncompany solution is to uninstall and reinstall app - never mind the lost time and setup configuration. \n\ndon’t recommend buying these vents.","updated":"2019-11-27T17:53:18-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"3139179875","userName":"1Eydjax","userUrl":"https://itunes.apple.com/us/reviews/id37757026","version":"1.5.5","score":1,"title":"Online issue","text":"If the day ends in a “Y” they’ve all fallen off the network. You drag it the ladder or just swear a lot","updated":"2018-08-31T19:25:30-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"4581982418","userName":"Gh2708","userUrl":"https://itunes.apple.com/us/reviews/id171213283","version":"1.7.1","score":5,"title":"Love my Keen System","text":"I like everything about this system. \n\nPurchase Help: Before I purchased Keen in July 2018, I looked at the other two larger systems. The help I received from Keen before purchase was very good. One of the other systems wanted to charge me for an estimate. Not Keen. Great help in purchasing.\n\nShipping: The devices arrived just as promised. The SUPPORT button was so easy to click and ask the status of my order. Support is not 24-7 but they ALWAYS got back to me the next day.\n\nInstallation: I was offered help with the installation but decided to do it myself. I followed the instructions and everything worked! It was EASY.\n\nSo how is it working now 1 year later? Really good!!! I had some issues (not understanding the system) so I contacted Support and they were very responsive. They can see my system and offered help in settings etc. \n\nMy system works perfect with my Ecobee Thermostat and Ecobee room sensors along with the Keen temp sensors. I can now keep my bedroom nice and cool at night while closing vents in my office and other unused rooms when not occupied. The Control feature of each vent allows me to tell the system when I am not in that room and close the vent. NICE!\n\nI would like to see the temp sensor help with the Control of the vents by allowing me to set temps at certain times of the day. Right now it is all occupied or unoccupied. I know Keen will continue to improve. The 1 & 2 star reviews are not valid, in my book. I feel they did not try to contact Keen Support with their problems. Keen Support has ALWAYS helped me in a very timely manner.\n\nLooking forward to what’s next!","updated":"2019-08-07T07:48:18-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"6875406536","userName":"Rodriguise","userUrl":"https://itunes.apple.com/us/reviews/id32955413","version":"1.7.1","score":1,"title":"Ecobee integration is broken","text":"This app is so bad. Don’t buy these vents support is terrible.","updated":"2021-01-15T21:54:21-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"1644350665","userName":"Ric9876","userUrl":"https://itunes.apple.com/us/reviews/id86041068","version":"1.4.1","score":1,"title":"App crashes","text":"The app crashes every time I try to add a thermostat or hub","updated":"2017-06-14T11:13:20-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"3609885709","userName":"La le","userUrl":"https://itunes.apple.com/us/reviews/id134870407","version":"1.7.1","score":4,"title":"It’s OK","text":"Hardware is nice and well thought out but I would prefer hardware that’s a bit more low profile (smaller box containing the motor and batteries). I found the vents fit snug into my vent openings because they are shallow and the keen vent is tall.\n\nI found the software confusing. I linked it with my Ecobee and room sensors and didn’t realize you have to click into the room then select “set temperature limit” then go back out to the home controls to set the optimal temperature for the room. Why not just provide 2 sliders or modes on the home controls screen? Optimal temperature limit and manual override opening/closing vents?\n\nA min/max open threshold is a good idea as well. Not less than 10% but not more than 80% for example.\n\nI also had issues getting the vent and smart bridge to communicate (on a desk next to each other) I had to power cycle the smart bridge several times to get it to connect.\n\nI’ve just got the one vent installed in a room close to the smart bridge but was disappointed that I couldn’t get it to connect in the room down the hallway where I need the vent. It seems silly to have to buy repeaters in this day in age. It’s also confusing when my ecobee room sensors run off a coin battery and I have them throughout the house (far from the ecobee3 lite thermostat) and require no repeaters to work. Maybe this is the difference between Zigbee and z-wave? It feels like a scam to buy more smart bridges as repeaters when we have mesh WiFi and Bluetooth head phones that can connect thru many walls and floors.\n\nIf the reason Keen used Zigbee is low power, I’d rather buy a battery charger and recharge the batteries and replace them every 6months so the vents can run off a real wireless protocol like WiFi or Bluetooth vs. buying antiquated hardware repeaters.","updated":"2019-01-03T21:18:07-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"1325057176","userName":"David Reviewer Guy","userUrl":"https://itunes.apple.com/us/reviews/id412153578","version":"1.1.1","score":2,"title":"Vents are nice but Connecting the smart hub is not reliable","text":"I could not get the smart hub to register until I power cycled it a few times.  Then could not get a vent to register. \n\nI moved the hub to a new location when I got a few more vents and could not get the hub to connect. I contacted support but did not get a human on the phone or a response by email or the app chat feature. \n\nI finally got it working again. \n\nNow I am in the process of figuring out how to use the vents. No good instruction exist so I am moving my vents from room to register room. \n\nI asked for help with setup and have not received a response. I am only invested 3 vents and a hub. I have a nest so thought this would be a good choice. \n\nI do have a little time with the vents before the return period is over.\n\nHope to be able to stick with keen home, but I can't see sinking more than the cost of the hub until I get a better experience\n\nI will keep my fingers crossed","updated":"2016-01-30T10:23:26-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"5017303522","userName":"Rassaan","userUrl":"https://itunes.apple.com/us/reviews/id647807698","version":"1.7.1","score":5,"title":"Love it!","text":"This app is awesome!!!","updated":"2019-10-25T20:25:14-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"7366341085","userName":"Phishtudo","userUrl":"https://itunes.apple.com/us/reviews/id26686899","version":"2.0.1","score":1,"title":"Buyer beware","text":"I am a very heavy user of home automation devices and technology. I have invested substantially in making my home more efficient and the cost savings in energy use have more than justified the initial cost for the products I use. From Hue lights, Ecobee Thermostats, integrated alarm systems, sprinklers, motion sensing light switches and bathroom vents, I have installed and worked with dozens of products. Hands down the Keen vents have been the worst products, application and customer service family, bar none. \n\nIn theory the vents are a great idea, balancing your homes temperature in different rooms. But in use I can say I have spent more time, mostly frustrated, with the devices. They either didn’t connect or work properly (which then needed to be exchanged), or an app that is extremely difficult to manipulate without a website portal, or a company and service group that simply read from a manual provided by the headquarters with no real knowledge of the devices or how they integrate with the thermostats. \n\nDO NOT BUY THIS PRODUCT. You will spend more time (I have for the past three years) trying to get it to work than having a product that is actually working properly. They are also a major energy users and you will replace batteries often. They will constantly lose contact to the hub and repeaters and vents take multiple times connecting and lose connection often. They also do not notify you when the batteries have been depleted putting the onus on you to check every vent, in the app, all the time to find out which is empty, stuck in a closed position or in an open position, negating their effectiveness. \n\nAgain in theory they are a great idea and obviously much cheaper than having your AC guy install dampers throughout your duct work. But again you can find dozens of other home automation devices to invest in prior to this.","updated":"2021-05-20T09:19:02-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"3025753330","userName":"john.lindley","userUrl":"https://itunes.apple.com/us/reviews/id116450593","version":"1.5.5","score":1,"title":"Money or time wasted the most?","text":"I’ve spent over $1000 on these things and probably over 10 hours hoping to finally get them in a steady state. This saga has been ongoing for over 2 years and I’ve finally removed the batteries and set them where I want them by hand. Battery suppliers are going to be hurting now just from me cutting back!\n\n1) Constant resets of the battery packs needed to get vents back online. This happens at least once a week for one of my ten. Often even battery replacements. \n2) Needed to buy an extra repeater to get the 10 to work in an open(ish) upstairs area covering about 1500 square feet. \n3) App has two areas that show percentage open and neither are ever the same. What one, if any, is the most accurate is a question I’ve had for two years. \n4) Set one of the aforementioned percentages and come back later and it’s changed to full open of full closed. \n5) Emailed then early on and prior to purchasing to ask about room by room temperature readings and adjustments. Was told that it would be enabled soon via a firmware update. Two years later, it is enabled but via a very expensive add on hardware purchase. (I have cheap room temperature sensors that are connected to my Nest and Home Assistant. I could easily automate this if they had an accessible API.)\n6) Was told they do not and have no plans of establishing a public API. In the world of smart homes today this is unacceptable to me. \n\nYou live and you learn/waste money. I count this as just that. If someone will pay the shipping I’ll sell you my 10 plus the two repeaters for a few bucks each!","updated":"2018-08-06T06:05:00-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"4989509161","userName":"EvanMcNair","userUrl":"https://itunes.apple.com/us/reviews/id149378176","version":"1.7.1","score":1,"title":"Misses the mark..","text":"If you’re looking for a way to open or close(mostly) your vents from your phone rather than having to traverse the house on a regular basis as external temperature and humidity changes affect the interior of your home, you’ve found it.\nIf you are looking for a way for your vents to intelligently open and close themselves based on room temperature without you having to lift a finger or otherwise babysit the technology, look elsewhere.\n\nI have 9 Keen Home vents in my house, as well as an ecobee thermostat with a temperature sensor in every room - it’s the ideal setup, really.  I’ve granted the KeenHome system access to my ecobee thermostat to poll temperature and heat/cool status - everything that should be needed for an automatic solution.\n\nThe issues:\n1. I’ve regularly had to re-grant access for KeenHome to the ecobee system.\n2. Even when access is granted, the KH app only seems to query Ecobee when I change the temperature VIA the KeenHome app (which I don’t want to do).\n3. Ecobee can allow a 2 degree delta between heat and cool. KeenHome ignores this and only allows a 3 degree delta.\n4. I regularly encounter situations where the heat is running, all rooms but one are cold; the hot room has open vents blowing heat, and the cold rooms have closed vents, in spite of the preferences which should cause the reverse to be taking place.\n5. The app itself is buggy. Even trying to request support, the keyboard regularly hides for no reason while typing, the x button in the upper right is so high that it can’t be tapped, and once a support request is submitted, it vanishes from the GUI...\n6. Resorting to email support, the first feedback is of course “have you tried turning it off and on again.” This would be forgivable; however, to add insult to injury, I’ve received NO further communication from KeenHome.\nHey guys, provide me with an API, and I’ll just build my own app. Otherwise, please fix your solution and your app!\n\nI’m awarding one star because 1. I have no choice, and 2. The vents DO open and close.. but so did the vents that didn’t cost a hundred bucks each.\n\n The really good news here is that this is ALL software trouble, so it could be fixed! I’d love to come back and update this review to report that all has been made right, but until that time, I could not be more dissatisfied with this product, the app, and the (lack of) support.","updated":"2019-10-20T17:25:31-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"1321765013","userName":"dkitsov","userUrl":"https://itunes.apple.com/us/reviews/id28630125","version":"1.1.1","score":3,"title":"Growing pains","text":"It DOES work.\nThe technology is ok, but the software as often the case, requires some work. UI is mostly aimed at initial setup of rooms and vents rather then everyday use—I fail to see the need to easily go into the room removal mode from the main screen for everyday use of the system. Selecting location for hub is important—the more central it is the better.\nCurrently system does not seem to have a useful logic for the ventilation/fan mode of the HVAC system even with officially supported and integrated (NEST) ones. It simply follows a logic of the current mode (heat/cool).\nSome of the functionality is somewhat limited as there are no OEM or third party sensors that seem to work in conjunction with the smart bridge from keen home.\nAn important point to understand that keen vent built in sensors monitor the condition of the supplied vent and not the room conditions—for a truly responsive system an in room sensor would be needed.","updated":"2016-01-24T10:40:35-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"1530504700","userName":"Airbus CFI","userUrl":"https://itunes.apple.com/us/reviews/id363595897","version":"1.3.0","score":1,"title":"I agree wth badjoeyjoe","text":"I have had nine of these units for a year now.  They have NOT worked since day one. I can tell the app to \"identify\" the units and they blink \"hey, I'm here\" but they don't open and close according to the app nor do they report back the actual setting to the app. My Nest thermostat paid for itself in one summer. I figured that the Keen vents along with the Nest would further reduce my heating & air conditioning bills by closing off vents in rooms that I don't use. WRONG! Because the vents don't obey the commands AND the software doesn't work, these vents have actually COST me money! The vents work better with my Samsung Smarthome app but the Keen app is supposed to actually \"think ahead\" and adjust the vents based on history or current readings from the Nest and/or the vents themselves. I paid for the Keen app to work! So far, NADA in getting the app updated. Now I just got word today that the hub software has been updated. That's nice but I want the damned app updated too. Promises. Promises. I ain't happy.","updated":"2017-01-25T16:00:52-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"1342296909","userName":"JMA321","userUrl":"https://itunes.apple.com/us/reviews/id86351180","version":"1.2.0","score":1,"title":"Revised- Works intermittently has lots of problems","text":"So after having these vents for awhile now I am revising my review.  The app is basic but OK.  The hub disconnects often and needs to be reset.  The vents stop responding and you need to remove batteries to reset.  Sometimes the vents can't connect in a small 3 bedroom condo/townhouse.  All vents are on the same floor as the hub and still lots of intermittent issues.\n\nWhen they do work they are just remote controlled vents with no automation or smarts built in today.  The advertising for the preorder was very misleading on the automation portion and advertised as smart vents.  Today built in sensors are useless.\n\nSupport is so so and slow to respond probably because everyone has similar issues or maybe just understaffed. Can't believe they are selling this half baked product at Lowe's.","updated":"2016-03-03T17:38:37-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"1488234644","userName":"badjoeyjoe","userUrl":"https://itunes.apple.com/us/reviews/id33752069","version":"1.3.0","score":1,"title":"Horrible App and Product","text":"If I could give it a zero rating I would, on the hardware side, half the time the things don't connect to the hub, endless reboots, pulling batteries out, and repeat, what a mess. On the software, a full disaster, not intuitive at all, can't tell what's what, the smart feature has been in beta for God knows how long and it simply couldn't be dummer, I mean honestly I have no idea what this beta/smart feature toggle is for, does nothing, I think it's a plecbo. If I could return them and get my money back I would in a heart beat. Please for the love of God, skip this product. I had high hopes, but this has been nothing but a big disappointment. :-(","updated":"2016-11-20T20:24:45-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"2801176111","userName":"ConcordCharlie","userUrl":"https://itunes.apple.com/us/reviews/id9150944","version":"1.5.5","score":2,"title":"Great potential but poor implementation","text":"I really have high hopes for this and want it to succeed, but someone at this company needs to listen to customer wishes and complaints and take action on this. If they could address just a few of these minor issues, it could be a great system. The fact that they can’t makes me wonder if their programmers are working part-time and only as a hobby. \n\nI’ve had 9 of these vents throughout my home for a little more than half a year and here are my thoughts. My system originally had one hub paired with an Ecobee and sensors throughout every room. \n\nNumbers 2 and 4 below are priority for me and probably most customers as well. \n\n1. Purchased a number of these vents but several arrived very late during the winter.\n\n2. A number of these vents suffer complete disconnects randomly without any app or email notification whatsoever. A temporary solution involves reinserting the batteries.  The app should alert you if the vents go through prolonged or intermittent communication issues. After several complaints, customer support said an additional repeater might help these communication issues. I installed a new hub and it seems like the disconnects have mostly resolved. Still with 9 vents being purchased, you’d think the company by default would send you a hub out of courtesy because of all the money and time spent with tech issues. Tech support did send me one to try to get it working (a bi afraid to send them more money) and it was a big help. \n\n3. As others have pointed out here, the app still lists “beta” at the top. One Keen employee told me to not use it and that they were planning to remove it. That was almost half a year ago...\n\n4. I repeatedly receive random notices at the top only when opening the keen app that it needs to reauthorize the Ecobee integration. This involves entering my username and password again. There’s no checkbox to save username and pass info either which is a pain with so many passwords. When the app and system disconnects, you lose control of the individual room Ecobee sensor readings temps) that talk to your vents. There’s no notice whatsoever (email or push) that alerts users to the system disconnecting unless you constantly check the app on a daily basis. The app really needs to alert customers to communication issues. \n\nTalked with customer support again for a number of times on this same issue. They keep telling me they’re working on fixing it which seems like a load of bs. That was months ago. Instead I think they’re trying to market their own sensors to customers although they’ve stated the ecobee sensors supposedly work just as well. \n\n5. Customer support is poor at getting back to customers. It often involves waiting several hours or a day or two. Think there are only two employees in customer support department... No direct phone number either which is probably intentional.\n\n6. There should be more ability to customize the occupancy schedule within the app. Simply having a range of checkboxes with times is not as good as being able to manually specify exact times.","updated":"2018-06-29T22:52:28-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"1305598016","userName":"Magyaramerican","userUrl":"https://itunes.apple.com/us/reviews/id172980659","version":"1.1.0","score":5,"title":"Great interface. Some bugs.","text":"Love Keen and the smart home vents. This app is great with a stylish interface. Experienced 2 problems so far: cannot choose room type when connecting a smart vent and the app only works with 1 Neat thermostat in your home. We have 2 thermostats and hope they are able to update this. \n\nOverall: excellent.","updated":"2015-12-24T11:24:30-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"1471784873","userName":"Group456","userUrl":"https://itunes.apple.com/us/reviews/id11534336","version":"1.3.0","score":4,"title":"NOT HomeKit compatible 👎","text":"*Homekit*\nCustomers want the security Apple demands from manufacturers, just as much the easy to use and built in functions of seamlessly integrating apps in to the new Apple HomeKit app. \n\n*Ecobee3 Room Sensors*\nIf these smart vents could be integrated and work with the ecobee room sensors then the keen smart vents would truly become SMART! \n\nI love the idea of this product and its huge potential to become a leader in smart home technology. I want to only give 1⭐️ but I feel like that is not fair to keen as the product and app does as advertised.\n\nI bought only one to test for now. My purchase is on hold until I dump some serious cash on updating all my vents in my home and vacation home. NEED HOMEKIT AND ECOBEE SUPORT!!!","updated":"2016-10-23T08:21:54-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"1331904990","userName":"Jrc323","userUrl":"https://itunes.apple.com/us/reviews/id29735394","version":"1.1.1","score":5,"title":"So Far, So Good!","text":"Initial set up was a breeze. App is user friendly. Connected to my Nest Thermostat instantly. Full home automation is the only way to go...\n\nHoping that Keen links up with Wink soon. Can't wait to see the next product from Keen. Great job!","updated":"2016-02-12T09:12:05-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"1545252840","userName":"Nasty Nayeem","userUrl":"https://itunes.apple.com/us/reviews/id100856557","version":"1.4.0","score":5,"title":"Excellent functionality with ecobee support!","text":"I've been waiting for the ecobee integration for months now and have to admit it's everything I was hoping for. I know get true room-by-room thermostat capability from my Smart Vents. Brilliant!","updated":"2017-02-15T15:26:09-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"1317066511","userName":"RobBdigital","userUrl":"https://itunes.apple.com/us/reviews/id366087703","version":"1.1.1","score":1,"title":"Doesn't work!!!","text":"Just received my smart vents today and cannot use them with the app due to an issue with the smart bridge. Have contacted the company several times and the only response is that we will notify you by email when we reply. The estimated wait time is 48 hours. Probably will return them to the company if I don't hear back soon. Very frustrating, it appears I have 13 paperweights now.","updated":"2016-01-15T17:59:18-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"1327547798","userName":"bass_rock408","userUrl":"https://itunes.apple.com/us/reviews/id185665540","version":"1.1.1","score":4,"title":"Great Looking App","text":"This app has a great user interface. The system in general is fantastic.\n\nThere are a few features missing in the app that would be great but I can see the potential and that the system is expanding awesomely!","updated":"2016-02-04T00:28:51-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"1545253559","userName":"wmcleod","userUrl":"https://itunes.apple.com/us/reviews/id10392129","version":"1.4.0","score":5,"title":"Best thing since ecobee","text":"Finally, these vents r ready for prime time. With ecobee integration you can actually set each room like it's own thermostat. Keeps getting better","updated":"2017-02-15T15:28:24-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"1429505712","userName":"123dawgfan","userUrl":"https://itunes.apple.com/us/reviews/id18489402","version":"1.2.4","score":1,"title":"iOS version doesn't work","text":"I followed instructions multiple times after multiple reboots with multiple routers and multiple \"Smart\"Bridges.  I'm unable proceed past Step 1 and I'm very frustrated. I haven't had much help from the Help Desk either.  For those that were able to access their SmartBridge, congrats.","updated":"2016-08-08T18:03:40-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"1545253064","userName":"NGMitunes","userUrl":"https://itunes.apple.com/us/reviews/id85310234","version":"1.4.0","score":5,"title":"Now officially supports EcoBee","text":"Keen Home has now added support for EcoBee. And more importantly the EcoBee sensors. You can now close the room by room sensing and control loop.","updated":"2017-02-15T15:26:51-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"1325764999","userName":"timwilkinson","userUrl":"https://itunes.apple.com/us/reviews/id39911538","version":"1.1.1","score":1,"title":"Not working. Ignored when trying to return vents","text":"Maybe it will work for you, but I couldn't get a vent to work more than 20 feet from the hub. The company was helpful up until the point I decided to return them, then absolutely no response to any emails or message. Don't buy these.","updated":"2016-01-31T15:20:21-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"1317652958","userName":"JJones_86","userUrl":"https://itunes.apple.com/us/reviews/id36875374","version":"1.1.1","score":1,"title":"Frustrated","text":"Glad I'm not the only one having issues with the new smart bridge. It simply does not work. It finds the vents, but you can't control them.","updated":"2016-01-16T19:35:29-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"1499361197","userName":"Billy smuin","userUrl":"https://itunes.apple.com/us/reviews/id417619639","version":"1.3.0","score":5,"title":"Great app so far","text":"App works great and I love my vents","updated":"2016-12-10T05:40:17-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"1315170516","userName":"Thicket143","userUrl":"https://itunes.apple.com/us/reviews/id482981373","version":"1.1.0","score":1,"title":"Truly awful","text":"Crappy app and crappy product that doesn't do what it says. Great design but it's all superficial lies","updated":"2016-01-11T21:26:53-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"7644222653","userName":"PursuitOfAppiness","userUrl":"https://itunes.apple.com/us/reviews/id33455112","version":"2.0.1","score":1,"title":"Authentication failed","text":"Authentication failed\nAuthentication failed\nAuthentication failed\nAuthentication failed\nAuthentication failed\nAuthentication failed\n\nCan’t log in to the app. Tried “forgot password”, and it does not recognize my email address, which I triple-checked was in fact correct and have been using for a year as my username. \n\nThis app is completely unusable garbage. Do not buy Keen products. Do not download this app. Unless you enjoy spending thousands of dollars on “smart” vents that promptly become useless because the app doesn’t work. Alternatively, you could just set your money on fire.","updated":"2021-08-01T15:17:45-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"7176050113","userName":"TheLimeyGeek","userUrl":"https://itunes.apple.com/us/reviews/id31666770","version":"2.0.1","score":1,"title":"Ecobee integration still not fixed.","text":"Ecobee integration still not fixed.","updated":"2021-04-02T12:30:40-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"7171096820","userName":"ethisnameistaken","userUrl":"https://itunes.apple.com/us/reviews/id671486925","version":"1.7.1","score":1,"title":"App bugs and connection issues ALL.THE.TIME.","text":"I have not been able to use the vents as designed for about 6 months at this point because of problems Keen has been aware of and working on.    I wanted to love this.  Have 9 keen vents so doing that math well over 1k invested in something that does exactly the same thing as the metal vents I replaced them with.  Horrible product, horrible support, horrible experience.  Never again.","updated":"2021-04-01T07:36:48-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"5427349073","userName":"Slydurin","userUrl":"https://itunes.apple.com/us/reviews/id1124467113","version":"1.7.1","score":5,"title":"App Now Works Great","text":"Running on iPad Pro/iOS 12.1.4 with eight vents, one hub, two repeaters, and Ecobee 4 thermostat plus five temperature sensors.  It’s also working great with my Android device.  If you’ve had problems with this app in the past, you might want to update and give it another try.","updated":"2020-01-20T06:28:41-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"},{"id":"4647338970","userName":"MattBrashear","userUrl":"https://itunes.apple.com/us/reviews/id39404425","version":"1.7.1","score":1,"title":"Good potential - piss poor execution","text":"I searched around and found a number of online reviews and reddit threads that touted the Keen system as one of the best. I jumped in with both feet and ordered over $1000 worth of smart vents, temperature sensors, bridges, and trim kits. This is money wasted. \n\nInstall was a breeze. Connecting the devices and setting was also very easy. Unfortunately, the devices just don’t work. They do not close when they should, they do not open when they should, and trying to operate the opening and closing using the app, they do not stay open or closed. It’s all very frustrating. \n\nI would not buy Keen products again. Oh, and I have some smart vents to sell at a deep discount. Buyer beware.","updated":"2019-08-20T16:17:38-07:00","url":"https://itunes.apple.com/us/review?id=1052372493&type=Purple%20Software"}]