[{"id":"3520695098","userName":"#MomHumor","userUrl":"https://itunes.apple.com/us/reviews/id676051163","version":"1.4.6306","score":5,"title":"JAM ROCKS!!!","text":"Our Family LOVES JAM!!!  We play all types of Fun Music throughout the house frequently!!!  As Mom, I ABSOLUTELY LOVE being able to talk to My Family through the intercom feature!  It’s much more fun waking Everyone Up in the mornings now!!!  #MomHumor","updated":"2018-12-11T16:26:57-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"4960573402","userName":"Robb Miller","userUrl":"https://itunes.apple.com/us/reviews/id117044926","version":"1.4.7409","score":4,"title":"I love music","text":"I bought this Jam symphony so I could listen to my phone’s music library out in my shop, hoping that it would be louder than my phone’s speakers.  I was NOT disappointed.  This speaker thumps!  I am very happy with my purchase.\n\nThe app is ok. What I mean by that is that it gets the job done.  Any dissatisfaction is an opportunity for improvement, right?  What bugs me may be of no significance to anyone else.  But with the possibility that others may have similar thoughts about it and the potential for improvement, I’ll share:\n\n1. Connecting to WiFi was fairly easy with the user manual.  We upgraded WiFi years later and without the manual, it was a little more difficult... not impossible though.  Having the instructions engraved or imprinted on the unit would be helpful.\n\n2.  I do not use a streaming service.  Having to go to the bottom of the list each and every time to play from my library gets old.  It would be nice if it could default to my selection when I run the app.  If I ever purchased a service, I could always back out and make a new selection.\n\n3.  It would be really cool if I could cast it to a TV screen and use watch music videos?\n\n4.  It would be cool if I could use it as a speaker(s) for my TV.\n\n5.  It would be cool to use the speakers through my home stereo receiver,\n\n... just ideas.\n\nOverall, I am satisfied with my purchase and would buy it again.","updated":"2019-10-17T06:34:45-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"3063389554","userName":"P. Adam","userUrl":"https://itunes.apple.com/us/reviews/id42032807","version":"1.4.5911","score":1,"title":"Shockingly bad software.","text":"I’ve had these speakers for a year or so, and I’ve used them with two different iPhones on two different networks. Here are the two major problems:\n1) the software cannot, under any circumstance, seem to “remember” the volumes I set for different speakers. It keeps resetting, for example, when I change the overall volume. Or when I change playlists. It’s madness. \n2) some mornings I get up and try to connect my iPhone to the speaker system and it will literally take 4 minutes. It won’t see the Group. Or it will see the Group and take forever to connect. \nThe most infuriating thing about this is that I know the developers understand that these problems exist. And we get updates every so often, but these absolutely basic problems continue. Don’t buy this crap.","updated":"2018-08-14T06:16:30-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"4607655631","userName":"random blind person","userUrl":"https://itunes.apple.com/us/reviews/id132680664","version":"1.4.6306","score":4,"title":"Good, but could use work","text":"I received a Jam Voice as a gift and downloaded this app, the problem is that I'm visually impaired, and some features in the app don't work with VoiceOver, the accessibility feature that apple has. For example, when I want to choose a radio station to listen to, I have to turn off VoiceOver tap on the screen, turn on VoiceOver and hope that I tapped on the correct spot, and if I didn't repeat the process over. So I would greatly appreciate it if the developers could make this app more accessible. Other then that the app works great!","updated":"2019-08-12T10:38:42-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"2628630361","userName":"Hawkgt12","userUrl":"https://itunes.apple.com/us/reviews/id31568339","version":"1.4.5707","score":1,"title":"App crashes","text":"I got the app to run through the 1st time. Then it disconnected from WiFi and reset after update. Now the app crashes every single time and I can’t connect it to WiFi anymore. Not sure if it’s the speaker or the app.\n\nI’m running an iPhone 7 and I have the Jam Voice model HX-P590. Not sure if it is the app now because I deleted it and reloaded and got the jam to connect to WiFi. Then when it turned off, it lost all the WiFi info and I had to try and load it all over again. Except this time I cannot get the WiFi signal to appear in the settings. I think this jam is broken a few hours after I turned it on.","updated":"2018-06-01T16:17:27-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"3117690738","userName":"Hi_Tek","userUrl":"https://itunes.apple.com/us/reviews/id405972018","version":"1.4.5911","score":4,"title":"Needs Tune In attention","text":"All in all the app works well. Just ran into a problem when searching for a new radio stream. I found it fine but not able to play or store it because it states the stream is incompatible.\nTune In on other devices is fine for the same station stream but the JAM app needs some updating from the Tune In folks.\nNew streams come on everyday so I suspect JAM Audio is not supporting the Symphony or Rhythm WIFI models further with updates from TuneIn.","updated":"2018-08-26T12:18:34-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"5561800820","userName":"Yode1981","userUrl":"https://itunes.apple.com/us/reviews/id40126965","version":"1.4.7625","score":1,"title":"Good speakers, horrible app","text":"The speakers are great for the money. Great sound and bass with the built in subs. They sync well. However the app is one of the worst I’ve ever used. It’s not production ready. It constantly shuts down on me right in the middle of using it. Setup took over an hour having to constantly restart the app and begin over to connect Speakers. Now synced and playing the app shuts down when I’m trying to manage speaker output, and volumes. Absolutely horrible software. Hoping that updates take care of it.","updated":"2020-02-21T09:08:36-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"3906322704","userName":"watzaum","userUrl":"https://itunes.apple.com/us/reviews/id499813028","version":"1.4.6306","score":3,"title":"Functional but has limits","text":"Overall, the speaker is good at what it does especially the connectivity. However, the main purpose I bought the speaker was to listen to quietly in bed. For me the lowest volume could be lower and there should be more stages in volume control. Any chance of having this fixed with firmware/software update? It would be great if it could.","updated":"2019-03-20T20:25:17-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"2132571545","userName":"Wiseives","userUrl":"https://itunes.apple.com/us/reviews/id40267229","version":"1.4.5317","score":3,"title":"Needs update","text":"Recent app and firmware update have made the symphony and rhythm speakers much better. Better stability between the speakers and way less drops and lags. It plays better with favorite music apps. The app can still use some improvements and I'd like to see better EQ controls, with additions to just treble and bass. Otherwise,  a much better experience with the recent update.","updated":"2018-01-27T04:45:19-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"4801990547","userName":"fgalmeida","userUrl":"https://itunes.apple.com/us/reviews/id137190836","version":"1.4.7409","score":1,"title":"App simply won’t work","text":"App can’t find the speakers. I have two jam symphony speakers configured as a group to play in stereo. Every time one of the speakers is disconnected from power the group config changes from stereo to mono, when that happens I have to open the app to reconfigure the group. Now the app can’t find the speakers so I’m stuck with mono music. I regret so much buying these speakers, I should’ve spent the extra money and bought a better quality pair. (Sonos, Apple, etc..)","updated":"2019-09-18T18:26:42-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"5929415829","userName":"Ltk013","userUrl":"https://itunes.apple.com/us/reviews/id130256676","version":"1.4.7625","score":4,"title":"Compatibility!","text":"I wish that my iTunes would allow me to access all of my playlist not just some of it when using the app😞!","updated":"2020-05-10T16:40:49-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"7938983114","userName":"Robin Couch","userUrl":"https://itunes.apple.com/us/reviews/id1085377954","version":"1.5","score":5,"title":"Music","text":"Love this music on Jam","updated":"2021-10-21T11:08:11-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"2603933802","userName":"Interfere","userUrl":"https://itunes.apple.com/us/reviews/id180198421","version":"1.4.5707","score":1,"title":"Glitches","text":"Always glitches, especially when connecting multiple speakers.  I have two speakers and it always glitches when connecting the second. The glitch forces me out of the app completely and keeps me from going back in only way to reset this is by actually turning the phone off and then back on.  \n-Running this app on an iPhone X","updated":"2018-05-27T09:35:51-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"2651458434","userName":"hytrttujyrrgbb. chn","userUrl":"https://itunes.apple.com/us/reviews/id735223311","version":"1.4.5707","score":2,"title":"It’s useless","text":"I love my jam speaker, but every time I try to connect to Wi-Fi, and never wants to connect, this app need to , It’s connected to Wi-Fi right now with no problems, but every time I try to connect to a different network, it doesn’t want to work, it’s not a 5G network, it’s 4G network , And the network it fast, please fix update","updated":"2018-06-06T10:06:12-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"2837544405","userName":"Frustrated in San Diego","userUrl":"https://itunes.apple.com/us/reviews/id212451725","version":"1.4.5707","score":1,"title":"Unable to connect to WIFI","text":"Very very frustrated with the Jam Rhythm speaker app. I’ve tried for hours to connect to my in house WIFI but the app will not accommodate me, saying the password is incorrect. That’s not true, because my entire house runs off that password. Getting ready to return it as a defective item, if customer service can’t fix the problem. Help!!!!","updated":"2018-07-04T13:20:11-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"4738855026","userName":"marykendall dade","userUrl":"https://itunes.apple.com/us/reviews/id232669383","version":"1.4.6306","score":2,"title":"It is difficult","text":"It’s difficult to keep the Bluetooth connected once you close the app. When I open the app I need to reset/ select the Bluetooth device - it does not auto connect like pandora does - I only have one Bluetooth device I hoped that it would work as the “other app”","updated":"2019-09-06T18:24:08-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"2480875598","userName":"Gunfighter97","userUrl":"https://itunes.apple.com/us/reviews/id117050602","version":"1.4.5317","score":1,"title":"Poor design and low sound quality","text":"This speaker is by no means user-friendly, the app has too many hoops to jump through just to set up and adjust the sound settings. To make it worse, the sound itself is terrible. No treble, too much base and overall, just doesn’t have any proper projection of sound. Not worth the time or money.","updated":"2018-04-28T17:06:01-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"5244729328","userName":"Deoby","userUrl":"https://itunes.apple.com/us/reviews/id192353393","version":"1.4.7625","score":4,"title":"Great app","text":"Works flawlessly. Would like pandora back as an option though.","updated":"2019-12-07T07:37:42-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"3100535087","userName":"Jareood","userUrl":"https://itunes.apple.com/us/reviews/id115228197","version":"1.4.5911","score":1,"title":"Pretty Bad","text":"Usually dont write reviews but these mad me so frustrated. Speakers are connected and show up when search for airplay. When I click to connect to the speakers, they disconnect or the song doesn’t continue playing. I also cannot play both speakers at the same time. I knew I should’ve gone with Bose....","updated":"2018-08-22T13:15:27-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"3557465626","userName":"Datchickstore.com","userUrl":"https://itunes.apple.com/us/reviews/id591519670","version":"1.4.6306","score":2,"title":"Worked for a sec","text":"Worked for 5 mins the firmware update came I ignored it now all of a sudden my WiFi cant connect when my whole house is on the same WiFi 🤦🏽‍♀️ my Alexa dot works perfectly fine on the same WiFi","updated":"2018-12-21T17:22:42-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"2896673832","userName":"T-Rex-ny","userUrl":"https://itunes.apple.com/us/reviews/id111845949","version":"1.4.5707","score":1,"title":"Can’t connect","text":"I rarely write any review but this can never get me connect. Both my iPhone 6s and the jam speaker connected to the same WiFi network but they just can’t connect to each other. Tried more than 10 times resetting the speaker. Nothing work","updated":"2018-07-12T20:37:18-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"4105349474","userName":"Jumper 1998","userUrl":"https://itunes.apple.com/us/reviews/id324600470","version":"1.4.6306","score":3,"title":"Only concern","text":"The only complaint that i have is you cannot connects others apps like pandora etc.","updated":"2019-05-05T10:17:25-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"3320460662","userName":"Tynoodlesoup","userUrl":"https://itunes.apple.com/us/reviews/id275808564","version":"1.4.6031","score":1,"title":"Terrible","text":"Terrible I’m constantly having a problem connecting to it. I’ve downloaded the app on multiple occasions and I still have the same issues. Smh","updated":"2018-10-19T12:42:59-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"5855850267","userName":"Kdutep","userUrl":"https://itunes.apple.com/us/reviews/id400923098","version":"1.4.7625","score":3,"title":"Not happy","text":"It disconnects very often, need to pair phone/ speaker every time.","updated":"2020-04-23T21:59:52-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"4732482811","userName":"ekwerh","userUrl":"https://itunes.apple.com/us/reviews/id563360675","version":"1.4.6306","score":1,"title":"Bad experience","text":"I bought the jam rhythm and only connected once to the WiFi and it doesn’t work no\nMore","updated":"2019-09-05T16:11:35-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"4416261045","userName":"TreyM24","userUrl":"https://itunes.apple.com/us/reviews/id38292169","version":"1.4.6306","score":1,"title":"Nothing but problems","text":"Go back to bluetooth ... I’ve spent hours trying to get this to work with no luck.","updated":"2019-07-05T14:37:57-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"3223336610","userName":"Lagartija Nicholas","userUrl":"https://itunes.apple.com/us/reviews/id177512386","version":"1.4.6031","score":1,"title":"Garbage","text":"Not only could I not get it to work, but my tech-savvy kid couldn’t get it to work either. I’m returning the crap speaker and deleting this garbage app.","updated":"2018-09-23T18:46:04-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"1828577156","userName":"Miwooll","userUrl":"https://itunes.apple.com/us/reviews/id299310111","version":"1.4.3","score":5,"title":"Great product at a great price!","text":"The speakers sound great and are easy to setup. I setup 4 in about 30 minutes. I've had them about 3 months and no problems! Speakers are always connected and the app works as designed. I read lots of reviews about speakers needing to be reconnected constantly, this isn't the speakers fault, it's the wifi's fault. Take some time and configure your home network properly and you won't have any problems.  On a side note to the developers, the app could use a little \"fine tuning\" to make it more user friendly.  But for the price compared to competitors its 5 stars!  I would like to see the ability to have more than 4 presets per speaker. And the ability to copy presets from one speaker to the next. You can have 20 presets per speaker and just make the top 4 selectable with the speaker preset buttons.  Thank you for this product, no competitor even compares when you compare price to quality!","updated":"2017-10-05T04:54:42-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"2805555550","userName":"Brady969","userUrl":"https://itunes.apple.com/us/reviews/id175415301","version":"1.4.5707","score":1,"title":"Horrible","text":"The Jam audio system and this app are horrible. It kept crashing on me.","updated":"2018-06-30T10:08:15-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"4910084592","userName":"ZaaZaaZan","userUrl":"https://itunes.apple.com/us/reviews/id191900644","version":"1.4.7409","score":1,"title":"would give it 0","text":"this app is horrible. the connection process is janky and it keeps crashing","updated":"2019-10-08T11:03:25-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"4410693539","userName":"Shellsinator","userUrl":"https://itunes.apple.com/us/reviews/id157585917","version":"1.4.6306","score":5,"title":"Has bugs but I love it","text":"I have 3 speakers in my small house. I’ve grouped them together via the app and then separated left and right channels in my kitchen and living room. The one in my bedroom plays left and right but I slide it to a lower volume. \n\nThe ability to use wifi instead of Bluetooth means I can play music for my dogs when I’m not at home (but there’s always thunder here in the summer). \n\nRight now I’m listening to In Search of the Lost Chord by the Moody Blues. On Spotify. From\nStart to end with left and right channels singing through. I mean...all I can be is extr”stream”ly grateful","updated":"2019-07-04T11:20:19-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"1536053011","userName":"Edluvrr","userUrl":"https://itunes.apple.com/us/reviews/id129845073","version":"1.4","score":2,"title":"Good speak, limited capability","text":"The speaker is great! Sounds wonderful and the price is right compared to other wifi speaker systems that go for double and triple the price. The problem is the connectivity to apple iTunes. You have to reconnect your speaker to your wifi every time you turn the music off. Once it's connected it will play for hours no problem but as soon as you pause or stop music you have to reconnect, its very annoying! I also can't access my iTunes library from the app. It shows an icon to do so and it will show the music in my library from the app but once you press to play the music the app reads \"can not play\" on every song. If they could fix these problems this would be at least a four star app rating with a five star speaker! Fix please cuz I will buy more of these speakers!!","updated":"2017-02-02T23:32:03-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"1599211927","userName":"PhillyG954","userUrl":"https://itunes.apple.com/us/reviews/id279427975","version":"1.4.1","score":2,"title":"Needs better connection","text":"Love the speakers and app when it works!  Every time I close the app or stop listening for a little while, I open the app and it says no jam speaker found.  I then have to reconnect one speaker and the app will then recognize the other speakers I have previously connected.  Kind of a hassle to have to do everyday.  Fix this and you have a 5 star product!","updated":"2017-04-27T15:18:06-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"2001538600","userName":"Kimbokimkimkim","userUrl":"https://itunes.apple.com/us/reviews/id518149487","version":"1.4.3","score":1,"title":"Horrible it’s worthless","text":"My speaker now refuses to connect to WIFI when it did before however, there were times more then I care to remember where the song was playing but no sound came through. So I would have to pause it then hit play for it to come through again. The sound quality is very mediocre....I have a cheap plug in speaker that sounds way better. Don’t waste you money on this junk","updated":"2017-12-16T09:49:40-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"2109561445","userName":"yoshhhh24","userUrl":"https://itunes.apple.com/us/reviews/id702457026","version":"1.4.3","score":2,"title":"Bluetooth only","text":"This speaker works great with the Bluetooth feature, however, when trying to use the app to connect it to my WiFi it just constantly says “connecting” on the screen nonstop and never actually connects. There is nothing wrong with my WiFi, it’s the app. This app is basically useless since it doesn’t want to connect.","updated":"2018-01-20T15:56:22-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"1490168082","userName":"Bigish33","userUrl":"https://itunes.apple.com/us/reviews/id201160027","version":"1.3.7","score":2,"title":"Aggravated!","text":"Just purchased a jam symphony and i love the speaker... when i can get the darn app to work! This app is a pain in the backside!!! If you're gonna make a system that makes it all but difficult to use without the app, you should really spend some time working the kinks out the app!!! Sheesh, 150 for a speaker system that half the time i cant use...","updated":"2016-11-24T06:06:01-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"1945040488","userName":"Battle Hardened","userUrl":"https://itunes.apple.com/us/reviews/id34841","version":"1.4.3","score":3,"title":"Good speaker","text":"I love the speaker and the audio quality. When I bought the speaker I assumed it would be connectable through blue tooth, I guess I was wrong. The app blows, user interface blows, and that’s about it. Other than the app and the absence of blue tooth, the speaker is worth the money. But the app is bad.","updated":"2017-11-24T03:28:31-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"1705799778","userName":"Minalinda","userUrl":"https://itunes.apple.com/us/reviews/id539853578","version":"1.4.3","score":2,"title":"NO WFI CONNECTION","text":"The speakers sound good and connects to Bluetooth fine. HOWEVER I paid for the speaker with Alexa and it DOES NOT connect! Very disappointing I know it's not my wifi all of my other devices connect fine. I even disconnected to my other devices still didn't work. Don't waist your time buying this version. Will be returning tomorrow.","updated":"2017-07-30T21:35:14-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"1508335005","userName":"Fjpc6","userUrl":"https://itunes.apple.com/us/reviews/id257779392","version":"1.3.8","score":1,"title":"Waste of money","text":"Bought these speakers and seemed like a great substitution from more expensive brands. However piece of junk . Speakers keep losing themselves from wifi . Very frustrating . Worked well for about and hour then problem after problem . Do not waste your money or time . All I'm doing is wasting time with them .","updated":"2016-12-24T15:20:16-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"1509186491","userName":"Map4239","userUrl":"https://itunes.apple.com/us/reviews/id217891331","version":"1.3.8","score":1,"title":"Doesn't support Apple Music","text":"I can't even use this with Apple Music through the app. I have a two of the speakers both connected properly, but can only use one at a time. If I could use both speakers and play music from Apple Music that would make the speakers worth wild.","updated":"2016-12-25T22:48:02-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"1506204190","userName":"Reviewer 242495","userUrl":"https://itunes.apple.com/us/reviews/id520422738","version":"1.3.8","score":1,"title":"Garbage.","text":"This app is an absolute abomination. It never works. Therefor, neither does the speaker - unless you have an aux cable. I have a stupid roommate that bought this. \"Wifi speaker\" is not the same as \"Bluetooth speaker\". Sorry if you wasted any money on speakers from this company, they royally trucked you in the bum.","updated":"2016-12-21T08:01:35-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"1520062456","userName":"Sb511","userUrl":"https://itunes.apple.com/us/reviews/id231429481","version":"1.4","score":3,"title":"No pandora and app required","text":"I don't like that I can't use pandora and I don't like that the app is required to use the speaker.","updated":"2017-01-11T13:23:43-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"1723260922","userName":"Hugod01","userUrl":"https://itunes.apple.com/us/reviews/id35174680","version":"1.4.3","score":2,"title":"Needs work","text":"THE AUDIO IS NOT VERY GUD😭 it connects but it need work plus it takes a long time to connect. Your normal phone speaker is better than this.","updated":"2017-08-11T08:25:38-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"1508747613","userName":"Jaz122898","userUrl":"https://itunes.apple.com/us/reviews/id541170919","version":"1.3.8","score":1,"title":"Terrible","text":"App doesn't work so the speaker doesn't work either. Waste of money unless you want something that only works with an aux.","updated":"2016-12-25T05:39:33-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"1557456530","userName":"Prez0101","userUrl":"https://itunes.apple.com/us/reviews/id341527067","version":"1.4","score":1,"title":"Fix It","text":"I don't like that it can't connect to Sound Cloud.","updated":"2017-03-04T10:07:36-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"6823584454","userName":"Madi7272","userUrl":"https://itunes.apple.com/us/reviews/id469316200","version":"1.5","score":1,"title":"Disappointed and confused???","text":"I’ve had this speaker for YEARS and I’ve never had a problem with it or the app (I mean the app isn’t the “prettiest” but it does the job). Now I re-downloaded the app after coming back from Uni and everything’s changed??? Now I have to connect with the jam speaker through WiFi instead of my Bluetooth??? And if I do that then my Spotify goes offline even though it’s using data, maybe because of where I live, but if I’m on my normal WiFi I have no problems. I am so upset because this was truly one of the best things I have to listen to music and now it’s just like a decoration. The reason this is an app review is because everything changed in the app, not the speaker.","updated":"2021-01-02T13:57:02-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"6079689369","userName":"xyxlhxh","userUrl":"https://itunes.apple.com/us/reviews/id111541862","version":"1.4.7625","score":1,"title":"Why even bother.","text":"Get an Alexa. I’m saving you the trouble of searching for ways on how to properly connect and use this device. This device is not user friendly at all, the setup is easy but trying to figure out how to play songs that aren’t on my phone is nearly impossible. In other words if you like free streaming music on YouTube or other areas, good luck no one knows how to play those and the company does not answer questions. It’s a nice doorjammer though.","updated":"2020-06-15T10:31:05-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"5365390196","userName":"smb silver","userUrl":"https://itunes.apple.com/us/reviews/id1103493193","version":"1.4.7625","score":4,"title":"Needs more music platforms to listen on","text":"Add SoundCloud to the app please because a lot of us don’t have Spotify or tilde","updated":"2020-01-05T11:40:22-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"3197576348","userName":"LiveLoveLaughPhoenix","userUrl":"https://itunes.apple.com/us/reviews/id384894345","version":"1.4.6031","score":5,"title":"HiFi Sound @ An Affordable Price","text":"It is not the top of the line best system or software money can buy. It is however by far the best VALUE, and it provides 95% of the quality at literally 10% of the price OR LESS!!! Jam allows you to stream over WiFi from the app from various services, including both HiFi (Tidal & Deezer) plus Spotify (most popular in USA, where I live), HiFi Local Tracks, Plus the ability to connect via a DLNA server, all of which (outside of Spotify, who is supposedly experimenting with offering HiFi) allow you to stream at HiFi quality (FLAC, AIFF, WAV equivalent) while apple airplay limits Apple Music and local music to ALAC and limits everything else to MP3. The technology used to power the sound distorts at the highest volumes, which I have used only once to see if the distortion actually happens. It does. I have never lived in a single family house with these, that is the only setting under which I would even consider using the full volume due to the power level and sound level it has at lower volumes, under 75% I hear no distortion, and I rarely go above 50% or 55%. I got my Jams a little over 2 years ago, since then the firmware has been updated to iron out all the kinks to my satisfaction. Early on setting up speakers as well as remembering speaker groups and volumes was not great, but presently I no longer run into those issues. This is such a tremendous value for the budget audiophile that I rated & reviewers the app, which I normally do not do. Go Jam!!!! I believe the target audience is audiophiles on a budget, they sound best with high quality resolution music!!!","updated":"2018-09-16T17:28:11-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"2792790982","userName":"Bigg smokey","userUrl":"https://itunes.apple.com/us/reviews/id131706015","version":"1.4.5707","score":1,"title":"Crashes after first time","text":"App keeps crashing and disconnecting its self I’m running a iPhone 7plus and I’m using the model HX-W09901. This is frustrating!","updated":"2018-06-28T20:34:52-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"2596997940","userName":"kisannmar","userUrl":"https://itunes.apple.com/us/reviews/id714876469","version":"1.4.5707","score":1,"title":"Awful","text":"Doesn't work with apple music or youtube, useless. Will be returning the speaker.","updated":"2018-05-25T21:02:17-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"2524672921","userName":"Jrzywmn","userUrl":"https://itunes.apple.com/us/reviews/id166722502","version":"1.4.5317","score":1,"title":"Giving 1star for misleading product info","text":"Your box should state your product only works thru the downloadable app and don’t put WiFi Speaker so Bold and Big and this is clearly a speaker pushing Spotify and more of a droid platform then an IOS (Apple) platform. Now this review is solely based prior to me putting both speakers on the app at home If I go by sound quality as in the store it was amazing then I wouldn’t have walked out with 2 of them I’m downloading the software as we speak wishing the app works from some of the previous reviews. Hope this helps someone!","updated":"2018-05-09T09:27:59-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"},{"id":"1944750550","userName":"MicDaMan","userUrl":"https://itunes.apple.com/us/reviews/id140192368","version":"1.4.3","score":1,"title":"Lose the limitations and it’s great","text":"These speakers could be great, but they’re not. It’s nothing hardware related, as they sound fine and I don’t have any issue connecting to WiFi. The issue comes from the app itself. Why you can’t connect the speakers to any other application or smart home device. It has Amazon Alexa push to talk, but can’t connect to Alexa devices via WiFi. It can’t connect to Google Home either. If it could do either of those, you could have complete home automation without having to use your phone to select any songs. But these are all things that could be. In summary, these speakers could be a lot better with a simple firmware update; until that time, don’t waste your money on one.","updated":"2017-11-24T00:27:28-07:00","url":"https://itunes.apple.com/us/review?id=1106812948&type=Purple%20Software"}]