[{"id":"2266829292","userName":"dj3w3ll1","userUrl":"https://itunes.apple.com/us/reviews/id8127715","version":"1.1.1","score":1,"title":"App Update for iPhone X","text":"Please update the App for iPhone X Screen Size & iOS 11. Also it would be nice to have a newer Firmware released for your Weiser Premis Lock alongside the App upgrade for battery life issues and maybe a new feature or two. It’s been a year since your last App/Firmware update.","updated":"2018-03-03T07:47:47-07:00","url":"https://itunes.apple.com/us/review?id=1172580106&type=Purple%20Software"},{"id":"4962794101","userName":"JJBeut","userUrl":"https://itunes.apple.com/us/reviews/id194809207","version":"1.1.1","score":1,"title":"App Resets","text":"This app works fine to setup the lock initially.  However after closing the app and opening it later everything is gone. It has lost all previous settings and wants to start the setup from the beginning.","updated":"2019-10-17T17:02:15-07:00","url":"https://itunes.apple.com/us/review?id=1172580106&type=Purple%20Software"},{"id":"4812561667","userName":"disappointed682","userUrl":"https://itunes.apple.com/us/reviews/id201900177","version":"1.1.1","score":1,"title":"App crashes","text":"App crashes with iOS 13 can’t even use my lock or control my access codes","updated":"2019-09-20T18:28:16-07:00","url":"https://itunes.apple.com/us/review?id=1172580106&type=Purple%20Software"},{"id":"3910046230","userName":"Matthew.Harding","userUrl":"https://itunes.apple.com/us/reviews/id43979109","version":"1.1.1","score":3,"title":"It works but...","text":"The app shows that it’s not updated to scale to the iPhone XS. \n\nIt would also be nice if the locks alerted when the battery was low through HomeKit.","updated":"2019-03-21T18:12:59-07:00","url":"https://itunes.apple.com/us/review?id=1172580106&type=Purple%20Software"},{"id":"3402937724","userName":"Anchorman2626","userUrl":"https://itunes.apple.com/us/reviews/id203168181","version":"1.1.1","score":2,"title":"Doesn’t work biG need for FireWire up date","text":"Ok that is it home kit apple kiwi set is not working","updated":"2018-11-10T10:05:44-07:00","url":"https://itunes.apple.com/us/review?id=1172580106&type=Purple%20Software"},{"id":"4907295864","userName":"heardv","userUrl":"https://itunes.apple.com/us/reviews/id103654627","version":"1.1.1","score":1,"title":"Broken iOS 13","text":"Your 4 year old piece of junk app is iOS 13 broken can’t use my lock, add users...etc!!!!!!","updated":"2019-10-07T19:59:21-07:00","url":"https://itunes.apple.com/us/review?id=1172580106&type=Purple%20Software"},{"id":"4821815744","userName":"paulrrrr","userUrl":"https://itunes.apple.com/us/reviews/id36021059","version":"1.1.1","score":1,"title":"Can’t switch homes on iOS 13. Need to fix this!!","text":"Can’t switch homes on iOS 13. Need to fix this!!","updated":"2019-09-21T22:41:37-07:00","url":"https://itunes.apple.com/us/review?id=1172580106&type=Purple%20Software"},{"id":"4825763997","userName":"Siddhārtha","userUrl":"https://itunes.apple.com/us/reviews/id130622317","version":"1.1.1","score":1,"title":"Can’t find the lock.","text":"This app and associated hardware do not work well together at all. My lock is already installed and works with HomeKit. However this app does not find the lock. I’ve removed the lock and reinstalled the lock several times now. Started to work for a while, now it can’t find the lock again. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware. ATTENTION DEVELOPERS! Please fix your software and hardware.","updated":"2019-09-22T17:20:57-07:00","url":"https://itunes.apple.com/us/review?id=1172580106&type=Purple%20Software"}]