[{"id":"3873401561","userName":"jaro360","userUrl":"https://itunes.apple.com/us/reviews/id34495206","version":"1.0.7","score":2,"title":"I can’t believe these are sold by Apple","text":"I purchased a OMNA Camera over a month ago to supplement my current nest cams and to be my first foray into HomeKit cameras, lets just say they’re not off to a good start. The recent software update did bring improvements such as the day review and automatic updates, but the camera’s are still buggy.\n\nI inherited 2 more cameras from a friend recently and I found that all 3 of these cameras all use the same network name leading to some difficulties setting up. Also I found when viewing both from the app then switching immediately over to the integrated home app, one of the Cramer’s crashes every time requiring a hard power reset. The app isn’t bad getting around in but it takes WAY too many clicks on the GUI to get to any recordings from the cameras: see Nest or even the super smooth interface from Apples own Time Machine on MacOSX!\n\nAnother big hit is the inability to provide notifications only when you are not at home. Sure the new app has a button to press for away, but this all needs to be automated: also see Nest.\n\nI hope the updates to both the firmware for the cameras and features for the apps continue to be released by D-link, as well as HomeKit capability improvements from Apple. I feel like it’s a solid product but needs support!","updated":"2019-03-12T08:32:18-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"4161143525","userName":"Ang0527","userUrl":"https://itunes.apple.com/us/reviews/id36730640","version":"1.0.7","score":3,"title":"Features need polishing","text":"I love the camera, it works great in the home app and also in OMNA app for viewing. However features in this Omna app need polishing, specifically the recorded playback features. The daily recap feature is awesome, but only after the 10+ minutes it take for it to put itself together and finally play for me. There needs to be an option for these daily recaps to automatically create themselves everyday and save itself to the micro SD card. That way we can just stream it instead of rendering it every time we tap the thumbnail for that day. I just used it, and after watching I went back to the screen to choose a day, went back to the same day I just did, and then it started the long process again.... why? Just fix that and this will be an amazing feature. Also I run into a bug where it says only two people can be viewing at the same time something like that, but literally no one is viewing it only me. And I know because I’ve tested it with the people who have access to it.","updated":"2019-05-16T13:38:51-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"2725071230","userName":"Jeff Gzh","userUrl":"https://itunes.apple.com/us/reviews/id226860654","version":"1.0.4","score":2,"title":"Need better motion detection method","text":"The current motion detection at night when using night view is a disaster. I choose detection areas and sensitivity level, and it even detect when a bug or visible dust fly by the camera and record lots of random clips with no use. All I need to to detect person or other objects! Need an update with better machine learning and adaption. And a better way to view all my random bug or dust clips in the app. Scrolling through hundreds of useless clips just to find one useful clip at the last is a waste of time. Please fix these problems. Thank you.","updated":"2018-06-19T07:18:45-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3650750457","userName":"sbvp","userUrl":"https://itunes.apple.com/us/reviews/id33978814","version":"1.0.6","score":1,"title":"Good at recording but not at looking at what was recorded.","text":"An item was stolen outside from right in front of the camera. But the time period was a week long. The stolen item is valuable but not valuable enough compared to the time requires to look through the hundreds or thousands of little snippets of video. It would help if the video thumbnails were bigger so a thumbnail might show a detail of what triggered the motion recording. Ability to download all or plug the micro SD card into a computer would be great, (My macs wont recognize card format) Then I could scrub through the videos so much faster in an app actually designed for video playback. Trying to download video after video in the app is just as slow as trying to open the videos to scrub through them.","updated":"2019-01-14T15:27:14-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"2031340562","userName":"Slickhick","userUrl":"https://itunes.apple.com/us/reviews/id34930414","version":"1.0.3","score":3,"title":"Needs an on demand record button","text":"It seems like this camera just records at random...my kids are running around all day and it says no clips, then randomly one day I get a bunch of clips... great camera for live and 2 way... terrible at recording... it would be great to have a button to record so if someone breaks in you get the motion alert and you can hit record. Or fix how it records/ have clips longer than 30sec. Also option to delete oldest recording first if you run out of space instead of having to format the card.","updated":"2017-12-27T00:15:54-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"4874729679","userName":"dddjdlux","userUrl":"https://itunes.apple.com/us/reviews/id5585693","version":"1.0.8","score":2,"title":"Camera is great, app is horrendous.","text":"The camera quality when watching LIVE is superb. Crystal clear with almost no latency. However, the app itself is a buggy mess. Reviewing your footage takes FOREVER and there’s no reason for it. When trying to upgrade the firmware I am told I am not on the same WiFi network over and over again.","updated":"2019-10-02T12:47:14-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3758702199","userName":"William Timberman","userUrl":"https://itunes.apple.com/us/reviews/id31056933","version":"1.0.7","score":5,"title":"New update very welcome","text":"Finally! New version 1.0.7 of the app—and firmware 1.4–resolve all the problems, and add back the promised new features, so at last they work as advertised. After the first disastrous release and subsequent withdrawal of this version, I wasn’t sure if D-Link’s programmers would ever get their act together, but they did. Took them long enough, but in the end they’ve done right by us.","updated":"2019-02-11T10:00:02-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3079647266","userName":"woodyfromboro","userUrl":"https://itunes.apple.com/us/reviews/id31586242","version":"1.0.4","score":4,"title":"Thankful for most features","text":"The camera does a great job of recording all the events of motion that take place. Easy way to see past events and play them no matter if I’m at home, vacation, or work. Most of all it’s Apple HomeKit enabled. \nOne request I have is for a mass delete option when I’m viewing all the videos, for there are many days when I’m home and I just want to delete all the recorded videos from that day.","updated":"2018-08-17T18:56:45-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3041837892","userName":"Deep River","userUrl":"https://itunes.apple.com/us/reviews/id41075385","version":"1.0.4","score":1,"title":"Confusing and feature poor app","text":"The app is confusing to use, settings seem all over the place, hard to find things such as recordings. There are no menu items for such things as hot spots; maybe there is though as I had said previously, the app is difficult to use. In fact ya would think that the app was designed by hardware engineers and not user interface experts, maybe the same guy that did the clock interface on an early VCR.\n\nThe camera itself seems okay, maybe better than others.","updated":"2018-08-09T14:04:37-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3724292124","userName":"user157844","userUrl":"https://itunes.apple.com/us/reviews/id141480062","version":"1.0.6","score":1,"title":"Bugs and bugs everywhere","text":"I got a OMNA 180cam HD and it always notifies me when it switches from day to night and night to day and the notification is of the last real image it captured so it looks like I’m the one setting it off and I’m not there, like it forgot to update to the current image, I tried contacting support March of 2018 which is almost a year ago and the support says they will fix it next update but it’s still version 1.3. The camera is annoying and seems like it’s never going to be updated","updated":"2019-02-02T05:00:08-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"7360910352","userName":"Mirza.Adil","userUrl":"https://itunes.apple.com/us/reviews/id311486860","version":"1.0.8","score":1,"title":"Crap of a product","text":"I purchased this camera with much enthusiasm but it turned to be a nothing but a failure. It never keep connected more than a day. I’ve deserted it more than the earth revolves round the sun and yet the issue persists. Had multiple calls with the contact center, but of no help. \n\nKindly refrain from buying this product and save yourselves from headache and other hassles. It’s a crap product with no use and heavy price tag. Sorry D-Link this is not worth manufacturing.","updated":"2021-05-19T06:35:35-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3690207532","userName":"Sancheeeto","userUrl":"https://itunes.apple.com/us/reviews/id266162460","version":"1.0.6","score":1,"title":"Newer updates showed promise but too many bugs","text":"Purchased this at full retail in 2017, I’ve never had any sort of connection issue some have had. Newest update has a bug that doesn’t save the sensitivity settings or the zones. The arm/disarm feature doesn’t show up, I use this in my living room facing the front door when I’m not home so it’s useless when I am home due to the 100 notifications I’ll get from movement. Had high hopes for this app but the lack of support is really hurting it.","updated":"2019-01-24T13:01:47-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3199870373","userName":"greenapple3317","userUrl":"https://itunes.apple.com/us/reviews/id131724636","version":"1.0.4","score":4,"title":"Great app and camera","text":"Not sure of the bad reviews as I’m having no problems with the app or camera. It records motion, detects motion well, no issues there, the camera is great quality, the wide angle replaced my 2 older camera so its cost efficient.\nMy only wish is they would add a way to schedule the motion detection. \nOther than that, great job!","updated":"2018-09-17T08:11:15-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3561290123","userName":"JustBlessed106","userUrl":"https://itunes.apple.com/us/reviews/id458900551","version":"1.0.6","score":3,"title":"Was just reading all reviews.....","text":"And was kinda surprised how many negative reviews. Granted, issues when first released, but for me, for the most part works as expected. Only issue I just discovered while testing before leaving a review is after watching a recorded event, closing it crashed the app. Otherwise does what it’s supposed to. Very responsive in Home app as well.","updated":"2018-12-22T16:32:03-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"2950913364","userName":"If Justif","userUrl":"https://itunes.apple.com/us/reviews/id383931925","version":"1.0.4","score":1,"title":"Total waste of my money","text":"I have never wasted my money on anything Apple has endorsed before like this crap off the camera it is the worst thing ever it does not do any surveillance it freezes up all the time it does not connect to Wi-Fi most of the time it tells you to upgrade when you try to do so you're not able to and totally locked out of the camera it is a horrible horrible purchase this is completelzero start","updated":"2018-07-22T15:17:18-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"4944357075","userName":"JamesM.","userUrl":"https://itunes.apple.com/us/reviews/id39224763","version":"1.0.8","score":1,"title":"Abandoned camera","text":"After ios13 this app no longer works. As a HomeKit camera, this is larger and less sharp than the competition. Presence sensor is basic at best and doesn’t work with HomeKit scenes. Unfortunately the SD card playback for this device never worked. Every time I tried to review it would ask to reformat the drive. Overall an expensive camera to others have clearly surpassed it in design, features, and value.","updated":"2019-10-13T22:11:48-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3494755782","userName":"MasterAlex17","userUrl":"https://itunes.apple.com/us/reviews/id257397867","version":"1.0.5","score":1,"title":"Unable to playback video.","text":"Ever since the app updated two days ago, I haven’t been able to look at recored videos. App states there’s a new firmware update for my device and in order for me to access new features I have to update firmware, but when ever I try and update firmware it states its running the latest version which apparently is 1.3. Camera has been restored multiple times and issues persist","updated":"2018-12-04T20:59:17-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"2271214761","userName":"Tibi mmm","userUrl":"https://itunes.apple.com/us/reviews/id166243897","version":"1.0.4","score":1,"title":"Stopped working when remote","text":"I got a message that the camera was disconnected, and even though it was working on the iPad, I could never get it to work on the iPhone again. I am sure the app it’s just too buggy. This is a waste of money and time, especially with the D-Link support being totally unwilling to help. Their solution to uninstall the app, re-install it, and logging in with the OMNA account does not work for me.","updated":"2018-03-04T12:34:00-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3552308406","userName":"Tonysitunes","userUrl":"https://itunes.apple.com/us/reviews/id39799265","version":"1.0.6","score":1,"title":"Disappointed","text":"I bought this camera last summer. It has a quality picture in daylight. Night time or when the lights are dimmer you see nothing. \nI try to take a picture when away from home and I get no respond.\nMy family has quality security cameras at a fraction of the cost of this camera and they work  perfect. \nI wouldn’t recommend buying this camera.","updated":"2018-12-20T07:01:25-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"1821119401","userName":"umarz8181","userUrl":"https://itunes.apple.com/us/reviews/id165653073","version":"1.0.3","score":2,"title":"Buggy since new update. Not working!","text":"App and camera worked great on all devices till we updated now app doesn’t work keeps giving accessory unavailable n asking us to use 10.1","updated":"2017-10-01T10:24:27-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3509638320","userName":"Miziovoi","userUrl":"https://itunes.apple.com/us/reviews/id116735326","version":"1.0.6","score":1,"title":"Update: really?","text":"Each time the app is ‘updated’, more bugs are introduced making the device useless.\nNow I cannot even open the application remotely from my iPhone, although it works from my iPad, both running iOS 12.1.1. What kind of QC they have at D-link. They managed to transform an otherwise interesting device into a brick. Very disappointing.","updated":"2018-12-08T16:58:43-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3471755272","userName":"Hmanasu53","userUrl":"https://itunes.apple.com/us/reviews/id202445160","version":"1.0.4","score":1,"title":"Terrible","text":"These are absolutely terrible. Anytime you are not on same WiFi or you close out app while not on same WiFi you get locked out of the camera. What the hell is the point of having a camera you can’t use unless you are in the same room with it? Absolute JUNK. Only reason it’s getting one star is I can’t give it zero stars","updated":"2018-11-28T17:20:00-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"1745620885","userName":"joshdnp","userUrl":"https://itunes.apple.com/us/reviews/id24512416","version":"1.0.3","score":5,"title":"Great update","text":"Nice to see the pinch to zoom and other new features like save clip to camera roll. Thanks for listening to customers.","updated":"2017-08-24T09:06:51-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3611325338","userName":"Colin Tan","userUrl":"https://itunes.apple.com/us/reviews/id198707623","version":"1.0.6","score":4,"title":"Thanks for the bug fix","text":"Waiting for the new firmware to actually get released to support summary clip feature.\nBut the SD clip feature crashes in the app at the moment. Where’s the promised firmware update????","updated":"2019-01-04T06:05:47-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3521841223","userName":"techconnect","userUrl":"https://itunes.apple.com/us/reviews/id18882317","version":"1.0.6","score":1,"title":"Wares money","text":"This is indeed useless. Buggy software that works only when you are next to the device.  Why??? This is totally useless and wasted money.  Hard to believe that this garbage is sold at an Apple store... and with an expensive camera, it’s even more expensive garbage!!!","updated":"2018-12-12T00:41:39-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3508853027","userName":"adamgirard","userUrl":"https://itunes.apple.com/us/reviews/id5948055","version":"1.0.6","score":1,"title":"Update broke SD card functionality","text":"How do you release an app update that requires new firmware but not release the new firmware? Due to this, I can’t watch any SD card clips anymore and like the previous review said, they pulled the new features anyway. So really all the update did was break the SD card playback.","updated":"2018-12-08T11:22:44-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"2350725027","userName":"James M K.","userUrl":"https://itunes.apple.com/us/reviews/id35637699","version":"1.0.4","score":2,"title":"Card Playback = Spinning Wheel of Death","text":"Nice looking app but doesn’t work well. Memory card playback constantly hangs, viewing the camera works 2/3 of the time. Pretty disappointed in this camera.","updated":"2018-03-26T20:39:43-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3725962624","userName":"Drdrake1023","userUrl":"https://itunes.apple.com/us/reviews/id205412196","version":"1.0.6","score":1,"title":"Software is trash","text":"The software is absolute trash. Can’t schedule when to turn the camera on/off. Can’t save settings regarding motion detection. Can’t auto delete oldest videos. Can’t do all the basic things you’d expect a camera to be able to do.","updated":"2019-02-02T14:19:38-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3497865606","userName":"themoran","userUrl":"https://itunes.apple.com/us/reviews/id35725979","version":"1.0.6","score":5,"title":"Version 1.0.6 👍","text":"On iOS 12.1.1  the app feels fast and more responsive. The app looks much cleaner.","updated":"2018-12-05T16:25:18-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"1840488691","userName":"Soljie","userUrl":"https://itunes.apple.com/us/reviews/id42283348","version":"1.0.3","score":2,"title":"Not working away from home","text":"Camera stop working when i’m away from home . Was working before , now it only works when i’m at home on Wi-Fi .","updated":"2017-10-10T18:30:23-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"2261088499","userName":"NickMarkoff","userUrl":"https://itunes.apple.com/us/reviews/id113342322","version":"1.0.4","score":1,"title":"Good but needs an update","text":"V1.0.4 is a disaster. I receive notifications but can no longer connect via iPhone or iPad app. Resetting doesn’t help and can’t delete or add the accessory. The camera is now a brick. I have waisted time going nowhere, I expected so much more from this brand.","updated":"2018-03-01T18:16:21-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"1856109844","userName":"Doug77777","userUrl":"https://itunes.apple.com/us/reviews/id42072437","version":"1.0.3","score":1,"title":"Not stable","text":"Camera requires power cycle to stay on line way to often - weekly or less. \nNo webui to remote reboot \nI have many dlink cameras - this is a poor product that has not received updates to fix basic stability problems.","updated":"2017-10-17T17:11:50-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3505081689","userName":"JPoirx","userUrl":"https://itunes.apple.com/us/reviews/id180616743","version":"1.0.6","score":1,"title":"What happened?","text":"D-Link introduced a much needed arm/disarm button and then pulled it away hours later. Now I’m unable to turn motion sensing off at all. I can turn off notifications but that doesn’t prevent the camera from recording.","updated":"2018-12-07T13:17:03-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3492616269","userName":"Zippie-13","userUrl":"https://itunes.apple.com/us/reviews/id17348775","version":"1.0.5","score":1,"title":"Can not play back recorded videos after upgrade","text":"I’ve attempted to look at the support page, reformatted my ssd card, reinstalled the software and fully reset my camera but the same problem exists. Help!!","updated":"2018-12-04T06:16:41-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3333590607","userName":"Rad00021","userUrl":"https://itunes.apple.com/us/reviews/id189348491","version":"1.0.4","score":1,"title":"Not a good camera nor app","text":"Terrible, the camera heats up a lot, and the app is so confusing and lacking of features. \nIm already rejecting that I didn't read the app reviews before buying, probably returning cameras this same week...","updated":"2018-10-23T00:42:01-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3492199790","userName":"Captain Pleasure","userUrl":"https://itunes.apple.com/us/reviews/id21124555","version":"1.0.5","score":2,"title":"Mediocre","text":"No location-based arm function, and I can’t access the clips on my almost empty SD card. It just spins and spins.","updated":"2018-12-04T03:48:48-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"2471911205","userName":"Jackx36","userUrl":"https://itunes.apple.com/us/reviews/id47713445","version":"1.0.4","score":1,"title":"Needs a lot of work","text":"Please tell me you all are working on improving this product. It’s stale, unintuitive, a burden to use, a challenge to access recorded content.\n\nPlease work diligently to improve this product.","updated":"2018-04-26T14:12:28-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"2860487564","userName":"Tiki Man 2001","userUrl":"https://itunes.apple.com/us/reviews/id30897730","version":"1.0.4","score":1,"title":"Do not use the firmware update","text":"Set up in less than a minute. Looked and worked great. Asked for a firmware update. Now it’s dead. Spent an hour trouble shooting. No luck.  Boxing it back up now to return it.","updated":"2018-07-07T19:40:22-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3964581243","userName":"BigA75","userUrl":"https://itunes.apple.com/us/reviews/id34408180","version":"1.0.7","score":1,"title":"Awful App","text":"Not user friendly and constantly freezes despite repeated hard resets. Either get straight or it’s going in the trash where it belongs!","updated":"2019-04-03T07:49:07-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"5183455512","userName":"Bobs39ford","userUrl":"https://itunes.apple.com/us/reviews/id480092699","version":"1.0.8","score":1,"title":"Would not connect","text":"Called D-Link they tried and would not connect to the new c 310 camera \n\nReturned the same day I received it","updated":"2019-11-22T15:16:02-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3489473853","userName":"Keyser Sozee","userUrl":"https://itunes.apple.com/us/reviews/id19337419","version":"1.0.5","score":1,"title":"Update doesn’t work","text":"Unable to view recordings with new update. Tried on both iPad and iPhone.","updated":"2018-12-03T08:15:15-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3827480689","userName":"Fahad Suhaimi","userUrl":"https://itunes.apple.com/us/reviews/id39559381","version":"1.0.7","score":1,"title":"Terrible","text":"Terrible hardware terrible software. Never worked!\nNo option for less stars!\nDon’t buy don’t use.","updated":"2019-03-01T01:32:33-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3550665058","userName":"Crew909","userUrl":"https://itunes.apple.com/us/reviews/id210207814","version":"1.0.6","score":1,"title":"Never works outside of WiFi","text":"Always have to reset it to get it to connect outside of WiFi!","updated":"2018-12-19T20:34:34-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"2390410737","userName":"Pereirawpg","userUrl":"https://itunes.apple.com/us/reviews/id186386232","version":"1.0.4","score":1,"title":"Dont buy it! It’s useless","text":"It doesn’t work when you are out of the same Wi-Fi of the camera","updated":"2018-04-06T05:20:08-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"2124310327","userName":"Jacobalvin","userUrl":"https://itunes.apple.com/us/reviews/id210587435","version":"1.0.3","score":3,"title":"Update to support iPhone X screen please","text":"Update to support iPhone X screen please","updated":"2018-01-24T23:03:57-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3517294088","userName":"crsrc","userUrl":"https://itunes.apple.com/us/reviews/id19895122","version":"1.0.6","score":1,"title":"Won't save motion settings","text":"There is no way to save the settings for the motion detector. It just reverts back to the old settings. Please fix.","updated":"2018-12-10T16:57:27-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"4037856569","userName":"me-oh-mi-oh","userUrl":"https://itunes.apple.com/us/reviews/id120938108","version":"1.0.7","score":1,"title":"Horrible","text":"If your debating between a Nestcam & OMNA, I suggest Nest. The OMNA is just an expensive paper weight. It only works 5% of the time when I want to view it remotely.","updated":"2019-04-20T08:37:44-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"5224971181","userName":"سلمان آلشهري","userUrl":"https://itunes.apple.com/us/reviews/id459716687","version":"1.0.8","score":3,"title":"Arabic language support","text":"Will the Arabic Language Association soon","updated":"2019-12-02T06:04:23-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3506615469","userName":"アンソニーー","userUrl":"https://itunes.apple.com/us/reviews/id37772937","version":"1.0.6","score":1,"title":"Bad Update","text":"Beware: the most current update completely breaks the motion detection functionality.","updated":"2018-12-07T23:11:13-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3857368851","userName":"Zow#1","userUrl":"https://itunes.apple.com/us/reviews/id217974324","version":"1.0.7","score":1,"title":"BUGGY/INTERMITTENT FUNCTIONS","text":"What’s with the intermittently functioning Arm/Disarm and Detection On/Off.  You’ve made several bug fixes but these functions are STILL BUGGY!!!","updated":"2019-03-08T07:31:32-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"1563827594","userName":"#hateafterpulse","userUrl":"https://itunes.apple.com/us/reviews/id20884497","version":"1.0.1","score":2,"title":"Doesn't record continuously, 20 sec clips","text":"Really could be a great camera for use with HomeKit. Easy setup simple menus. \n\nBiggest miss is the 20sec record from a motion detection. If your looking to have a continuous feed for review, forget it. It's annoying that you can't set a recording length longer or until movement stops. You end up with a bunch of 20 sec clips and missing footage while it retriggers in between recordings. The retrigger has nothing to do with length of recording it just senses motion and records again at max 20seconds. \n\nUpdate this feature D-Link! Your other cameras have it!","updated":"2017-03-13T14:34:38-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"1550470494","userName":"2BillBrasky","userUrl":"https://itunes.apple.com/us/reviews/id101189277","version":"1.0.0","score":3,"title":"Easy, But Missing Features","text":"Setup of the new camera was wonderful simple. The interface is nonstandard, but not hard to figure out. One key feature that should have been obvious, but is unfortunately missing, is some kind of zoom feature. You get this great big wide angle view of your room in a nice high quality image, but you can't actually see anything that isn't right in front of the camera because of that wide angle. This is particularly exacerbated on small screens like on the phone versus an iPad. Also, I find myself missing a manual control over night/day mode. This was available in the old D-Link camera app and was useful when the automatic control got it wrong.\n\nI realize this is a new product with new software, so I'm hoping these little issues will be corrected quickly in subsequent updates.","updated":"2017-02-22T20:55:36-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"1608854267","userName":"kittycat262728","userUrl":"https://itunes.apple.com/us/reviews/id36023126","version":"1.0.2","score":1,"title":"Needs a way to store video in the cloud","text":"I absolutely love that this app supports HomeKit. In fact, that's why I chose this camera over my older Nest cam. However, there is one glaring omission that means I won't be able to use this camera as my main one anytime soon...\n\nThe one major thing this device needs is the ability to save video (say 24 hours worth) in the cloud for safekeeping. I appreciate the fact that the Omna camera gives you the ability to use a microSD card for more long term storage, which is something that I always wanted with my Nest cam, but what good is that if your home gets broken into and the camera is stolen? Cloud storage is a necessary companion to internal storage and without it this device isn't a full fledged security camera. \n\nI really hope the ability to integrate recordings with iCloud is added very soon. I'd definitely pick up more of these cameras if it is.","updated":"2017-05-08T18:53:07-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"1581569115","userName":"Neverremembersperiodmyself","userUrl":"https://itunes.apple.com/us/reviews/id222017597","version":"1.0.1","score":2,"title":"Missing key features","text":"While the picture is good in the app, there are some key features missing that make this version less than optimal. Namely the ability to zoom as well as the monitor not overriding your phones auto shutoff feature, which means you have to keep opening the app up and waiting for it to load the camera view. Not great if you're trying to keep tabs on a sleeping baby.","updated":"2017-04-05T15:47:40-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"1546764667","userName":"HeloHead","userUrl":"https://itunes.apple.com/us/reviews/id106896120","version":"1.0.0","score":3,"title":"Good start ...","text":"Although a good start the camera really needs homekit based recording control. In other words, you need to be able to create a scene such as \"leaving\" or \"home\" which can turn motion recording on/off. Currently the only attributes that can be controlled via homekit are speaker audio,  mic audio, and image mirroring.\n\nI like the product but i want to control it via location services which is currently not possible. \n\nThis may be a current homekit limitation but i very much doubt it.","updated":"2017-02-17T19:17:38-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"1599077015","userName":"cbro12","userUrl":"https://itunes.apple.com/us/reviews/id31499240","version":"1.0.2","score":2,"title":"Needs better software","text":"I cannot find a way to delete multiple clips and deleting them one at a time takes forever. The ability to delete an entire day's clips with one click would make this 4 stars. The website offers no help either.","updated":"2017-04-27T09:08:53-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"1547489475","userName":"Mosne131","userUrl":"https://itunes.apple.com/us/reviews/id131557772","version":"1.0.0","score":5,"title":"Impressed. Added to my wifi and Apple TV no problems!","text":"This is a very cool device. I picked it up at my local apple store and it was super easy to set up! I hope motion detection works well, time will tell. Also impressed it is working over LTE with my Apple TV serving the live feed. Awesome job D-link!","updated":"2017-02-18T18:00:45-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"1636746750","userName":"Billions","userUrl":"https://itunes.apple.com/us/reviews/id33190361","version":"1.0.2","score":4,"title":"Please add notifications for SOUND, not just motion.","text":"This would make it a better monitor for a baby's room, notifying you if the baby starts crying. Or if your dog starts barking at someone outside.\n\nFinally, consider making an outdoor-capable version of this camera or a HomeKit enabled router for use with your wide range of existing cameras.","updated":"2017-06-07T13:57:45-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"1549150883","userName":"pfoxhoven","userUrl":"https://itunes.apple.com/us/reviews/id33474301","version":"1.0.0","score":1,"title":"Crazy Buggy","text":"One of the most buggy apps I've ever used. Using the camera through Apple's Home app is reliable. Go into this app and go to settings and it almost always results in a crash. Not just the app. The camera stops responding completely until hard power cycled. Try it... load settings and visit the SD card settings. Boom, crash and a circle of death. So frustrated this is the first review I've ever made.","updated":"2017-02-21T01:06:41-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"1550807915","userName":"iChosen1","userUrl":"https://itunes.apple.com/us/reviews/id241952699","version":"1.0.0","score":3,"title":"Room 4 Improvement; Optimistic...","text":"Needs some software updates: Firmware Update always says accessory not available. SD card playback has not worked yet for me. Need to be able to set Home/Away times. Motion Detection should be for Away, not Home. Triggers far too often during daily activities.","updated":"2017-02-23T05:56:21-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"1639903261","userName":"JaegerBob","userUrl":"https://itunes.apple.com/us/reviews/id40596991","version":"1.0.2","score":2,"title":"OK for v1.0","text":"Nice camera but waiting for a few more things. I'd give it more stars but the v1.0 feature set brings the score down a bit. \n\nI haven't yet found a way to integrate this with my Apple Watch tho that is featured in the video. A watch app is needed. \n\nNo clear solution for notifications. I'd like an email or a notice sent to my iOS device, again as featured in the video, but it beats me how to set this up. Second day research continues. \n\nWould like a sensitivity setting for switching to night black and white mode. Seems to want lots of light to show color and darker rooms are often in b/w even during the day. \n\nSeems to me the most recent recordings should appear at the top of the SD card video file list. Or give us a sort option. Me, I'd rather see what just happened instead of the oldest content in storage. \n\nDesperately need the option to save a video to our Photos app. And yes, automatically to iCloud as well. The point made by another reviewer that a stolen camera makes a security camera worthless is dead on. \n\nSound doesn't seem quite right yet. The camera speaker seems to play the sound the unit broadcasts as well as the sound from the distant app user. Duplex please. \n\nSecurity, vis a vis The Internet of Thingys. Please explain what you've done to prevent our cameras from being hacked. \n\nMotion recording smarts are needed. Yes, the suggestion that we be able to automatically disable certain cameras when the owner is home is a great idea. I don't want to have to dress up when I walk around the house at night. Or at least a very direct way to toggle on/off without diving into settings. Consider \"Off for X hours\" as a bonus. \n\nDocumentation is non-existent. No. A quick start guide does not count as documentation. Maybe documentation would tell me how to do what I think is lacking. The FAQs on their site don't. \n\nA support link should go to this devices site info, not drop you into the general home page for support. \n\nFYI, for those who want to quickly delete all their video, just reformat the SD card - app will let you do that. All or nothing tho. \n\nKudos for making a nice device that doesn't require an account to use. Just leverage what our devices can do and you have a great solution.","updated":"2017-06-10T07:44:42-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"1571846358","userName":"tacogy3","userUrl":"https://itunes.apple.com/us/reviews/id100546920","version":"1.0.1","score":1,"title":"Beta product","text":"Has such along way to go to get up to Nest standards. I really wanted it because of HomeKit and SD recording but man does it lack features. \n\nNeeds live thumbnail view without having to click into the camera. Multiple cameras can be viewed on the page like Nest has\n\nContinuous recording option to SD\n\nPut the most recent recordings at the top, not the bottom for me to scroll to. \n\nBetter alerts/notifications\n\nHomeKit app keeps telling me their is a firmware update but the app says there isn't.","updated":"2017-03-24T16:18:06-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"1618112435","userName":"Bent O","userUrl":"https://itunes.apple.com/us/reviews/id133369948","version":"1.0.2","score":3,"title":"Notifications","text":"Possibility for notifications needs to be added","updated":"2017-05-19T04:33:21-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"1562099779","userName":"stubaker","userUrl":"https://itunes.apple.com/us/reviews/id34881612","version":"1.0.1","score":1,"title":"This version not stable","text":"Settings now take 1-2 minutes to load. With no other way to turn off and on motion detection or recording it has greatly diminished use of camera. Get your QA act together.","updated":"2017-03-11T03:12:53-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"1571884847","userName":"jstattman","userUrl":"https://itunes.apple.com/us/reviews/id105086396","version":"1.0.1","score":1,"title":"Keeps saying I have an update on HomeKit","text":"Keeps saying an update is available, but whenever I go to update it says I am on the latest version. So annoying!","updated":"2017-03-24T17:54:28-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"1584984366","userName":"Alquimista586","userUrl":"https://itunes.apple.com/us/reviews/id115116448","version":"1.0.1","score":1,"title":"Crash","text":"Crash to much.","updated":"2017-04-09T17:08:06-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"1548991688","userName":"Bomaha","userUrl":"https://itunes.apple.com/us/reviews/id24778353","version":"1.0.0","score":1,"title":"Not ready","text":"Good hardware, mediocre app.","updated":"2017-02-20T20:06:22-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"3638993881","userName":"michaelalreadytaken","userUrl":"https://itunes.apple.com/us/reviews/id26176869","version":"1.0.6","score":1,"title":"Doesn't save settings","text":"Apparently they know it is an issue with iOS 12 but haven't fixed??? But I can't turn off motion detection. You toggle off. Leave the screen. It is right back on. Ditto with region setting. So now I have to disconnect the camera until an app update \"eventually maybe\" comes out to fix.\n\nNo web based interface to bypass their broken app.\n\nNo Mac App Store app.\n\nI'd have to go buy an Android device just to change a motion detection setting to off.","updated":"2019-01-11T14:37:34-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"2259861790","userName":"CrimsonEcon","userUrl":"https://itunes.apple.com/us/reviews/id106487894","version":"1.0.4","score":1,"title":"Do NOT run 2018-02-28 Update","text":"App has always been a bit buggy, especially for installing new camera. But it worked. However, latest update killed remote viewing, when you’re not at the same location as the camera, which is the whole point of a web security camera. I spent a long time working with D-Link support trying to fix this. They were able to replicate the problem and confirm that the upgrade killed remote viewing, but the only solution they could offer was to do an on-site physical reset and reinstallation. Hard to do when the camera is in a remote location. Means that I’ve lost use of the security camera until I can fly to where it’s installed. Inexcusably bad engineering. I’m running the app on a new (less than one year old) iOS device with latest version of OS, so it’s not like I’m running an old legacy configuration that D-Link couldn’t expect to test and support. How could D-Link release an upgrade that kills key camera functionality? Poor testing.","updated":"2018-03-01T08:45:40-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"2211905135","userName":"Titiyo86","userUrl":"https://itunes.apple.com/us/reviews/id280983120","version":"1.0.3","score":3,"title":"Needs a little improvement","text":"I always wanted to get a camera for my home, search in the internet and to expensive but I found this, it’s good really good but I give it three stars because the recorded videos can’t be watched on ipads app, I tried and it says no videos found or pictures so to be able to watch a video I have to take the sd card and used on a tablet that support sd cards because apple iPad don’t support sd cards so why offer an apple app just to watch live video, I wanted to get two more of this cam because they are good looking but with that money I just spend a little more and get a cam set that comes with dvr where you can access recorded videos and watch them over wife or carrier service.","updated":"2018-02-15T12:00:26-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"},{"id":"2019292860","userName":"cmfa","userUrl":"https://itunes.apple.com/us/reviews/id28791730","version":"1.0.3","score":3,"title":"Not bad... A few software suggestions...","text":"So far I really like the camera. Easiest setup of a product I have ever experienced. It was literally as easy as plugging in the device and scanning the code on the back with your phones HomeKit camera instructions. Within a few minutes it was up and running. \n\nJust a few suggestions... \n- Really needs a delete all or delete multiple function when viewing recordings from the day. Sometimes there is just way too many clips to browse through that aren’t necessary and deleting each one by one is annoying. \n- Need a way to either turn the camera off when I arrive home or turn off the motion sensor when I’m home. There is absolutely no reason to have this thing constantly saving video clips of me walking around my home. That’s just stupid and a waste of memory. \n- I wanted the motion sensor to turn on my Hue Lights when it senses motion. Worked great. However when I go to turn the lights off... the motion of the lights turning off sets off the motion sensor which turns the lights right back on again!!! It’s a never ending loop. Had to disable this automation for the time being. Please add a delay so that my lights turning off doesn't re-trigger the automation of turning them back on!!!! \n- Finally... how about a way to store some clips in the cloud? What good does this camera do for me if a robber steals the camera. I will have no way of retrieving the important footage needed to show police if the robber takes the camera with the SD card inside it.","updated":"2017-12-22T19:53:37-07:00","url":"https://itunes.apple.com/us/review?id=1195797354&type=Purple%20Software"}]