[{"id":"3301246023","userName":"Jmille22","userUrl":"https://itunes.apple.com/us/reviews/id26894276","version":"4.1.0","score":2,"title":"Latest Version Not Good","text":"I agree with some of the latest reviews I’ve seen, this latest update was not an improvement.  Just the look and feel makes the app less user friendly and not as intuitive as the previous (Colors? Font?  Functionality?).  One pet peeve, why not make the Download list view the same as the recorded All Shows view?  The vanilla Download view is an eyesore, and doesn’t contain enough information (such as the dates on the right hand side) to compare and determine what you’ve downloaded and what you have not.  It takes a lot more analysis.  And the list resets each time you go back to it, so you must scroll to the bottom for the latest downloads each time.  The All Shows list is sorted the opposite, with latest recordings listed first.  I agree, bring back the old interface please.","updated":"2018-10-14T07:37:58-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5676811094","userName":"rjrustia","userUrl":"https://itunes.apple.com/us/reviews/id42185901","version":"4.4.1","score":3,"title":"Could Use Improvement","text":"I use this app on a daily basis. I bring my iPad with me wherever I go. I don’t like the fact that I can’t stream some of my shows due to flags set by the cable company, but I can live with that. I agree with others that downloads should appear the same as the my shows view. But I rarely have problems streaming shows, and on the rare occasion that a download fails, I delete the download and start it again. \n\nAdding cellular download ability is great! My biggest complaint is that the app will not download while streaming or download in the background while using another app. I use several streaming apps and they all download in the background. Also, the buttons are too small for my big fat fingers. No reason to make them so small, and not give the user the ability to enlarge them. I think the developers are young, and don’t realize older disabled users have trouble with small tightly grouped buttons and fine print. Fix these issues and you get 5 stars from me.","updated":"2020-03-18T04:04:23-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5483231174","userName":"DrJose","userUrl":"https://itunes.apple.com/us/reviews/id41771529","version":"4.4.1","score":1,"title":"Ever time it just seems to get worse","text":"This app could used to be better. Problems: 1. when you set it up to record a program, even when you set it to not record duplicates, it records the same program twice; 2. connectivity is not great, difficult to watch shows as it often says it can’t connect even when you are a few feet away from the modem; 3. you can only transfer to an apple product; 4. often you have to manually update the app, it should do that automatically; 5. About every other month the app just quits, when you try to transfer recordings to an iPad it just gives you an error message saying it was unable to transfer, but provides no rationale or solution, so I end up having to delete the app and starts all over again which is very frustrating for someone who travels for work. You would think TIVOwould hire a team of computer engineers that could make an app","updated":"2020-02-03T06:46:05-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4068436926","userName":"JingoroKitty","userUrl":"https://itunes.apple.com/us/reviews/id13966669","version":"4.2.0","score":2,"title":"Can’t swipe to delete from My Recordings any more","text":"The latest release has more snazzy graphics but makes it much harder to do one of the primary tasks I use the app for - managing my recorded shows on the box. I used to be able to swipe left on a single recording from the main My Shows view to delete it, or in the case of series, swipe left on individual episodes on the series page to delete them. Now I have to go into each episode to delete, and there is no option to “stop recording now and delete” for something actively recording - have to wait till the recording is complete. I don’t need more pretty graphics or “more ways to discover”. I just need basic recording management back, in as few taps as possible. Please!","updated":"2019-04-27T11:26:39-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3561237966","userName":"Foto Man","userUrl":"https://itunes.apple.com/us/reviews/id26476286","version":"4.2.0","score":1,"title":"Get rid of the pictures- give me back lists","text":"I really, really dislike this latest version. We finally got the app in the previous version to stop buffering so much (we have G-speed broadband) and you had to bring THIS out. Yuck! We sometimes record a month or even a whole season of a show to watch later. Do you have any idea how awful it is to scroll through all those pictures to get to the episode we want? We want the list back! You take up all that space with pictures and then the text is micro. Then we’re having buffering issues again. No, our network is fine, thank you. Other streaming apps work just dandy. I had it when the app refused to load the new data from our box today. I threw it away and retried. No. So I’m trying downloading it again which is why I ended up here. Did I say I really, really dislike this version?","updated":"2018-12-22T16:11:23-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3447397289","userName":"Victorian-charm","userUrl":"https://itunes.apple.com/us/reviews/id29990053","version":"4.1.0","score":2,"title":"I don’t like this new version","text":"I work in Information technology so I am not adverse to change. With that said this app has a lot of bugs. I use this app to schedule my recordings and trying to find out what is on for movies is impossible. 1). I get halfway through the list and it produces an internal error. I checked my network and rebooted my box, but still gets the error. EVERY TIME!  2). Movies are shown on channels I have to pay for. And not eve for channels I subscribe to. If I want to pay for a movie I will go to that app. The old version of the app only showed free movies. I prefer that. \n\nI do hope they fix this.","updated":"2018-11-22T06:55:40-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3407295499","userName":"Luke-7","userUrl":"https://itunes.apple.com/us/reviews/id87435931","version":"4.1.0","score":1,"title":"Update ruined it for me","text":"The main thing I use this app for is to remotely record shows, mostly sport. The previous app was fine for this. Now, I search for a game, hit record, and it records standard definition. I canceled that, and scrolled to the HD version of the game, and selected record. I went to watch and it was recorded in SD. I did this previously and it worked, but now it seems hit or miss. Why SD would be a default in late 2018 is beyond me. This needs fixing...\n\nStill not fixed, though now if I GO to the HD channel to record it will. I searched for Red Zone, the infographic SAYS HD. So I hit record. Still records in SD when searching and select record. The only way around this is to search for the show date/time (if unknown), then MANUALLY go to that date and time on the SPECIFIC channel and only then will it record in HD.","updated":"2018-11-11T12:27:09-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3307238181","userName":"EJ.2018","userUrl":"https://itunes.apple.com/us/reviews/id15919857","version":"4.1.0","score":1,"title":"Worse than ever","text":"The app overhaul is poorly designed; downloading has become essentially nonfunctional — shows partly download, stall, and can never be started again; shows that do download often cannot be played back in their entirety (“a problem with playback” isn’t a very helpful error message) — the interface is too big (only 2-3 downloaded shows appear on my iPhone before having to scroll, and the text is too wide as it fades off the right side of the screen).\n\nThe app has always had some minor problems and occasional streaming/downloading issues (which seemed to get worse over the past month). But this “update” has rendered the app nonfunctional.\n\nWish I didn’t have “automatic updates” turned on or could revert to the old version.","updated":"2018-10-15T23:31:54-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3605254762","userName":"db1126","userUrl":"https://itunes.apple.com/us/reviews/id28935878","version":"4.2.0","score":1,"title":"New version is a disaster!","text":"The latest update is annoying. Can’t easily find what I’m looking for anymore, can’t see all the upcoming shows for a series easily if you don’t already have an episode recorded, no more basic handy remote controls on the top bar to pause or stop. All these things were in the previous version. Wish could go back to it!\n\nUpdate: this version is such a disaster I’ve resorted to digging out my ancient iPad2 running iOS 9 so I could download and the far superior previous version. NOW I can find my shows easier, use the app to select a live program from the guide to watch, and easily pause the live tv from the app. I wish I had the option to go back in my newer iOS devices. The people that approved this new version should be fired!","updated":"2019-01-02T16:24:26-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3741408461","userName":"fedupwithtivo","userUrl":"https://itunes.apple.com/us/reviews/id186804444","version":"4.2.0","score":1,"title":"Dec upgrade is crap","text":"I waited as long as possible to download the latest update being as I’ve had issues in the past.  This one is by far the worst.  I’m in the process of downloading ALL my previously downloaded shows....WTH!  Why am I having to do this? This is ridiculous.  \nNow I’m no longer able to see the air dates of my shows which was a previous feature I actually found helpful. I also can’t figure out how to toggle between shows I’ve recorded and those I’ve downloaded to my IPad.  \n\n“improvements” aren’t IMO!  As per usual I’m sure some poor employee had to come up with this update in order to justify his/her job when there wasn’t any real need to change the look or feel.  Was anyone complaining I wonder!","updated":"2019-02-06T17:57:42-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"7138020413","userName":"BeamerDude","userUrl":"https://itunes.apple.com/us/reviews/id5111133","version":"4.6.1","score":1,"title":"Horrible Development","text":"You people are absolutely terrible developers. I have used this app for years and it still has the same problems - shows get interrupted during streaming, have to constantly set up streaming (really?? you can’t do this without the user having to interact with the software??). I have extremely fast internet upload and download speeds with very low latency. My home network is extremely fast with a 1Gbps backbone, also with very low latency. The user experience with your app is so awful! Why haven’t you fixed your streaming problems? Every other reputable app developer can get an app to stream, reliably. Perhaps, you don’t care? Then, terminate the app!!","updated":"2021-03-23T22:48:55-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3558563092","userName":"Jlwhitten","userUrl":"https://itunes.apple.com/us/reviews/id48797591","version":"4.2.0","score":3,"title":"Suggested improvements for new UI","text":"Put the remote control icon and access back on the top of the main page. Plenty of room at the top of screen (next to search icon).  Shouldn’t have to switch pages to just to call up remote to then pause, skip commercials, jump forward and back, etc.   \n\nSeems like selecting to watch something on Live TV should more intuitive and require one touch only.\n\nJust my own situation, I understand why TV on and off can’t work in app, but a nice compromise might be to provide a toggle to blank the screen (to black) when desired.","updated":"2018-12-22T00:20:41-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3135832515","userName":"auryaun nevin","userUrl":"https://itunes.apple.com/us/reviews/id484707641","version":"3.7.9","score":1,"title":"I have no idea what this app is doing","text":"I wish I could attach screen shots. The app is so frustrating! My show list, when sorted by date, lists folders in an order that doesn’t correspond to the actual contents. The folder will have today’s date, but the contents will all be from months ago, with everything already having been seen. Similarly, I get a “New” flag in folders that don’t actually contain new content. Additionally, the app no longer registers that I’ve watched an episode. I use my phone and my television equally, but they don’t sync information. Lastly, the mobile interface is clumsy and outdated by a few years: flat design isn’t going away, guys. Your TV app is beautiful ~","updated":"2018-08-30T23:33:41-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6620076146","userName":"LK====","userUrl":"https://itunes.apple.com/us/reviews/id23076062","version":"4.6.1","score":1,"title":"Downloads stop playing hourly","text":"App has stopped allowing streaming from my iPad. My only recourse is to delete the app and reload. Doing so will permanently delete all my downloaded shows and movies. What’s the point of having this service if I can’t count on saving my shows? \n\nDownloaded shows stop playing hourly unless I interact with the show. Even when I’m in airplane mode. Your chat support says its a known “feature” created during the last release but can’t tell me what the benefit to the user is supposed to be. Please learn how your users want to use the app. I want my downloaded movies to play until the end without intervention from me.","updated":"2020-11-07T13:20:07-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3257203794","userName":"STPLOX","userUrl":"https://itunes.apple.com/us/reviews/id282805007","version":"3.7.9","score":5,"title":"Works for me","text":"Some may have different needs than I have, but for me this app works flawlessly.  WiFi allows me to see what’s on and when, set a one pass if i wish, watch what’s on my play list no natter where I am. And if I wish, use the app as a remote control, find shows I enjoy and note when to watch (or record), in my home network watch a show away from my TV on any connected device (I do this often while in my workshop etc.).","updated":"2018-10-02T18:22:36-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3722810824","userName":"PurpleUrge","userUrl":"https://itunes.apple.com/us/reviews/id11262036","version":"4.2.0","score":3,"title":"Search doesn’t reflect what you’ve recorded","text":"When I search for a movie/tv show, it shows me the options to view it (prime, Netflix, etc), but if I have recorded a show and overlooked it, it never shows me that I already have it on my box. Hard drives have gotten so large now it is easy to scroll past something. I feel like this app should always show me if the show I am searching for is already on my box, before I pay to watch it elsewhere.\n\nOtherwise, I generally like the app. The buffer can be a little short and that can be tough to watch.","updated":"2019-02-01T20:32:49-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4940981879","userName":"bogie100","userUrl":"https://itunes.apple.com/us/reviews/id126211208","version":"4.2.0","score":1,"title":"Terrible App Now","text":"They took what was a reasonable app from just ok to terrible. The GUI is so much worse, made it difficult to navigate, can’t search for a channel # if you know it, fonts and background has terrible contrast and size some labels are unreadable. I’m middle age and have a very hard time reading the labels and navigating. I would say I have above average technical abilities for my age group and I have a very difficult time with this app. Some suggestions: make fonts easier to read and better and higher contrast, make this be much more functional and able to select a program to record at a current or future time slot more intuitive and easier and quicker.","updated":"2019-10-13T09:46:06-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"8074480971","userName":"PippinsPaw","userUrl":"https://itunes.apple.com/us/reviews/id25761918","version":"4.8.1","score":5,"title":"Nov ‘21 update is much improved","text":"First impressions of the latest update is fantastic!  Finally able to have a stable streaming “out of home” session for an entire show without crashes.   This is what was expected years ago, and appreciate the rewrite. Will definitely get more use out if the app moving forward than I have the past 5+ years of buggy operation.","updated":"2021-11-28T16:36:49-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3541458998","userName":"MM-Maloney","userUrl":"https://itunes.apple.com/us/reviews/id14530999","version":"4.2.0","score":2,"title":"UI was good... now not so much... download gotten worst","text":"The app was a bit difficult when downloading before but now it is even more challenging.  But the worst are the UI changes.  Why is the download group of videos not treated like the main??  Where is the folder groupings of the shows, where is the option or order by the season/episodes. And what happen to swipe to delete a show or folder?  Now I have to go into the item to remove it.  Some of the ease has been lost... please bring at least the UI in download up to speed and it would greatly improve the app usability!","updated":"2018-12-17T06:52:36-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5470644586","userName":"Johnish","userUrl":"https://itunes.apple.com/us/reviews/id27062862","version":"4.4.1","score":2,"title":"Reconnecting... reconnecting","text":"Was a decent app at a time. Now it’s mostly unusable. I would only use it to search for upcoming shows and to set it to record when I was out in the road. \nHowever, doing this now is a struggle. The search feature is shockingly bad with results that aren’t being aired in the future, which are then not very relevant. Once you do find the show to record the screen will refresh with the word reconnecting and you have to start over. Took my 4 tries to set it to record a show.","updated":"2020-01-31T07:33:00-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1888943429","userName":"Seale69","userUrl":"https://itunes.apple.com/us/reviews/id49805182","version":"3.7.7","score":3,"title":"Mostly ok but could be a lot better","text":"I’m glad this app exists because I can set up and edit recording plans when I’m away from home.  Search could be improved and interface is off in parts. I tried to use guide to look for a show in the future but didn’t realize I had to click on the black bar’s blank space to get it to take.  Wished the search worked better then I wouldn’t have to use Google to find the actual times for a college football event.","updated":"2017-10-31T20:42:11-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3877273671","userName":"Poolmwv","userUrl":"https://itunes.apple.com/us/reviews/id165526829","version":"4.2.0","score":2,"title":"Who made these decisions?","text":"Although there are some aspects that I like about the new version (I like being able to come up immediately to my to do list) it is no longer possible to left swipe on something that is recorded to delete it. You have to go into each program and delete it. Please bring back that feature. It would also be nice if we could save our preferences for recording. For example I never want to get streaming versions. But I always have to choose recordings only.","updated":"2019-03-13T10:09:00-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6217127817","userName":"jjddgg","userUrl":"https://itunes.apple.com/us/reviews/id37587161","version":"4.5.1","score":3,"title":"Fix the Login!!","text":"For my purposes, the app works well ... once I'm logged in, that is.\n\nCredentials expire quickly enough that I need to verify my identity just about every time I use the app. However, it's not integrated with iPhone biometrics, so touch and face ID are not available. This makes logging in a huge pain in the rear since I use a long, complex password stored in a password manager. For a long time, the app and the manager didn't play well together.","updated":"2020-07-19T09:56:46-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3735733232","userName":"texastechguy","userUrl":"https://itunes.apple.com/us/reviews/id941845737","version":"4.2.0","score":1,"title":"Big disappointment","text":"The new user interface is poor in numerous ways and a big step back compared to the earlier app (prior to the big change in the UI). The app is also very slow to start. It’s not easy to switch between different units in different rooms. Imagine your remote taking 5 seconds to work each time you pick it up. Fail!  The shading that attempts to show which option is selected in various locations images makes it difficult to see which option is selected (white vs off white). Why not use color? The fonts used are tiny and it’s just not intuitive.","updated":"2019-02-05T03:38:51-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3738101904","userName":"has29650","userUrl":"https://itunes.apple.com/us/reviews/id25787695","version":"4.2.0","score":1,"title":"Frozen now","text":"I have had the same issues with downloaded shows. The download often stalls part way along.  What I do download often does not play well. Now the app just want start at all. I have downloaded about 10 shows so I hate to delete and reinstall the app. I think I am just going to try using the browser interface to watch my shows.  I had started downloading because streaming with the app was hopeless.  It would stop randomly and when you restarted streaming it would go back to the beginning of the show.  Hard to imagine any app that functions more poorly.","updated":"2019-02-05T19:40:38-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3573282441","userName":"Bad artist!","userUrl":"https://itunes.apple.com/us/reviews/id17418541","version":"4.2.0","score":1,"title":"A big step backward","text":"This app was never great, but at least it was more functional. As many other reviewers have noted, the last major upgrade made almost everything more difficult to use and navigate. Downloading shows now take more steps. And the list of downloaded shows is now horrible.  It is not grouped by show and there is no information about the show unless you click into it. Please bring back the old interfaces or at least try to fix it.  Maybe have a test group of users since it doesn’t look like they used one last time around.","updated":"2018-12-25T17:43:29-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5366483738","userName":"TivoFan4","userUrl":"https://itunes.apple.com/us/reviews/id130085345","version":"4.4.1","score":3,"title":"Wish List","text":"The app loses connection gives error message and requires me to log in on a regular basis. No other app does this to me. It’s frustrating when you’re in a hurry to record or use the app to quickly find something. \nI can’t find how to see upcoming episodes for my season passes, and it used to be easy. \nOverall it is really handy to have, since setting up recordings on the Bolt is more cumbersome.","updated":"2020-01-05T18:35:00-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3702672014","userName":"ritterml","userUrl":"https://itunes.apple.com/us/reviews/id33135997","version":"4.2.0","score":1,"title":"V 4.1 has network connection issues that are unresolved.","text":"Despite being able to login to my account through the website and to login on the v 3 series of this app, I cannot maintain a network connection to my device since version four. It constantly says “network connection error”.\n\nUPDATE: After uninstalling and reinstalling the app it connected, but the network connection issue persists soon after.\n\nUPDATE 2: now to watch a show I have to find the channel then click a button for “watch and record“ then tap on TV then tap live TV. This just is not user-friendly at all!","updated":"2019-01-27T17:03:58-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2800235899","userName":"Bobbi 1234","userUrl":"https://itunes.apple.com/us/reviews/id10344916","version":"3.7.9","score":3,"title":"Sound when advancing through commercials","text":"The sound is VERY loud when you use the advance button or select button for that matter, any button that has sound. When I try to turn the sound off it does not work. It is louder than the actual program I am watching and is almost not worth hearing it to change anything. Everything else is great about the app. Love that you can program and watch shows through the iPad.","updated":"2018-06-29T19:44:35-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6118329417","userName":"VanHalensing","userUrl":"https://itunes.apple.com/us/reviews/id21017305","version":"4.5.1","score":2,"title":"Too cluttered","text":"The app has become too cluttered, and doesn’t even work with all devices. Specifically, it doesn’t work with the Stream 4K. Their newest device isn’t supported. Even if they had 2 apps it would be better. One for all devices that’s a remote and basic functions, and one for all the fancy stuff that is cluttering the app. Or, a mode to turn those things off. Whatever works for them. Right now they’re caught between doing too much, and not enough.","updated":"2020-06-24T18:56:09-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3539502261","userName":"KenFromSanDiego","userUrl":"https://itunes.apple.com/us/reviews/id13662631","version":"4.2.0","score":1,"title":"User Interface on v.4.2.0 is worse","text":"I really loved the older user interface before the “dark mode” overhaul. U.I. is subjective and it would be great if developers offer “classic look” or something. Anyone can get “used to it”, but I value data over graphics.  When I open a group recordings I get a bunch of icons. Why?  I prefer the list that showed be the info data with each show.  Now I have to press the “Edit” button to give me that list.  I hate the Channel list as well.  Why not the old-school grid design that shows more than just the current hour’s shows.","updated":"2018-12-16T18:24:48-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4218827686","userName":"Jim020764","userUrl":"https://itunes.apple.com/us/reviews/id665747460","version":"4.2.0","score":2,"title":"Old was better","text":"The download function has gotten worse. I still don’t understand that when you download something in a less that perfect WiFi network you end up with a download that can’t play. Downloading files has been something that has been done already even in thought network situations I downloaded a 3 part thing and the first episode craps out in the first 10 seconds. Completely unacceptable. And let’s not talk about the bad way of displaying Downloaded files","updated":"2019-05-27T05:10:37-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4552017791","userName":"AriaLHM","userUrl":"https://itunes.apple.com/us/reviews/id35987663","version":"4.2.0","score":1,"title":"Inefficient","text":"Needs some improvements!\n\n1) Add the option to choose a smaller buffer for high-speed connections, & a larger buffer for low-speed connections. This will solve the problem of people not having enough hard-drive room/RAM to prevent their streams from freezing. \n2) Add the regular fast forward & rewind buttons. I will stop & watch commercials if they look interesting, this way. Skipping forward by 30 seconds almost guarantees I won't watch them.\n3) Add the ability to see what channel all the tuners are on, which are recording, and which is being viewed on the TV.\n4) Allow viewing of shows/movies/events without recording them.\n5) Be able to select different Channels or recording dates when modifying a recording. A future recording shouldn't have to be deleted to see what other recording options there are.\n\nPlease make these changes for an app worthy of 5 stars! :)","updated":"2019-08-01T12:19:32-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3381473286","userName":"jaybrennan","userUrl":"https://itunes.apple.com/us/reviews/id17534587","version":"4.1.0","score":2,"title":"Latest update removes useful functions","text":"What were they thinking?  The previous versions had a virtual remote with a scrub bar, making it so easy to move backwards or forwards through a program.  There was also a pause button in the menu bar.  Both are gone now.  When you opened the program guide in the app, it was always on whatever program was playing live; now it’s on whatever channel you navigated to in the guide previously.  The whole app looks more cluttered","updated":"2018-11-04T14:24:55-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1924324722","userName":"NotSoMuchAnymore","userUrl":"https://itunes.apple.com/us/reviews/id439247951","version":"3.7.8","score":2,"title":"Streaming Quality Not So Good","text":"Streaming quality for a small screen, like a phone, is acceptable, but streaming to a large screen via AppleTV is unacceptable with low resolution and reduced frame rates (see Slingbox as the benchmark of good streaming quality). It would be nice if this app could natively connect to AppleTV without mirroring (it would fix the reduced frame rate issue). It was also be nice if this app could natively connect to a Roku box. Both of the later two functions are available on the Slingbox app, and work wonderfully.","updated":"2017-11-15T21:44:20-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1994262061","userName":"DrugRixhTre","userUrl":"https://itunes.apple.com/us/reviews/id527889621","version":"3.7.8","score":1,"title":"Needs update and iPhone X Support","text":"The remote app needs an UI update instead of directly copying and pasting the look and feel of of the remote. So much space was wasted doing this which forces users to scroll up and down for remote control access which is a bad design. Needs iPhone X support which would help this scrolling issue alot but that's not a solution to that problem. Haven't tried streaming outside of the house so cannot say if that needs improvement or not. Will give it one star because the main function of this app is a mess.","updated":"2017-12-13T15:07:13-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2267050315","userName":"SMU Control","userUrl":"https://itunes.apple.com/us/reviews/id28991438","version":"3.7.9","score":2,"title":"Date/time selector still broken","text":"A simple fix that goes unaddressed with every release! Still no label on the button to select a date/time in the selector. I can select “Now” or “Tonight”, but if I scroll the date/time, I have to know the secret of touching in the black void next to “Tonight” to select my scrolled date/time. Why not label the void with “Select” or “Go” so that selecting a time is not a secret? Just look at the number of calls/comments you get saying that you can’t change the date! FIX THIS!!!","updated":"2018-03-03T09:03:05-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4043327201","userName":"Tearose8375","userUrl":"https://itunes.apple.com/us/reviews/id43813799","version":"4.2.0","score":1,"title":"Wish I could give zero stars","text":"This newer version is horrible. I don’t have to use it often but every time I do, it makes me log in again AND usually makes me reset my password even though I’ve recorded my password from the last time. \n\nIf I search for something on Live TV, it used to have a simple “Watch Now” option. That is gone. It’s a guessing game of hitting options until you find the right one. Trying to set a recording is an even worse nightmare. \n\nThe remote portion of the app used to look just like the handheld remote, making all the functions easy to find and use. That was awesome but of course they got rid of it. Now it’s just a flat chart of “buttons” whose placement makes no sense whatsoever. \n\nI only use this app for the simplest of functions but it can barely do that! Bring back the old version at least, but definitely scrap this one!","updated":"2019-04-21T14:14:23-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2501748058","userName":"Rasterman2","userUrl":"https://itunes.apple.com/us/reviews/id26448577","version":"3.7.9","score":5,"title":"Way better","text":"…that a few years back.  Been using it with a rovio for 6 weeks. Downloads are fast and reasonably efficient. I particularly like that I can start playing soon after downloading has started. It also worked seamlessly when I was away from home and streaming over the net.","updated":"2018-05-03T18:58:58-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3626877656","userName":"khooper_0919","userUrl":"https://itunes.apple.com/us/reviews/id26456864","version":"4.2.0","score":2,"title":"Very difficult to use and confusing","text":"The new apps for iphone and ipad are very difficult to use and confusing.  Looking for “upcoming” episodes, and trying to see which episodes are recorded, swiping to delete a recording from the “My Shows” or “Manage Recording List” (feature now gone), are a couple of examples.  Overall I wish we had the old app back. It worked, it was straightforward and easy to use.  You’ve tried to “fancy it up” for no reason!","updated":"2019-01-08T07:59:27-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5796450111","userName":"Needle Brain","userUrl":"https://itunes.apple.com/us/reviews/id25173671","version":"4.4.1","score":1,"title":"An embarrassment to all involved in its creation","text":"This piece of junk deserves negative stars. In the last ten minutes I have had it “reconnect” somewhere around thirty times. When it reconnects it forgets what it was doing and you must reissue your entire request. And the search results are appalling. I searched for a movie called “Sixty-Six” and got no results. Then I searched for the director of said movie and “Oh look, there it is.” Absolutely pathetic. As a software developer I would commit ritual suicide before releasing a load of crap as immense and smelly as this.","updated":"2020-04-11T07:53:00-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3477460462","userName":"noSMSspam","userUrl":"https://itunes.apple.com/us/reviews/id28982933","version":"4.1.0","score":2,"title":"Used to be a good app","text":"This used to be a good app.  Then I made the mistake of updating it and have had nothing but problems.\nThe new downloaded-shows interface is awful; it doesn't even group together multiple instances of the same show.  I often get an error when I try to download them; others download.  Turns out I can only select one show to be downloaded at a time.  Until that completes any other show I tell it to download gives an error.  Ugh.","updated":"2018-11-30T06:03:22-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3710353626","userName":"Nickname314001","userUrl":"https://itunes.apple.com/us/reviews/id38400931","version":"4.2.0","score":1,"title":"They should stop trying to improve the experience.","text":"The current version makes it more difficult to record a program and delete a program. Also whenever you try to use your phone or iPad to find something to watch on the TV it will insist on steaming it to the device instead of changing the channel. Why can’t they just go back to the software they had 3 years ago. Also if they think people are going to choose their device over a proper streaming device like a Fire or  Roku they are high.","updated":"2019-01-29T16:29:53-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3592933907","userName":"tinac1","userUrl":"https://itunes.apple.com/us/reviews/id41088236","version":"4.2.0","score":2,"title":"Accessibility issues- text too tiny to read!","text":"Unfortunately this version of the app has such a tiny font, it’s almost impossible to read the text in your recordings list unless you have pretty excellent vision. It doesn’t have any way to make the font larger, nor does it support Apple’s dynamic text so it ignores your system font settings. \n\nThis version has made improvements in streaming and audio so it gets 2 stars instead of the 1 star I was going to give.","updated":"2018-12-30T12:58:31-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2530170965","userName":"BanjoBiker","userUrl":"https://itunes.apple.com/us/reviews/id33269266","version":"3.7.9","score":3,"title":"Keeps dropping audio","text":"I like the freedom this app gives me, but I get annoyed when I set up a stream and the video plays with no audio. I have to skip ahead several minutes into the stream to acquire audio, then go back to the beginning. Many times the audio is still gone, but after several tries and restarts, it finally appears. I hope this gets fixed soon. It is very irritating.","updated":"2018-05-10T17:30:36-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2388056729","userName":"rhodabe","userUrl":"https://itunes.apple.com/us/reviews/id139666471","version":"3.7.9","score":4,"title":"Good, Could Be Even Better","text":"I love that I can use this, away from home, to set something to record when I have just heard about it, so I don’t forget. Yes, there are more advanced options missing that several other comments mention, but I would rather have an app that gets my major needs right than a sketchier one with a bigger reach.","updated":"2018-04-05T14:15:05-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4305885282","userName":"OldDogThree","userUrl":"https://itunes.apple.com/us/reviews/id14354773","version":"4.2.0","score":1,"title":"New app is a letdown","text":"One example: My Shows has new glossy graphics.  It may look better but it’s virtually unusable.   In many cases you can’t read the name of the episode or date of the recording.   The old version had a simple tabular interface.  Not as pretty but perfectly fit the functionality it was supporting.   This version is designed for the sake of form.   Folks, good design means form follows function.   Very disappointing from a company that has seemed to understand that and delivered superior products.   No longer - sad.","updated":"2019-06-12T12:11:48-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2291688336","userName":"Old Engineer Tim","userUrl":"https://itunes.apple.com/us/reviews/id482607883","version":"3.7.9","score":4,"title":"OK but works but not always","text":"Works OK, but could be better. When logged into app and I go to another app, it has trouble staying logged in, have to close all apps in order to login. Sometimes have to reboot my iPad. This is a time consuming process. Why does it have so many Login problems. Please fix, this has been like this for a long time.","updated":"2018-03-10T09:35:47-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4228094133","userName":"DrJBDC","userUrl":"https://itunes.apple.com/us/reviews/id15217700","version":"4.2.0","score":1,"title":"Version 4 is horrible","text":"I wish you had access to the old version. The new version has difficulty connecting with my main unit even in the house. Downloading a show will take me 3 to 4 times as long as it used to with the older version. The new were version is much more difficult to navigate through. Granted, it looks nicer, but if the nicer Lux take up so much more processing on the CPU, it’s just not worth it.  I just can’t believe there’s been no updates in four months to address these issues.","updated":"2019-05-28T20:52:30-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1959795450","userName":"BitburgDan","userUrl":"https://itunes.apple.com/us/reviews/id20757718","version":"3.7.8","score":1,"title":"Uhm...where’s the ‘Back’ button on the remote","text":"I really like my new Bolt and the new UI. When I updated my Mini it told me that the new UI heavily used the ‘Back’ button on the remote which doesn’t exist on older remotes. OK. So I need a new remote for my Mini.  But imagine my surprise when I went to use the remote control emulation in this app and discovered there is no ‘Back’ button for my Roamio, Bolt, or Mini. WHERE’S THE BACK BUTTON?  Come on guys. Try actually using the apps you publish. It’s not like you aren’t providing the hardware AND the software. \n\nFail.","updated":"2017-11-30T05:16:32-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3293637657","userName":"walkatola","userUrl":"https://itunes.apple.com/us/reviews/id101023608","version":"4.1.0","score":2,"title":"Liked version 3 better","text":"Why are the rewind/pause/FF buttons in the middle of the screen when streaming?  And they stay for about 5 seconds so it’s annoying when scanning through a sports event (or whatever else you’re watching). I’m trying to skip through downs in a football game and all I see is three circular buttons when the new play starts. Please put these buttons back to the bottom as they were in version 3.0.","updated":"2018-10-12T09:02:11-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5741800824","userName":"Jacks2157","userUrl":"https://itunes.apple.com/us/reviews/id112376783","version":"4.4.1","score":3,"title":"Bug Fixes = layout change ?","text":"Misleading description of these updates. The new guide layout now has a large section of the display filled with pictures of the selected show ( 40% if my iPad). This leaves less room for viewing my channel guide. A bad choice in my opinion, I need the information in the guide more than I need the useless pictures.","updated":"2020-03-31T09:58:44-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5257557772","userName":"Angus MacGuyver","userUrl":"https://itunes.apple.com/us/reviews/id188401504","version":"4.4.1","score":3,"title":"Annoying issues","text":"A new customer to Bolt OTA.\nThese are my complaints regarding the app, so far, and echo some of the other complaints.\n\n1. Slow - The interface and app, in general, is slow to navigate, even when connected to the same WiFi network as the Bolt OTA.\n\n2. Cellular - [This feature has been added as of Dec. 2019] Streaming or downloading a recorded item only works when the mobile device is connected to a WiFi network.\n\n3. Minimize - There is no ability to minimize the video to a window in the corner to allow doing a different task at the same time.\n\nOther than these items, I enjoy the app and appreciate the feature.","updated":"2019-12-10T16:33:00-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"7837460234","userName":"LDW-EG","userUrl":"https://itunes.apple.com/us/reviews/id651223436","version":"4.6.1","score":1,"title":"Just gets and worse","text":"How about an update that actually fixes bugs and improves the things that people are complaining about? It seems that the developer’s mission is to make the app completely unusable/ worthless so he won’t have to work on it anymore.\n\nRight now I can’t even dismiss the stupid warning that an update is coming soon and this garbage app will delete all of my downloaded shows. 100% broken. Fire the developer and hire someone competent.","updated":"2021-09-23T10:46:41-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6311794689","userName":"HeRatesApps","userUrl":"https://itunes.apple.com/us/reviews/id29176955","version":"4.6.0","score":4,"title":"Voice search doesn’t work","text":"Voice search, the newly released feature on this app, does not work. After I give the app permission to access dictation settings, even the simplest voice search like “show me movies” results in a message that says “no results found.”","updated":"2020-08-12T13:40:54-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5724176436","userName":"Lftnthedust","userUrl":"https://itunes.apple.com/us/reviews/id161440618","version":"4.4.1","score":1,"title":"Really bad app!","text":"This App was updated a while back. The previous version was really good. But ever since the update and the redesign of the app, it’s been terrible! Whenever you’re using it, it constantly stops and says “reconnecting.“ Then it gives you a “sign in error” when you weren’t even signing in. The only option is “try again,” and then you get caught in this loop. Really wish they had somebody taking care of this that knew what they were doing!","updated":"2020-03-27T20:43:42-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4384460129","userName":"AGuyFromWaukee","userUrl":"https://itunes.apple.com/us/reviews/id8561189","version":"4.2.0","score":3,"title":"Better than DirecTV, but borders around video","text":"Overall this is a great streaming app and works very well without having to rely on on-demand programming.\n\nOne big issue is I run the latest iOS devices and the app doesn’t fill the screen when watching.  Basically there are black bars all round the video making the screen 10-15% smaller. I can zoom but will cut off the sides of the video.","updated":"2019-06-28T22:34:40-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6570088655","userName":"Diehajqd","userUrl":"https://itunes.apple.com/us/reviews/id234776848","version":"4.6.1","score":2,"title":"Agonizingly SLOW","text":"Every few keystrokes it has to “reconnect,” and it takes way too long to look up listings, search for shows, or so much of anything other than when you’re away from home and need to schedule a recording.  Otherwise you might as well use your remote at home.... even entering one letter at a time and navigating menus it’s faster than this train wreck of an app.","updated":"2020-10-24T12:44:46-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5915906298","userName":"2014Mu5tang","userUrl":"https://itunes.apple.com/us/reviews/id1008266935","version":"4.5.1","score":1,"title":"Has become unusable","text":"I have used the app on my iPad for years. It has never been great, but it allowed me to watch my content on my iPad. I was okay with that. In recent days it has become unusable!! I have tried all the suggested fixes. Some have worked, but only for brief periods.  They say they are working on it, but I don’t understand why they pushed out an update that is worse than whatever problem they were trying to fix!! Unhappy in quarantine!","updated":"2020-05-07T11:44:45-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1922299585","userName":"Secular Humanist","userUrl":"https://itunes.apple.com/us/reviews/id43702849","version":"3.7.8","score":2,"title":"Buggy","text":"3.7.8 and still lots of problems with protected content, which is a lot of cable TV (for example, Comedy Central). Streams freeze and cannot be restarted by the \"Try Again\" option despite being on a high quality 100Mbps+ home network. Shows rarely finish downloading before failing completely. Sometimes even downloaded shows won't play and have to be downloaded again. \n\nVery frustrating.","updated":"2017-11-15T01:22:48-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1923662598","userName":"Tiffyheartscats","userUrl":"https://itunes.apple.com/us/reviews/id42896143","version":"3.7.8","score":4,"title":"Works Great","text":"I love it! Can catch up on my shows anywhere. I never have any problems. And customer service is very nice had to call once when there was a issue. For a free app, it’s easy to use and if there an issue there’s actual people to help. \n\nLive TV is lagging quite a bit though. That’s my only complaint.","updated":"2017-11-15T15:18:18-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3369344797","userName":"renweave","userUrl":"https://itunes.apple.com/us/reviews/id703943057","version":"4.1.0","score":5,"title":"Basically perfect!","text":"The latest update finally made this app much better! Doesn’t randomly crash anymore. And the interface is way easier to navigate! So nice to be able to record a show away from my house.","updated":"2018-11-01T10:39:43-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5737304287","userName":"HighlandsBoy","userUrl":"https://itunes.apple.com/us/reviews/id38225727","version":"4.4.1","score":2,"title":"Meh","text":"I don’t use the app often, but when I do I almost always am asked to login again. Why doesn’t this app leave me logged-in? Simple fix, no? OR, with many other apps I use my iPhone recalls my saved password. At least that is something. But not this one. I have to open my passwords app to copy it. All needless, designed by people who I can only assume actively dislike their customers.","updated":"2020-03-30T13:22:43-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4239711764","userName":"nicyname80","userUrl":"https://itunes.apple.com/us/reviews/id70024107","version":"4.2.0","score":1,"title":"Not good","text":"The main reason I have this app is to download my shows so I can watch them when I’m away from home.  Can’t get anything to download keep getting something about maximum streaming reached.  Don’t understand as nothing has changed and it worked fine the day before.  Also don’t like the new interface to many graphics and lost the ability to just swipe a show to delete it.  Why not fix the complaints and leave the other things alone","updated":"2019-05-31T03:31:02-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3302901500","userName":"Bokmann","userUrl":"https://itunes.apple.com/us/reviews/id34596003","version":"4.1.0","score":1,"title":"Bugs galore in latest version","text":"Setting aside the interface changes I hate, you have broken the ability to stream video.  I get 15-30 seconds of video before it freezes, then just simply says I have a ‘streaming problem’.  It goes away after an hour or so, but it comes right back.\n\nI could live with the minor annoyances in the UI, like always returning to sorting by season...  but I guess when you can’t get sorting right, reliable video is too much to ask.","updated":"2018-10-14T18:55:04-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5915505043","userName":"katyb3","userUrl":"https://itunes.apple.com/us/reviews/id35953600","version":"4.5.1","score":1,"title":"Worse than before, which wasn’t great.","text":"Since these latest updates occurred, every time I open the app, it makes my home connection disconnect.  The app has rendered itself useless now.  Before I could at least schedule recordings ahead of time via the app, download things to watch while away, etc.  Needless to say, it’s frustrating!  With every update recently, I hold out hope that this bug has been remedied.  But, alas... no.","updated":"2020-05-07T09:36:46-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3487685932","userName":"Panicing","userUrl":"https://itunes.apple.com/us/reviews/id14765490","version":"4.1.0","score":2,"title":"Deleting shows is harder.","text":"The app needed the overhaul and the iPhone X update. The has its pros and cons. My main beef is it is 3 or 4 taps to delete an episode and I don’t  see an option to delete multiple episodes or a folder. I mainly used this app to manage my shows, but now it’s so hard, my box is 100% full. A nice slide to delete would be nice, and please bring back ability to delete a folder or multiple episodes. Thanks.","updated":"2018-12-02T20:59:59-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6534293591","userName":"KurtJohnston","userUrl":"https://itunes.apple.com/us/reviews/id456755057","version":"4.6.1","score":4,"title":"No remote control after iOS 14","text":"I like the app, but the remote control says it is not connected to my device. I can play recordings and it displays shows that are being recorded so it is connected to the unit. Seems that iOS 14 has messed up the remote.","updated":"2020-10-14T06:52:46-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5862780017","userName":"Ccryan2000","userUrl":"https://itunes.apple.com/us/reviews/id133599694","version":"4.5.1","score":5,"title":"4.5.1 fixed streaming!","text":"Thanks for fixing and cellular streaming on iOS is fantastic!  Now can we get the ability to have the show playing go to a small window so we can watch and multitask on an iPad?","updated":"2020-04-25T09:49:19-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"7541292990","userName":"RayRobid","userUrl":"https://itunes.apple.com/us/reviews/id230311989","version":"4.6.1","score":2,"title":"Way worse","text":"Must have worked hard to make every feature worse. The guide layout is atrocious, as you no longer can see several channels at a time for a 1-2 hour time period. My streaming no longer works, despite delete/reloads, hard reset of iPad, etc. Says there is a network problem on the same network I’ve used for 3 years.","updated":"2021-07-05T03:13:13-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3611446249","userName":"Crankintosh","userUrl":"https://itunes.apple.com/us/reviews/id27222838","version":"4.2.0","score":2,"title":"Old version was better","text":"The old version of the app was a lot better. This one frequently has type with such low contrast against the background it is essentially unreadable. Also, it is confusing to navigate between episodes of a show. Also, the big suggestions at the top of the screen are just a total waste of valuable screen space. Just show me the list.","updated":"2019-01-04T06:42:22-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"7046649732","userName":"VNB-CAB","userUrl":"https://itunes.apple.com/us/reviews/id173779226","version":"4.6.1","score":1,"title":"Frequent sign ins are stupid!","text":"If the app is going to require frequent sign ins, which it shouldn’t, at least ake it possible to use finger or face identity to get the app back. These days, folks have possibly dozens of different passwords and email combinations! Do you realize how maddening it is when you have to sign in frequently and look up what password you need? There is absolutely nothing this app offers that should require any security at all, IMHO!\nFIX THIS NOW!","updated":"2021-02-27T15:35:37-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3426030720","userName":"primdollie","userUrl":"https://itunes.apple.com/us/reviews/id217051565","version":"4.1.0","score":2,"title":"Update does NOT work","text":"I loved the previous version when it actually worked and I was able to see my channels and choose what to save and watch etc. This version doesn’t work well, crashes or won’t even open! This needs to be fixed it’s basically worthless to me. I’m not happy that I can’t program my shows and delete the ones I don’t want etc. This needs fixing.","updated":"2018-11-16T16:15:30-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3972215898","userName":"Only1Change","userUrl":"https://itunes.apple.com/us/reviews/id41457722","version":"4.2.0","score":3,"title":"Major changes needed","text":"1 - The touch targets on the iPad Pro 12” are too small and too close together.\n\n2 - PIP support?  Come on guys, this isn’t hard and the API has been available for a long time now.\n\n3 - The organization with all the picture boxes is not only confusing it’s a glorious waste of usable screen real estate.\n\n4 - I’ve had multiple occasions where I’ve had to log out and back in, plus setup the streaming again in order to stream video on my own network from my Bolt.  Maybe not a big deal overall, but just doesn’t seem reliable.\n\nCould be great, but the design decisions and the implementation need a lot of work.","updated":"2019-04-05T03:41:06-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3818621168","userName":"ohiophilosophydude","userUrl":"https://itunes.apple.com/us/reviews/id29439384","version":"4.2.0","score":1,"title":"Piece of junk","text":"I don’t know whether to be impressed how bad this app is or by the fact that it works at all. Certainly the remote streaming is junk. It works okay when on the same network as the host, but almost never when remote. It can be configured only while on the same network as the host, so if it decides to reconfigure itself somehow when you are not there, you are out of luck. Keep your expectations very low and you won’t be greatly disappointed.","updated":"2019-02-26T16:18:42-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3382058614","userName":"Sargam","userUrl":"https://itunes.apple.com/us/reviews/id43662245","version":"4.1.0","score":1,"title":"Nothing works on the new app","text":"I thought the new app will be user friendly instead the basic functionality has stopped working. Out of the house streaming keeps asking you to set it up every 10 minutes and fails most of the time. The shows don’t download and keep giving errors. After playing the recorded shows it plays for about 5 minutes before it stops and buffers or asks you to run the setup again.","updated":"2018-11-04T18:30:49-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2341831450","userName":"Still typing","userUrl":"https://itunes.apple.com/us/reviews/id18152910","version":"3.7.9","score":1,"title":"Poor streaming performance","text":"The app freezes on average after 20 to 30 minutes of viewing and often requires closing and opening the app to continue viewing. This occurs on both an iPhone 6s and an iPad Pro with excellent WiFi signal strength. When mirroring to an AppleTV it freezes more frequently and the image definition quality is often poor. Sometimes the image definition quality is good to start and then degrades while viewing the program.","updated":"2018-03-24T09:54:05-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6769316940","userName":"RodMeIn","userUrl":"https://itunes.apple.com/us/reviews/id38472917","version":"4.6.1","score":1,"title":"Horrible App (and service)","text":"The app has become useless since iOS 14. It’s been months that iOS 14 came out and still no support for it, it just crashes when I try to play anything. Every few days it needs to ask to login again! When I try to run the setup to see if that will fix it, I get an error that I’m using a modified iOS version, I’m on the latest iOS version directly from Apple.","updated":"2020-12-18T22:45:08-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5194150497","userName":"Sivieng","userUrl":"https://itunes.apple.com/us/reviews/id129250645","version":"4.2.0","score":3,"title":"App doesn’t work on IOS anymore - Updated","text":"This app used to work on both iPhone and iPad but now it just kept trying open and doesn’t run anymore. Perhaps it needs an update for the new iOS?\n\nUpdated: I had to delete this app and installed it again so it works now. It shouldn’t need to but it did.","updated":"2019-11-24T21:03:40-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4878081915","userName":"cdog1200","userUrl":"https://itunes.apple.com/us/reviews/id37840245","version":"4.2.0","score":1,"title":"DOES NOT WORK","text":"Records unchecked SD channel instead of selected HD channel when you schedule away from home network. Have to be on the home network for it to work properly.  Also, future showings of a show cannot be scheduled as it will only set the next showing to record. This problem has been documented on community forums for months and months and no response. Can’t expect people to continue investing in a company that doesn’t provide a usable product.","updated":"2019-10-03T06:41:43-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3837761744","userName":"JenMas1","userUrl":"https://itunes.apple.com/us/reviews/id34929169","version":"4.2.0","score":1,"title":"Repeated failure to download","text":"I am very disappointed. I was out of the country for 2 months and assumed that my issues were due to being in a location with terrible internet. But when I returned home I found that not to be the case. I like to download to my mobile to give me something to watch during a long public transit commute. Downloads fail repeatedly within my own home. The interface is a lot more confusing than it used to be.","updated":"2019-03-03T07:19:14-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5392153058","userName":"Enthous","userUrl":"https://itunes.apple.com/us/reviews/id13468706","version":"4.4.1","score":2,"title":"How many times do I have to set up out of home?","text":"I set up out of home viewing so I can watch My Shows when out of town. It worked once but now I’m traveling and it’s telling me I have to set up out of home viewing and can’t watch my recordings. Ridiculous.\n\nI’m now on another trip and can’t even get the app to load.  This app is virtually useless.","updated":"2020-01-11T18:05:50-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3459819262","userName":"CrazyWizard101","userUrl":"https://itunes.apple.com/us/reviews/id4280774","version":"4.1.0","score":2,"title":"Defaults to Standard Def","text":"This app version is a complete step back from the previous. Besides defaulting to the standard def channel when trying to set a recording, it crashes when you go in to modify the recording and change it to the high def channel. The look and feel is not nearly as easy to use as the former version either. Change it back or make it better.","updated":"2018-11-25T10:45:15-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2836235451","userName":"SandyB44","userUrl":"https://itunes.apple.com/us/reviews/id29549800","version":"3.7.9","score":4,"title":"Works for me","text":"I have this app on my iPad and only use it to see what is playing on tv channels and to manage recordings. So I can’t attest to the streaming quality as I don’t use the app for that function. Otherwise what I’m using it for it works great and I have had no problems with its performance.","updated":"2018-07-04T08:56:14-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3304835043","userName":"ZmoneyUSC","userUrl":"https://itunes.apple.com/us/reviews/id18176636","version":"4.1.0","score":2,"title":"Faster and Cleaner UI but ruined download experience","text":"One of the best features is the ability to download shows to watch on the go—but the latest update lost all organization of downloaded content.  It’s now a list in no particular order making the next show to see impossible to find.  Huge loss to the best feature of the mobile app.","updated":"2018-10-15T07:03:40-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5257737697","userName":"Forkinyoureyetoadstool","userUrl":"https://itunes.apple.com/us/reviews/id8189304","version":"4.4.1","score":1,"title":"Garbage","text":"Latest version is actually worse than ever, which is quite a feat. Still fails to log in all the time and for some insane reason, doesn’t store log in info so it always has to be retyped in full.  Trying to set a show to record is just outright failing now. I see a brief flash of the hockey game that I want to record and then it just pops to a generic “nhl hockey” that won’t let me schedule a recording. This. App. Is. Trash.","updated":"2019-12-10T17:52:34-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3329125480","userName":"Ynot5555","userUrl":"https://itunes.apple.com/us/reviews/id473024080","version":"4.1.0","score":1,"title":"Major Step Backwards","text":"I only have one star because that is the lowest ranking apple allows. This “upgrade” is mean spirited.\n\nThe latest version has LESS functionality and ease of use for the User took two steps backwards.\n\nHow can a technology company in the content delivery industry be so inept?\n\nPasswords were reset and no place to replace the temporary password with your own.\n\nI’m completely baffled as to how they could release such an unworkable version.\n\nCleaning up the recorded shows (deleting) is nearly impossible. To delete a select group of your shows is now a miserable experience. Many extra clicks... this is so poorly designed.\n\nPlease bring back the previous version until you get it right. At least it was serviceable.","updated":"2018-10-21T19:11:58-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3302438704","userName":"Baileybean 58","userUrl":"https://itunes.apple.com/us/reviews/id153022921","version":"4.1.0","score":1,"title":"DO NOT UPDATE","text":"They changed the way shows are displayed after downloading. Makes it very difficult to figure out what episodes you have downloaded. Also, before I updated to the newer version I could download shows in my house in less than 10 mins, usually faster. Now it takes twice as long and it has hung up several times. Really wished I had the option to return to older version.","updated":"2018-10-14T15:22:24-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3287868498","userName":"all nicknames fail","userUrl":"https://itunes.apple.com/us/reviews/id141624514","version":"4.1.0","score":1,"title":"What’s up with the update","text":"The update is a total mess. I had to reestablish a connection, painfully, and how I have hundreds of episodes since as far back as 2015 that I deleted years ago. The ability to swipe left to delete is gone so it takes multiple steps and then when I think I’m done more episodes appear. Endlessly. Just a total mess. What were you thinking? May we have the old working version back, please? Disaster.","updated":"2018-10-10T20:45:35-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2815972365","userName":"SnoopDogg1","userUrl":"https://itunes.apple.com/us/reviews/id101577549","version":"3.7.9","score":3,"title":"Can’t turn off closed captioning","text":"It’s really annoying that I can’t turn off closed captioning in many shows I have recorded. I click the cc button during playback, and captioning is still there. Click again...  still there...  cc won’t go away. Please fix this!\nOtherwise the app works fairly well for me.","updated":"2018-07-01T19:21:33-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6912419587","userName":"CGTeri","userUrl":"https://itunes.apple.com/us/reviews/id20530712","version":"4.6.1","score":3,"title":"What happened to update in December","text":"You sent out a notification that an update was coming in December and would erase all downloaded shows. What happened?  When is this going to happen?  Would like to download some shows, but not if they are going to be erased.","updated":"2021-01-25T08:52:34-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3286320141","userName":"AZ IOS User","userUrl":"https://itunes.apple.com/us/reviews/id429665066","version":"4.1.0","score":2,"title":"Change for change sake","text":"No advantage that I can see over previous version, but turned off functionality. I used the network remote frequently - my most used feature, but it apparently wasn’t important to them, so it’s gone.  Continuation of the downward slide after the merger where they are much less concerned about what their loyal customer base thinks.","updated":"2018-10-10T09:57:09-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3628850890","userName":"H316","userUrl":"https://itunes.apple.com/us/reviews/id37164745","version":"4.2.0","score":1,"title":"AWFUL!!","text":"please go back to the pre-October interface! this version is convoluted and I just hate it, thank God I have an older version on other devices (v3.7.9), but even with the new look the absolute worst part is the stupidity of the remote control interface! Before it looked identical to the real remote this one is ridiculous and distracting to look at. Also seems to have more connectivity errors and slower response between menus","updated":"2019-01-08T21:27:15-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3390412881","userName":"Bh232271","userUrl":"https://itunes.apple.com/us/reviews/id35184218","version":"4.1.0","score":1,"title":"Fix Download View","text":"This latest update has made it very difficult to find the record date / episode number for downloaded shows. To figure out which episode to watch I have to go in and out of each recording and make a written list of the show names and episode number so I know which order to watch. Please add folder grouping and the record date to the grid like you have for the “All Shows” view.","updated":"2018-11-07T01:36:20-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1982607011","userName":"TonyD08043","userUrl":"https://itunes.apple.com/us/reviews/id143547644","version":"3.7.8","score":2,"title":"App needs improving","text":"When using the guide, the app is really dumb. If I change the date, it reverts to current time. If I scroll to another channel, the date and time revert to current, even if the last thing I did before changing the channel was set the date and time. It’s really simple folks... if I change the channel, DON'T CHANGE ANYTHING ELSE. If I change the date, DON'T CHANGE ANYTHING ELSE...","updated":"2017-12-09T04:58:15-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5404364178","userName":"tivo user35752","userUrl":"https://itunes.apple.com/us/reviews/id251801295","version":"4.4.1","score":1,"title":"New version is terrible","text":"I finally downloaded the latest version and I wish I could go back.  Why did they change it - the old app was fine.  The layouts are not user friendly or intuitive to use. The episodes don’t show the title unless you click on them. - I’m am seriously thinking about restoring my iPad to a backup copy so I don’t have to deal with this newer version.","updated":"2020-01-14T16:21:44-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3531597498","userName":"bobrtex1","userUrl":"https://itunes.apple.com/us/reviews/id452879304","version":"4.2.0","score":1,"title":"Readability","text":"Type size in the new app is too small to read even on an iPhone plus. Is there anyway to roll back to the previous version. This one is impossible for me to use.  This opinion seems to be repeated by others. I noticed when I hit send my opinion does not go through please allow us to revert to the previous version,\n\nStill too small type to read on phone, who designed this version!","updated":"2018-12-14T18:04:14-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3346991777","userName":"eaunger1","userUrl":"https://itunes.apple.com/us/reviews/id33026243","version":"4.1.0","score":1,"title":"Upgrade took app back big time. Very frustrating and no longer working","text":"Repeat set up each time you connect and then it doesn’t play shows\nGrouping shows by season without a show all is very frustrating- too many steps to find and play a show now. Feels like windows folder model mirrored and brought to app but that is not a good mobile experience\n\nNo longer a swipe to delete\n\nWhen you hit play a drop down with small fonts asks you to choose tv vs iPad...hard to hit and use...old interface much easier\n\nThus far this version only added complexity to a previously intuitive and easy to use interface \n\nAnd, more importantly it fails to stream on the iPad now...so. Is worthless","updated":"2018-10-26T12:01:25-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"8092161314","userName":"appnotgreat","userUrl":"https://itunes.apple.com/us/reviews/id398709544","version":"4.8.1","score":1,"title":"New update is messed up","text":"Every single time this app is updated things get worse, it was fine a few days ago I could watch my shows on the app. Now it won’t let me....getting errors customer service is pretty bad too..\n\nHere’s an idea when you build an app how about testing it thoroughly before you release it. I don’t imagine your company being around much longer…jmo","updated":"2021-12-03T17:21:34-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5365427415","userName":"e.dbl","userUrl":"https://itunes.apple.com/us/reviews/id43599050","version":"4.4.1","score":1,"title":"What a JOKE","text":"I read most of the reviews and after reading how the multitude of people hated this app, I still downloaded it. This app wouldn’t let me past the front door. Kept asking for a valid email address... I tried THREE valid email addresses and each one came back with the message, “Not a valid email address.” If I can’t get in the front door... then why should I even try?\nWhat a JOKE...","updated":"2020-01-05T11:53:57-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3414614142","userName":"Frees321","userUrl":"https://itunes.apple.com/us/reviews/id112752704","version":"4.1.0","score":2,"title":"Downloads not working in latest update","text":"With latest version in iPhone X, I can stream shows from my recorded shows out of the home but the download for later offline viewing has stopped working. Tried from multiple devices and get the same issue making me think it is the software and not my device.","updated":"2018-11-13T13:18:58-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3690564389","userName":"LIRR_4_Life","userUrl":"https://itunes.apple.com/us/reviews/id922062068","version":"4.2.0","score":1,"title":"My shows folder view","text":"Can you please just create an option to view shows combined in a folder, in a list view like you see in the main “My Shows”? The graphic only tile view is terrible.  Everything looks the same, you can’t see show times and if shows do not have season or episode, they all show S1 E1, the green bar at the bottom makes it look like everything has been watched.","updated":"2019-01-24T15:35:53-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4932092576","userName":"Smlatha","userUrl":"https://itunes.apple.com/us/reviews/id48929641","version":"4.2.0","score":1,"title":"Issues","text":"The last update has continued to show many issues. Search is all but useless. It has stopped returning the shows you search for. They are in the guide, but don’t show on search. Now recording is not working remotely. You can try to record a game and it will error out and then you can’t get back to the game without going all the way back to the guide.  This is terrible.  Really needs to be addressed.","updated":"2019-10-12T09:19:58-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3728736592","userName":"We_too_low","userUrl":"https://itunes.apple.com/us/reviews/id11107816","version":"4.2.0","score":1,"title":"Can’t find episodes w/o lists!!!","text":"The latest update makes it very difficult to find the episodes I want to watch.  Why did they get rid of list view?  Do you realize that the picture shown for each dr. Phil episode is exactly the same?  Do you expect me to memorize the season and episode number for shows I haven’t seen yet? We need the list view back. Please bring the list view back. List, list, list, that is all.","updated":"2019-02-03T06:27:45-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5242802101","userName":"Larry Rosenstein","userUrl":"https://itunes.apple.com/us/reviews/id37237261","version":"4.2.0","score":2,"title":"Needs work","text":"I find that managing my recordings is more difficult than it should be. I wish it was easier to delete an episode of a show. \n\nAlso I’ve recently noticed that sporting events recorded from a One Pass can’t be watched in the app. The show page is completely blank.","updated":"2019-12-06T21:45:05-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3308728308","userName":"Mdw2dtw","userUrl":"https://itunes.apple.com/us/reviews/id538066682","version":"4.1.0","score":1,"title":"Do not upgrade to this version!!!","text":"If you were a fan of the app like I was and used it out of the home, you will not like this. It’s so confusing! None of your recorded shows are in the same folder. I have too many recordings to have to go thru them one by one and they are not in any order. Please fix this. Find a way to put the recordings for each show in its own folder like it used to be.","updated":"2018-10-16T07:34:16-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3116900844","userName":"Simbolic69","userUrl":"https://itunes.apple.com/us/reviews/id236864556","version":"3.7.9","score":1,"title":"To buggy to use","text":"It’s to bad too. The hardware is an excellent product but it’s hit or miss if you want to watch anything using this piece of trashware. For months I have battled with this app trying to keep it working and all it gives is one pop up or another as an excuse for why you can’t watch anything using this app. Sigh....If you never wanted to just throw something on the floor and stomp on it then get this app and share the experience.","updated":"2018-08-26T07:41:36-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3675071037","userName":"swfan0505","userUrl":"https://itunes.apple.com/us/reviews/id428527925","version":"4.2.0","score":1,"title":"worst update ever","text":"great if all you want to do is load pictures.  lots and lots and lots of pictures.  ...and more pictures.  But, if you want to just get a simple list of upcoming episodes, forget it.  you have to scroll thru all the pictures and try to find the right one.  I may have missed an episode.  I don’t know.  I got tired of scrolling thru pictures.  Must have been designed by someone in marketing.","updated":"2019-01-20T13:34:47-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3515028871","userName":"griff2000","userUrl":"https://itunes.apple.com/us/reviews/id101744427","version":"4.1.0","score":1,"title":"Awful and getting worse","text":"The new version is the worst yet. Not only does it constantly stop streaming when out of the house, the interface is completely screwed up now. Things that used to take one click now take three or even  five to do the same thing. Everything I used to do frequently now takes longer and the number of times it fails to play is like 70%. COMPLETE WASTE OF TIME.","updated":"2018-12-10T02:31:58-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3287645349","userName":"The Su1tan","userUrl":"https://itunes.apple.com/us/reviews/id36322486","version":"4.1.0","score":5,"title":"Bit performance boost!","text":"With this update, the app finally performs how it always should have. \n\nThanks for redesigning the very outdated and poor performing app. This version actually works well and I will use it much more.","updated":"2018-10-10T19:12:04-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2557362424","userName":"mccaf984","userUrl":"https://itunes.apple.com/us/reviews/id4477880","version":"3.7.9","score":1,"title":"Streaming reliability horrible","text":"The only thing the app is really good for is checking what is recorded at home and then to schedule shows to record. I have super fast internet at home, when in a hotel with a premium connection and great measured speed, streaming will not work. Downloading sometimes works if you download at the lowest quality and it will still take 3 hours to download a 1 hour show.","updated":"2018-05-16T20:28:44-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1893487272","userName":"Mr. Mad Dog","userUrl":"https://itunes.apple.com/us/reviews/id140847416","version":"3.7.7","score":5,"title":"Latest update","text":"Since last update of this app in IOS the app will not stay connected. Never had this problem before.","updated":"2017-11-02T20:40:25-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"7353466290","userName":"Oncle J","userUrl":"https://itunes.apple.com/us/reviews/id8286126","version":"4.6.1","score":3,"title":"Audio cuts out","text":"When using the app, the audio will cut out during playback.  Perhaps every ten minutes (seem random), the audio will disappear for three or four seconds, then resume.  It's in sync with the video, just missing.","updated":"2021-05-17T19:05:51-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5055281898","userName":"spoiledrottensj","userUrl":"https://itunes.apple.com/us/reviews/id23598022","version":"4.2.0","score":2,"title":"Fix the freezing","text":"The app freezes up and I can’t watch my shows I have downloaded! Then I have to uninstall and reinstall and I have lost all my shows I have downloaded and I have shows that have expired on my home box so I can catch up at work so it’s a total lost and I am even more behind!","updated":"2019-10-31T04:36:12-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5134938687","userName":"KJBM47","userUrl":"https://itunes.apple.com/us/reviews/id6351881","version":"4.2.0","score":1,"title":"Does not work consistently","text":"Every couple of weeks, you’ll have to delete the app and redo load. It does not work for consistent periods of time. Additionally, there are times where the it stops streaming midshow. The only way to get it to work again is to shut off WiFi, close the app and turn on WiFi again. Again, no consistency with how it works.","updated":"2019-11-13T20:29:55-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3567317407","userName":"Yeah......right.","userUrl":"https://itunes.apple.com/us/reviews/id110168486","version":"4.2.0","score":1,"title":"V4.x continues to disappoint","text":"This version continues to be one of the worst apps I have had the displeasure of using. There are sooo many usability problems with this version that I can’t even think about anything that is improved. \n\nRoll back to version 3.x and fire your current app designers. Read through the comments posted regarding current version  and don’t repeat the disaster. \n\nVersion 4.x should be sent to the scrap heap!","updated":"2018-12-24T05:40:57-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2040285634","userName":"AndrewTraub","userUrl":"https://itunes.apple.com/us/reviews/id20367914","version":"3.7.8","score":4,"title":"Good but can’t change date in guide easily","text":"You can select a new date and time in the guide but there’s no ok button to actually confirm what you select.  Touching outside the selection area on iPhone just returns to current setting.","updated":"2017-12-29T22:53:36-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6423975121","userName":"SueBNJ411","userUrl":"https://itunes.apple.com/us/reviews/id130214516","version":"4.6.0","score":1,"title":"Ugh.","text":"Yeah I still hate this app... What have you done? The app is no longer user intuitive, when I can get it to even load that is. Why can’t I delete simply anymore, or see my shows in a logical order? Horrible app and even worse update. Months later there are still days that the app just won’t work. It hangs forever. Shameful app for a tech company.","updated":"2020-09-12T23:27:49-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"7823359411","userName":"Anthony Foglia","userUrl":"https://itunes.apple.com/us/reviews/id160505863","version":"4.6.1","score":2,"title":"Barely adequate","text":"You can access the guide, and schedule recordings, and that’s about it. Streaming is very fragile and fails often. And downloading shows to your device works so rarely that it’s not even worth trying. And it’s been like that for years, so they obviously don’t care enough to fix it.","updated":"2021-09-19T10:05:42-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3382680906","userName":"App Guy01","userUrl":"https://itunes.apple.com/us/reviews/id216621706","version":"4.1.0","score":1,"title":"Last update is horrible!!!","text":"Can’t stream my any of my shows now as the app says I’m off my home network but I am on my home network. Been three weeks and no help. Going to cancel my service and switch to cable. If I’m going to pay for a service, I expect the service to work and if not, at least be fixed in a reasonable fashion. If I did this with my employer, I would’ve been fired last week!!!","updated":"2018-11-04T23:08:25-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2398994369","userName":"jfreibe","userUrl":"https://itunes.apple.com/us/reviews/id41418935","version":"3.7.9","score":3,"title":"Can’t move the Guide Schedule Ahead","text":"App won’t respond to selecting a new date and/or time directly within the scheduling window. I have to arrow forward manually to get to the desired program date and time, very annoying. If it works, please advise how to move about the Guide schedule directly.","updated":"2018-04-08T10:09:35-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1958748934","userName":"vasilemj","userUrl":"https://itunes.apple.com/us/reviews/id13677976","version":"3.7.8","score":1,"title":"They broke it","text":"I’m not sure what they did but the developers totally screwed up this app. You can no longer jump to a particular day and time in the guide. So if you want to see what’s on TV 2 days from now, while clicking on “today” in the guide brings up your date/time selections, you can’t make them stick and have the guide jump to that particular point in time. It’s pretty much useless.","updated":"2017-11-29T18:58:38-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2306143912","userName":"Cousindaz","userUrl":"https://itunes.apple.com/us/reviews/id29067500","version":"3.7.9","score":2,"title":"Two because it doesn’t crash...","text":"However, this is one horrible app. I think it’s done in HTML so it has to load the complete cable lineup every time you open it, which takes forever. This is the type of app that was common before developers learned how to do mobile development. It’s ironic that the inventor of the best tv remote ever created this app.","updated":"2018-03-14T12:42:03-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3773371270","userName":"Cathlabrob","userUrl":"https://itunes.apple.com/us/reviews/id240570245","version":"4.2.0","score":3,"title":"List display","text":"Bring back the list view of “My Recordings.”  The square picture picture icons should be able to be toggled off!  Very annoying when trying to scroll through hundreds of recordings to find something particular.","updated":"2019-02-15T09:36:06-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6005256926","userName":"Bmz5005","userUrl":"https://itunes.apple.com/us/reviews/id176642258","version":"4.5.1","score":1,"title":"The App is absolute Garbage","text":"I can’t tell you how many times I’ve had to re-login again and again on the IOS app on both the phone and tablet. Over and over the same issue. And now today, I’m getting an error stating “middleminderror”. The app doesn’t do the product any justice whatsoever in an era where a user-friendly app is the price of admission. Do better.","updated":"2020-05-28T07:50:45-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3317762166","userName":"Rosiebelle44","userUrl":"https://itunes.apple.com/us/reviews/id154000235","version":"4.1.0","score":1,"title":"This app wears me out","text":"First it stopped working. Called our cable company they had no idea what was wrong with it. Finally we find out it needed Am update. Get that done. Now it is having problems connecting. NO MATTER WHAT I DO IT WON’T CONNECT.  Seriously fix this app.  First I lost all info, didn’t show main box. That got fixed. Now it only shows me settings. I can’t see any of my shows. Would you people just fix this","updated":"2018-10-18T20:08:33-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3723496031","userName":"d-kic","userUrl":"https://itunes.apple.com/us/reviews/id106598265","version":"4.2.0","score":2,"title":"Please undo!","text":"Please, please put the pause/play buttons back down on the bottom. They don’t belong in the middle of the screen. \n\nPlease, please, please (I beg you) go back to an episode list in My Shows. The picture icons mean nothing, and it’s hard to scroll to the earliest episode until all the pictures are loaded. And yes, I have a high speed internet.","updated":"2019-02-02T00:38:47-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5051284281","userName":"icommentNC","userUrl":"https://itunes.apple.com/us/reviews/id43163542","version":"4.2.0","score":1,"title":"Slow and clunky","text":"Mainly I want to set recordings with the app. But it takes forever for the app to load. Then the search is slow or just doesn’t work. So I have to open my spectrum app to the channel for the show I want, then wait for the guide to load. Then wait again as I scroll to the day I need to record.  Just bad for what it needs to be.","updated":"2019-10-30T09:03:35-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4752926482","userName":"Missy in Hampton Roads","userUrl":"https://itunes.apple.com/us/reviews/id43688815","version":"4.2.0","score":1,"title":"Constant refreshing in background makes app worthless","text":"I LOVE the 30-second Skip and fast-forward advance to bypass commercials. However, the constant refresh or reconnect ...whatever is going on the background... has always caused latency. I’ve tried everything to troubleshoot, and it’s not on my end. Please fix! We’ve had TiVos since the beginning so hoping you can update the app ...thanks!","updated":"2019-09-09T04:19:43-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2434871744","userName":"RB3","userUrl":"https://itunes.apple.com/us/reviews/id37095562","version":"3.7.9","score":1,"title":"Abandonware","text":"Three years ago, I said: \"Works great with my Premiere and Stream to enable simple movement of tv shows among our iOS gizmos. I wish it supported AirPlay, but I get why it does not.\"\n\nBy now, the slow performance, wonky network access, erratic streaming, and the absence of picture-in-picture are terribly aggravatjng. This app could be great, but it just barely avoids being terrible.\n\nCannot properly display correct aspect ratio video on my iPad.","updated":"2018-04-17T16:36:24-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6101349990","userName":"bob the meme","userUrl":"https://itunes.apple.com/us/reviews/id30328120","version":"4.5.1","score":1,"title":"Poor Functionality","text":"This app has always had issues, but I’ve at least been able to get it to work in the past. Now, it doesn’t work at all. Every time I try to search or click on anything, it says it’s “reconnecting” and takes me back to the main page of the guide. I can’t do anything with it. Useless.","updated":"2020-06-20T11:18:21-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6060119841","userName":"Lady Death 18","userUrl":"https://itunes.apple.com/us/reviews/id519958745","version":"4.5.1","score":3,"title":"Okay could be better","text":"Look and feel are fine, but I have to login all the time.  Need to give it the ability to remember the email and password so we don’t have to login every time the app is launched.","updated":"2020-06-10T12:23:15-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4852758981","userName":"SRosario","userUrl":"https://itunes.apple.com/us/reviews/id33128431","version":"4.2.0","score":1,"title":"Can’t even do the minimum","text":"If nothing else, the app should make it easy to record shows when you are not in front of your box. If you pay for a subscription, you should be able to browse, search and find what you want to record. The app makes all of this painful and in some cases fails outright. If not these fundamental things, then nothing else matters.","updated":"2019-09-28T05:26:21-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2039607851","userName":"T3OOO","userUrl":"https://itunes.apple.com/us/reviews/id86638879","version":"3.7.8","score":2,"title":"Close Closed Captions","text":"I can’t get rid of the subtitles when I’m streaming.  Same issue on my iPad and iPhone, i toggled the closed caption option on then back off and it still remains.  Kind of annoying and gets in the way of what you’re viewing.  Been like this for over a year now but now compelled to write about it.  Please fix.","updated":"2017-12-29T17:27:55-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3671166698","userName":"Fiebert","userUrl":"https://itunes.apple.com/us/reviews/id38319750","version":"4.2.0","score":1,"title":"Newest version is a big step backwards","text":"There are a lot of great enhancements in the new app, but some of the functionality that has been removed makes the app very difficult to use.  Folders are now gone (so your shows are no longer grouped) and you can no longer fast forward with one button (only rewind).\n\nThey should consider bringing back folders and fast foward","updated":"2019-01-19T16:00:17-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3345920757","userName":"ABCXYZ1234543","userUrl":"https://itunes.apple.com/us/reviews/id26384051","version":"4.1.0","score":1,"title":"Recording wrong channel","text":"Twice I’ve tried to use the app to record a show since the update, and both times, it recorded a blank, non-existent channel instead. (One that wasn’t even in my channel list). It’s definitely an app problem instead of a box problem because I’ve had no problem setting recordings on the box. I missed a World Series game due to this issue.","updated":"2018-10-26T05:57:38-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3635448591","userName":"jklemm","userUrl":"https://itunes.apple.com/us/reviews/id24739629","version":"4.2.0","score":2,"title":"Indeed a disastrous update","text":"It was pretty good before this update now I cannot get the current listings to match our available channels nor delete the available recorded shows now catastrophic as a disabled person, please repair it or let me have the previous version —thanks very much for Tivo‼️Johnny please do something that will help ASAP AND SOME QA would really help ⁉️","updated":"2019-01-10T16:02:46-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5635057633","userName":"QueticoTim","userUrl":"https://itunes.apple.com/us/reviews/id140341570","version":"4.4.1","score":5,"title":"I just got it","text":"It seems fine for now I’m just starting to use it now so we’ll see \n\nAlso if problems I will just use tv📺 to do task","updated":"2020-03-08T19:12:20-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5504061039","userName":"Amy Schisler","userUrl":"https://itunes.apple.com/us/reviews/id7430270","version":"4.4.1","score":1,"title":"Terrible, unresponsive app","text":"I used to be able to open the app, search for shows to record, find my recordings, etc. now, all I get is a black screen and spinning circle. Nothing loads anywhere is the app. I can’t search or use any other features. This is true on my phone as well as iPad. Beyond frustrating when traveling.","updated":"2020-02-08T06:30:51-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3296386308","userName":"Mr Myself","userUrl":"https://itunes.apple.com/us/reviews/id3242757","version":"4.1.0","score":2,"title":"The upgrade was a downgrade","text":"The new version is worse than the older version.\n\nThe the list of Downloaded programs, there are no sorting or grouping options.  They are listed in order of when they were downloaded, and they are not grouped In the list.  I have many shows, and going through the list to pick a show to watch is a challenge.  \n\nThe list should have the name of each show, with all episodes in a group within it.  The dates should be based on when they were recorded, not downloaded.  \n\nPlease fix quickly!","updated":"2018-10-13T03:09:00-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3298809703","userName":"dblues72","userUrl":"https://itunes.apple.com/us/reviews/id37908869","version":"4.1.0","score":1,"title":"Just doesn’t work","text":"Classic case of an app working fine, then getting an update, then not working at all. Can’t set up streaming session with my Roamio, and again, worked perfectly fine before. TiVo’s used to be flawless (across all products) but that advantage has been whittled away, not by other products improving but by their products getting worse.","updated":"2018-10-13T17:29:04-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3344605568","userName":"bc chgo","userUrl":"https://itunes.apple.com/us/reviews/id125462332","version":"4.1.0","score":1,"title":"Did this have to be rewritten from the beginning?","text":"Because it it had to be, I am sympathetic. But it should not have been released until it was feature equivalent. There are so many regressions in this new version, I scarcely know where to begin to detail them. The usability is adversarial. And I am only trying to manage shows and plan recordings, not watching on mobile devices.","updated":"2018-10-25T22:41:42-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2168308341","userName":"MrPaisano","userUrl":"https://itunes.apple.com/us/reviews/id387198409","version":"3.7.8","score":1,"title":"Not working with MoCa adaptor","text":"So I downloaded the newest version. I have a MoCa wired set up that’s been working great, until now. During set up it won’t advance past, Checking for latest Software version. Then it says unable to set up, try again? Or not?   I noticed now that the shows I have recorded are there but I can’t play them on the iPad.  Waiting on Tech Support to email back tomorrow.","updated":"2018-02-04T18:01:55-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"7590958910","userName":"SML4Q","userUrl":"https://itunes.apple.com/us/reviews/id209565080","version":"4.6.1","score":1,"title":"Guide has stopped working properly","text":"This app has not been updated in nearly a year while iOS has been updated multiple times. As of today, I can no longer move the full guide to the future, even an HOUR ahead! I can still move individual stations forward but not the full grid!","updated":"2021-07-18T08:27:07-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3455306425","userName":"not a tivo fan any","userUrl":"https://itunes.apple.com/us/reviews/id506756890","version":"4.1.0","score":1,"title":"Terrible update","text":"Newest update is no improvement at all. Everything from deleting shows, recording shows and switching tuners takes twice as as many clicks. \nWorst part is that I’m unable to schedule recordings on the app.  Every time I schedule a show or a game it switches the channel to be recorded to a different channel. Instead of recording on channel 1205 it records on 35. So maddening!!!","updated":"2018-11-24T07:49:49-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2147424165","userName":"PlanoTexan","userUrl":"https://itunes.apple.com/us/reviews/id234216307","version":"3.7.8","score":5,"title":"Vastly improved reliability","text":"It used to have issues staying connected over WiFi. Works more reliably now. I like the features. And the remote.","updated":"2018-01-30T16:40:16-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"7080748222","userName":"krs123","userUrl":"https://itunes.apple.com/us/reviews/id5913594","version":"4.6.1","score":4,"title":"It works","text":"I am updating a one star review that I wrote a while ago. Works great now. I use it to schedule and manage recordings. I used to get crashes and freezes. Works for me now.","updated":"2021-03-08T12:18:19-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4209177196","userName":"tkhorik","userUrl":"https://itunes.apple.com/us/reviews/id184928137","version":"4.2.0","score":2,"title":"Really wish this would work","text":"My biggest issue is that the app won’t keep me logged in and doesn’t auto fill my password. It’s very frustrating to have to log in every time I use the app. Also, sometimes it won’t accept the password and I have to get on the computer to reset it.","updated":"2019-05-25T13:45:19-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4632374799","userName":"Mojo_Belmar","userUrl":"https://itunes.apple.com/us/reviews/id146194361","version":"4.2.0","score":5,"title":"Love this app!","text":"Has always worked well, use it daily. Nice job with this app and streaming! Has always been stable with each version.","updated":"2019-08-17T12:22:22-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3677274226","userName":"tinyToaster","userUrl":"https://itunes.apple.com/us/reviews/id101527083","version":"4.2.0","score":1,"title":"Useless","text":"Suddenly stopped working. Cannot stream or find streaming devices. Annoyed with repeated attempts, restarts, uninstalls and reinstalls.\n\nEdit: had been using an older iPad with a previous version of the app as a workaround. Suddenly this version will not accept the password, saying it is incorrect even though it is not. Streaming is completely useless now. Wish I could give zero stars.","updated":"2019-01-21T03:45:51-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3759964873","userName":"Trudnick","userUrl":"https://itunes.apple.com/us/reviews/id216143253","version":"4.2.0","score":2,"title":"Not impressed","text":"Why change a good thing? I’m also very frustrated with the app always reconnecting & sometimes won’t open at all since the upgrade. Sometimes I only have a few minutes to record a program & I’m unable to do it because it takes forever!","updated":"2019-02-11T19:02:55-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3249001256","userName":"singer55","userUrl":"https://itunes.apple.com/us/reviews/id157520219","version":"3.7.9","score":1,"title":"Repeated message: can't connect","text":"Gave a review about a year ago that the app suddenly quit working. It was stuck on the sign in page. \nWell, here we are again. \nContacted App Support via Chat and was advised there is an outage: \n\n“We regret to let you know that this issue has been tagged as an outage wherein devices from third-party manufacturers are encountering a login error...”\n\nThis was 4 days ago, AFTER allowing a couple of days from when I first encountered the problem; so it’s been about a week. \n\nI’m sorry but that seems like a long time to have an error ... THAT YOU HAVE HAD BEFORE! \n\nSure wish this app worked. I rely on it quite a lot.","updated":"2018-09-30T13:02:30-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3157712620","userName":"JTomlinson","userUrl":"https://itunes.apple.com/us/reviews/id27900927","version":"3.7.9","score":1,"title":"Miserable","text":"This app is horrible.  It requires constant signing in, and it crashes all the time.  I can’t even log in at this point.  I the. Tried to reset my password and it says “system error”.  I’m totally fed up.  The sad thing is, once you’re actually signed in to the app, it’s maybe a 3 star app.  Basically, waaaay too many bugs.  If you’re stuck with this like I am, best of luck to you.","updated":"2018-09-05T17:41:51-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3105397971","userName":"Frog Island Sam","userUrl":"https://itunes.apple.com/us/reviews/id124535706","version":"3.7.9","score":4,"title":"Great App, but...","text":"When I tap on the Guide, I am unable to change the date and time,  I tap on the current day and time and then scroll up to select the date and time I want but there is no way to enter it.","updated":"2018-08-23T15:44:08-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3899371247","userName":"#2cents","userUrl":"https://itunes.apple.com/us/reviews/id839200511","version":"4.2.0","score":1,"title":"App Does Not Open","text":"Caught in a loop after resetting password. Reconnecting... pop-up window displays. Then get Sign In Error page indicating a network error occurred/please try again. Only option available is to click OK button, which returns to Reconnecting... pop-up. Repeat. Home network is active and working fine for all other devices. No Help info to aid resolution.","updated":"2019-03-18T23:54:09-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3666823252","userName":"A2gretta","userUrl":"https://itunes.apple.com/us/reviews/id49370095","version":"4.2.0","score":2,"title":"Installed, reinstalled, re-re-installed....","text":"With the last change, the app simply doesn’t work. I look at a blank screen on my iPad with the nice blue line running along the top, the word TiVo—and that’s it. Nothing to tap, nothing to see. I prefer to monitor and schedule our recordings on the app. But it’s pointless as there is NOTHING to see!","updated":"2019-01-18T16:53:51-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3283787556","userName":"Divodd","userUrl":"https://itunes.apple.com/us/reviews/id117337553","version":"4.1.0","score":4,"title":"Recovering deleted shows","text":"This new update is almost perfect - but it took away the ability to recover deleted shows from within the app - please fix for 5 stars","updated":"2018-10-09T19:03:04-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2988700666","userName":"AliceWo","userUrl":"https://itunes.apple.com/us/reviews/id38069597","version":"3.7.9","score":5,"title":"Great app!","text":"I can watch tv shows on my iPad as I walk around the house. It’s so much easier to set up one passes on this app rather than the remote control!","updated":"2018-07-29T13:41:39-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6601282727","userName":"Really great weather app","userUrl":"https://itunes.apple.com/us/reviews/id322691011","version":"4.6.1","score":1,"title":"Can’t sign up","text":"I down loaded app but it went to a screen that wanted you to put your email and password in .. but wouldn’t let me sign up first so it keeps telling me no such account exist\nAnd I have to give it one star to be able to write this review otherwise it’s a zero for me till this issue gets fixed","updated":"2020-11-02T07:17:44-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3707129697","userName":"Masterp43454","userUrl":"https://itunes.apple.com/us/reviews/id114296236","version":"4.2.0","score":1,"title":"Downloads always have errors","text":"- Why is it that the app downloads an entire show just for it to tell me that there was a problem with the file after 5 minutes of viewing??? You need to fix how the app writes the video files so they aren’t corrupted!!!\n\n– Can't stream over LTE, since LTE is as fast as a home Internet connection I can't understand why.","updated":"2019-01-28T20:44:02-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3083942368","userName":"Greg10101","userUrl":"https://itunes.apple.com/us/reviews/id104710725","version":"3.7.9","score":3,"title":"No back button?","text":"When the upgrade to the new interface happened, we were told to make sure our remote had a “back” button. So why doesn’t the remote in this app have a back button?","updated":"2018-08-18T17:32:59-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5832781811","userName":"467556","userUrl":"https://itunes.apple.com/us/reviews/id21443298","version":"4.5.0","score":1,"title":"I am so fed up with this company","text":"They pushed out a small update and broke mobile device downloads. Can’t download to your iPad now. As a software developer, I can’t believe this company is still in business. I’ve been using their products since the DirecTivo. Never again will I spend $1,000 with this company.\n\nZero stars.","updated":"2020-04-18T22:06:03-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4517479637","userName":"Jdbfjdo","userUrl":"https://itunes.apple.com/us/reviews/id114156787","version":"4.2.0","score":1,"title":"Keep having to sign in all the time","text":"Every other time I get on this app I have to re login and what’s up with the plus sign for record???? I need a big red circle.  And then the guide is so wonky when I try to go back from tapping on a show, it doesn’t return me back to where I was the way it use too. I love the look but the functionality is bad. It use to be awesome.","updated":"2019-07-25T18:04:48-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3810430464","userName":"yet another sad user","userUrl":"https://itunes.apple.com/us/reviews/id117893802","version":"4.2.0","score":1,"title":"Horrible for offline use","text":"Did they just forget about those of us that travel and use offline mode. Here’s a suggestion fix the older version of the app so it can download from TiVo’s again. That way much like the TiVo’s where you can downgrade from the craptastic new hydra interface, we could use the perfectly functional old app and interface.","updated":"2019-02-24T11:24:40-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6023704083","userName":"Ichibanmoto","userUrl":"https://itunes.apple.com/us/reviews/id34522067","version":"4.5.1","score":4,"title":"Recent improvement!","text":"They seem to have made some recent improvements to the app. It works much better now.","updated":"2020-06-01T17:24:21-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3270440054","userName":"Mykidsaregreqt","userUrl":"https://itunes.apple.com/us/reviews/id422523765","version":"3.7.9","score":2,"title":"Guide use limited","text":"When you want to record something in the future, there is no way to advance the guide by day, it only advances by 30 minute intervals. there’s a pop up box that lets you select a different date and time, but it doesn’t work. Very cumbersome and not functional.","updated":"2018-10-06T06:43:27-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6307913317","userName":"Dom2605","userUrl":"https://itunes.apple.com/us/reviews/id150894924","version":"4.6.0","score":2,"title":"New update issues with streaming","text":"Cannot set up streaming says accept user agreement but doesn’t give you a place to select anything other than view the terms. Cannot move forward with streaming setup please fix","updated":"2020-08-11T14:34:24-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2778814701","userName":"rbmay24","userUrl":"https://itunes.apple.com/us/reviews/id23018494","version":"3.7.9","score":5,"title":"watch tv on your ipad!","text":"I use this app all of the time to watch my recorded shows on my ipad.  A life changer, really great.  Needs an occasional reboot like all electronics but usu works well","updated":"2018-06-26T21:32:03-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1928808205","userName":"Reid C.","userUrl":"https://itunes.apple.com/us/reviews/id13091590","version":"3.7.8","score":2,"title":"Not maintained; marginally usable.","text":"It mostly sorta works. The UI is ancient and hasn’t been updated for modern phones. Major functionality like the calendar picker is broke, so I hope you like clicking “forward 30min” on the program guide 2x24x7 times if you want to set a recording for a week from today.","updated":"2017-11-17T17:39:33-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5566527131","userName":"BreadHerald","userUrl":"https://itunes.apple.com/us/reviews/id175715671","version":"4.4.1","score":1,"title":"Connection issues","text":"For some reason, this app can’t hold a connection. It’s always having sign-in issues, asking you to set up streaming again or just saying it can’t connect to the box. Everything else on my device works, just not this app. Frustrating beyond belief.","updated":"2020-02-22T09:55:11-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3269403635","userName":"Loadmasterh","userUrl":"https://itunes.apple.com/us/reviews/id115529541","version":"3.7.9","score":4,"title":"Very stable interface","text":"I’ve been a user for many years now and I have witness how stable the platform has gotten. Normally a great connection for streaming even with moderate WiFi connection.","updated":"2018-10-06T00:50:46-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3283245888","userName":"hks200","userUrl":"https://itunes.apple.com/us/reviews/id465485032","version":"4.1.0","score":5,"title":"Latest update is amazing","text":"Just updated to Version 4.1 and I am impressed!!!  Both the iPhone and the iPad versions are much improved.","updated":"2018-10-09T14:59:27-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3130676904","userName":"JWA 45","userUrl":"https://itunes.apple.com/us/reviews/id167924504","version":"3.7.9","score":5,"title":"Great App","text":"Use it while traveling to record shows or special events. Lots of functionality.","updated":"2018-08-29T16:30:12-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3665877674","userName":"stromy weather","userUrl":"https://itunes.apple.com/us/reviews/id323221518","version":"4.2.0","score":1,"title":"Terrible!!!","text":"The newest version is horrendous! The app constantly makes you log back in and is no where close to user friendly. When you scroll up and down the channel list the app buffers. Buffers after every action as well. How do you take something that was great and screw it up that badly. I want the old version back - NOW!!!","updated":"2019-01-18T10:39:16-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3287198806","userName":"JimMets","userUrl":"https://itunes.apple.com/us/reviews/id37370273","version":"4.1.0","score":5,"title":"A Welcome Improvement","text":"A much more user friendly and stable platform than the previous versions.","updated":"2018-10-10T16:06:45-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3283572081","userName":"amy_414","userUrl":"https://itunes.apple.com/us/reviews/id12848321","version":"4.1.0","score":5,"title":"Finally an update!","text":"Big improvement! It’s much faster than the old version and looks great on iPhone X","updated":"2018-10-09T17:35:40-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3291072582","userName":"Ffej V","userUrl":"https://itunes.apple.com/us/reviews/id13916131","version":"4.1.0","score":2,"title":"Never worked well, now broken","text":"I wish this app worked as it should. It always had bugs and other problems, but the last update broke it completely. Hopefully, it’s basic functionality is fixed soon.","updated":"2018-10-11T17:17:45-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4598086555","userName":"eckomancer","userUrl":"https://itunes.apple.com/us/reviews/id6153586","version":"4.2.0","score":4,"title":"Now that it’s working I am happier","text":"The only thing I wish it had was the ability to download my shows even when the app is not open","updated":"2019-08-10T12:52:18-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3795193058","userName":"Rnadick","userUrl":"https://itunes.apple.com/us/reviews/id38412674","version":"4.2.0","score":1,"title":"Crap on a stick","text":"When is this piece of sh%#*t app going to be fixed?  It has been almost weeks and nothing. This is unacceptable. I think perhaps a class action suit needs to be filed. If you want to join in a class please let me know. Absolutely ridiculous. I downloaded 22 shows and I can't watch a single one!  It's unfortunate I can't leave zero stars.","updated":"2019-02-20T19:44:02-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3027249692","userName":"trashycuz","userUrl":"https://itunes.apple.com/us/reviews/id37915533","version":"3.7.9","score":2,"title":"Mostly good, but the bad is really bad.","text":"When creating or modifying a Season Pass, I used to be able to choose New Only, New & Repeats, or Everything. Now, no matter what show it is, all I see is New Only. This makes it impossible to automatically record repeats, which I happen to love.","updated":"2018-08-06T13:49:01-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2797209615","userName":"BajaBarry","userUrl":"https://itunes.apple.com/us/reviews/id6273464","version":"3.7.9","score":1,"title":"Inferior technology","text":"As a long time user, I am frustrated with the terrible download connectivity situation. I have no problem downloading Netflix movies but trying to download a half hour show with the app results in many disconnects. At a minimum it could provide an option to set the number of retries before requiring the user to manually retry or quit.","updated":"2018-06-29T08:28:16-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1903142222","userName":"recent purchaser","userUrl":"https://itunes.apple.com/us/reviews/id24460957","version":"3.7.7","score":1,"title":"This app is truly horrible","text":"The app is so cluttered with promotional celebrity nonsense that it is difficult to control even the basic function such as recording an up coming show. \nThe 100+ button remote is more functional than the app. \nWhy after so many year and so many subscriber dollars they couldn’t do better is a mystery for the ages.","updated":"2017-11-06T21:30:43-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1825976047","userName":"Snohoman","userUrl":"https://itunes.apple.com/us/reviews/id27379892","version":"3.7.7","score":1,"title":"Wish I could give zero stars","text":"I just updated to the latest version and now I can't stream on my iPad. This is yet another example of poor QA for apps that worked at one point but once updated fail miserably. I can't even download a show to my iPad. Big bummer! Hopefully the crack programming team can find a fix.\n\nNow to go sit in front of my tv...","updated":"2017-10-03T21:33:55-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1815321079","userName":"barbvent","userUrl":"https://itunes.apple.com/us/reviews/id110685708","version":"3.7.7","score":5,"title":"Makes life easier","text":"I only use this app so far to program my TV's, and it works perfectly and easily for that.","updated":"2017-09-28T11:16:36-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1789164715","userName":"SFKate70","userUrl":"https://itunes.apple.com/us/reviews/id11535326","version":"3.7.7","score":1,"title":"Huge Disappointment!","text":"I wish this app would run smoothly while streaming in the same room as the stream box to not disturb family who don't want the tv on. No bug a-- fat chance. I wish I could use this app to watch shows I've saved and stream smoothly to watch what's been going on back home while I'm out of town on vacation.","updated":"2017-09-13T22:34:33-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3445545553","userName":"snoskiur","userUrl":"https://itunes.apple.com/us/reviews/id101401310","version":"4.1.0","score":1,"title":"I want the old version back.","text":"Do not like the new version at all. PLEASE give ya the option to use the old version. I could swipe left and delete shoes easily. Now, every single show requires me to go through several steps to just delete it. The layout is cumbersome and hard to figure out. The old app was simple and worked well.","updated":"2018-11-21T19:16:59-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2129532404","userName":"NothingWorks!","userUrl":"https://itunes.apple.com/us/reviews/id214434923","version":"3.7.8","score":2,"title":"Could use some updating","text":"I used to be able to search for shows to record by selecting a future date/time. Now after I select it, there’s no way to search it so it just goes back to my regular guide. Please update this app and make it relevant for your users.","updated":"2018-01-26T08:46:08-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3405196958","userName":"vkell123","userUrl":"https://itunes.apple.com/us/reviews/id436011356","version":"4.1.0","score":2,"title":"No streaming with latest version","text":"Very unhappy with the latest version. Used to be able to stream within my house to my iPad or iPhone and now I can do neither. Bring back the old version please, or understand that I’ll be watching more Netflix!","updated":"2018-11-11T00:25:50-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3534515750","userName":"MrBadBoy55","userUrl":"https://itunes.apple.com/us/reviews/id37056445","version":"4.2.0","score":1,"title":"Can no longer stream to iPad","text":"I used to easily watch My Shows on my iPad.  Now I cannot access anything.  Message suggests setting up In-Home & Out of Home streaming but then tells me I have a network connection problem. I don’t!  Everything else in my home works fine and I am on the same network.  This is awful!","updated":"2018-12-15T11:07:44-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2368229561","userName":"Grunberd","userUrl":"https://itunes.apple.com/us/reviews/id510732183","version":"3.7.9","score":3,"title":"When it works it’s pretty good","text":"But there are many instances where it refuses to connect, or stream, or behave well. It’s never clear what the problem is. The WiFi connection can be super strong and still the intermittent problems persist.","updated":"2018-03-31T10:21:48-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3770687264","userName":"92816354","userUrl":"https://itunes.apple.com/us/reviews/id305473571","version":"4.2.0","score":1,"title":"Latest update","text":"Why is it just about every time I launch the app I have to sign in again? I don’t recall this happening in previous version. Do you ever test updates before pushing them out? Do you even take into account the people using the app and their suggestions or are you like facebook and do what you want?","updated":"2019-02-14T18:03:18-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5467598457","userName":"Randy in DC","userUrl":"https://itunes.apple.com/us/reviews/id29789025","version":"4.4.1","score":2,"title":"Dreadful","text":"The only reason for me to use this app is to record a show when I’m away from home. But the browsing is so slow, even on 5G E, that I can’t search for shows or channels, or even scroll through the guide.","updated":"2020-01-30T13:42:26-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3385864540","userName":"akcTiVoUser","userUrl":"https://itunes.apple.com/us/reviews/id20264157","version":"4.1.0","score":1,"title":"Horrible update in v4.1","text":"This is like a bad beta release...UI is not optimized whatsoever for frequent users who download and watch shows offline. Downloading is now highly unreliable, don’t finish, and downloaded shows have glitches do they don’t play. Downloaded shows page is horribly inefficient and hard to use. Please fix ASAP.","updated":"2018-11-05T19:49:38-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"8103209843","userName":"Pamela-c","userUrl":"https://itunes.apple.com/us/reviews/id26301744","version":"4.8.1","score":1,"title":"App does not work","text":"I originally thought it was me because I had recently moved. I uninstalled and reinstalled the app and I still get the reconnect and the scrolling circle. Please fix the app so we can stream on our devices. If I could I would give my current rating zero stars. Thank you","updated":"2021-12-06T18:55:49-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2459956371","userName":"HapCave","userUrl":"https://itunes.apple.com/us/reviews/id28439220","version":"3.7.9","score":3,"title":"CC On iPhone","text":"I use this app a lot, mainly on the iPad. Good for searching and programming recordings. Good for viewing shows on iPad. Complaint: I cannot turn off CC (closed caption) on the iPhone while viewing recordings. Please fix, and come back for another review.","updated":"2018-04-23T17:06:20-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3206370004","userName":"Mike cip","userUrl":"https://itunes.apple.com/us/reviews/id35006454","version":"3.7.9","score":5,"title":"Please make viewable area larger","text":"This needs an update for home button free phones like the x. It’s been out a year and no update","updated":"2018-09-19T05:42:53-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2168899612","userName":"sf@awesome","userUrl":"https://itunes.apple.com/us/reviews/id25861201","version":"3.7.8","score":1,"title":"Issues with Tovo Stream","text":"Stopped working from one day to the next. 2 days into it and while they confirmed a bug (many other people calling with similar issues) still no ability to download or stream.  Guys, it is an app and it has to work. fix it fast or watch your customers run away.","updated":"2018-02-04T21:44:38-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6710396321","userName":"Rachel29m","userUrl":"https://itunes.apple.com/us/reviews/id107793470","version":"4.6.1","score":1,"title":"Since update, unable to stream at home or download shows","text":"Since the last update, I have been unable to stream my shows at home or download them to go.  It is VERY frustrating.  Please fix and I will change my rating.","updated":"2020-12-02T11:17:17-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1847380761","userName":"Sam Traveler","userUrl":"https://itunes.apple.com/us/reviews/id86437523","version":"3.7.7","score":5,"title":"Really great","text":"I can watch my recorded programs while away from home.  Great quality.  Works fine with my new Bolt!","updated":"2017-10-13T20:36:35-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5774262002","userName":"armywife85613","userUrl":"https://itunes.apple.com/us/reviews/id546049323","version":"4.4.1","score":1,"title":"Worst app","text":"This is, by far, the worst app on my iPad. It takes forever to open, is very slow, isn’t very reactive, etc. At this very moment it takes a full minute to open and then tells me I am not connected to the internet. If that were the case, how am I writing this review?","updated":"2020-04-06T22:01:32-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4818539162","userName":"AJL72","userUrl":"https://itunes.apple.com/us/reviews/id39109996","version":"4.2.0","score":2,"title":"Usually dead useful, but has bugs","text":"When selecting a show from the guide, the channel is listed as HD, the detail screen says it’s SD, and then when you schedule it to record it lists the SD channel. So I can go to ch202 and set up to record, but the app decides to record ch002 which is the SD channel. \nThere is no workaround.","updated":"2019-09-21T10:11:55-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5183758443","userName":"papageek999","userUrl":"https://itunes.apple.com/us/reviews/id147657197","version":"4.2.0","score":4,"title":"Excellent app. Ignore the naysayers","text":"Works perfectly so I don’t know if the bad reviews are caused by technically deficient users or just because they never bothered actually using the app.","updated":"2019-11-22T16:44:32-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3291566732","userName":"819rb","userUrl":"https://itunes.apple.com/us/reviews/id26831525","version":"4.1.0","score":2,"title":"Want the old app back","text":"I really hate the remote interface.  The old interface that was the exact replica of the remote was sooo much more intuitive.  The new app “looks” slicker but certainly doesn’t provide the same easy to use interface.","updated":"2018-10-11T20:50:27-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4101718915","userName":"wandaloskot","userUrl":"https://itunes.apple.com/us/reviews/id24479632","version":"4.2.0","score":1,"title":"Wish I didn’t upgrade","text":"New version is way way waaaay worse. No ability to customize. Too complicated, too many slow loading pictures, hard to find information. Please give us back the old version, or at least option to choose.","updated":"2019-05-04T17:50:44-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3616483529","userName":"justray&renie","userUrl":"https://itunes.apple.com/us/reviews/id9922090","version":"4.2.0","score":1,"title":"Worst “update” ever!","text":"Totally worthless! I used to see all of my episodes by titles. Now all you see are worthless picture icons. You have to click on each one to view the episode title. All I see in this update is more space for TV “self-promotion”: Upcoming, May Also Like, etc. Please give us our old interface back!!!!","updated":"2019-01-05T13:20:09-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3525016178","userName":"acybd","userUrl":"https://itunes.apple.com/us/reviews/id477942348","version":"4.2.0","score":5,"title":"Terrific update","text":"LOVE the new update. Slick new UI. One button press for playing content and managing favorite channel feature from the app :)","updated":"2018-12-12T22:18:08-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1870474689","userName":"Adios Mafia","userUrl":"https://itunes.apple.com/us/reviews/id103595571","version":"3.7.7","score":1,"title":"TERRIBLE","text":"This is the worst app ever!  You download to your iPad or iPhone to watch away from home and without fail, the download stops working in the middle of what you’re watching. What a piece of garbage.  With the amount of money I pay each month for this service you’d think they’d have an app that actually works.  Completely unacceptable.  GARBAGE","updated":"2017-10-23T18:42:31-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4178885971","userName":"Ukrainian Newshound","userUrl":"https://itunes.apple.com/us/reviews/id116889565","version":"4.2.0","score":1,"title":"Unworkable, Awful, Awful, Awful","text":"Basic functions are hidden beneath layers of worthless nonsense. I can’t overstate how genuinely BAD this update is. At least the previous versions functioned.  This is just Awful. Too bad I can’t give it zero stars. And unable to access downloaded programs when out of home network. Terrible. Terrible. Terrible.","updated":"2019-05-19T21:40:14-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2552644467","userName":"gadgetperson","userUrl":"https://itunes.apple.com/us/reviews/id13202991","version":"3.7.9","score":2,"title":"Overscan with iPad Pro 10.5","text":"Functionality is excellent but I can’t use it to watch sports due to overscan. Can’t see things like the score and stats with baseball or the score and time with basketball. It works fine with my Samsung Note 8 but not with my iPad.  I hope this is fixed soon.","updated":"2018-05-15T18:18:36-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3288270933","userName":"MGMims","userUrl":"https://itunes.apple.com/us/reviews/id178610872","version":"4.1.0","score":5,"title":"New UI wonderful improvement","text":"Thank you Thank you Thank you for the greatly needed and improved app.","updated":"2018-10-10T23:35:35-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1960889237","userName":"El Pelegrino","userUrl":"https://itunes.apple.com/us/reviews/id104248149","version":"3.7.8","score":2,"title":"Streaming problem","text":"Streaming shows at home to mobile devices constantly freezes and you have to “try again” even with a strong signal & bandwidth. This used to be trouble free. What happened? Please fix this.","updated":"2017-11-30T16:28:39-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2147681669","userName":"KLUminski","userUrl":"https://itunes.apple.com/us/reviews/id25273082","version":"3.7.8","score":5,"title":"Love it","text":"Got rid of my bedroom TV. Sure there are som stability problems, but all told, it rocks.\n\nI solve buffering by pausing, counting to ten and hitting play. Works (almost) every time.","updated":"2018-01-30T18:18:59-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5604958808","userName":"JoeVictim","userUrl":"https://itunes.apple.com/us/reviews/id109963016","version":"4.4.1","score":1,"title":"Still no improvement","text":"Have to randomly reply in.  “Streaming not set up” over and over.  Can’t select options-screen acts like it is frozen. Downloads to device fail.  Downloads download but fail mid play.  Overall - still garbage.","updated":"2020-03-01T22:51:49-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3605911249","userName":"judypgh","userUrl":"https://itunes.apple.com/us/reviews/id18102561","version":"4.2.0","score":1,"title":"Clunky","text":"Having to scroll across a list of recordings in “My Shows” is annoying. Please give us the option to see just a list of shows with no images attached.  I would also like to choose “My Recordings” rather than “Watchlist” as my default for the drop down menu.","updated":"2019-01-02T20:26:22-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3329300642","userName":"Lsmcca","userUrl":"https://itunes.apple.com/us/reviews/id80012736","version":"4.1.0","score":1,"title":"Old app was easier to use","text":"Old app was much easier to use. The upcoming episodes option seems to be gone. Or I just can’t find the it. I can no longer swipe to the left to delete a show.  Now it’s edit then pick a show then yes on cancel. Fix it! Did someone who doesn’t use the app editing t it?","updated":"2018-10-21T20:27:10-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3316019324","userName":"TonyD79","userUrl":"https://itunes.apple.com/us/reviews/id15242225","version":"4.1.0","score":4,"title":"So much better","text":"The old app was balky and often just did not work. The latest version has been excellent and consistent.","updated":"2018-10-18T07:26:59-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1888430126","userName":"khidr9","userUrl":"https://itunes.apple.com/us/reviews/id111708212","version":"3.7.7","score":2,"title":"Long time user- app doesn’t have a back button","text":"Used to be able to use this as a simple remote for my TiVo’s but it doesn’t have a back button which is used throughout the new os - hopefully an update is coming soon to fix!","updated":"2017-10-31T14:54:37-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3890971535","userName":"Mexifinn","userUrl":"https://itunes.apple.com/us/reviews/id3053727","version":"4.2.0","score":2,"title":"Keeps logging me out","text":"Ever since the app was updated to look and feel newer I keep getting logged out. Since I use random passwords for my accounts, I need to look it up constantly.\n\nApp is basically useless since it never keeps me logged in.","updated":"2019-03-16T20:58:52-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"8102720806","userName":"Msred33","userUrl":"https://itunes.apple.com/us/reviews/id274422298","version":"4.8.1","score":1,"title":"I can’t even get it to work","text":"With the new update I can’t even get the app to connect to any of my Tivos on my home network. I have 5 of the latest ones purchased in the last year (I love my Tivos!) but I’m so sad the app won’t work on my phone OR iPad to even connect. Bah!  Please fix this update.","updated":"2021-12-06T15:14:36-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"8039977630","userName":"rjy63","userUrl":"https://itunes.apple.com/us/reviews/id37451576","version":"4.8.1","score":1,"title":"Absolutely broken with latest update","text":"I used the new version yesterday and it was just fine. Today it’s complaining about an invalid login and it’s stuck in an infinite loop asking if I want to sign in again, but never letting me sign in again. Ridiculous.\n\nAnd while I’m here… HOW MANY YEARS MUST WE LIVE WITH THIS ONLY BEING A FULLSCREEN IPAD APP???","updated":"2021-11-19T03:38:32-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5444224795","userName":"itunesaddict2332","userUrl":"https://itunes.apple.com/us/reviews/id218338412","version":"4.4.1","score":2,"title":"It keeps freezing when opening the app.","text":"It keeps freezing when I turn it on. I’ve had to delete the app and re download it multiple times.  It disconnects easily.","updated":"2020-01-24T13:44:37-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3551459776","userName":"Nobody cares about user names","userUrl":"https://itunes.apple.com/us/reviews/id13904205","version":"4.2.0","score":3,"title":"There really needs to be","text":"a faster way to delete large numbers of programs. The last two updates have slowed this process horribly.","updated":"2018-12-20T02:15:57-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3542387747","userName":"TheGeekGoddess","userUrl":"https://itunes.apple.com/us/reviews/id48845452","version":"4.2.0","score":1,"title":"Please fix show playback!","text":"My main issue is that I am not able to watch episodes from a TV series that has been mismarked as a movie with the same name. I’ve had no issue watching the series up until this recent update! \n\nPotential deal breaker...I hope this gets fixed soon!","updated":"2018-12-17T13:19:42-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2494106393","userName":"JEK138291","userUrl":"https://itunes.apple.com/us/reviews/id305473906","version":"3.7.9","score":1,"title":"From bad to worse","text":"I just to be able to stream, had the occasional issue but it worked overall.\n\nUpdate: streaming works now, but very badly. Audio chopped off, low quality on a high speed network. Simply bad.\n\nUpdate 2: streaming works maybe 50% of the time. Bad performance and not consistent.","updated":"2018-05-01T19:21:21-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6611966149","userName":"jonahlee","userUrl":"https://itunes.apple.com/us/reviews/id36638003","version":"4.6.1","score":1,"title":"The latest version barely works","text":"The latest version barely works, when i try and search for shows I end up with a spinning icon and never get results! I have to go to tivoonline to get results. This makes the app less than useless!","updated":"2020-11-05T08:32:13-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3812180748","userName":"AdvntrGuy","userUrl":"https://itunes.apple.com/us/reviews/id31568302","version":"4.2.0","score":2,"title":"CC won’t turn off","text":"The latest iOS update removed the ability to turn off closed captions under settings.  Can’t turn them off in app either.  \n\nDownload speed from Roamio is so slow it’s not worth it.  \n\nTry harder guys.","updated":"2019-02-24T22:58:44-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5162611784","userName":"srornat","userUrl":"https://itunes.apple.com/us/reviews/id38312307","version":"4.2.0","score":1,"title":"App can’t rememberer login","text":"Every time I open this app it forgets who I am and demands to to be logged in. This can be very frustrating when I’m trying to record a show close to the start even though I use 1Password. If didn’t have that I would be even more upset.","updated":"2019-11-17T21:01:24-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3828803951","userName":"Sarpent","userUrl":"https://itunes.apple.com/us/reviews/id28750850","version":"4.2.0","score":1,"title":"Can’t remember your login information","text":"If you enjoy manually retyping your login information then this app is for you. It’s 2019 and this app is still incapable of remembering your login info. Look up your login information, manually type it in, look up your login info, manually type it in.\n\nThis is your life now. 2019.","updated":"2019-03-01T08:03:00-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2452666476","userName":"NitroLab","userUrl":"https://itunes.apple.com/us/reviews/id262133196","version":"3.7.9","score":2,"title":"Still missing a button","text":"If you scroll to another day to check the schedule the button to the right of “tonight” is still issuing weeks after I brought it to their attention.","updated":"2018-04-21T22:53:46-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3528486220","userName":"Hojimoto","userUrl":"https://itunes.apple.com/us/reviews/id29543487","version":"4.2.0","score":1,"title":"Lousy update!!","text":"I agree completely with other reviewers, the old app was much better! Often have to re sign in, which never had to do before, very annoying. Remote is awful need the old one back. Can’t view all available channels on my mini as before. Overall very poor!","updated":"2018-12-13T21:37:20-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3798389368","userName":"Shaun Singletary","userUrl":"https://itunes.apple.com/us/reviews/id162857003","version":"4.2.0","score":2,"title":"Not great anymore","text":"I remember downloading this app and it being amazing. How the last year has changed. Streaming doesn’t work as well as it used to. Loading errors happen all the time as does login issues. Get it together!","updated":"2019-02-21T14:44:59-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2118301858","userName":"AG18361836","userUrl":"https://itunes.apple.com/us/reviews/id199439243","version":"3.7.8","score":4,"title":"Satisfied","text":"The only things I can’t do on my iPad are download recorded shows and skip commercials while viewing shows on iPad.    Basically I’m pleased.","updated":"2018-01-23T04:58:43-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5861803445","userName":"Meshtale","userUrl":"https://itunes.apple.com/us/reviews/id144092045","version":"4.5.1","score":4,"title":"New update fixes previous streaming issue","text":"Fast work with a fix. Thanks.","updated":"2020-04-25T05:18:52-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3529504331","userName":"Phomari7","userUrl":"https://itunes.apple.com/us/reviews/id158550079","version":"4.2.0","score":1,"title":"Please test your app!","text":"This app’s one job is to stream content, but all it’s doing is annoying your customers and trashing you reputation. Have you guys even looked at all the one-star reviews?  And how many customers who didn’t write reviews must be thinking the same thing?  Doesn’t bode well for your future.","updated":"2018-12-14T04:24:00-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3291235628","userName":"Fharris66","userUrl":"https://itunes.apple.com/us/reviews/id26246495","version":"4.1.0","score":1,"title":"New app stinks","text":"For downloaded shows you can’t sort by date or show. There is no rhyme or reason to the design and the app is unusable in it’s current release. Strongly suggest you have better beta testers. I have been considering moving to Altice One and this poor design is making this decision easier.","updated":"2018-10-11T18:32:07-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3288010420","userName":"trip1eX","userUrl":"https://itunes.apple.com/us/reviews/id15793115","version":"4.1.0","score":1,"title":"Terrible","text":"I used the app to manage recordings. Now it has 2 big icons in My Shows which greatly reduces the number of recordings that can be displayed at once. Terrible.\n\nIt also forced me to login and do a password change.  But it is a temp password. And now I have to seemingly go to the website to get rid of temp password.","updated":"2018-10-10T21:44:34-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2514215549","userName":"Slynky","userUrl":"https://itunes.apple.com/us/reviews/id140809873","version":"3.7.9","score":3,"title":"Out of Home Streaming...","text":"I set it up successfully in settings but when I try to watch, tells me the software doesn't support out of home streaming. Software is no use to me if I can't do that.","updated":"2018-05-06T19:39:55-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3696819298","userName":"Quickdraw39","userUrl":"https://itunes.apple.com/us/reviews/id71946","version":"4.2.0","score":2,"title":"New update doesn’t work.","text":"The new update doesn’t change the channel. I have to manual change it. I like the old version better. Plus now nothing doesn’t even show up. I tired everything and nothing works.","updated":"2019-01-26T06:06:51-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2151572663","userName":"bigoshareef","userUrl":"https://itunes.apple.com/us/reviews/id148001822","version":"3.7.8","score":2,"title":"Glitches","text":"Constantly tells me I can’t stream a show after I watch half of it while it is downloaded to my iPad or phone.... I am not even streaming when it is in airplane mode.  What is the point of downloading a show if it acts like I am connecting.","updated":"2018-01-31T17:38:40-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3317619450","userName":"Luvmyamiga","userUrl":"https://itunes.apple.com/us/reviews/id38666344","version":"4.1.0","score":2,"title":"interface has changed ,does not work","text":"After upgrade interface has changed ,does not work as expected , second box only shows channels under 100","updated":"2018-10-18T19:06:39-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6598001385","userName":"Stratkatt","userUrl":"https://itunes.apple.com/us/reviews/id12597134","version":"4.6.1","score":1,"title":"What a disastrous app","text":"I’ve never had so much trouble with the inconsistent operation of a tv service app in my life. It barely provides what you expect an app of this type to do. They need to take lessons from Direct TV and Xfinity on how a successful app is supposed to work. My god can this app any worse??","updated":"2020-11-01T08:57:48-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6164835946","userName":"DWJ47","userUrl":"https://itunes.apple.com/us/reviews/id30396080","version":"4.5.1","score":1,"title":"Only Works half of the time","text":"When it works, it’s great but it seems to work less and less often, so I have to delete and reload the App and that doesn’t always solve the problem either. Frustrating","updated":"2020-07-06T09:48:08-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5749017284","userName":"Donald Keys","userUrl":"https://itunes.apple.com/us/reviews/id139191613","version":"4.4.1","score":1,"title":"APP DOES NOT WORK","text":"Very hard to load. Keep on getting the error “A network error occurred please try again”. Sometimes it will load, but then you can not touch anything on the screen, (your shows, recordings remote etc...) This app is a joke!","updated":"2020-04-01T20:54:31-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3563786099","userName":"Any name aabbcc","userUrl":"https://itunes.apple.com/us/reviews/id135536288","version":"4.2.0","score":1,"title":"Latest update made this worse","text":"Last update is awkward and not user friendly. I have to click more to get desired results, transferred from page to page to complete a task....please go back to old format...this new one is junk.  If I could give less then a star I would!","updated":"2018-12-23T07:11:54-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3552592950","userName":"TulsaLDM","userUrl":"https://itunes.apple.com/us/reviews/id110550264","version":"4.2.0","score":3,"title":"Unstable","text":"This version has to have information reinterred occasionally. This version is confusing. The earlier ones worked better and were more trouble free","updated":"2018-12-20T08:46:27-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3447084463","userName":"kraigspear","userUrl":"https://itunes.apple.com/us/reviews/id12355463","version":"4.1.0","score":5,"title":"Much better","text":"Vastly improved from the previous outdated version.\n\n👏","updated":"2018-11-22T05:10:51-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3325480882","userName":"Aero1976","userUrl":"https://itunes.apple.com/us/reviews/id28701059","version":"4.1.0","score":1,"title":"Atrocious.","text":"Absolutely awful. Wish I could go back to the old version. Basic functionality missing - like being able to slide to delete a show or group of shows. Streaming is very unreliable and interface design is not intuitive or user friendly. F-","updated":"2018-10-20T20:38:17-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3293663022","userName":"Xnskfndos","userUrl":"https://itunes.apple.com/us/reviews/id110059569","version":"4.1.0","score":1,"title":"New version a step backwards","text":"iPhone X version is a big step backwards for the interface and battery. Sorting is wrong and not configurable. Common functions are behind more and smaller buttons.\n\nWatching a downloaded video now also kills battery life and gets my XS red hot, a huge disappointment.","updated":"2018-10-12T09:10:56-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6611664610","userName":"CosJap","userUrl":"https://itunes.apple.com/us/reviews/id28474323","version":"4.6.1","score":1,"title":"Constant crashes","text":"The developers need to get their heads out of the sand. This thing hasn’t been working with the update. It’s been a long time maybe 6 months since I’ve been able to use this on my iPhone without a crash.","updated":"2020-11-05T06:45:56-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6443527617","userName":"Moto 999","userUrl":"https://itunes.apple.com/us/reviews/id210578715","version":"4.6.1","score":1,"title":"Worse App on the market","text":"It is by far one of the worst apps on the market. Always dumps your information so you have to re-log back in to the app. It takes you forever to get logged back in once it dumps your information.","updated":"2020-09-18T17:22:21-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2462866880","userName":"_jonhay","userUrl":"https://itunes.apple.com/us/reviews/id28285177","version":"3.7.9","score":2,"title":"Missing key features","text":"Does not implement any multitasking functions of iOS.\n\nThe ability to play videos while working on something else seems like it would be a given, but it’s not present at all.","updated":"2018-04-24T10:37:17-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3628644933","userName":"S. Dore","userUrl":"https://itunes.apple.com/us/reviews/id38657333","version":"4.2.0","score":1,"title":"Unusable mess","text":"I don’t understand who thought this was an improvement in usability. Playing shows on the TV is more steps, deleting shows takes more steps, all of the controls are small and hard to target, and digging into some recorded shows can be an infinite rabbit hole.","updated":"2019-01-08T20:03:50-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3371095217","userName":"ShawnaStiles","userUrl":"https://itunes.apple.com/us/reviews/id114549237","version":"4.1.0","score":2,"title":"Love TIVO...this new app, not so much","text":"This app times out constantly and takes forever to load anything, not to mention can you make the font any smaller?  I’m on a plus phone, I can imagine what it would be like for someone on a smaller phone.","updated":"2018-11-01T23:05:29-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3603637477","userName":"asharachal","userUrl":"https://itunes.apple.com/us/reviews/id39580368","version":"4.2.0","score":1,"title":"Used to love this app","text":"But now, I am constantly signed out of the app, it won’t take my log-in information and I have to reset my password and then go through the whole scenario all over again. Seriously considering just dropping it and getting an X1 finally.","updated":"2019-01-02T06:33:02-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2950678739","userName":"PatRnvl","userUrl":"https://itunes.apple.com/us/reviews/id674730705","version":"3.7.9","score":2,"title":"No streaming","text":"I can do everything but stream programs to my mobile device. For some reason streaming is not working at all. It used to work until an update or two ago.","updated":"2018-07-22T13:37:52-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3320563494","userName":"JCZorkmid","userUrl":"https://itunes.apple.com/us/reviews/id24216038","version":"4.1.0","score":1,"title":"Took away my primary use case","text":"I mainly used this to check if a show/movie was available via cable, on demand, or streaming. Usually I did this while out of the house. Now I can’t because I have to be connected to the same network to use this feature.","updated":"2018-10-19T13:29:56-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4578735909","userName":"Will-I-B","userUrl":"https://itunes.apple.com/us/reviews/id35431593","version":"4.2.0","score":2,"title":"Fix basic functions","text":"Unable to simply browse guide on app then tap show to watch and will not switch to that program. Have to open remote control app  and manually key in channel.","updated":"2019-08-06T14:44:20-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"7925899104","userName":"Glemmie","userUrl":"https://itunes.apple.com/us/reviews/id347521300","version":"4.6.1","score":1,"title":"Password Issues","text":"Can’t access my account even though I haven’t changed the password. Try to reset it, no joy. Just looks at me after providing the email the account is under. Doesn’t go anywhere. Do better, for F’s sake!","updated":"2021-10-17T14:25:38-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2004553010","userName":"Bernard11111","userUrl":"https://itunes.apple.com/us/reviews/id28510078","version":"3.7.8","score":2,"title":"Okay app","text":"This app is okay, but the app just like the product leaves a lot to bee desired. I had a bolt that worked pretty well for almost two years, then I bought a new bolt and I have had nothing but problems.","updated":"2017-12-17T12:10:57-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3400296103","userName":"Space wizz","userUrl":"https://itunes.apple.com/us/reviews/id26979344","version":"4.1.0","score":3,"title":"OK but is a pain to use","text":"The app works ok but you constantly have to log back in and set streaming up again after some period of time. Not very reliable.","updated":"2018-11-09T18:32:55-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2952617862","userName":"SteveTheElectrician","userUrl":"https://itunes.apple.com/us/reviews/id303304782","version":"3.7.9","score":1,"title":"Won’t let me add an email","text":"I honestly wouldn’t know anything about this app because when I try to create an email and password with MAK and enter in the numbers it doesn’t do anything. Fix this now, please. Also the numbers don’t even show up, just the cursor in their place.","updated":"2018-07-22T23:55:34-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2015326052","userName":"HappyRembrandt","userUrl":"https://itunes.apple.com/us/reviews/id33891330","version":"3.7.8","score":4,"title":"Could be a 5 but...","text":"I love this app but it does crash or lock you out occasionally! If you fix that it would be a five star.","updated":"2017-12-21T10:50:55-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"7898548559","userName":"ChrisKurk","userUrl":"https://itunes.apple.com/us/reviews/id383183491","version":"4.6.1","score":1,"title":"Slow searches, if they even load at all","text":"Ugh. Looking forward a show to record? Good luck. Often the searches don’t load at all and I give up. It’s been like this for years. How hard is it to make an app that works?","updated":"2021-10-10T03:25:57-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5269720539","userName":"Atomic Dragon","userUrl":"https://itunes.apple.com/us/reviews/id11976789","version":"4.4.1","score":1,"title":"Terrible update","text":"App locks up when opening no way to restart without shutting down the phone. Downloading shows to the app not working. Streaming not working. Worked without issue before the update.","updated":"2019-12-13T18:26:25-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4969637319","userName":"Jose carlos Marco Antonio","userUrl":"https://itunes.apple.com/us/reviews/id630150121","version":"4.2.0","score":5,"title":"Update app*****","text":"App won’t open and I’m using an updated iPhone XR \nPlease I love your app and your equipment!!!\nPlease send an update to App\nPlease send an update to App","updated":"2019-10-18T15:36:57-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3295574379","userName":"Math3.14159","userUrl":"https://itunes.apple.com/us/reviews/id7536085","version":"4.1.0","score":1,"title":"Cannot log in","text":"You say that you fixed this issue but you haven’t. Tried everything possible for two hours, including resetting password multiple times, uninstalling, rebooting etc. Shame on you for releasing this!!!","updated":"2018-10-12T22:18:00-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2807802765","userName":"Print all","userUrl":"https://itunes.apple.com/us/reviews/id10223546","version":"3.7.9","score":3,"title":"Flawed performance on iPad.","text":"Doesn’t always record series show. \n\nWill not provide random access to future dates. Must scroll a half hour at a time.","updated":"2018-06-30T19:02:18-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2431061029","userName":"honest1 period","userUrl":"https://itunes.apple.com/us/reviews/id564230247","version":"3.7.9","score":5,"title":"Amazing period","text":"Better then any other tv hands down 👍","updated":"2018-04-16T16:23:33-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3725397700","userName":"ChipHN","userUrl":"https://itunes.apple.com/us/reviews/id32258256","version":"4.2.0","score":2,"title":"Latest version is awful","text":"So, you took a pretty decent app & made it nearly unusable!    I can’t select an item in the guide to just watch it ... It automatically records!   Wish I could revert to the old version!","updated":"2019-02-02T10:35:11-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"7767767787","userName":"Dustin Amundson","userUrl":"https://itunes.apple.com/us/reviews/id21488101","version":"4.6.1","score":1,"title":"App is frustrating!!!","text":"I continue to get the error message on my IPAD  “out of home streaming is not allowed “ for the past three months now. BUT when I login by going to the website is streams just fine with no issue. What’s up???","updated":"2021-09-03T16:06:21-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3865267732","userName":"Turtle's mommy","userUrl":"https://itunes.apple.com/us/reviews/id23308491","version":"4.2.0","score":1,"title":"Forgetting password","text":"Why does this forget the password after a few days? It’s also  slow to get started. These are things that make me use alternative apps from my TV company to view only live shows now, when I used to use this app regularly.","updated":"2019-03-10T05:06:25-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2546518527","userName":"Homestead.","userUrl":"https://itunes.apple.com/us/reviews/id15633468","version":"3.7.9","score":2,"title":"Date picker not working","text":"There is no way for a selected future date under the “guide” tab to advance to that date. Options only are “now” and “tonight” \nWhy have a date picker that doesn’t work?","updated":"2018-05-14T08:35:58-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3467887810","userName":"Drxx","userUrl":"https://itunes.apple.com/us/reviews/id23194421","version":"4.1.0","score":3,"title":"Good but","text":"The constant need to reconnect makes it unusable. The connection should stick for at least 24 hours. \n\nAnd it should never forget credentials even thru and update.","updated":"2018-11-27T16:18:49-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1961148017","userName":"white tiger 1","userUrl":"https://itunes.apple.com/us/reviews/id39733496","version":"3.7.8","score":2,"title":"Future days","text":"I can no longer check what’s on in the future without moving 30 minutes at a time. When I select another day or time there is no way to call it up. IPhone 6 iOS 11.1.1","updated":"2017-11-30T18:54:48-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2493721136","userName":"MJMaysr","userUrl":"https://itunes.apple.com/us/reviews/id42617140","version":"3.7.9","score":2,"title":"Stop recording","text":"The app is so so. Time lag to set up streaming every time you want to watch. The requirement to record while watching is unnecessary. Can’t compare with the remote tv watching ability of my SeNext tv streaming box.","updated":"2018-05-01T16:46:13-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6861931702","userName":"BeachGirl707","userUrl":"https://itunes.apple.com/us/reviews/id265128298","version":"4.6.1","score":1,"title":"Update won’t open","text":"Updated it on iPad yesterday and can’t open it since. Hope they rush a fix out because this is ridiculous. Even updated iOS thinking that was issue. It wasn’t- it’s this app update.","updated":"2021-01-12T10:32:16-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5859020956","userName":"itsmeejudi","userUrl":"https://itunes.apple.com/us/reviews/id42158388","version":"4.5.1","score":1,"title":"Not in home Network","text":"Even though I’m in my home network it’s telling me I’m out of home network. What’s the use of using this app if you can’t watch anything. Whatever the last update was it ruined the whole app. PLEASE FIX!  I’m not to happy.","updated":"2020-04-24T14:03:46-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4943410079","userName":"tfoubert","userUrl":"https://itunes.apple.com/us/reviews/id40492457","version":"4.2.0","score":1,"title":"Crashes constantly","text":"This release crashes constantly.  The only way to get it working again is to delete it and to reinstall it.  Of course you lose all of your downloaded episodes each time.  So horrible.","updated":"2019-10-13T17:59:56-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4270285176","userName":"Lizard99989","userUrl":"https://itunes.apple.com/us/reviews/id40202595","version":"4.2.0","score":1,"title":"Cannot login after update, per usual","text":"Latest update always makes it so I cannot login. Tells me wrong password, it isn’t. No matter how much I deleted and re-download this app never properly updates the most basic functionality. It is maddening.","updated":"2019-06-05T19:52:52-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4156442009","userName":"PR_Apple1","userUrl":"https://itunes.apple.com/us/reviews/id17173727","version":"4.2.0","score":1,"title":"Unstable app","text":"The app has multiple issues. \nIt is very hard to get a proper remote stream going and even on the local network it has stability issues (on a gigabit connection and wireless N network). \nThe app constantly logs out and does not cache the user/pass. \nQA on the app is extremely bad.","updated":"2019-05-15T17:49:23-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3490739053","userName":"MSRic","userUrl":"https://itunes.apple.com/us/reviews/id105722096","version":"4.1.0","score":1,"title":"Don’t like Latest Version 4.1","text":"Used to love this app and used it all the time.  I don’t care for the newest version I don't think it’s as user friendly as the old one was. Also it also keeps signing me out every week or so and I have to sign back in.  It never used to do that.","updated":"2018-12-03T17:31:22-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1882817241","userName":"iNewbie2009","userUrl":"https://itunes.apple.com/us/reviews/id100096097","version":"3.7.7","score":2,"title":"Great but could be better","text":"Love being able to remotely check channel guide without disturbing family. Like being able schedule shows remotely. \n\nCrashes often.","updated":"2017-10-29T02:05:45-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1883415150","userName":"FathaMike","userUrl":"https://itunes.apple.com/us/reviews/id112137247","version":"3.7.7","score":3,"title":"Can’t change date","text":"Generally useful, but not great. You can use spinners to set new date, but the active date never changes. Could be a favorite app if perfected.","updated":"2017-10-29T07:57:41-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3394185861","userName":"iphone4+itouch4","userUrl":"https://itunes.apple.com/us/reviews/id33308977","version":"4.1.0","score":2,"title":"Downloaded shows","text":"This is horrible - downloaded shows are no longer able to be grouped by show! It’s a time-consuming mess to find what one wants to play. It’s now a complete pain to use. 😢","updated":"2018-11-08T02:46:41-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6739870505","userName":"The Knoosh","userUrl":"https://itunes.apple.com/us/reviews/id34768079","version":"4.6.1","score":1,"title":"Latest version terrible","text":"They took a perfectly working app and messed it up. Downloads hard to find and a lot of features no longer work at all.","updated":"2020-12-10T19:54:50-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6617009531","userName":"Sjogi","userUrl":"https://itunes.apple.com/us/reviews/id29884889","version":"4.6.1","score":1,"title":"Get With the Prigram","text":"Freezes all the tine. Have to delete and reinstall.  A GREAT product is going down the drain.  PLEADE correct.\n\nAre you out there?  This is a major product that is going down the tubes.  After 2 years, it is getting worse.","updated":"2020-11-06T17:47:45-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3456217251","userName":"Beemon","userUrl":"https://itunes.apple.com/us/reviews/id125918977","version":"4.1.0","score":1,"title":"Broken","text":"Latest version keeps failing to connect to network.  Never had problem before and web access still works so new version appears to be the issue.  Wish I could revert to previous version.","updated":"2018-11-24T13:16:17-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3557983767","userName":"PT5988","userUrl":"https://itunes.apple.com/us/reviews/id496278553","version":"4.2.0","score":2,"title":"Can’t figure out how to do things with latest version","text":"I just want to see upcoming episodes, but can’t figure out how to do that.  Also, I have to use the remote to save episodes.  Big step backwards.","updated":"2018-12-21T20:33:11-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3290344565","userName":"SoloAppReviewer","userUrl":"https://itunes.apple.com/us/reviews/id101004920","version":"4.1.0","score":3,"title":"Picture in Picture + QuickMode","text":"I use the app all the time. The new version looks good. \n\nDisappointed it still doesn’t support Picture in Picture or QuickMode, though.","updated":"2018-10-11T11:25:58-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3286870115","userName":"Ardra007","userUrl":"https://itunes.apple.com/us/reviews/id28849905","version":"4.1.0","score":4,"title":"Changes","text":"I like most of the changes but I’m really annoyed I can’t sort or group my downloads.","updated":"2018-10-10T13:35:50-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"7050251220","userName":"julesagogo","userUrl":"https://itunes.apple.com/us/reviews/id230442492","version":"4.6.1","score":3,"title":"No touch ID","text":"Nice user interface but why in the world does it require an email address and password every time","updated":"2021-02-28T13:06:16-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3918792669","userName":"batsports","userUrl":"https://itunes.apple.com/us/reviews/id189518659","version":"4.2.0","score":1,"title":"Horrible app","text":"I saw all of the bad reviews and thought it couldn’t be that bad, but it’s worse.  No way to change a password. Can’t download 99% of recorded shows.  Can’t stream 99% of recorded shows.  Terrible help content...no results for password?!? If you want a simple TV guide, it’s okay.","updated":"2019-03-23T18:25:32-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3373578286","userName":"brazosguy","userUrl":"https://itunes.apple.com/us/reviews/id157488001","version":"4.1.0","score":2,"title":"Latest version is a big step backwards","text":"The previous version was pretty good.  This version has replaced functionality with a somewhat confused and buggy new look.","updated":"2018-11-02T13:42:11-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3461048518","userName":"bfarrelli","userUrl":"https://itunes.apple.com/us/reviews/id42018807","version":"4.1.0","score":1,"title":"Won’t even start up","text":"This is horrible. Not that the last update was any better, it always said my password and email was wrong.\n\nThis one just has that blue line go back and forth for ever and never even starts. So frustrating.","updated":"2018-11-25T18:58:46-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3197442251","userName":"ParkerHouseHO","userUrl":"https://itunes.apple.com/us/reviews/id490073822","version":"3.7.9","score":2,"title":"Needs fixing","text":"If I want to record a future show by changing the date in the guide, a nice script comes up to change it. But after scrolling to new date, there’s no way to select it!","updated":"2018-09-16T16:24:47-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3302848992","userName":"Dalel M.","userUrl":"https://itunes.apple.com/us/reviews/id10317479","version":"4.1.0","score":1,"title":"New remote terrible","text":"The changes to the remote in the app are awful. All of our favorite features have been taken away. We wish there was a way to switch back to the old app. These new updates are worthless!","updated":"2018-10-14T18:31:55-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6437021064","userName":"Lovely mom Ms. Nice","userUrl":"https://itunes.apple.com/us/reviews/id28974457","version":"4.6.1","score":1,"title":"The worst app on the market","text":"It crashes ALL the time after one use. I would have given it a zero if that was an option. I use it because we lost our remote but I’ve never used a worse app ever.","updated":"2020-09-16T20:25:24-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1834178750","userName":"Drifter815","userUrl":"https://itunes.apple.com/us/reviews/id40463975","version":"3.7.7","score":5,"title":"Great app","text":"Very helpful to download prior to a flight or watch over wifi","updated":"2017-10-07T19:41:27-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4187623393","userName":"PrefersAppsThatDontCrash","userUrl":"https://itunes.apple.com/us/reviews/id137843103","version":"4.2.0","score":1,"title":"Hates regular users","text":"It's a decent enough app once you get into it, but it logs you out at least once a week, and then goes out of its way to make it hard to log back in. Why not let us stay logged in? Or at least work properly with password managers?","updated":"2019-05-21T12:40:51-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3958764371","userName":"k8gro","userUrl":"https://itunes.apple.com/us/reviews/id429900205","version":"4.2.0","score":1,"title":"Download Folder Hard to Use","text":"Please put back the ability to sort shows and group them in the download folder.  It’s too hard to manage with just a random list based on download date (not show date).","updated":"2019-04-01T23:59:44-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3354319883","userName":"Lawnman5566","userUrl":"https://itunes.apple.com/us/reviews/id104167635","version":"4.1.0","score":2,"title":"Frequent login problems","text":"Why does the new version have so much difficulty logging in? And no way to remember the login information? I’m spending too much time trying to get the thing to login.","updated":"2018-10-28T08:31:22-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3738270814","userName":"dubzsz","userUrl":"https://itunes.apple.com/us/reviews/id24162071","version":"4.2.0","score":1,"title":"What were you thinking???","text":"Why would you think it’s a good idea to take an easy, compact list of episodes and turn them in 100 pages of identical pictures that I have to scroll through for a day and a half?\nThis version is crap.","updated":"2019-02-05T20:46:37-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3622972931","userName":"applebud","userUrl":"https://itunes.apple.com/us/reviews/id30595086","version":"4.2.0","score":1,"title":"Mostly useless","text":"App is constantly having to reconnect, telling me there was a problem with sign in. 5-10 attempts later and the app will work for another few minutes, until the whole process repeats itself.","updated":"2019-01-07T06:33:38-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3302230015","userName":"swixo","userUrl":"https://itunes.apple.com/us/reviews/id32457252","version":"4.1.0","score":2,"title":"Oct2018 version terrible redesign","text":"Does not remember view settings, so you only see one season At a time for a show instead of what you downloaded. \n\nDownloaded shows hidden and not organized into folders. Takes 3-4 taps to do what used to be one tap before. \n\nIf I could roll back I would - what were you thinking?\n\nUpdate: remote streaming broken too. Now app useless. Programs download to device but will not play back.","updated":"2018-10-14T13:43:04-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3382126782","userName":"MarieSea","userUrl":"https://itunes.apple.com/us/reviews/id29410323","version":"4.1.0","score":2,"title":"Sllloooow","text":"The latest version takes minutes to load the guide, minutes to switch boxes. If I could uninstall and go back to a previous version I would.","updated":"2018-11-04T18:59:26-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3283328811","userName":"Annoyeduser418","userUrl":"https://itunes.apple.com/us/reviews/id17569398","version":"4.1.0","score":1,"title":"Warning: Destroys Existing Downloaded Shows","text":"With no mention of this limitation in the app notes, this new version of the app destroys any existing shows you may have previously downloaded to your IOS device. They will no longer exist after the update.","updated":"2018-10-09T15:41:24-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2671809655","userName":"Tellurider","userUrl":"https://itunes.apple.com/us/reviews/id17932800","version":"3.7.9","score":5,"title":"Good for remote recording","text":"Excellent app for setting up recordings from remote locations.","updated":"2018-06-10T07:36:14-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3660307870","userName":"nodamidis","userUrl":"https://itunes.apple.com/us/reviews/id17290361","version":"4.2.0","score":1,"title":"App Stopped Working","text":"The app just stopped functioning several days ago and won’t even load up.  I hated the functionality and interface to begin with but now I’m just going to have to delete it altogether.  If I could give it zero stars I would.","updated":"2019-01-17T03:53:36-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3302506163","userName":"Rossking2","userUrl":"https://itunes.apple.com/us/reviews/id157767632","version":"4.1.0","score":2,"title":"Update is a downdate","text":"New now has background download\n\nBut simple things like swip delete shows and group delete. Also edit with selector to delete gone\n\nA lot of app use it to clean up old shows","updated":"2018-10-14T15:55:34-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5524411952","userName":"Goose3281","userUrl":"https://itunes.apple.com/us/reviews/id203998206","version":"4.4.1","score":2,"title":"Too Many Steps","text":"Why is deleting a show and moving on to the next show to delete a 4 step process?","updated":"2020-02-12T22:41:11-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2228455975","userName":"mindthump","userUrl":"https://itunes.apple.com/us/reviews/id34111559","version":"3.7.8","score":3,"title":"Media Access Key screen is broken","text":"Recent updates make it somewhat better than nothing.","updated":"2018-02-20T04:19:48-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2004388141","userName":"Chicagophysician","userUrl":"https://itunes.apple.com/us/reviews/id217648146","version":"3.7.8","score":3,"title":"tnicola","text":"I would give it more stars if it wasn’t for the poor download speeds of programs to my iPad. This is true even when the internet signal strength is excellent.","updated":"2017-12-17T10:49:47-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1935033386","userName":"Danny_Bob","userUrl":"https://itunes.apple.com/us/reviews/id34457981","version":"3.7.8","score":1,"title":"Enable background downloading!","text":"All I use this for is downloading shows to my iPad for flights, and it’s so annoying that the app has to be active for it to continue downloading shows. Other apps like Netflix download in the background just fine.","updated":"2017-11-20T06:59:09-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"7133865291","userName":"Bayouski","userUrl":"https://itunes.apple.com/us/reviews/id48946949","version":"4.6.1","score":1,"title":"App randomly logs you out","text":"The app randomly logs you out and won’t let you save your password.  It is really inconvenient to be forced to type an email and password just to use the remote functionality.","updated":"2021-03-22T20:14:47-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6162270686","userName":"Claude Mundy","userUrl":"https://itunes.apple.com/us/reviews/id4721041","version":"4.5.1","score":5,"title":"Works great!","text":"I just installed my new Bolt (along with my existing Romario), and the app works great!","updated":"2020-07-05T18:36:01-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3815302141","userName":"Glorfinniel","userUrl":"https://itunes.apple.com/us/reviews/id33824752","version":"4.2.0","score":2,"title":"Better before update","text":"I need to use this app occasionally so I won’t delete it, but it’s so much more difficult to navigate than before. Please return to the old interface.","updated":"2019-02-25T17:58:51-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3567863121","userName":"hbanks","userUrl":"https://itunes.apple.com/us/reviews/id16998995","version":"4.2.0","score":2,"title":"Way too cluttered, confusing","text":"All I want to do is delete or change a time for an episode. Hard to figure out. Visually confounding. \n\nCan’t we go back to some of the earlier simplicity? It worked.","updated":"2018-12-24T08:18:35-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3337009604","userName":"dragon-2009","userUrl":"https://itunes.apple.com/us/reviews/id106280052","version":"4.1.0","score":2,"title":"No cellular network support","text":"Developer, please check on setting, there is no option to select for cellular network. I can not use to stream my tv when I am out of home. Thank you.","updated":"2018-10-23T22:42:02-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3433244935","userName":"sicstick666","userUrl":"https://itunes.apple.com/us/reviews/id113248900","version":"4.1.0","score":1,"title":"Unusable","text":"Will not even let me log in. App just spins. The only thing that functions well is the password reset feature. Still will not allow me any access after going through that process.","updated":"2018-11-18T11:24:04-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3172158366","userName":"Gex2501","userUrl":"https://itunes.apple.com/us/reviews/id30420079","version":"3.7.9","score":2,"title":"Needs work.","text":"It’s like the app hasn’t really been updated in years. Not since before the high res iPhones came out. It’s functional, which it what the updates address, but it clearly needs a redesign.","updated":"2018-09-09T11:01:26-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2249223588","userName":"Weboat","userUrl":"https://itunes.apple.com/us/reviews/id109340590","version":"3.7.8","score":2,"title":"Gets choppy after about an hour","text":"I use this app a lot on iPad Pro.   Even while I’m home network it starts getting choppy after watching about an hour.  I have to keep stopping it and restarting.","updated":"2018-02-26T04:38:36-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2449700347","userName":"Joge-gee","userUrl":"https://itunes.apple.com/us/reviews/id11864514","version":"3.7.9","score":3,"title":"Spotty and outdated","text":"I don’t think they’ve updated this since the iPhone 5.  It’s very spotty and it think it’s gotten worse.  If they would just invest a little QA into this App it would be awesome.","updated":"2018-04-21T06:22:36-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2219824143","userName":"Jpsl3","userUrl":"https://itunes.apple.com/us/reviews/id37972808","version":"3.7.8","score":2,"title":"Remote section needs Back button","text":"Ok app. Really needs to add the Back button to the embedded remote though. This is critical for anyone using the Hydra interface. Would also like to have skip enabled.","updated":"2018-02-17T16:27:30-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5436210972","userName":"Kendalls mom","userUrl":"https://itunes.apple.com/us/reviews/id23863829","version":"4.4.1","score":2,"title":"Logging in is a pain","text":"This is the only app I have where I have to log in each time I use it. It says it’s saved in the Touch ID but it doesn’t work. I dread logging in.","updated":"2020-01-22T13:12:16-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1836418791","userName":"Cisco1999","userUrl":"https://itunes.apple.com/us/reviews/id100661946","version":"3.7.7","score":1,"title":"App not working again","text":"Is it going to take 2 months to fix it this time. You guys need to get it together. You offer a service that doesn’t work half the time, you don’t even deserve a one star, If I could give you negative 5 stars I would.","updated":"2017-10-08T21:22:04-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"8051912165","userName":"Cybercho","userUrl":"https://itunes.apple.com/us/reviews/id11406882","version":"4.8.1","score":1,"title":"New update won’t let me open app","text":"The new update that was just added will not allow me to even open the app!  I’ve deleted it, reinstalled it and restarted my phone. It still will not open. Please fix!!","updated":"2021-11-22T09:23:23-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5707950706","userName":"Texguy04","userUrl":"https://itunes.apple.com/us/reviews/id218475078","version":"4.4.1","score":1,"title":"Always forgets my password","text":"Why does it always forget my password!?\n\nI use it to record remotely. I don’t do it too often. But I always have to input my password almost every time. So annoying","updated":"2020-03-24T14:30:30-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3075122963","userName":"Dcjeep","userUrl":"https://itunes.apple.com/us/reviews/id8739226","version":"3.7.9","score":2,"title":"Never works","text":"This app is very disappointing when I try to use on my iPad always issues. Always disconnecting from network and I have deleted app reinstalled and same afterwards","updated":"2018-08-16T19:38:05-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4305072983","userName":"Fistandantilus","userUrl":"https://itunes.apple.com/us/reviews/id40169311","version":"4.2.0","score":1,"title":"Horrendous step backwards","text":"The app NEVER sets up recordings in HD even though I specifically select an HD channel.  The show description page is a UI mess and needs to be cleaner.  I don’t care about the show image being the background.\n\nThe app constantly hangs and gets stuck.","updated":"2019-06-12T08:27:23-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4189334858","userName":"BertieWooster","userUrl":"https://itunes.apple.com/us/reviews/id34132901","version":"4.2.0","score":1,"title":"Fast Forward and Rewind are practically unusable.","text":"I have extremely fast WiFi and I’ve checked multiple devices, but the result is the same: the fast forward and rewind functions are extremely difficult to control.","updated":"2019-05-21T21:49:37-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3884226143","userName":"bethyma","userUrl":"https://itunes.apple.com/us/reviews/id43327216","version":"4.2.0","score":1,"title":"App updates lose log in","text":"Every time the app updates I have to re-enter a password and the app doesn’t recognize the existing password. I’m not going through a reset password process every time I want to open the account.","updated":"2019-03-15T06:44:41-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3524175643","userName":"Seattle Steven D","userUrl":"https://itunes.apple.com/us/reviews/id335752735","version":"4.2.0","score":1,"title":"Current Version is Not Useable","text":"Viewing “My Shows” is no longer useable for anyone who keeps more than a few shows in the list. This version shows what happens when the app developers don’t actually use the app. Worthless.","updated":"2018-12-12T16:10:13-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3453970835","userName":"Aber.Fitch","userUrl":"https://itunes.apple.com/us/reviews/id36350817","version":"4.1.0","score":1,"title":"Mostly broken","text":"It will let me change channel using the digital remote but when I go to a show and hit watch live on tv it just makes the existing channel on my tv refresh. Doesn’t change the channel.","updated":"2018-11-24T00:19:35-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3648310696","userName":"JLO1977","userUrl":"https://itunes.apple.com/us/reviews/id21937033","version":"4.2.0","score":2,"title":"Often doesn’t work!","text":"This app is so frustrating. It often stops working or streams slowly for no reason, every update is worse. Frustrating!","updated":"2019-01-13T23:59:32-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1994909485","userName":"Madison Johnston","userUrl":"https://itunes.apple.com/us/reviews/id3491647","version":"3.7.8","score":3,"title":"Would rate higher but","text":"I am constantly running into issues with out of home streaming.","updated":"2017-12-13T21:13:36-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5196683273","userName":"O'Sullivan's","userUrl":"https://itunes.apple.com/us/reviews/id833954509","version":"4.2.0","score":1,"title":"Constantly tells me I can't stream away from home network when I'm at home.","text":"Havent been able to stream to devices in the household on the same network for months. Androids, Apples, Chromebooks, PCs. All junk.","updated":"2019-11-25T11:46:56-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3874984450","userName":"Snicks9","userUrl":"https://itunes.apple.com/us/reviews/id105746355","version":"4.2.0","score":1,"title":"Wow - stopped working completely","text":"I have used this app for years and I’m incredibly disappointed that it has stopped working completely...just sits in opening blue screen with the bar moving across the top. Please fix it soon!","updated":"2019-03-12T19:25:53-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3799188471","userName":"HawkAz1","userUrl":"https://itunes.apple.com/us/reviews/id37745213","version":"4.2.0","score":1,"title":"Latest version unstable","text":"Normally, i love this ap, but it stopped working on my phone and has stopped working on my ipad now as well. It wont open unless i go into airplane mode which allows me to see current recordings, but i can download any new ones.","updated":"2019-02-21T20:04:21-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3154597907","userName":"CCRussell","userUrl":"https://itunes.apple.com/us/reviews/id179305583","version":"3.7.9","score":2,"title":"Hard to use","text":"You can’t select a date in the future easily, that date picker doesn’t work. That makes it a pain to use to set up recordings","updated":"2018-09-04T21:34:25-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3340182820","userName":"Best-offer","userUrl":"https://itunes.apple.com/us/reviews/id167246835","version":"4.1.0","score":1,"title":"Don’t update!!!","text":"I can no longer stream on any device- iPhones and iPads. You can no longer pause a download and then resume. Please fix!!  “Problem streaming” is all that is displayed.  I’ve spent hours trying to fix. Very disappointed. 😔","updated":"2018-10-24T18:46:10-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"8023784827","userName":"bl@ckd0g","userUrl":"https://itunes.apple.com/us/reviews/id100019545","version":"4.6.1","score":1,"title":"Moronic UX","text":"Not sure why they thought it was a good idea to use the same image thumbnail as episode recordings under a specific show under My Shows. Stupid and hard to navigate. What happened to this company? Embarrassing.","updated":"2021-11-14T08:43:20-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5621384045","userName":"dean l c","userUrl":"https://itunes.apple.com/us/reviews/id9118560","version":"4.4.1","score":1,"title":"Awful app","text":"I can’t connect to stream unless I delete the app and reload it. But then closing an reopening the app causes the same problem. And deleting the app deletes any previously downloaded shows.","updated":"2020-03-05T15:48:53-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5613481998","userName":"jsen56","userUrl":"https://itunes.apple.com/us/reviews/id137971623","version":"4.4.1","score":1,"title":"The worst app ever!!!!!!!","text":"Sometimes it works but usually it is a crap shoot as to whether I can even sign in let alone download a show. And if I succeed in downloading it won’t let me watch it! Just ridiculous for 2020.","updated":"2020-03-03T20:51:37-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3233662464","userName":"MoHudd","userUrl":"https://itunes.apple.com/us/reviews/id174708956","version":"3.7.9","score":1,"title":"Can’t log in...","text":"As of today the app says my email or password is wrong, but it allows me to login on the website. I changed the password and again it is recognized on the website but not my iPhone or iPad. This is with iOS 12.","updated":"2018-09-26T15:54:35-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3953930036","userName":"bmathers","userUrl":"https://itunes.apple.com/us/reviews/id20182224","version":"4.2.0","score":1,"title":"Streaming doesn’t work anymore","text":"Used to work...but stopped working a few releases ago. Very frustrating. Does the app team do any sort of QE before releasing updates?? I can stream using Chrome on my phone, but the app won’t let me stream. Terrible app.","updated":"2019-03-31T19:23:42-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1938399722","userName":"PapaSas","userUrl":"https://itunes.apple.com/us/reviews/id256770762","version":"3.7.8","score":4,"title":"New customer","text":"Very satisfied with app. Viewing the app on my iPad makes programming convenient. I am enjoying all the possibilities.","updated":"2017-11-21T14:41:59-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3347978373","userName":"Ed abcdefghijkl","userUrl":"https://itunes.apple.com/us/reviews/id24529959","version":"4.1.0","score":1,"title":"New app is terrible","text":"Help!!!  How do we go back to the old app. Downloads don’t sort properly and there is no way to change sorting.  Trying to stream is difficult. Please let us go back to the old app until you figure this out.","updated":"2018-10-26T18:59:47-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1895942153","userName":"Stormcow","userUrl":"https://itunes.apple.com/us/reviews/id406595050","version":"3.7.7","score":1,"title":"Slow and flakey","text":"When things are perfect, downloads are painfully slow. But usually they aren’t, and connections get dropped and it freezes up. Every other app thinks my connection and iPad are pretty fast and reliable.","updated":"2017-11-03T21:43:05-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3037945064","userName":"eastwest6566","userUrl":"https://itunes.apple.com/us/reviews/id130205735","version":"3.7.9","score":4,"title":"It’s Gotten Better But Has a Little Farther to Go","text":"The app freezes less, but what would be great is, if the app allowed you to create a WISHLIST.","updated":"2018-08-08T18:21:50-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4079127215","userName":"sherishul","userUrl":"https://itunes.apple.com/us/reviews/id37631449","version":"4.2.0","score":1,"title":"Worst app I have","text":"The app looks like should work great but there is always connection problems even when my WiFi network is working perfectly. It is so frustrating to use I am going to delete it.","updated":"2019-04-29T20:49:25-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3513952034","userName":"Waukegan guy","userUrl":"https://itunes.apple.com/us/reviews/id184703846","version":"4.1.0","score":2,"title":"New version miss step","text":"New version lost the +30 second jump feature. Why? It was great for speed watching football. Please bring back.","updated":"2018-12-09T19:01:18-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2525823301","userName":"5Bingers","userUrl":"https://itunes.apple.com/us/reviews/id548794535","version":"3.7.9","score":4,"title":"Easy to Use","text":"Great app to have when I forget to record at home. Very easy to use.","updated":"2018-05-09T16:31:22-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6344366401","userName":"Av8rmum","userUrl":"https://itunes.apple.com/us/reviews/id5897126","version":"4.6.0","score":1,"title":"Worthless","text":"This app is crap. Every time I open it , it spins to reconnect.  Can never get anywhere because of it.   Fix it. Don’t worry about updated features as you can never get to use them.  Reconnecting .....  grrr","updated":"2020-08-21T02:52:07-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5364385252","userName":"RNP1968","userUrl":"https://itunes.apple.com/us/reviews/id13492340","version":"4.4.1","score":1,"title":"Never able to connect","text":"The app continually gives a sign in error and is never able to connect to the box successfully.","updated":"2020-01-05T06:38:47-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4430123094","userName":"Katlady123","userUrl":"https://itunes.apple.com/us/reviews/id258981277","version":"4.2.0","score":1,"title":"It won’t even open","text":"You log in and a blue line starts going across the top and it will not open. I have left it working for 15 minutes, still nothing. Have tried on my iPhone 7 and my iPad Pro.","updated":"2019-07-08T07:50:15-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1905115736","userName":"nflyt12","userUrl":"https://itunes.apple.com/us/reviews/id33612004","version":"3.7.7","score":2,"title":"Fix this","text":"The last update caused me to only be able to stream recordings in progress and not shows that have been recorded. Please fix this.","updated":"2017-11-07T19:16:30-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3448618173","userName":"Cardinaj2","userUrl":"https://itunes.apple.com/us/reviews/id24907630","version":"4.1.0","score":1,"title":"Slow","text":"Still slow. Why does it take so long to load the guide?\n\nStreaming doesn’t work either. After the app told me it successfully setup streaming, I tried to watch something on my iPad and nothing happens.","updated":"2018-11-22T14:34:46-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5335569712","userName":"mcmarmee","userUrl":"https://itunes.apple.com/us/reviews/id17994941","version":"4.4.1","score":2,"title":"Works occasionally","text":"When it opens,  emphasis on WHEN, it shows the channel lineup. Any other functions are continually buffering.","updated":"2019-12-29T10:20:44-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6524987043","userName":"CoasterFamily","userUrl":"https://itunes.apple.com/us/reviews/id37812692","version":"4.6.1","score":1,"title":"Slow, won’t stay logged in","text":"The app is slow and hard to use. Which would be fine if I didn’t have to log in every time I used the app.","updated":"2020-10-11T11:53:54-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4861165326","userName":"Nise-nise","userUrl":"https://itunes.apple.com/us/reviews/id87326511","version":"4.2.0","score":2,"title":"Poor Connection","text":"Every time you try to schedule a show or look at the TV guide it can’t load the programming.  The app used to be so easy to use, now it’s a constant headache.","updated":"2019-09-29T11:23:26-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3787216004","userName":"Mattron5000","userUrl":"https://itunes.apple.com/us/reviews/id391083633","version":"4.2.0","score":2,"title":"Missing simple things","text":"Aside from the fact it cannot remember my login.  You can't skip comericals for shows that you can on the physical box.","updated":"2019-02-18T19:17:03-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4237857726","userName":"Ruthye","userUrl":"https://itunes.apple.com/us/reviews/id34653771","version":"4.2.0","score":1,"title":"My downloads is terrible","text":"Hardly ever works now!Overall the interface looks much better but the my downloads is terrible. Needs to be back to list form not one long list. Makes no sense.","updated":"2019-05-30T18:52:41-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2220418034","userName":"antoniot","userUrl":"https://itunes.apple.com/us/reviews/id10352924","version":"3.7.8","score":2,"title":"Slow performance","text":"The guide portion of the app takes too long to load, even on the latest iPhone available.","updated":"2018-02-17T20:28:56-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3441502680","userName":"JDC596","userUrl":"https://itunes.apple.com/us/reviews/id179596171","version":"4.1.0","score":1,"title":"Please rewind to the prior version","text":"I travel a lot for work and have relied on downloaded shows to make flying bearable.  This version has ruined the download functionality.  Please make the old version available in the App Store. Thank you","updated":"2018-11-20T17:00:16-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2700274742","userName":"StatusKuoman","userUrl":"https://itunes.apple.com/us/reviews/id18029622","version":"3.7.9","score":4,"title":"Great for travel","text":"I travel a lot an this app is great.  I’d rate this a 5 star if they had commercial skip and 2x play w/audio in the app.","updated":"2018-06-15T09:06:45-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2201365812","userName":"Carl Thunder","userUrl":"https://itunes.apple.com/us/reviews/id172499978","version":"3.7.8","score":2,"title":"Bugs","text":"Do you even care about this app?  If so, prove it by fixing the many issues.  Oh and how about supporting other iPhone size classes.  I’ll give you another star for iPhone X support.","updated":"2018-02-12T18:33:04-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3884846708","userName":"Hazelnus","userUrl":"https://itunes.apple.com/us/reviews/id34485382","version":"4.2.0","score":1,"title":"Trash.  Consistently downgraded","text":"This app has been less and less reliable with streaming since it's inception.   And they still find ways to make it less user friendly.    Get the streaming fixed!!","updated":"2019-03-15T10:10:09-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3596164205","userName":"theshutterbug","userUrl":"https://itunes.apple.com/us/reviews/id34518523","version":"4.2.0","score":1,"title":"Clunky now","text":"The latest update has made the app much less intuitive. I just wanted to watch a live show on TV but it defaults to recording the selected show now. And getting to the remote seems to require my effort.","updated":"2018-12-31T08:08:57-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3525001440","userName":"CyberBob859","userUrl":"https://itunes.apple.com/us/reviews/id37844733","version":"4.2.0","score":1,"title":"What the heck happened?","text":"The app now takes forever to load, can’t seem to find an Internet connection (even though other apps work fine) and is just extremely sluggish.   Garbage","updated":"2018-12-12T22:11:14-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3406226883","userName":"Almooga","userUrl":"https://itunes.apple.com/us/reviews/id302212144","version":"4.1.0","score":1,"title":"Not An Improvement","text":"I find the latest update lacking. Won't remember password. Certain features previously used have been lost or else I am able to find them. Not pleased.\nSo bad I stopped using it.","updated":"2018-11-11T06:15:16-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1945200466","userName":"Vikt8864","userUrl":"https://itunes.apple.com/us/reviews/id104787793","version":"3.7.8","score":2,"title":"Streaming video with Apple divices","text":"Good concept, but locks up frequently in use.  Very frustrating over many years.  Would love to have app that works reliably most of the time.","updated":"2017-11-24T04:58:55-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2399059135","userName":"Topangajack","userUrl":"https://itunes.apple.com/us/reviews/id514402163","version":"3.7.9","score":2,"title":"No longer works","text":"After updating, I am no longer able to login to my account which renders this app useless.","updated":"2018-04-08T10:31:11-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1890018440","userName":"The Manosteel","userUrl":"https://itunes.apple.com/us/reviews/id135482747","version":"3.7.7","score":3,"title":"3 star for how often it works","text":"Shows will start playing about 3 out of 5 times on my iPhone 6 plus w/ bolt +","updated":"2017-11-01T07:52:18-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"8085474256","userName":"Ric Porath","userUrl":"https://itunes.apple.com/us/reviews/id35887467","version":"4.8.1","score":1,"title":"App does not work anymore","text":"Please fix this app! Ever since the latest update it works maybe 5% of the time. Takes forever to find the server and connect.","updated":"2021-12-01T19:26:38-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3999736894","userName":"Cuthbert101","userUrl":"https://itunes.apple.com/us/reviews/id39370741","version":"4.2.0","score":1,"title":"Failure","text":"Consistently fails to provide current information although sign-in is successful and it claims to be connected to my Bolt.  It used to be very reliable and I could add programs to be recorded and make changes on my iPad remotely, but now it is useless.","updated":"2019-04-11T11:14:04-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3524453235","userName":"SKT71","userUrl":"https://itunes.apple.com/us/reviews/id38064737","version":"4.2.0","score":1,"title":"Why make it more complicated?","text":"Latest update makes if unnecessarily complicated. Older version was much easier to use. Keep it simple and clean!  I won’t even use the app now unless I absolutely have to.","updated":"2018-12-12T18:08:33-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3425754630","userName":"anonomously yours 1","userUrl":"https://itunes.apple.com/us/reviews/id936066167","version":"4.1.0","score":1,"title":"Anonymously","text":"The new update is not friendly, so much harder to see and navigate, this update is very bad, go back to the old one, much friendlier. The new update is so hard to understand and see what is going on. Very poor update!","updated":"2018-11-16T14:22:25-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3359473840","userName":"RW_DC","userUrl":"https://itunes.apple.com/us/reviews/id18912278","version":"4.1.0","score":1,"title":"Horrible new interface","text":"I liked the old version of the app, but with the latest revision, the new interface is horrible. Much less user-friendly than the old version.","updated":"2018-10-29T18:48:17-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3304790875","userName":"Tibunekubda","userUrl":"https://itunes.apple.com/us/reviews/id86055951","version":"4.1.0","score":1,"title":"Horrible","text":"Doesn’t remember login info \nCopy/paste from my password safe didn’t work because switching apps cleared everything \nDownloaded shows has no organization!  Not grouped even by show \n\nEvery time they update this app they take features away and make it worse\n\nFind more every time I use it: \n\n“Recently deleted” is sorted alphabetically and not by date. So I can’t really see what was most recently deleted!","updated":"2018-10-15T06:49:32-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3280833380","userName":"Mark N Florida","userUrl":"https://itunes.apple.com/us/reviews/id85938065","version":"3.7.9","score":1,"title":"No Longer Streams With IOS 12","text":"We used to stream and download shows to watch on our iPads. Since the update no longer works. The last update was 7 months ago. Poor customer support.","updated":"2018-10-09T00:35:12-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2175814552","userName":"Duuuumb","userUrl":"https://itunes.apple.com/us/reviews/id4211079","version":"3.7.8","score":2,"title":"Ugh","text":"Big company, popular service, terrible app. Constantly being signed out to the point the only fix is to delete the app and reinstall.","updated":"2018-02-06T18:07:51-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3467889822","userName":"free-refil","userUrl":"https://itunes.apple.com/us/reviews/id85305161","version":"4.1.0","score":2,"title":"Constantly signing in","text":"Always having to sign in after updates I suppose?  Very annoying","updated":"2018-11-27T16:19:39-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5350329436","userName":"MarisaGallo","userUrl":"https://itunes.apple.com/us/reviews/id121481092","version":"4.4.1","score":1,"title":"Horrible Update","text":"I can’t see any of my shows on the app, I can’t manage anything that is being recorded, I can’t cancel a OnePass. Everything has disappeared or stopped working.","updated":"2020-01-02T01:19:01-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3226451798","userName":"Fudgie Bear","userUrl":"https://itunes.apple.com/us/reviews/id35837641","version":"3.7.9","score":2,"title":"Still no iPhone X support","text":"The XS is out but the app still doesn’t support the X. If I’m going to buy 4K boxes (with limited 4K support) at least put as much effort into the app as you have into voice search.","updated":"2018-09-24T15:56:49-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3275450255","userName":"Cisco Engineer","userUrl":"https://itunes.apple.com/us/reviews/id39978010","version":"3.7.9","score":3,"title":"It’s just okay","text":"Could have better and faster interfaces. Disconnects a lot and it is not a network issue.","updated":"2018-10-07T13:03:24-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3298470771","userName":"JulieBean81","userUrl":"https://itunes.apple.com/us/reviews/id105474612","version":"4.1.0","score":2,"title":"Latest version is trash","text":"I cannot get the latest version of this app to work for streaming.  It constantly crashes.","updated":"2018-10-13T15:03:19-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1832379973","userName":"DelHovis","userUrl":"https://itunes.apple.com/us/reviews/id221731189","version":"3.7.7","score":4,"title":"Just fine","text":"So far, working just fine","updated":"2017-10-06T23:33:45-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6526890222","userName":"wok-N-roll","userUrl":"https://itunes.apple.com/us/reviews/id102065514","version":"4.6.1","score":1,"title":"Completely broken","text":"App keeps popping up a “reconnecting” box and takes you back to selection screen. Completely unusable.","updated":"2020-10-12T03:35:46-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6468019575","userName":"tbkdjr","userUrl":"https://itunes.apple.com/us/reviews/id173502891","version":"4.6.1","score":1,"title":"New update will delete all saved shows?","text":"Is this correct?  Everything saved on our iPads will be deleted? How can this be?","updated":"2020-09-25T12:17:25-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5748107943","userName":"Gavin'sTechHelp","userUrl":"https://itunes.apple.com/us/reviews/id263539378","version":"4.4.1","score":1,"title":"Can’t even login","text":"The app doesn’t even let me log in on any of my devices anymore. The dvr’s are fine, though this app would make me regret my purchase decision.","updated":"2020-04-01T16:27:46-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5396371436","userName":"Add 263 767 217","userUrl":"https://itunes.apple.com/us/reviews/id222103650","version":"4.4.1","score":1,"title":"New version, not better version","text":"I have one question, Does the person who designed this still have a job? If they do, I hope it’s not designing updates.","updated":"2020-01-12T17:17:43-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4156848516","userName":"Amba A","userUrl":"https://itunes.apple.com/us/reviews/id36358651","version":"4.2.0","score":1,"title":"Hello? Is this thing on?","text":"As of today, there hasn’t been an update in 5 months which tells me developers don’t care about this app. The app hardly opens and is pretty much not functional. It’s sad and a disappointment.","updated":"2019-05-15T19:34:38-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3627441853","userName":"Tonyacls","userUrl":"https://itunes.apple.com/us/reviews/id35246382","version":"4.2.0","score":1,"title":"Have not been able to get in for months","text":"Uninstalled and reinstalled and still nothing. Have not been able to sign in for months. Absolutely the worst.","updated":"2019-01-08T11:44:03-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3524324015","userName":"MurphKilter","userUrl":"https://itunes.apple.com/us/reviews/id384676035","version":"4.2.0","score":1,"title":"Terrible update","text":"The update is terrible and ruined the app.  I can’t find one positive (seriously).  And my phone won’t connect to the home network anymore.  Change it or I will be switching providers.","updated":"2018-12-12T17:13:38-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3339200027","userName":"drjburke","userUrl":"https://itunes.apple.com/us/reviews/id27678909","version":"4.1.0","score":1,"title":"What happened?","text":"I use this all the time. This app is no longer user friendly. It keeps losing its connection to my TiVo’s rendering it useless. My downloaded are no longer grouped which is a huge inconvenience. Please fix this ASAP.","updated":"2018-10-24T11:41:51-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3308103364","userName":"MrFlxrho","userUrl":"https://itunes.apple.com/us/reviews/id156428555","version":"4.1.0","score":1,"title":"Bring back the old version","text":"Much less friendly and useful than the previous version. I was very happy with the old one. This is a major step in the wrong direction. Pfui!","updated":"2018-10-16T04:24:51-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3306055413","userName":"knunn","userUrl":"https://itunes.apple.com/us/reviews/id13410255","version":"4.1.0","score":1,"title":"Unfriendly version","text":"The latest update changes everything about this app and makes it not user friendly.  Settings that used to be easy to find are now buried in menus.","updated":"2018-10-15T14:59:19-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3403548721","userName":"Mortgagemasterjc","userUrl":"https://itunes.apple.com/us/reviews/id29578397","version":"4.1.0","score":2,"title":"Latest version no good","text":"Most people are using this as a remote control. There are entirely too many steps to change channels on your tv.","updated":"2018-11-10T14:11:23-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3729266002","userName":"Wolfgang CA","userUrl":"https://itunes.apple.com/us/reviews/id122212261","version":"4.2.0","score":1,"title":"Gets worse and worse","text":"After years of good performance now the app sometimes hangs and needs to get uninstalled. If it works it requires often new login. Why to make things that work so much wors?","updated":"2019-02-03T09:02:30-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6339130956","userName":"llm987654321","userUrl":"https://itunes.apple.com/us/reviews/id210579102","version":"4.6.0","score":1,"title":"Still not working on iPad","text":"At least 6 months and several updates later, still unable to view shows on my iPad.  App is USELESS.","updated":"2020-08-19T16:03:41-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1977628977","userName":"TheOtherShopTillUDrop","userUrl":"https://itunes.apple.com/us/reviews/id120919059","version":"3.7.8","score":2,"title":"Lost Streaming Capabilities","text":"I used to love this app. Just tried to watch on my iPhone and it gives me an error message. Mad since my hotel room has a crappy tv.","updated":"2017-12-07T06:49:50-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5841880157","userName":"hjgtgfgh","userUrl":"https://itunes.apple.com/us/reviews/id815216776","version":"4.5.0","score":1,"title":"Last version","text":"The last version doesn’t let me stream from my phone. I updated the app and now I can’t watch my shows","updated":"2020-04-20T21:57:40-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4875629690","userName":"seattlechick","userUrl":"https://itunes.apple.com/us/reviews/id34063751","version":"4.2.0","score":1,"title":"Hope you have one newer than 4 years...","text":"Well you apparently have to have one newer than 2015 to be able to watch your recorded shows on the app. Another way to make money. 😡","updated":"2019-10-02T17:48:31-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4590684820","userName":"Brock Schmickley","userUrl":"https://itunes.apple.com/us/reviews/id185338943","version":"4.2.0","score":1,"title":"Horrible","text":"When it’s working, which is spotty, the user interface is horrible, both downloaded shows and the guide. Previous version was much better.","updated":"2019-08-09T05:05:36-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4374613187","userName":"Bossofthewine","userUrl":"https://itunes.apple.com/us/reviews/id147776732","version":"4.2.0","score":1,"title":"What a piece of crap","text":"This app used to be halfway decent until some monkey decided to revise and redesign it into a worthless waste. You cant even change channels from the guide any longer.  Don’t waste your time with this piece if garbage","updated":"2019-06-26T18:21:20-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3851317588","userName":"AtomicGeeks","userUrl":"https://itunes.apple.com/us/reviews/id147359350","version":"4.2.0","score":3,"title":"Not working on New XS Max","text":"Latest version does not work on iPhone Xs. Max. I am not sure what’s wrong. I removed it and reinstalled and unfortunately no success.","updated":"2019-03-06T18:27:48-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3330878824","userName":"Eddaaayyy","userUrl":"https://itunes.apple.com/us/reviews/id41357322","version":"4.1.0","score":1,"title":"What happened...","text":"Pretty much the same issues as everyone else. This new overhaul is absolute garbage. The old app was incredible, so easy to use. I can barely get on this to record a show. Please for the love of god fix this.","updated":"2018-10-22T06:26:33-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2829658014","userName":"Busted Flush","userUrl":"https://itunes.apple.com/us/reviews/id43603014","version":"3.7.9","score":1,"title":"Completely quit working","text":"I can log on from desktop but no longer from iPhone or iPad. Can’t change password on phone/pad. Can’t get past log in screen. Not an old phone. New iPad.","updated":"2018-07-03T11:59:24-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1853382091","userName":"dsmed90","userUrl":"https://itunes.apple.com/us/reviews/id353310694","version":"3.7.7","score":2,"title":"iOS 11 unable to stream With Bolt","text":"Upgraded my iPhone and iPad to iOS 11 and now unable to stream remotely on either devices. Prior to the update everything was good. T","updated":"2017-10-16T11:30:40-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"7997750509","userName":"TashTish","userUrl":"https://itunes.apple.com/us/reviews/id25565708","version":"4.6.1","score":2,"title":"No update for a year","text":"Doesn’t that one thing exemplify everything?","updated":"2021-11-07T00:39:21-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4739233189","userName":"Feltonk","userUrl":"https://itunes.apple.com/us/reviews/id118659992","version":"4.2.0","score":2,"title":"Crap","text":"Not sure which is worse...this app or the actual remote!  Constantly having to restart the router, the machine and the phone!","updated":"2019-09-06T19:42:44-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3682217562","userName":"Tech savvy enough","userUrl":"https://itunes.apple.com/us/reviews/id165710497","version":"4.2.0","score":2,"title":"Can’t turn off close caption","text":"Can’t turn off the Closed Caption. Now have to delete app and reload and lose all programs on phone? Ugh","updated":"2019-01-22T09:27:21-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3726131625","userName":"ndgirlinks","userUrl":"https://itunes.apple.com/us/reviews/id43620422","version":"4.2.0","score":1,"title":"Horrible","text":"I can’t even get into the app to use it horrible please go back to the old version it worked way better than it does now and even then it’s sucked","updated":"2019-02-02T15:32:12-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1810137821","userName":"Thegreatpatzby","userUrl":"https://itunes.apple.com/us/reviews/id187960590","version":"3.7.7","score":2,"title":"Streaming still not working in this version","text":"Good for finding and scheduling shows. Streaming to iOS devices still not working for me.","updated":"2017-09-25T19:34:39-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2261133805","userName":"RedRocker777","userUrl":"https://itunes.apple.com/us/reviews/id41440945","version":"3.7.8","score":4,"title":"Update fixed all my stuff","text":"Works well. Could badly use iPad PIP ability.","updated":"2018-03-01T18:35:18-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2112712785","userName":"Science rules","userUrl":"https://itunes.apple.com/us/reviews/id31875183","version":"3.7.8","score":1,"title":"Log in fails","text":"Tried many times but the app just won’t work. Have the latest update. I can log onto the site so I know my information is correct and that it is the app.","updated":"2018-01-21T12:36:54-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1924056331","userName":"bbenj556","userUrl":"https://itunes.apple.com/us/reviews/id493633521","version":"3.7.8","score":1,"title":"Closed Captioning Stuck ON","text":"Closed captioning is stuck on even when you toggle it off. It makes shows un watchable because of the distraction. This has been going on for a year without at fix.","updated":"2017-11-15T19:10:59-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5509471818","userName":"Homeowner in NJ","userUrl":"https://itunes.apple.com/us/reviews/id38673135","version":"4.4.1","score":2,"title":"Constantly crashes. Cannot connect.","text":"Need to fix the issues ASAP.","updated":"2020-02-09T11:09:45-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3069609971","userName":"Bobbikk","userUrl":"https://itunes.apple.com/us/reviews/id23533407","version":"3.7.9","score":2,"title":"Doesn’t always work","text":"Buffers all the time. Hard to watch a show because it’s constantly stopping.","updated":"2018-08-15T14:42:00-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5460356979","userName":"CM-2947","userUrl":"https://itunes.apple.com/us/reviews/id22558778","version":"4.4.1","score":1,"title":"Bad app","text":"The app has gotten worse and more buggy over time and updates. TiVo’s inability to provide a good user experience is the reason will cut cable and just stream.","updated":"2020-01-28T17:06:04-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3638504998","userName":"Ashrhbvdhh","userUrl":"https://itunes.apple.com/us/reviews/id351642637","version":"4.2.0","score":1,"title":"How incompetent are these programmers?","text":"The app keeps losing my login info, I have to re-enter it every few uses! With the latest version, when I set a recording it runs it on the SD channel instead of the HD channel I set it on. How stupid!","updated":"2019-01-11T11:05:11-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3595202249","userName":"SithLrd","userUrl":"https://itunes.apple.com/us/reviews/id26253268","version":"4.2.0","score":1,"title":"Embarrassment","text":"The coders for this app should give up their keyboards.  The disconnects are constant, and the app hasn’t been updated for the latest resolutions for the 2018 iPad Pro.\n\nOne more reason to never pay for cable again","updated":"2018-12-31T03:03:34-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3535373915","userName":"Jruggs","userUrl":"https://itunes.apple.com/us/reviews/id104354077","version":"4.2.0","score":1,"title":"Go back to the old way","text":"No remote option since the update. This couldn’t have been one of the worse updates in the App Store history","updated":"2018-12-15T17:07:50-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2451788003","userName":"Elvis98","userUrl":"https://itunes.apple.com/us/reviews/id29275625","version":"3.7.9","score":1,"title":"Old, doesn’t work","text":"Interface is severely outdated and doesn’t fit modern phones.  Even if I look past that (which is hard), the app doesn’t let me stream outside of my home network.","updated":"2018-04-21T18:16:18-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3520639276","userName":"v3lasco","userUrl":"https://itunes.apple.com/us/reviews/id41320422","version":"4.2.0","score":1,"title":"4.2 update is horrible","text":"So when y’all finally updated the app from the old version it was great but this new update, version 4.2 is absolutely horrible. It’s slow, buggy and unresponsive.","updated":"2018-12-11T16:02:45-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3299433628","userName":"Evy720","userUrl":"https://itunes.apple.com/us/reviews/id196746827","version":"4.1.0","score":2,"title":"Remote??","text":"What happened to the remote in the update?  Was fine until that was removed.","updated":"2018-10-13T21:25:59-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1811557346","userName":"hsohar","userUrl":"https://itunes.apple.com/us/reviews/id196715735","version":"3.7.7","score":4,"title":"Great Little App.","text":"Love the way it works on my iPhone just a little cantankerous occasionally.","updated":"2017-09-26T13:21:37-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6866764448","userName":"rgghutggjjhfch","userUrl":"https://itunes.apple.com/us/reviews/id160549778","version":"4.6.1","score":1,"title":"Bad app","text":"App has major issues when trying to stream outside of home.  That’s when i want to use it the most. Constant error. App is useless!!","updated":"2021-01-13T16:52:39-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5763825669","userName":"luroropa","userUrl":"https://itunes.apple.com/us/reviews/id270946039","version":"4.4.1","score":1,"title":"Worst entertainment app","text":"This app has always been slow and clunky. Now it takes forever to log me in to my Bolt., or it errors out. I’m so over it.","updated":"2020-04-04T18:07:25-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4833699596","userName":"AnneSchott","userUrl":"https://itunes.apple.com/us/reviews/id283395912","version":"4.2.0","score":1,"title":"App has been bad for years","text":"It’s an exercise in frustration every time I have ever used it. It doesn’t remember your user name and password when updated. It’s slower than molasses in January and always has been. Bad. Bad. Bad.","updated":"2019-09-24T16:21:29-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4250206249","userName":"mynameismichael","userUrl":"https://itunes.apple.com/us/reviews/id33697401","version":"4.2.0","score":1,"title":"Completely unusable now","text":"Unstable, unable to login due to network error, and otherwise unusable. This was fine a few months ago. What is going on?","updated":"2019-06-02T00:37:16-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3971174748","userName":"Spdracer888","userUrl":"https://itunes.apple.com/us/reviews/id19080183","version":"4.2.0","score":1,"title":"What a joke!","text":"App works intermittently at best.  What was once a great company with a terrific product has descended into oblivion.  Tech support is horrendous, product quality is crap and this “helpful” app is nothing but helpful...you’ll be lucky if works intermittently.","updated":"2019-04-04T21:39:11-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3959859193","userName":"SGinSocal","userUrl":"https://itunes.apple.com/us/reviews/id645551897","version":"4.2.0","score":1,"title":"Non functional for months","text":"The app was marginally functional but about 3 months ago it died entirely.   The fact that we are still waiting for an update is unbelievable.","updated":"2019-04-02T05:49:30-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3651689770","userName":"DydekD","userUrl":"https://itunes.apple.com/us/reviews/id141636267","version":"4.2.0","score":1,"title":"Go back to your roots","text":"For the past two years, the quality of the application has been in steady decline. The UI is ever more confusing, the app does not keep personal preferences. I wish I could downgrade.","updated":"2019-01-14T21:55:41-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1851761371","userName":"BESTiCAN","userUrl":"https://itunes.apple.com/us/reviews/id24878173","version":"3.7.7","score":1,"title":"Genuinely awful","text":"Constant crashes and not enough functionality to make putting up with the bugs to make it worth your while.","updated":"2017-10-15T19:30:24-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1851652651","userName":"Jhfafjbg","userUrl":"https://itunes.apple.com/us/reviews/id109462268","version":"3.7.7","score":1,"title":"Bad to worse","text":"The app was rough before the new apple update. It would randomly freeze, restart,etc. Now it doesn’t appear to be working at all. Don’t advertise this steaming capability if it doesn’t work....","updated":"2017-10-15T18:16:06-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5404585019","userName":"Disgruntle 1010","userUrl":"https://itunes.apple.com/us/reviews/id30860242","version":"4.4.1","score":1,"title":"Worst ever","text":"It’s obvious that this company doesn’t care about app support. My app won’t even connect unless  I sign off and resign on every time in order for it to work.","updated":"2020-01-14T17:45:08-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3378014254","userName":"vanessaroxanne1991","userUrl":"https://itunes.apple.com/us/reviews/id811983600","version":"4.1.0","score":1,"title":"Hate new update!","text":"Ever since the app has been updated every single time I open up the app it resets the box. 😡 I can’t set a recording when I’m away from home anymore either.","updated":"2018-11-03T17:39:37-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3359527371","userName":"UMich99","userUrl":"https://itunes.apple.com/us/reviews/id16992807","version":"4.1.0","score":1,"title":"Net version - what a disaster.","text":"Get you ___ together - who tested this? You got rid of so much functionality. It’s been 3 weeks now - what are you guys doing. Please fix ASAP. Read the reviews - everyone is saying the same thing. Ugh!!!","updated":"2018-10-29T19:10:23-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3297353462","userName":"driverwannabe","userUrl":"https://itunes.apple.com/us/reviews/id28630575","version":"4.1.0","score":1,"title":"Updated app doesn’t work","text":"Password issues. Reset fails. Channel list only goes to channel 99! Search fails. Poor release. Can’t get to my programs at all via phone or app!","updated":"2018-10-13T08:07:20-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1911981367","userName":"WLF1","userUrl":"https://itunes.apple.com/us/reviews/id102885331","version":"3.7.8","score":1,"title":"Doesn’t work!","text":"Used to be my go to tv app. Has’t worked in over a month now. Have contacted app for update and fix solution but nothing back. Don’t recommend at this time!","updated":"2017-11-10T16:57:08-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1784225020","userName":"DLC_eleven","userUrl":"https://itunes.apple.com/us/reviews/id123027052","version":"3.7.7","score":1,"title":"New version crashes when opening","text":"It used to work well, but I just updated to the newest version, and now it crashes on the \"Connecting...\" screen.","updated":"2017-09-10T17:12:49-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"8097561337","userName":"Tom8oliver","userUrl":"https://itunes.apple.com/us/reviews/id8335399","version":"4.8.1","score":1,"title":"Tom Oliver, Washington","text":"Wow, this app is really terrible. I’ve spent multiple afternoons with TiVo’s tech support only to have it quickly revert to the dreaded, endless “Reconnecting” message. I’m giving up —it’s just not worth it.","updated":"2021-12-05T04:09:50-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6843798605","userName":"stormygirlwm","userUrl":"https://itunes.apple.com/us/reviews/id37082536","version":"4.6.1","score":1,"title":"Literally doesn’t work","text":"No updates, won’t connect to the service, total piece of crap. Not sure why they even released an app.","updated":"2021-01-07T20:20:55-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4332624790","userName":"Harry910","userUrl":"https://itunes.apple.com/us/reviews/id30920398","version":"4.2.0","score":1,"title":"Crash JUNK AS IT STANDS!!!!","text":"It worked awesome for a long time now it crashes all the time... Tried uninstalling it an installing it but no good still crashes! Please update!!!! Or fix!!!! Bad bad bad!!!!!!! UPDATE! UPDATE! UPDATE! UPDATE! UPDATE! UPDATE! UPDATE! UPDATE! UPDATE! UPDATE! UPDATE! UPDATE! UPDATE! way over due for update!!!!!!!!","updated":"2019-06-17T19:20:11-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4328226281","userName":"guzzer77","userUrl":"https://itunes.apple.com/us/reviews/id39072613","version":"4.2.0","score":1,"title":"Horrible","text":"Do you have people developing your app who doesn’t use your hardware?\n\nI use to love this app while traveling and on my last trip I came very close to deleting this whole app.\n\nAwful","updated":"2019-06-16T21:24:40-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4302222014","userName":"Corillian42","userUrl":"https://itunes.apple.com/us/reviews/id19529655","version":"4.2.0","score":3,"title":"No Air Play","text":"Would be a higher star than if it had an AirPlay feature.","updated":"2019-06-11T18:07:57-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3613514859","userName":"PHT P&L","userUrl":"https://itunes.apple.com/us/reviews/id16859195","version":"4.2.0","score":1,"title":"Love box & service, but new app is a disaster","text":"This new app is just a wreck, please allow subscriber to ditch & return to the old but sturdy edition.  My have deleted & re-installed, re-set log-in details, etc., and nothing seems to work.  Sad !","updated":"2019-01-04T19:44:48-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2413463898","userName":"Broke on MS","userUrl":"https://itunes.apple.com/us/reviews/id536833357","version":"3.7.9","score":3,"title":"Works well but needs a iPhone X update","text":"On the iPhoneX the video is enlarged about 15% cutting off the outside of the picture","updated":"2018-04-12T05:27:01-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3295531769","userName":"Pepinak","userUrl":"https://itunes.apple.com/us/reviews/id153952475","version":"4.1.0","score":1,"title":"Can’t login","text":"Cannot login to the app since the update. I’ve reset my password like has been suggested to no avail. Pretty useless update if you can’t even login to to app in the new version.","updated":"2018-10-12T22:01:22-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"7054471468","userName":"MooneyMan252","userUrl":"https://itunes.apple.com/us/reviews/id21021974","version":"4.6.1","score":2,"title":"Doesn’t Work On iPad","text":"Latest version does not run at all on my iPad.  Works OK on mi iPhone.  I agree with others that the UI is poor at best.","updated":"2021-03-01T15:18:12-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2217528065","userName":"KevinDavis","userUrl":"https://itunes.apple.com/us/reviews/id27596072","version":"3.7.8","score":1,"title":"Can’t change date","text":"There used to be a “done” button in the guide so you could change the date and time. It’s gone. So now you can’t set a future recording.","updated":"2018-02-17T01:22:22-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1783585906","userName":"hlh6983","userUrl":"https://itunes.apple.com/us/reviews/id339237081","version":"3.7.7","score":1,"title":"Absolutely Terrible","text":"This app never works. It's always saying it needs to reconnect but then never reconnects. I've tried deleting it and downloading it again but still nothing. I hate this app.","updated":"2017-09-10T06:24:58-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"8035612885","userName":"h3yrick","userUrl":"https://itunes.apple.com/us/reviews/id8749920","version":"4.8.1","score":1,"title":"Latest Version Hangs Reconnecting","text":"Things were working well until this last update. Unusable now.  Just hangs saying “Reconnecting”","updated":"2021-11-17T20:14:58-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"7555235937","userName":"OC Paul","userUrl":"https://itunes.apple.com/us/reviews/id36118387","version":"4.6.1","score":1,"title":"It’s not this hard","text":"I am on my home network, it drops connectivity while streaming, downloading is awful.","updated":"2021-07-08T19:03:22-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4173379986","userName":"DisappointedRhapCust","userUrl":"https://itunes.apple.com/us/reviews/id3456176","version":"4.2.0","score":2,"title":"Keeps having login failures","text":"Used to be good, but always get login failures now.\nDownloads only work when the app is open.","updated":"2019-05-18T21:49:06-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6413001413","userName":"LSMDJD526815","userUrl":"https://itunes.apple.com/us/reviews/id496667385","version":"4.6.0","score":1,"title":"Never works right","text":"It always takes multiple attempts to set a recording. Never works the first time.","updated":"2020-09-09T17:55:41-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6319962877","userName":"jldubu","userUrl":"https://itunes.apple.com/us/reviews/id28177531","version":"4.6.0","score":1,"title":"Doesn’t work at all","text":"Can’t stream. Can’t download to ipad. Total crap. Oh it works sometimes. But it can almost never connect or stay connected.","updated":"2020-08-14T15:17:07-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5822291668","userName":"ABCagle","userUrl":"https://itunes.apple.com/us/reviews/id494974621","version":"4.5.0","score":1,"title":"Poor performance","text":"I give up. This app is terrible. Most of the time it doesn’t work at all. Needs a ton of improvement.","updated":"2020-04-16T17:52:47-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5350283797","userName":"JaninneG","userUrl":"https://itunes.apple.com/us/reviews/id242385871","version":"4.4.1","score":1,"title":"Updated yesterday","text":"Will not load. It was working perfectly before I updated. Frustrated","updated":"2020-01-02T01:01:41-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5196824206","userName":"Bono227","userUrl":"https://itunes.apple.com/us/reviews/id201956733","version":"4.2.0","score":1,"title":"Terrible App","text":"This app is constantly unable to connect. Error messages, search function is horrendous. Serious update needed.","updated":"2019-11-25T12:44:52-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3316595878","userName":"Worldtraveler100","userUrl":"https://itunes.apple.com/us/reviews/id20242493","version":"4.1.0","score":1,"title":"Terrible now!","text":"As has been said it does not actually work!  Nothing but crashes.\n\nBeyond that all the text and controls like playing slider are now tiny!  Need a magnifying glad to read.  The slider often does not respond to touch.\n\nDeleting a program is now a four step process. Instead of swiping left like all other apps.\n\nThis is why monopolies don’t last forever...","updated":"2018-10-18T11:06:48-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2514158458","userName":"Trinity21532","userUrl":"https://itunes.apple.com/us/reviews/id441070555","version":"3.7.9","score":1,"title":"Doesn't want to stream","text":"It doesn't want to stream to my iPad most of the time. It works great when it works but it hardly does anymore. Please fix.\n\nUpdate It doesn’t work at all anymore. 1 star","updated":"2018-05-06T19:20:25-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6707894939","userName":"deepod7","userUrl":"https://itunes.apple.com/us/reviews/id22657220","version":"4.6.1","score":1,"title":"Frustrating","text":"...to have to log into the app every 30 days. No other app does this, keep us signed in longer or indefinitely. It’s not a banking app for $&)@s sake.","updated":"2020-12-01T18:23:34-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6655493535","userName":"Be True","userUrl":"https://itunes.apple.com/us/reviews/id39772610","version":"4.6.1","score":1,"title":"Can’t even open. What is going on!","text":"Absolute worst!\nI used to Love it. Not so much anymore. Problems. Won’t connect!\nAlways having problems!","updated":"2020-11-17T05:55:54-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5607850374","userName":"Aredubyou","userUrl":"https://itunes.apple.com/us/reviews/id196369218","version":"4.4.1","score":1,"title":"Useless","text":"The current version of the app is useless. When I try searching for a channel or program all I see is an endlessly spinning wheel.","updated":"2020-03-02T14:14:26-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4861929719","userName":"renitajenkins","userUrl":"https://itunes.apple.com/us/reviews/id34552541","version":"4.2.0","score":1,"title":"Previous version was great","text":"This one, not so much. And since I updated to iOS 12.4.1, the app refuses to load. They have not updated it in 9 months. Will it even work with iOS 13?","updated":"2019-09-29T14:33:18-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1849274270","userName":"A. Happy User","userUrl":"https://itunes.apple.com/us/reviews/id18220215","version":"3.7.7","score":2,"title":"Can no longer sign in. Please fix!","text":"The password is correct, but suddenly the app no longer lets me sign in, so useless.","updated":"2017-10-14T16:29:11-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4093838063","userName":"MrSpicoli","userUrl":"https://itunes.apple.com/us/reviews/id265914494","version":"4.2.0","score":1,"title":"Terrible","text":"App is terrible. Can’t connect half the time, the other half the app won’t even open. No updates, non user friendly interface.","updated":"2019-05-03T03:51:12-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3465946206","userName":"Tired of crashing","userUrl":"https://itunes.apple.com/us/reviews/id26013559","version":"4.1.0","score":1,"title":"Does not work offline","text":"I used previous version to watch programs offline. I can no longer do anything with this new version.\nFix it!","updated":"2018-11-27T03:38:14-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"2529188883","userName":"TomMToo","userUrl":"https://itunes.apple.com/us/reviews/id38268518","version":"3.7.9","score":1,"title":"Stopped Working","text":"This app no longer stays connected.  You try to add a program & it says “Away From Home Network”  even though I am on the home network.","updated":"2018-05-10T11:17:52-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5144035036","userName":"Feta cheeeese","userUrl":"https://itunes.apple.com/us/reviews/id48964878","version":"4.2.0","score":1,"title":"What did you people do!?","text":"The latest update broke this app. Can’t wat a show by just finding it in guide anymore. Remote is slow as molasses...it’s just bad.","updated":"2019-11-15T12:13:46-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4277355053","userName":"cfs525","userUrl":"https://itunes.apple.com/us/reviews/id41974785","version":"4.2.0","score":1,"title":"Can no longer log in","text":"Unlike the other platforms, the iPad app no longer lets me log on or reset password. Customer support was far from helpful.","updated":"2019-06-07T04:25:25-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3851322154","userName":"echo.gulf","userUrl":"https://itunes.apple.com/us/reviews/id273587273","version":"4.2.0","score":1,"title":"Stopped working and is useless","text":"It used to be a solid app. Recently, this app stopped working and is completely useless now. It opens but keeps loading endlessly and does nothing.","updated":"2019-03-06T18:29:30-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3593453020","userName":"Akdare","userUrl":"https://itunes.apple.com/us/reviews/id29889331","version":"4.2.0","score":1,"title":"Cannot stream since last update!","text":"Cannot watch anything on my iPad or iPhone since the last app release. Just circles endlessly on “checking activation status”","updated":"2018-12-30T16:26:35-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4555931020","userName":"Greg117Cady","userUrl":"https://itunes.apple.com/us/reviews/id139731391","version":"4.2.0","score":2,"title":"Can’t login using facial recognition","text":"That app constantly logs out on its own, your forced to log back in and can’t use the fingerprint or facial recognition.","updated":"2019-08-02T06:37:15-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5497306466","userName":"gotodoublehockeysticks","userUrl":"https://itunes.apple.com/us/reviews/id181396116","version":"4.4.1","score":1,"title":"Used to be Great","text":"This app used to work great for us.  Suddenly I am told that I have an “incompatible box”.  It's the same box I had this afternoon and suddenly it’s incompatible?  What the heck?","updated":"2020-02-06T17:44:18-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4242917335","userName":"Jadie74","userUrl":"https://itunes.apple.com/us/reviews/id217367285","version":"4.2.0","score":1,"title":"Awful","text":"Haven’t used it in months, but now it simply won’t open and doesn’t work with Comcast streaming. Guess it’s time to just go with the Comcast box ...","updated":"2019-05-31T17:19:38-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3372107724","userName":"grandma Bibi","userUrl":"https://itunes.apple.com/us/reviews/id217453479","version":"4.1.0","score":1,"title":"New version is awful","text":"Ever since latest version update, app no longer recognizes my home network and will not stream in home.  Have reconnected base unit and restarted modem. Ridiculous!","updated":"2018-11-02T05:17:02-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3359656649","userName":"97'sFAN","userUrl":"https://itunes.apple.com/us/reviews/id26606203","version":"4.1.0","score":1,"title":"Won’t let me login???","text":"Since the latest update, I can’t login to the app. I’ve reset the password & even deleted the app....nothing. I can login to the website, but not the app!! 😡","updated":"2018-10-29T20:05:20-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6490026178","userName":"J_Hyde NYC","userUrl":"https://itunes.apple.com/us/reviews/id26881366","version":"4.6.1","score":1,"title":"Constantly requires authentication","text":"The application constantly requires reauthentication, it would be a much, much nicer experience if that could be fixed","updated":"2020-10-01T16:01:01-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5509032135","userName":"dsbenson","userUrl":"https://itunes.apple.com/us/reviews/id290686627","version":"4.4.1","score":1,"title":"No longer works at all","text":"No ability to see or schedule shows. No Guide results. 100% failure","updated":"2020-02-09T08:48:08-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3392777939","userName":"rosewood2424","userUrl":"https://itunes.apple.com/us/reviews/id111449187","version":"4.1.0","score":2,"title":"Hate the new look.","text":"Hate the changes.  Put it back the way it was!  Went from a 5 star to 2.","updated":"2018-11-07T17:00:05-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4054176590","userName":"Lauren1728","userUrl":"https://itunes.apple.com/us/reviews/id20273747","version":"4.2.0","score":1,"title":"Stopped working","text":"Since latest update it either will not load or says there is a network error. Pure crap.","updated":"2019-04-24T06:27:18-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3539535177","userName":"a2what","userUrl":"https://itunes.apple.com/us/reviews/id13076273","version":"4.2.0","score":1,"title":"Doesn’t load","text":"This app doesn’t load just sits at the main screen after login. If you fix it I may change my rating.","updated":"2018-12-16T18:38:26-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"6118301180","userName":"deff673","userUrl":"https://itunes.apple.com/us/reviews/id210398582","version":"4.5.1","score":2,"title":"Cannot access recently deleted videos from app.","text":"Am using Edge and iPad.","updated":"2020-06-24T18:46:22-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3354023827","userName":"Treads99","userUrl":"https://itunes.apple.com/us/reviews/id38991623","version":"4.1.0","score":1,"title":"App doesn’t load since update!","text":"I was a fan of this app before the creators updated it. Now it doesn’t load on either my iPhone or my iPad. Very disappointing. 😡","updated":"2018-10-28T07:01:20-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3301366711","userName":"Pzqsvgggh","userUrl":"https://itunes.apple.com/us/reviews/id195539554","version":"4.1.0","score":1,"title":"Lost features","text":"Do not upgrade to this version. Lost the ability to view upcoming shows - major part of scheduling.","updated":"2018-10-14T08:16:49-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3284167202","userName":"Shilo1973","userUrl":"https://itunes.apple.com/us/reviews/id154232362","version":"4.1.0","score":1,"title":"Don’t bother","text":"Fix the problem with being able to connect it before doing other crap to it.","updated":"2018-10-09T21:35:49-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"1899439612","userName":"JRNinDC","userUrl":"https://itunes.apple.com/us/reviews/id24572122","version":"3.7.7","score":1,"title":"Will not stay connected","text":"Since the last update this app constantly drops the connection. It has become useless.","updated":"2017-11-05T07:20:07-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4198208215","userName":"Not The Attorney","userUrl":"https://itunes.apple.com/us/reviews/id677844756","version":"4.2.0","score":1,"title":"What happened??","text":"Very disappointed in the current version... things that were useful are now gone.  Most unhappy.","updated":"2019-05-23T16:02:08-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3882820070","userName":"dumb1960","userUrl":"https://itunes.apple.com/us/reviews/id377565591","version":"4.2.0","score":1,"title":"Junk app redesign it","text":"Horrible horrible horrible.\n\nLogins required every 2-3 days (loses connection info)\n\nUI has gotten worse, but some mods are nice\n\nToday, the app was hijjacked and SalesForce app and marketing took over the screen... quite shocking... major phishing attach or other penetration.  I uninstalled... reset iPad and then reloaded... same problem appeared.\n\nBottom line:  I do not trust the security of the iPad app","updated":"2019-03-14T22:36:07-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3286601529","userName":"smallville808","userUrl":"https://itunes.apple.com/us/reviews/id40541025","version":"4.1.0","score":3,"title":"Downloads?","text":"What happened to the nice grouping of downloads by show name?   One long list???","updated":"2018-10-10T11:47:04-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3245612420","userName":"executedcupid","userUrl":"https://itunes.apple.com/us/reviews/id121116826","version":"3.7.9","score":1,"title":"Terrible","text":"Haven’t been able to log in for two days. Tried everything. Worthless","updated":"2018-09-29T17:33:16-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"7258349219","userName":"tag8939","userUrl":"https://itunes.apple.com/us/reviews/id221344992","version":"4.6.1","score":1,"title":"Update","text":"Still waiting for the promised update that will delete everything on my iPad?","updated":"2021-04-24T05:06:13-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"4591322495","userName":"J Texas","userUrl":"https://itunes.apple.com/us/reviews/id116812285","version":"4.2.0","score":2,"title":"Undo last update","text":"It’s never been great, but now just a black screen stating reload.  Please fix","updated":"2019-08-09T07:39:42-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"5095326451","userName":"Meglizholly","userUrl":"https://itunes.apple.com/us/reviews/id40268794","version":"4.2.0","score":1,"title":"It won’t load","text":"I can’t get it to load on my iPhone XR. When I tried to alert TiVo’s tech support, their site wouldn’t load either. 😒","updated":"2019-11-06T13:04:41-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3847564317","userName":"cosmic_nerd","userUrl":"https://itunes.apple.com/us/reviews/id15759910","version":"4.2.0","score":1,"title":"Better","text":"By no means perfect but, in my situation, the new version is a lot more stable and the features it does have generally work (unlike the old version).","updated":"2019-03-05T18:24:00-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3730441293","userName":"dberk77","userUrl":"https://itunes.apple.com/us/reviews/id37303917","version":"4.2.0","score":1,"title":"App doesn't work","text":"My login never works on the app, but works on the website. But the website says I can only record using the app. So I can't record remotely..","updated":"2019-02-03T16:34:24-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"},{"id":"3376541780","userName":"jcc2123","userUrl":"https://itunes.apple.com/us/reviews/id25684309","version":"4.1.0","score":1,"title":"New version is terrible","text":"Takes forever to load. Older version much better and easier to use.","updated":"2018-11-03T08:18:59-07:00","url":"https://itunes.apple.com/us/review?id=401673976&type=Purple%20Software"}]