[{"id":"3295283266","userName":"PewaukeeEd","userUrl":"https://itunes.apple.com/us/reviews/id24494724","version":"9.13","score":2,"title":"Meh. Awkward to get to turn a light on or off.","text":"Software usually works but to switch lights in and off, you have to burrow to the system, then a room, then pick lights. Long way to go. If you want to switch another light on or off, back up to the rooms, then down to lights in that room. You can pick favorites, but I don’t see how that short cuts anything.  \n\nC4’s app is somewhat better. Room, lighting, then all lights on the system appear on the same screen. \n\nPlease reorganize and rewrite this app!","updated":"2018-10-12T20:21:36-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1599130425","userName":"Sooo33baaad","userUrl":"https://itunes.apple.com/us/reviews/id24996733","version":"9.12","score":1,"title":"Horrible company - many failures","text":"I remodeled a new home. Bought for $60+K of Lutron gears (Radio Ra2): NOTHING works as promised. They refuse to fix their problems, keep pointing fingers (not our fault, the dealer is the guilty party). I used 3 different dealers: same stories. One of them even took $2K from me to place the order for an automated shade, Lutron apparently canceled him out as a dealer after accepting the order and I never got my $2K bac (nor the shade!!!). Sensors are horrible (don't work as promised - get confused - randomly trigger,..,). Switches have random issues. Some lights stay on 24h a day or don't turn on... believe me you don't want to buy anything from them. The only thing they do well is take your money and tell you it is not their problem...","updated":"2017-04-27T11:14:41-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"3218857262","userName":"AID145864","userUrl":"https://itunes.apple.com/us/reviews/id122029160","version":"9.13","score":1,"title":"Avoid.  Company uses mafia tactics and crap apps","text":"Top engineering. Worst delivery of luxury goods I’ve ever experienced. \n\nFive-digit sum for the Lutron Installation and then apps that keep being rendered obsolete.  Stay away from Lutron unless you’re made of millions and your time (or your staff’s time) means nothing to you. \n\nLutron sits on well-earned patents, stifling competition.  They have good engineering.  You order the product and pay through the nose, only to later be told that any problems you have are due to the customer’s bad planning and the installer’s installation.  And the apps are hit-and-miss.\n\nBut they know they’ve got us all by the balls because the equipment is already installed.  They’ll probably respond to this with a “please contact us to make it right”.  Why should I?  So I can pay $2000 yet again for a 20-minute issue that should’ve been covered in the installation or, at most, cost an extra tenth of that?\n\nNope, won’t contact you or the installation.  I’ll just keep telling others the truth about your business model.  Bait.  Switch.  Cha-Ching.","updated":"2018-09-22T14:50:05-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"5285216655","userName":"metrognomicon","userUrl":"https://itunes.apple.com/us/reviews/id16075338","version":"9.18","score":5,"title":"Save the cloudless app!! Our clients don't want cloud!","text":"This app is massively better than Connect for doing live scene settings.  Lutron, at least let us keep using this app inside the home on the local network!  And our high net worth clients do not want to be on any cloud.  They use Home+ through their VPN and don't need or want to use a cloud they don't control due to security risk. \n\nSave the cloudless app!!","updated":"2019-12-17T17:31:57-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"566678591","userName":"Fqtrvlr","userUrl":"https://itunes.apple.com/us/reviews/id100479965","version":"4.0.2","score":2,"title":"Must use PPTP to connect?! Wow!!!!","text":"What a BS app! I purchased this app thinking that I'd be able to connect to my Radio Ra 2 system via my iPhones IPSEC VPN connection. When I couldn't get the app to connect to my main repeater I realized the brain dead programmers at Lutron only specified the repeater to accept an PPTP connection. You have to buy the router than Lutron specifies in order for this to work which is a Linksys or DLink. Honestly if you can afford to purchase and have a Radio Ra 2 in your house you are more than likely running something more robust than one of these sub $200 routers. This just doesn't make any sense and I hope others take notice because being able to control your lights when your not home is the main appeal of this app and this system. Lutron here is your wake up call - IMPROVE YOUR NETWORKING FUNCTIONALITY! By one very disappointed and loud customer.","updated":"2012-04-19T06:04:01-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"3517930870","userName":"DJ Ren","userUrl":"https://itunes.apple.com/us/reviews/id31152779","version":"9.13","score":1,"title":"Watch App Removed, Why?","text":"Been using the app for 6+ years. Loved the addition of the watch app and not having to fish out my iPhone just to hit a scene button. Now I see it’s gone? Why? I never had an issue or problem, and now, just like that, without warning, it’s gone. Might need to figure out a different solution...\n\nUPDATE: After receiving a response from customer service, I see they want me to spend more money with them and an “installer” just to get back what I already had! I can see now why so many people are dissatisfied with this company.","updated":"2018-12-10T21:35:59-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"3429934064","userName":"LBVandal","userUrl":"https://itunes.apple.com/us/reviews/id35863821","version":"9.13","score":1,"title":"Wish I had gone with cheaper better version","text":"This works with Control 4 to provide terrible consistency.  Presently my Control 4 clock is off and so asking for the blinds to come up at 4pm means they might come up around 5:40 give or take 30 minutes. However on my other set of shades the clock is perfect, so I’m not sure if the blame is Luton or Control 4.  Either way I have to pay $200 to have someone come out to trouble shoot the system.  Wish I had Casita then I could trouble shoot on my own.","updated":"2018-11-17T15:33:00-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"2006553676","userName":"iLikeVancouver","userUrl":"https://itunes.apple.com/us/reviews/id443843665","version":"9.12","score":1,"title":"Horrible Lurton product and software","text":"Too bad I can’t give it 0 starts. Spent a lot of money on this system Radio RA2. Do not buy this system get any Z wave enabled products from Home Depot (GE) and install it yourself. Horrible Lutron software. Works  sometimes and it doesn’t other times. I can’t control the lights in my house through the app. At home or abroad. It asks me to buy a subscription. A complete waste of money.  Lutron doesn’t stand behind their product or support it.","updated":"2017-12-18T06:35:30-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1605942521","userName":"gonzo222","userUrl":"https://itunes.apple.com/us/reviews/id87775626","version":"9.12","score":1,"title":"Good lights, horrible software!","text":"It is amazing to me that lutron, the market leader, allows software like the radioRA app to be released.  This is exactly why they will lose their market position because startups who write good software will totally kill dinosaurs like them!  This stuff is hard to use, is closed architecture, and has to be constantly reset.  I've lost connection many times leaving the remote control value totally zero!  I have to go home and unplug it to reset..","updated":"2017-05-05T09:24:12-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"5863647464","userName":"applereviewsKLH","userUrl":"https://itunes.apple.com/us/reviews/id36382816","version":"9.18","score":5,"title":"Please don’t end support for this app!!","text":"Dear Lutron,\nThis app is so much better than Connect.  We are really bummed that we can’t continue using Home+.","updated":"2020-04-25T14:35:47-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"5053472436","userName":"DPNJ1","userUrl":"https://itunes.apple.com/us/reviews/id23478545","version":"9.16","score":1,"title":"I phone 11","text":"Since I upgraded from I phone 8 to 11 ,I can only control my lights from inside my home while using the app . Before I switched phones I can control my lights and thermostats from anywhere . What is the problem ?","updated":"2019-10-30T18:38:26-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"3201161146","userName":"Bpettit123","userUrl":"https://itunes.apple.com/us/reviews/id290261414","version":"9.13","score":5,"title":"Customer service awesome!","text":"Mike S. in the customer service department went above and beyond! Why to go Mike, thank you!!!","updated":"2018-09-17T18:20:38-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"4473017627","userName":"Bye bye nro","userUrl":"https://itunes.apple.com/us/reviews/id115343489","version":"9.13","score":1,"title":"Subscription expired can’t renew","text":"The app has worked reasonably well. Now trying to do annual renewal, constantly get “can’t reach store now, try again later” for days. Never saw it so hard to spend $59. As for customer service, good luck. On hold forever, never call back.","updated":"2019-07-16T22:03:57-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"6844622760","userName":"supahsaucey","userUrl":"https://itunes.apple.com/us/reviews/id148473946","version":"9.20","score":1,"title":"Text Size is TINY","text":"I woke up to the update and the size of the words are so small I need readers to see them??!! WTH happened to the size of the text? It needs to be larger and or have a way to make it larger.","updated":"2021-01-08T02:30:19-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"3803004868","userName":"dc/va","userUrl":"https://itunes.apple.com/us/reviews/id163498239","version":"9.13","score":1,"title":"Stay away","text":"Installed Radio Ra in two homes. It has been nothing but a headache and can’t find competent installers that are willing/able to fix it. We are now looking to replace what we have and write off a $40k+ investment.","updated":"2019-02-22T18:54:30-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"4374893689","userName":"Wkrp in cincinnati","userUrl":"https://itunes.apple.com/us/reviews/id19154626","version":"9.13","score":1,"title":"Keeps crashing","text":"I am trying to renew the app but first it could not connect to the store and now it opens for a second and then just crashes. Need help.","updated":"2019-06-26T19:55:24-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"4833352061","userName":"Hanky Panky Yankee","userUrl":"https://itunes.apple.com/us/reviews/id29252946","version":"9.15","score":1,"title":"Update this week made system unusable","text":"So much for a bug fix. Now I have no way to control my shades.","updated":"2019-09-24T13:56:37-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"3539193927","userName":"DR732944","userUrl":"https://itunes.apple.com/us/reviews/id40535207","version":"9.13","score":1,"title":"Watch support","text":"Losing support is terrible. Response from Lutron even worse.","updated":"2018-12-16T16:17:17-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"7098536431","userName":"P85DL","userUrl":"https://itunes.apple.com/us/reviews/id158725499","version":"9.21","score":5,"title":"KUDOS","text":"For continuing to support the legacy equipment!!!","updated":"2021-03-13T07:13:49-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"3682551972","userName":"Pinballwizard2012","userUrl":"https://itunes.apple.com/us/reviews/id30232535","version":"9.13","score":1,"title":"No Remote Access!!!!!!!!!!","text":"Will not let me register!!!!!!!!!!!!","updated":"2019-01-22T11:48:35-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"980225191","userName":"Former Lutron Customer","userUrl":"https://itunes.apple.com/us/reviews/id216562273","version":"6.0.0","score":1,"title":"DO NOT DOWNLOAD!","text":"This update removes the features that encompass the entire reason I selected Lutron.  I am now seeking proposals to remove all the RadioRA2 gear, sell it on eBay, and put in any competing system that does not treat their customers like we are incapable of simple tasks.  To be clear, this update removes the feature allowing an end user to tweak the lighting levels in their button panels.  I have scenes and lighting levels that I adjust seasonally.  I have timers and modes that I enable when I travel.  I now am unable to adjust lighting levels for thesis buttons, and am also unable to tell Lutron that I am \"away\" thus enabling my custom timers to mimic the behavior of being home.  I have no idea why Lutron would remove such useful functionality, other than to generate revenue for their installers (who are too busy to come over to make such minor tweaks), or if it's simply that they think the end user is too stupid to handle basic features.  \nThe ability to do these things from the iPad app was highlighted as a key feature in the marketing material and was a primary reason I selected Lutron.  I will never buy another product from them again unless this gets fixed within the next 90 days (the amount of time it will take me to select and schedule an installation of a competing product).  Avoid Lutron, avoid this app,  and best of luck if you are already a member of their proprietary, locked-down pergatory.","updated":"2014-04-20T09:58:36-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"587352772","userName":"ScorpionLeather","userUrl":"https://itunes.apple.com/us/reviews/id103086862","version":"4.0.3","score":3,"title":"Awkward protocols","text":"Lutron has this \"reinvent the wheel\" design philosophy with the RA2 so, although the user interface is very nice, some things end up working worse than average.  To use this app you specify separate telnet logins for the main repeater for each iPhone/iPad. Actually you have to reveal your password to your dealer/installer since Lutron does not release the main repeater programming software to homeowners.  The static IP in the main repeater also can only be changed by the dealer because this is configured by the programming software, so you can't manage your own network without babysitting from your dealer.  Lutron should have implemented a protocol that can share a login with multiple devices (not telnet) and allow the homeowner to enter logins and change static IP without the dealer involved. I got this working on a router with Tomato firmware so this will work across different types of routers. Note: you must configure one of the hardware keypads in the programming software in order to avoid a configuration error, even if the iPad/iPhone is your only keypad. Overall nice system but Lutron has to stop this \"it's not good if it's not invented here\" mentality in their software department.","updated":"2012-05-21T06:44:37-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"788834404","userName":"iSJM","userUrl":"https://itunes.apple.com/us/reviews/id14636958","version":"5.0.1","score":2,"title":"Too slow and expensive","text":"It is too slow to connect. Remember, this is a paid expensive application, not a freebie which it should have been in first place.\n\nIf you can't set up VPN, and want control your system from outside you will need to pay extra $59 per year. Let's face it, this system is for home use and advertised and sold under pretense that you will be able to control your system from anywhere. Technically, it is true but very conveniently left out the fact that it will require VPN which most home user will not have due to dynamic IP and complicated setup. So now after few long years they decided to offer alternative without VPN but with a fee of $59 per year.\n\nAlso, you will have to make sure your RadioRA 2 software is the latest version 6.0 or it will not work. You will have to call your Lutron rep to upgrade the software as they don't let you do that in your own. This will take another 24 hours at least if you are lucky.\n\nUpdate:  just found out about Nest Thermostat. The app for the Nest does not cost anything and there is no yearly fee for remote access.  So if you are looking for remote access for only thermostat there is better and cheaper alternative out there.","updated":"2013-04-15T20:53:09-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"563406347","userName":"Mr. Noah","userUrl":"https://itunes.apple.com/us/reviews/id23191953","version":"4.0.1","score":2,"title":"Much better on iPad","text":"So I love my Lutron system and controlling it from my phone always gets oohs and aahs at partys, however... \nOn the iPad there is a much more useful layout that includes a button called \"whole home\". This allows me to see all light and shade control in one screen.  Unfortunately the iPhone version doesn't have this, so I am forced to continually have to page back to select my room and then individual light control.\nDoesn't sound like a big deal, but when you are controlling over 20 Lutron lights and shades, it gets a bit tedious. \nLutron please add this feature layout to the iPhone version and I'll gladly up my star rating.  Thanks.","updated":"2012-04-13T21:12:49-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"821144267","userName":"CMJ7070","userUrl":"https://itunes.apple.com/us/reviews/id138383694","version":"5.0.11","score":5,"title":"Works as advertised","text":"I am an authorized installer… and I install other audio/video & control equipment.  Everything has an app now and some of them work well.  The good ones are responsive, accurate, and don't crash.  The bad ones provide something less than that. This one works… it provides a level of usability that doesn't exist in the Lutron systems without the app too.\n\nTo the guy that said it didn't work after spending $10k - I say, get a new installer.  Call Lutron - they will provide you a name of a certified installer like myself who can make it work, fix your network, or whatever else it takes.  It's highly unlikely to be an app issue.","updated":"2013-06-15T12:48:41-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1114142512","userName":"bjm5090","userUrl":"https://itunes.apple.com/us/reviews/id12257150","version":"8.0.1","score":4,"title":"This is what the app should have been originally","text":"I decided to wait to review this app until the latest update with the newest features for editing the programming on keypads was released. Since the 8.0 firmware in RA2 and HWQS this app finally lives up to what I expected it to accomplish. As a dealer, installer, programmer it is very exciting that we can finally put full customization into the hands of the homeowner. They love it and it cuts down on service calls. Would have given it 5 stars but the price is still a crime. $20 for the app per plus $60/year for a remote access subscription? Shameful it's gotta be that way.","updated":"2014-12-16T03:48:34-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1325663494","userName":"GoTour","userUrl":"https://itunes.apple.com/us/reviews/id35334180","version":"9.6","score":5,"title":"Must have for RadioRA2 systems","text":"A little bit pricey considering you already paid thousands for your system, but this app is very useful to control your house from your smart devices. It also allows you to add more scenes that would otherwise require an extra keypad/button. The GUI is OK, nothing fancy, but it works well. I use it when I am in bed if I forget lights on or when outside at the pool. Works locally only unless you purchase a DDNS feature from Lutron. If you know how to create a VPN tunel on your home network amd have DDNS, then you can do it yourself.","updated":"2016-01-31T10:30:55-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1171814477","userName":"Zilly Ersh","userUrl":"https://itunes.apple.com/us/reviews/id138820745","version":"8.2","score":2,"title":"Nice idea, bad business model","text":"Useful app on legacy iPhones but expensive. Crashes on 6, 6+. Requires local electrician to upgrade Radio RA 2 firmware, integrate new hardware (light switches, etc), and set up special password to use certain app features. Lutron desperately needs to provide consumers with full feature interface to self manage Radio RA 2 in order to stay competitive. Why nickle and dime consumers when they already paid thousands for hardware and installation? Make the app more consumer centric (free and full feature) and demand for Radio RA 2 products will increase benefiting consumers, electricians, distributors, and Luton. Also, it would be nice if Luton updated the app so it works on current iPhones :)","updated":"2015-03-22T08:49:26-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1198248612","userName":"jeremyclark","userUrl":"https://itunes.apple.com/us/reviews/id22165561","version":"9.0","score":2,"title":"Stopped working, Apple Watch app seems broken","text":"As others have noted, once you install this version the app seems to no longer connect to your Lutron repeaters. I found that doing a hard reset of the main repeater (unplugging for 5 seconds) solved that. The Apple Watch app loads and while I can add specific lights or shades to my Apple Watch \"favorites\" I'm unable to add Scenes for some reason (selection state won't work after it tells you to select an icon), which pretty much renders it useless for my setup. Please fix, Lutron! This will be my most useful Watch App once it works!","updated":"2015-05-16T09:59:22-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1110281622","userName":"Blue and Erin","userUrl":"https://itunes.apple.com/us/reviews/id35136364","version":"8.0.0","score":5,"title":"BEST UPDATE EVER!!","text":"So I've been a fan of our radiora2 system since it was installed about a year and a half ago... And with each update comes minor improvements.  This update has provided the BEST update yet... The ability to add and remove switches from scenes!! In the past, you could only edit the dinner settings of a scene... Now, in addition, you can add or remove specific switches. Almost no need for the software now!!  HUGE THANK YOU for the update Lutron!!","updated":"2014-12-08T21:50:11-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"980768259","userName":"lambil","userUrl":"https://itunes.apple.com/us/reviews/id42313422","version":"6.0.0","score":4,"title":"Worst Update Ever (Updated)","text":"UPDATE: Emailed app support and found out that there now is a switch in the app settings that defaults the edit function to off.  You must go to the Settings page, look for the Home + app and set the edit toggle to on. So far all seems to work.\n\nInstead of adding more functionality they took valuable functionality away. All edit functions have been deleted. Guys you need to get with program.  Do Not Update until they get this fixed.","updated":"2014-04-21T10:50:40-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1059441343","userName":"MAGAV","userUrl":"https://itunes.apple.com/us/reviews/id183689360","version":"6.0.8","score":1,"title":"Swing and a... foul ball","text":"First of all, it needs to be FREE!\n\nLutron, You'll get your $ from those that sign up for remote login. Either that or create in-app purchase to activate scene editing. \n\nFairly easy to use and edit lighting scenes however there isn't a way to add lighting loads to scenes that weren't originally programmed using the configuration software. \n\nHVAC control capabilities are ok but seem to respond wonky. Feedback doesn't always emulate what the Honeywell T-Stat does and sometimes requires 2 button presses. \n\nI REALLY don't like the fact that temperature icons show up in areas that don't have HVAC. Why do I need temperature controls in my Landscape zone?? HVAC icon should only show up in room that has the thermostat!! Not in unrelated rooms. \n\nI also don't like that all controlled devices use a lightbulb icon. I have fans and relays on the system and by them being listed as lights causes confusion. \n\nStill, a reasonable effort but doesn't stand out against competing platforms. Get to work Lutron!!","updated":"2014-09-05T10:37:33-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1041288880","userName":"Li0n","userUrl":"https://itunes.apple.com/us/reviews/id35099261","version":"6.0.8","score":2,"title":"Not Worth Using","text":"This app is so tedious to use, it isn’t worth the effort. I can use my Lutron’s old, non-mobile web server on my iPhone faster than this app! So now I’m paying for a worse experience than an old, out-of-date, non-mobile web server.\n\nOne has to navigate by floor, then room, then switch, then click the desired button. Just to turn a light on. Nope.\n\nYou can make only one plate/switch a favorite and that’s it. So your Lutron experience is spent navigating back and forth in text menus.\n\nWhy can’t we favorite a bunch of buttons that all appear on a favorites panel? That alone would make this app usable. But instead, Lutron wants us to pay an installer to make a panel of favorites, which we can only update with a programmer visit. What a pain - no thank you.\n\nCome on Lutron, step up to the plate and make an app that’s easy and efficient. This one isn’t.","updated":"2014-08-05T13:17:43-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1222093397","userName":"StefanoBK","userUrl":"https://itunes.apple.com/us/reviews/id7749766","version":"9.1","score":2,"title":"FIX IT!!!!","text":"overall an ok app. I wish the interface was a little more geared towards seeing multiple switches in a room at once. \n\nHowever, since the last update of iOS it STOPPED WORKING. I found this out while away for a long weekend and now have no control of the house lighting.  Since I don't have the away function programmed yet I turn lights on and off from afar to simulate someone being home. \n\nPlease fix this asap.","updated":"2015-07-04T07:37:21-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"881450571","userName":"ChristianSS","userUrl":"https://itunes.apple.com/us/reviews/id4724262","version":"5.1.1","score":1,"title":"Rip off","text":"Lutron makes enough on their ridiculously expensive switches, blinds and other products to provide this basic, sophmoric application that looks like it was written by a couple college kids for a nominal charge.  $60/year isn't expensive, but makes your stomach turn after investing in such an expensive system designed and marketed for remote control, only to be stuck on the backend with essentially an 'annual fee' for the priviledge of using their own products.  And same annual charge whether you have 5 lights or 5,000 lights, blinds, thermastats and other devices. Bad karma and bad business.","updated":"2013-10-10T20:59:34-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1326814758","userName":"Antoniogabriel","userUrl":"https://itunes.apple.com/us/reviews/id250404760","version":"9.6","score":5,"title":"Lighting/Shades","text":"I would say that when it comes to lighting controls and shade motorization/automation, Lutron has set the standard for reliable comunication and quality. Good luck with other systems that roam in the \"High End\" sphere and fall very short with poor comunication, bugs, glitches and multiple freezes wich turn your day into hell in a matter of minutes.","updated":"2016-02-02T15:22:34-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1532582566","userName":"OC Gordon","userUrl":"https://itunes.apple.com/us/reviews/id290076499","version":"9.9","score":1,"title":"I don't think Lutron cares that it's a bad app","text":"Have struggled with this app for over two years now. HORRIBLE.  Go away for three weeks and look at the house using our cameras I see some lights come on and others not come on at scheduled times. Hours of difference. Same with going off. What good is it to have a light come on in the middle of the day? Recheck the schedules on my IPad and they are fine, but the lights don't follow the schedule. If Lutron cared they would fix the app. Look for something else if you can. Including the light switch.","updated":"2017-01-28T17:31:28-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1065514163","userName":"Scene_edit","userUrl":"https://itunes.apple.com/us/reviews/id166510068","version":"6.0.8","score":3,"title":"Scene editing","text":"The software would be very useful if you could use it to add or remove lighting loads when editing a scene.  Currently it is only possible to change a light level when editing a scene. \n\nTo add or remove a lighting load from a scene I currently have to schedule an appointment with my Home Automation installer and that really bothers me.  I wish it was something I could do on my own.","updated":"2014-09-16T15:08:54-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1068195488","userName":"Sandy256","userUrl":"https://itunes.apple.com/us/reviews/id43638310","version":"6.0.8","score":1,"title":"Non-intuitive, needs more flexibility and customization","text":"• It takes way too many clicks to get to the light you want, in a specific room, on a specific floor.\n• You can't make a custom list of your favorite lights or scenes; you can only favorite a specific button panel that already physically exists.\n• No ability to customize which lights correspond to specific buttons on an existing button panel.\n• This app should also be free if you already have Lutron hardware; it's a waste of money as-is.","updated":"2014-09-21T13:24:30-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"484775595","userName":"Tryanst","userUrl":"https://itunes.apple.com/us/reviews/id133276376","version":"3.3","score":5,"title":"Very convenient!","text":"It is like having a keypad in my pocket. \nI have always enjoyed showing off my lutron system to my friends as well as showing off the system to the friends of my college age children. \nNow i save the iphone app for the end of the demo....., that is when i get the biggest \"wow\". \nTim Ryan","updated":"2011-11-20T04:12:38-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"439726518","userName":"Douglas Thom","userUrl":"https://itunes.apple.com/us/reviews/id28342525","version":"3.2","score":2,"title":"So so","text":"While this app has a nicer GUI than the older Homeworks program, it does not work with systems that are not on the standard ports (21,23,80).  This is a big problem for us since most of the home systems we do have multiple telnet, FTP, and web servers on the home network.  $20 is a lot to pay for a none usable app!  Lytton acknowledged this issue but the current up ate to 3.2 does not address it.","updated":"2011-06-24T23:22:49-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1353430163","userName":"weintrw","userUrl":"https://itunes.apple.com/us/reviews/id42271463","version":"9.8","score":1,"title":"Does NOT work when you sell your house","text":"Lutron RA2 systems are run from your cellphone.  The cellphone software requires a password, so when you buy a home with a lutron system unless you get your iPhone controlling the system before you buy the house, you need to spend several hundred dollars to use the system in the house. The hardware buttons work but they raise all shades at once. Only the software allows complete control that you need. Stay alert.","updated":"2016-03-25T10:55:17-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"756234692","userName":"Oditty","userUrl":"https://itunes.apple.com/us/reviews/id162589079","version":"5.0.0","score":5,"title":"Great system.","text":"I have been with lutron for 3 years never had any problems with there equipment or software. And I'm excited about the remote access now I can turn on my outside lights while I'm using my Everfocus app to view my cameras at night.","updated":"2013-02-21T18:46:26-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1521369976","userName":"VAGentleman2","userUrl":"https://itunes.apple.com/us/reviews/id163283211","version":"9.9","score":4,"title":"Does the job","text":"It took some work to get my system to recognize the app and also it drops once in a while- but I think that is iphone issues more than the app.  That said it does a great job and is versatile.  Looking forward to voice control version","updated":"2017-01-13T08:53:52-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"982514077","userName":"Mix-It-Up!","userUrl":"https://itunes.apple.com/us/reviews/id35232606","version":"6.0.0","score":1,"title":"Terrible update!","text":"In addition to the other reviews here... I have to note how terrible the new look of the app is... At least give me the option to customize the it a bit.  The all white background is horrible to look at after your eyes have adjusted to a dark environment.  At least give a white on black option so our eyes don't have to be burned out of our skulls when looking at it!  Thanks!","updated":"2014-04-25T00:52:38-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"770791897","userName":"JosephTarlecky","userUrl":"https://itunes.apple.com/us/reviews/id163777002","version":"5.0.1","score":5,"title":"Great app","text":"Works amazing with my radiora 2 light control and thermostat! Use it on two wall mounted iPads, a mobile one, and my iPhone. Turning off lights or adjusting temps while laying in bed is priceless! Remote access works flawless amazing product thanks lutron!","updated":"2013-03-16T17:58:20-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1267047987","userName":"MantelSam","userUrl":"https://itunes.apple.com/us/reviews/id418772201","version":"9.3.1","score":1,"title":"Unprofessional app, settings are confusing and limited","text":"I'm using Lutron RadioRA2 system with approximately 35 devices, I must say this app is very confusing and is very limited in settings.\n\nSome settings that can be set with the pc app from the installer but cannot be set from this app, also devices are not same layout as in the pc app.\n\nI guess my next option is replacing my system to a Control4 home automation system.","updated":"2015-10-04T14:52:18-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"980299232","userName":"ukbusiness","userUrl":"https://itunes.apple.com/us/reviews/id39708618","version":"6.0.0","score":1,"title":"Lost Functionality","text":"You show all the upgrade changes and then you let someone go live with this without anyone testing it.  None of the functions listed work - other functions have been lost - CAN NOT edit schedules.  I am going out of town and wanted to make changes and NOTHING can be changed.  Someone in management needs to have a long talk with the app designers.  If you don't test YOU ARE FIRED!!!!","updated":"2014-04-20T13:35:16-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"495742116","userName":"Don Diego 10559","userUrl":"https://itunes.apple.com/us/reviews/id145262547","version":"3.3","score":1,"title":"It almost works!!","text":"I have been using the Lutron Homeworks system without any problems for six years. However this app is fraught with bugs. Conceptually we designed it work intermittently with a WAN ip address. Works OK with a ip address on a local LAN but using this app on an iPhone mitigates locally mitigates its utility.\n\nI am really surprised at the lack of reliability of this app since Lutron hardware and software are normally bullet proof.","updated":"2011-12-15T10:20:57-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"939345433","userName":"Micro98","userUrl":"https://itunes.apple.com/us/reviews/id37925478","version":"5.2.1","score":4,"title":"Screen saver","text":"Taking away one star for not having the ability to remove unused hvac and use it for other things... And time out of the screen saver comes up to quickly","updated":"2014-02-08T06:52:14-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"490371476","userName":"BobFord","userUrl":"https://itunes.apple.com/us/reviews/id102948861","version":"3.3","score":3,"title":"needs to be improved","text":"The application works fine in the house but has issues re-loading configuration outside of the house even over high speed networks.  Even with VPN it won’t connect with 3G as it should.  Can’t control closures or motors directly.","updated":"2011-12-03T09:41:25-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1120355414","userName":"Gratitude56","userUrl":"https://itunes.apple.com/us/reviews/id154774801","version":"8.1.0","score":4,"title":"Latest Update Crashes","text":"Was working nicely until latest update. Can not add New system without app crashing. Please fix asap. Update. Deleted app and re-installed on ipad, fixed problem.","updated":"2014-12-27T19:00:30-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"421277302","userName":"Wildwood member","userUrl":"https://itunes.apple.com/us/reviews/id25232429","version":"3.0","score":3,"title":"Needs features","text":"Great app but for 20 bucks the free app does about the same. What I was hoping for was a Home and Away feature so you could use it at home and also remotely. The micasa verde has them all beat!","updated":"2011-04-19T14:32:28-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1246678068","userName":"ReidTwin1","userUrl":"https://itunes.apple.com/us/reviews/id270850460","version":"9.1","score":1,"title":"Broken app since IOS update 8.4.1","text":"Broken app since IOS update 8.4.1. I paid $20 for app 2 months ago and it worked for 1 month. Ever since I updated IOS software the app has been broken. It won't even open. Figured Lutron would have updated app with a fix since they charge $20 for app! Any way to get a refund for app purchase if they don't maintain the app?","updated":"2015-08-21T18:25:52-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1194133776","userName":"JD-2","userUrl":"https://itunes.apple.com/us/reviews/id26189102","version":"8.3","score":5,"title":"Application works very well.","text":"This application works very well from my iPhone and it is very useful.\n\nBut, it would be nice if there was a Apple Watch extension application for this application.","updated":"2015-05-08T05:26:45-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1229507639","userName":"_Rob M_","userUrl":"https://itunes.apple.com/us/reviews/id35876295","version":"9.1","score":1,"title":"Do NOT buy this!","text":"This app seems like a good idea. But for the price, I expect an app to actually work. Call me crazy, but how about if it would find my system more frequently?  Even 50% of the time would be nice?  And how about if the system didn't reset every time the power blinks off?  Don't waste your money for something that simply doesn't work!","updated":"2015-07-18T19:14:44-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1113845543","userName":"jackinpao","userUrl":"https://itunes.apple.com/us/reviews/id33931036","version":"8.0.1","score":5,"title":"Stopped working with 8.1.2","text":"Worked well before, but now crashes during startup.  That makes it pretty useless.\nJack","updated":"2014-12-15T13:01:53-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"487220362","userName":"Larry Bem","userUrl":"https://itunes.apple.com/us/reviews/id189153554","version":"3.3","score":5,"title":"Control + / Too cool","text":"Pleasant and friendly interface to control my lights from my iPhone or iPad. Leaving our home, or sitting on the couch very easy to use.","updated":"2011-11-25T17:26:42-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"875544498","userName":"jkohlen","userUrl":"https://itunes.apple.com/us/reviews/id31422560","version":"5.1.0","score":1,"title":"Shame on you Lutron","text":"I've had this app for about 3 months and it works remotely about 30% of the time. Most of the time it times out and says Cannot Connect to the System. So now Lutron wants to charge me $60 for a year to have the privilege of not being able to connect? Srsly? How about you get the system to work and then you charge me for it. Sorry Lutron you blew it.","updated":"2013-09-26T08:24:17-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"769362691","userName":"Dennis 2020","userUrl":"https://itunes.apple.com/us/reviews/id160166954","version":"5.0.1","score":3,"title":"Reinstall the app complainers","text":"If you completely uninstall and then reinstall the app all your problems will disappear. Trouble shoot before writing whiny reviews people. (Not that this is a hugely great app, but it does work after the newest updates)","updated":"2013-03-14T06:44:35-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"392244136","userName":"homesolutions","userUrl":"https://itunes.apple.com/us/reviews/id29958079","version":"2.0.1","score":5,"title":"Excellent!","text":"Thank you Lutron for this wonderful iPad app!  Can't wait for the level editor and timeclock support to be added to the iPhone!","updated":"2011-01-28T07:56:02-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"980908806","userName":"Very tricky","userUrl":"https://itunes.apple.com/us/reviews/id32793531","version":"6.0.0","score":1,"title":"Horrible update","text":"Agree with everyone else. Makes this app a fraction as useful as the previous version by taking away ability to edit events. Funny thing is that it still says \"edit events\" up on top of the screen. Hopefully it was just a huge oversight as opposed to intentional. Lutron please fix so we can update ratings.","updated":"2014-04-21T18:20:54-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"605660823","userName":"Bay Point Retreat","userUrl":"https://itunes.apple.com/us/reviews/id257282389","version":"4.0.3","score":3,"title":"Changing buttons","text":"The app is ok for modifying settings on already programmed buttons, but it does not allow you to add or delete lights to buttons. That is a real flaw in the app which needs addressed.","updated":"2012-06-20T07:53:53-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"768854992","userName":"Dissap123","userUrl":"https://itunes.apple.com/us/reviews/id24688873","version":"5.0.1","score":1,"title":"Dissapointed","text":"I have been waiting for this update for quite some time and I am extremely disappointed. The remote cloud access only works occasionally. I have to continuously reset the main repeater to get access to my system outside my local network, even then it will only work for an hour or so.","updated":"2013-03-13T08:07:45-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1122646060","userName":"Interface Wiz","userUrl":"https://itunes.apple.com/us/reviews/id33937573","version":"8.0.0","score":1,"title":"Update kills app. Was working.","text":"I have about 50K in Lutron lighting.  This software is a massive disappointment.   So tragic, the Lutron hardware is flawless.\n\nI have updated everything. Latest iOS, latest version of app. I have uninstalled and reinstalled the app. Still does not work.\n\nTo program your Lutron system, make sure you get the dealer software for Windows.","updated":"2014-12-31T23:59:44-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"807960769","userName":"movie rater guy","userUrl":"https://itunes.apple.com/us/reviews/id32976636","version":"5.0.11","score":5,"title":"Works fine for me...","text":"I'm not sure what everybody is complaining about, it works fine.","updated":"2013-05-20T20:00:40-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1110623485","userName":"iKirsh","userUrl":"https://itunes.apple.com/us/reviews/id42412910","version":"8.0.0","score":1,"title":"It's just not working for me any more","text":"Since this update some features done work such as the switches / panels. I click on them and nothing happens. I guess my homeworks is still not 8.0 but what am I supposed to be doing about that???????? That's what I have installed by my certified provider. Very bad practice to kill the backward compatibility.","updated":"2014-12-09T13:27:48-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"751906754","userName":"dfrho","userUrl":"https://itunes.apple.com/us/reviews/id32956866","version":"4.1","score":1,"title":"You need a dealer to make it work","text":"After spending thousands on the base unit and my switches, and the app, I can't get a Lutron dealer to return to my call to make the app work since presumably the job would be to small. Don't buy this software until you have the dealer appointment…And do yourself a favor Lutron and drop your dealers from this supply chain!!","updated":"2013-02-15T12:54:42-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"439130250","userName":"MrAlexCavallo","userUrl":"https://itunes.apple.com/us/reviews/id11017510","version":"3.2","score":3,"title":"I'd like to like it but ...","text":"For some reason the app opens up on my iPad to the iPhone resolution and it only covers the top left 1/4 of the screen. So I essentially paid $20 for exactly what the free app does. Great ...","updated":"2011-06-22T17:57:02-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"748570817","userName":"Original RAN","userUrl":"https://itunes.apple.com/us/reviews/id20046078","version":"4.1","score":1,"title":"Waste of money","text":"After spending over $3500 on the RadioRA2 hardware, it makes no sense to charge $20 for an app that doesn't work. Lutron's answer? Hire a certified installer? Why do they even sell the products retail then? Garbage that should not be in the App store. Lutron should take a look at how Nest (thermostat) does it, which works flawlessly right out of the box.","updated":"2013-02-10T10:55:54-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1110047754","userName":"Macman56","userUrl":"https://itunes.apple.com/us/reviews/id41884990","version":"8.0.0","score":3,"title":"Status no longer showing up","text":"For Homeworks the status of a button no longer works (on and off for ex shutters and aircon)\n\nPlease fix - it is crucial to know the status for ex alarms and aircon)\n\nOtherwise nice improvement","updated":"2014-12-08T10:17:59-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1251418356","userName":"Rolltide MJ","userUrl":"https://itunes.apple.com/us/reviews/id25385602","version":"9.3","score":5,"title":"App design needs new look","text":"Would be nice for the developers to make the app design look similar to the new Caseta app.","updated":"2015-08-31T18:43:37-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1248662671","userName":"King Guggug","userUrl":"https://itunes.apple.com/us/reviews/id79006609","version":"9.3","score":3,"title":"HVAC is gone in new release","text":"With The latest release i couldn't see my hvac anymore. I am totally not able to control hvac now.  Please fix.","updated":"2015-08-25T21:19:17-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"980822518","userName":"npicklo","userUrl":"https://itunes.apple.com/us/reviews/id10999281","version":"6.0.0","score":4,"title":"What happened to events?","text":"***Update\nApril 21, 2014\nSpoke with tech support. You have to enable homeowner's edit in the settings menu on the iPhone under the homecontrol app in order to edit events and create new events. \n\nApril 20,  2014\nI thought the new app and Ra2 firmware/software was going to allow for even more in depth event editing. Instead all editing of events is now gone!\n\nLutron...any feedback on this?","updated":"2014-04-21T13:43:27-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"755054113","userName":"nanmar831","userUrl":"https://itunes.apple.com/us/reviews/id10407703","version":"5.0.0","score":1,"title":"Rip off","text":"After waiting for the ap to control the system through the Internet they make you pay $60 each year. Rip off! After buying and installing a very expensive system and I wish I had gone with something else.","updated":"2013-02-19T21:29:47-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"793783211","userName":"Malgorithms","userUrl":"https://itunes.apple.com/us/reviews/id29809908","version":"5.0.1","score":1,"title":"Used to work now; constant crash on startup","text":"The interface has always left a lot to be desired. But now I can't even get to that point of frustration because the app force closes 5 seconds after starting, well before letting me do anything.","updated":"2013-04-24T18:41:44-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1360498805","userName":"Davidnyc10024","userUrl":"https://itunes.apple.com/us/reviews/id18769177","version":"9.8","score":1,"title":"Backwards","text":"It is mind numbing that honeywell can create an app that makes such a simple process of turning up or down the heat so impossible.  I regret buying this system as I spend more time teaching people how not to screw up this system than anything else in my house.","updated":"2016-04-08T13:02:32-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"670233897","userName":"Parikh1234","userUrl":"https://itunes.apple.com/us/reviews/id36062675","version":"4.0.4","score":1,"title":"Won't work with RadioRA2","text":"Unless you pay an \"installer\" to come to your place with the RadioRA2 Essentials software. It's very disappointing to spend thousands of dollars on switches, curtains, etc to have them tell you it won't work. I'm returning everything and going to another company.","updated":"2012-10-06T13:24:26-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1316085299","userName":"ICOOKINN","userUrl":"https://itunes.apple.com/us/reviews/id4126460","version":"9.5","score":5,"title":"Awesome","text":"Great app , works amazing and is just a good as being hard wired to my system.","updated":"2016-01-13T18:01:13-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"979870968","userName":"Lukeetal","userUrl":"https://itunes.apple.com/us/reviews/id100736336","version":"6.0.0","score":1,"title":"Fix editing schedules!","text":"Got to love Lutron. Sold the system on the ability to edit events and they drop support for it on the app. Really?  It would also be great if you fixed the but from years ago that causes the heat to run for no reason!!!","updated":"2014-04-19T20:13:42-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"671914248","userName":"Ltgfrk","userUrl":"https://itunes.apple.com/us/reviews/id115508708","version":"4.0.4","score":1,"title":"Can't edit time clocks with Illumination","text":"I have a HW illumination system and got this app because I wanted to be able to edit my lighting schedules. Turns out that's not possible with the illumination and that's not mentioned anywhere in the description.","updated":"2012-10-09T14:10:49-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1063334654","userName":"Limited scenes","userUrl":"https://itunes.apple.com/us/reviews/id216369503","version":"6.0.8","score":1,"title":"Poor app","text":"I would not have purchased this lighting product had I known I could not create my own scenes.  I don't understand why this is so limited and why you must pay support to set up additional scenes. Why?????","updated":"2014-09-12T18:44:56-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1200338561","userName":"Luc-e-Luc","userUrl":"https://itunes.apple.com/us/reviews/id377299054","version":"9.0","score":5,"title":"Best","text":"Your home could always use more Lutron.","updated":"2015-05-20T20:12:27-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"980735597","userName":"IraSaun","userUrl":"https://itunes.apple.com/us/reviews/id109700005","version":"6.0.0","score":1,"title":"Worst Ever !!!!","text":"Do not install this update. I loved the software, but this update 'misses the boat'.\nErrors! Missing features. Screen and icons all different now. Pictures below are not correct. I wished I had turned off auto-update, I will now!","updated":"2014-04-21T09:24:35-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"798328211","userName":"guy brand","userUrl":"https://itunes.apple.com/us/reviews/id20479296","version":"5.0.11","score":1,"title":"rip off","text":"This app has never worked. I have paid Lutron installers to get it to work and with no results. After spending $10K on a new home system, you would think it would work. This is a waste of an app.","updated":"2013-05-03T02:02:17-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1113133925","userName":"bradtx77","userUrl":"https://itunes.apple.com/us/reviews/id29562804","version":"8.0.1","score":1,"title":"Newest update crashes","text":"I have been unable to run the app since version 8.0. It shows me the splash screen as it loads, then it changes for a brief second to one of my lights and promptly crashes.","updated":"2014-12-14T05:45:16-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"980522536","userName":"luckytwn","userUrl":"https://itunes.apple.com/us/reviews/id39166708","version":"6.0.0","score":1,"title":"Same as everyone else","text":"Lutron should be embarrassed by this disaster. Major loss in functionality as others have pointed out as well as other major bugs. They need to fix immediately.","updated":"2014-04-21T01:19:52-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1111827156","userName":"GT640","userUrl":"https://itunes.apple.com/us/reviews/id85322430","version":"8.0.0","score":1,"title":"Crashes on iPad","text":"This latest update crashes on iPad. Seems to be fine on iPhone5, but catastrophic fail on iPad.\n\nI am a professional and certified Lutron integrator and updated my RadioRa2 program and software to version 8.0 and no good.\n\nLutron, you guys are a disaster with this app. EPIC FAIL.","updated":"2014-12-11T21:49:40-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"713992272","userName":"Steve1599","userUrl":"https://itunes.apple.com/us/reviews/id293689779","version":"4.1","score":1,"title":"Keeps Closing","text":"The application won't even open up....I am quite surprised since Lutron products are usually the top of the line. Let's hope an update comes out soon fixing this MAJOR bug!","updated":"2012-12-22T23:01:54-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1239883987","userName":"VAbeachfront","userUrl":"https://itunes.apple.com/us/reviews/id464999260","version":"9.1","score":1,"title":"Just. Stopped. Working.","text":"It was an ok app while it worked. Now it does nothing. Please fix it!  Call me crazy, but if I pay $20 for an app, I expect it to work for more than a week or two.","updated":"2015-08-08T05:39:49-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"765966746","userName":"scjnsn","userUrl":"https://itunes.apple.com/us/reviews/id35664753","version":"5.0.1","score":1,"title":"Lutron = Lame","text":"Lutron reminds me of computing in 1980. Old school command-control in everything they do. \n\nRemote control is $60/year and is limited to one device PER SYSTEM!\n\nThe whole Lutron team lacks a customer-focused mentality. They lock the program down and treat it like its some proprietary deep dark secret. \n\nHomeowners should be able to do 90% of their own configuration without calling a dealer to come make a schedule or scene change. \n\nLutron = Lame!","updated":"2013-03-08T09:29:22-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1546632670","userName":"Timberscotch","userUrl":"https://itunes.apple.com/us/reviews/id213896997","version":"9.9","score":1,"title":"Getting worse","text":"It now takes 30 seconds for the app to open.  30 seconds to turn on a light?!\n\nPlease fix this","updated":"2017-02-17T14:26:07-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"982182941","userName":"Jhnard","userUrl":"https://itunes.apple.com/us/reviews/id163486525","version":"6.0.0","score":1,"title":"Never works","text":"Works 10% of the time,what a huge disappointment. With each upgrade it always crashes.","updated":"2014-04-24T08:03:30-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1204082202","userName":"JCLava","userUrl":"https://itunes.apple.com/us/reviews/id340501070","version":"9.0","score":1,"title":"App doesn't work after update!","text":"As others have noted, I can't control my system from my phone anymore - really wish I hadn't updated!","updated":"2015-05-28T20:52:02-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1284661046","userName":"Joshihotels","userUrl":"https://itunes.apple.com/us/reviews/id138195993","version":"9.3.1","score":1,"title":"Crash crash crash","text":"I have been using Lutron app for years but with past update, the app crashes when I go back to prior screen.  Fix it please","updated":"2015-11-10T05:00:41-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1197917153","userName":"Mrbrain77777","userUrl":"https://itunes.apple.com/us/reviews/id16700982","version":"9.0","score":1,"title":"I am now locked out - do not download","text":"I can no longer control my system from my iPhone... So the entire reason I spent $$$$ one a whole house radio ra2 setup is worthless...","updated":"2015-05-15T19:31:11-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1127827253","userName":"AlienFX","userUrl":"https://itunes.apple.com/us/reviews/id34092851","version":"8.1.0","score":1,"title":"Constantly crashes","text":"I have not been able to use since new update","updated":"2015-01-10T15:44:41-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1110073916","userName":"Swweber","userUrl":"https://itunes.apple.com/us/reviews/id25191932","version":"8.0.0","score":1,"title":"Digusting Corporate Greed","text":"The system costs a small forture to install in the first place.  Now they have to bilk us for another $60 per year?  Do not download and pay for this.","updated":"2014-12-08T11:41:17-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1248680042","userName":"Bmoney04091974","userUrl":"https://itunes.apple.com/us/reviews/id360545654","version":"9.3","score":1,"title":"Status of buttons no longer works","text":"Cannot see hvac controls/status after upgrade on radio ra2.  Lutron - please fix!","updated":"2015-08-25T22:15:08-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"980679894","userName":"squeebus","userUrl":"https://itunes.apple.com/us/reviews/id144062623","version":"6.0.0","score":1,"title":"Crahes every time","text":"App crashes every time I click on a room name to try to adjust a light level. App is broken and useless.","updated":"2014-04-21T07:28:36-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"888634379","userName":"scottyc1234","userUrl":"https://itunes.apple.com/us/reviews/id37497664","version":"5.1.1","score":2,"title":"Lutron: Why $59?","text":"I paid SERIOUS money ($20K+) for a pretty good system. Now you make me pay $59 a year to control it?  This just rubs me wrong.","updated":"2013-10-28T17:13:45-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"979311602","userName":"Weather fanzzzzz","userUrl":"https://itunes.apple.com/us/reviews/id137430415","version":"6.0.0","score":1,"title":"Beware--bugs","text":"Don't upgrade to this version yet.  Ability to control hvac and away from home schedules was lost.  \n\nLutron please restore and fix","updated":"2014-04-18T21:13:35-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1119542979","userName":"Controversy7","userUrl":"https://itunes.apple.com/us/reviews/id221892976","version":"8.1.0","score":1,"title":"Crashes all the time","text":"I'm using latest version of this app and it crashes every time I try to open. This is insane. Pls fix ASAP.","updated":"2014-12-26T07:51:41-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1196286051","userName":"Noway2566","userUrl":"https://itunes.apple.com/us/reviews/id112486388","version":"9.0","score":1,"title":"Can no longer connect to my system","text":"This update has made it so I can't connect to my system.","updated":"2015-05-12T08:22:48-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"761329143","userName":"Aleph bet gimal","userUrl":"https://itunes.apple.com/us/reviews/id217473010","version":"5.0.1","score":1,"title":"Update keeps crashing can't open app","text":"Update makes the app crash. Unable to open","updated":"2013-03-01T04:03:10-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1112543288","userName":"cpwhitten","userUrl":"https://itunes.apple.com/us/reviews/id39806764","version":"8.0.0","score":1,"title":"Will not open after updating","text":"Guys, new version is not working...what am I paying for? Do your job, fix it.","updated":"2014-12-13T05:47:32-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"800294588","userName":"Gallojd83","userUrl":"https://itunes.apple.com/us/reviews/id285048021","version":"5.0.11","score":5,"title":"App works great","text":"Tis app works great love my system!!","updated":"2013-05-06T12:45:32-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1413539240","userName":"Irringo","userUrl":"https://itunes.apple.com/us/reviews/id194282694","version":"9.9","score":1,"title":"Not enough reviews for a rating???","text":"Here's another bad review. Used to be tons of bad reviews on here. Here is another one. This app is worthless. Glad i paid for it...","updated":"2016-07-16T17:02:18-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1064492069","userName":"Unhappy former evalangelist","userUrl":"https://itunes.apple.com/us/reviews/id37529177","version":"6.0.8","score":1,"title":"Outrageous","text":"It's outrageous that Lutron would charge thousands of dollars for a lighting and window shade system, then charge $60 per year for remote function. It's disgraceful.","updated":"2014-09-14T16:26:27-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"731041089","userName":"H.Sweets","userUrl":"https://itunes.apple.com/us/reviews/id138144724","version":"4.1","score":1,"title":"Warning","text":"This app does not work. Technical support is impossible to connect with.\nFor $20, one would not expect such a bad app in iTunes.","updated":"2013-01-17T10:07:39-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1249820948","userName":"PHOOMP","userUrl":"https://itunes.apple.com/us/reviews/id34120246","version":"9.3","score":1,"title":"Went from the best to the worst","text":"I am trying to find another app to control my smart house.","updated":"2015-08-28T09:10:28-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1039614595","userName":"Lutron user","userUrl":"https://itunes.apple.com/us/reviews/id34124799","version":"6.0.8","score":2,"title":"HVAC not responding","text":"App worked great until recent update and now the HVAC does not respond.","updated":"2014-08-02T17:31:13-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"761784418","userName":"snhroc","userUrl":"https://itunes.apple.com/us/reviews/id47683054","version":"5.0.1","score":1,"title":"App doesn't run after update","text":"Just keep crashing on startup. Somebody didn't take the time to test it.","updated":"2013-03-01T19:30:13-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"763372623","userName":"TI3","userUrl":"https://itunes.apple.com/us/reviews/id26012428","version":"5.0.1","score":1,"title":"Post-update = crash","text":"Once updated, the app crashes when I launch....cool on the iPad but iPhone is not working","updated":"2013-03-03T22:32:29-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"755119586","userName":"Burak Chi-town","userUrl":"https://itunes.apple.com/us/reviews/id86014066","version":"5.0.0","score":1,"title":"Crash","text":"Keeps crashing after V5 update. Wish never updated it :(","updated":"2013-02-20T00:13:25-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"980965077","userName":"Probeno1","userUrl":"https://itunes.apple.com/us/reviews/id150367644","version":"6.0.0","score":1,"title":"Terrible downgrade!!!!","text":"App is now useless--editing function is totally wiped out.    Without ability to edit, system is WAY OVERPRICED!","updated":"2014-04-21T21:01:03-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1137157908","userName":"Fábio Tavares","userUrl":"https://itunes.apple.com/us/reviews/id133392607","version":"8.1.0","score":1,"title":"Not Work","text":"The last up date doesn't work.","updated":"2015-01-27T15:52:21-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"770702243","userName":"Kent2010","userUrl":"https://itunes.apple.com/us/reviews/id20467197","version":"5.0.1","score":1,"title":"Ridiculously complicated and expensive","text":"Find something else. Anything else. \n\nApp isn't very useful. Flakey and expensive: $60 per YEAR! That's right, per year. \n\nLimit of only two mobile devices per account. I'm not kidding - 2 devices max.\n\nWhat century does Lutron live in?","updated":"2013-03-16T14:22:34-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"759758329","userName":"jpic200","userUrl":"https://itunes.apple.com/us/reviews/id43155963","version":"5.0.0","score":2,"title":"Lutron is all about the $","text":"I have several control keypads, but also like the option of controlling from my iPhone and iPad. \n\nPros- the best thing is to be able to set and change the scene levels from the app.  If you don't have the app, you have to have a tech set them and you are stuck.  So pay the 20, it is cheaper then the service call.  \n\nCons- with what the system costs, it is a ripoff to have to pay 20 for the app.  At 175 to 400 for light switches and key pads, toss it in.  It is worthless to anyone that does not have the system, so who cares.  That said, with what I paid for the system, what's another 20.  \n\nMy biggest complaint is that Lurton wants you to have to call your dealer and line their pocket anytime you want to program or change something.  All switches and shades should be accessible from the app and the user should be able to add them or remove them from a scene.  \n\nThis is an even bigger annoyance because my dealer is horrible and I am stuck calling them to make a change.  They have the program and how it is set.  To get someone else to do it I have to call another dealer and they would need to reprogram it all.  \n\nLurton has a great product, but it is designed to protect their dealers.   I have tried to get in touch with someone at lutron to discuss my dealer but you cannot get through to anyone that matters.\n\nI digress, basically, if you have the system, you need the app.  Pay the 20, don't pay 60 per year more for remote.  That is a ripoff solely for lutron to keep making money.  \n\nIf you have not gone with the ra2 yet, go with something else.  There are systems just as good that cost less and are mores end user friendly.","updated":"2013-02-26T20:02:33-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1213862998","userName":"NaplesCampbell","userUrl":"https://itunes.apple.com/us/reviews/id222834726","version":"9.1","score":1,"title":"Does not work with iOS 8.3","text":"This app does not work with iOS 8.3. It dies our whenever we I try to start it","updated":"2015-06-17T15:39:38-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1137747503","userName":"rosbelsanroman","userUrl":"https://itunes.apple.com/us/reviews/id85460046","version":"8.2","score":3,"title":"Iphone 6 & 6+ Support","text":"Great app! But can you support iPhone 6 and 6+ sizes?","updated":"2015-01-28T15:55:51-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"755146780","userName":"simplybrianp","userUrl":"https://itunes.apple.com/us/reviews/id30119649","version":"5.0.0","score":1,"title":"Version 5.0.0 crashes on startup","text":"Does not work at all.","updated":"2013-02-20T01:22:14-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1249499625","userName":"Adrianraiford","userUrl":"https://itunes.apple.com/us/reviews/id228726771","version":"9.3","score":1,"title":"Upgrade disaster","text":"After the app upgrade I have no rooms and no thermostats. Complete disaster!","updated":"2015-08-27T17:51:05-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1187573899","userName":"Pops Lulu","userUrl":"https://itunes.apple.com/us/reviews/id140353017","version":"8.3","score":1,"title":"Unstable","text":"Since I upgraded OS it continues shutting down. \n\nVery frustrating.","updated":"2015-04-24T19:10:32-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1247265322","userName":"B3ARC4T","userUrl":"https://itunes.apple.com/us/reviews/id28447884","version":"9.1","score":1,"title":"Broken since 8.4.1","text":"Needs an update...","updated":"2015-08-22T23:29:15-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1249564547","userName":"RM2077","userUrl":"https://itunes.apple.com/us/reviews/id43707731","version":"9.3","score":1,"title":"Please Fix!!!","text":"Was a great app but new update lost all HVAC features rendering it useless to me","updated":"2015-08-27T21:07:47-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1248652165","userName":"805guy","userUrl":"https://itunes.apple.com/us/reviews/id225395268","version":"9.3","score":1,"title":"Lost my thermostats","text":"Just did the update an lost my thermostats.","updated":"2015-08-25T20:44:38-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1249106167","userName":"DJ PUJALS","userUrl":"https://itunes.apple.com/us/reviews/id19951804","version":"9.3","score":1,"title":"No thermostat","text":"What happened to thermostat?? They are gone!!!","updated":"2015-08-26T20:40:55-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1112919421","userName":"SBMD007","userUrl":"https://itunes.apple.com/us/reviews/id121976181","version":"8.0.1","score":1,"title":"Does not work","text":"Since the last 2 updates I have been unable to edit any of the lights and keep getting message that it contains special programming and to contact the dealer! What gives!!!! I have homeworks QS system.  Lutron please fix that. One spends so much money to hopefully be in control of the lighting programming.please allow that.","updated":"2014-12-13T20:41:49-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1449890413","userName":"Xgamer M","userUrl":"https://itunes.apple.com/us/reviews/id40659619","version":"9.9","score":4,"title":"HomeKit Support Please!","text":"RadioRa2 support in HomeKit...","updated":"2016-09-14T21:05:07-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"3320178710","userName":"CG-NY","userUrl":"https://itunes.apple.com/us/reviews/id12321469","version":"9.13","score":4,"title":"Apple Watch","text":"10/19/18 update:\nI changed my review from 1 star to 4 stars. I am a HUGE RadioRA 2 fan and I did not want my 1 star review and comment regarding \"Apple Watch support being removed\" to in any way be a reflection on the Lutron System as a whole. True these reviews are supposed to be for the App but this is unique in that it is one of the few apps on the App Store that work along with an external system. \nLutron System = 5 stars\nLutron App (when/if Apple Watch support is restored) = 5 stars\n\nHuge thanks to Mike S. from Lutron for responding to my post. \n\n10/13/18 update: \nApple Watch Support has been removed??? Why! Why?\n\nOriginal 2015 Post:\nAs another reviewer stated, light status not working for RadioRA 2.","updated":"2018-10-19T10:39:45-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1291696912","userName":"LoveMyR6","userUrl":"https://itunes.apple.com/us/reviews/id472878773","version":"9.3.1","score":5,"title":"😍😍😍😍","text":"Best app ever","updated":"2015-11-25T17:25:21-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"408762969","userName":"Jacob Vanderlinde","userUrl":"https://itunes.apple.com/us/reviews/id22965313","version":"2.0.1","score":5,"title":"Nice app!!","text":"As always, Lutron rocks!!","updated":"2011-03-19T21:38:26-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"408416974","userName":"Qs installer","userUrl":"https://itunes.apple.com/us/reviews/id172276661","version":"2.0.1","score":5,"title":"Works great with homeworks qs","text":"Great control with I pod touch and wifi. Dependable. Can't create own user and password yet-Lutron says it is coming.","updated":"2011-03-18T20:01:19-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"403770296","userName":"Sdrosen1","userUrl":"https://itunes.apple.com/us/reviews/id28192849","version":"2.0.1","score":5,"title":"Incredible use of the iPad in home lighting","text":"I had Foothill Integrated Systems install radio RA in our new remodel and this iPad app is a total game changer for controlling the lights in our house.  One of the coolest features is that ability to tweak the lighting levels of the lighting and save them right from the iPad.  Terrific interface that is easy to use and very intuitive.","updated":"2011-03-06T22:44:36-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"390964272","userName":"LutronUser","userUrl":"https://itunes.apple.com/us/reviews/id29695358","version":"2.0","score":5,"title":"Help","text":"How did you get the new firmware. It's not available?","updated":"2011-01-23T12:37:30-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1205885536","userName":"Rick 13256","userUrl":"https://itunes.apple.com/us/reviews/id156947918","version":"9.0","score":5,"title":"Need to fix","text":"This has become a major problem every time I go to my Lutron app it will not connect please fix ASAP 😟 Update June 1st Lutron has been running very well and it is much more enjoyable to be able to run my  products from my phone,Thank you so much. I'll be adding more Lutron products to my system shortly.Life is good when everything is running properly 👍🏻👍🏻","updated":"2015-06-01T11:00:17-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"},{"id":"1084182788","userName":"MDAnderson","userUrl":"https://itunes.apple.com/us/reviews/id33567928","version":"6.0.8","score":1,"title":"Sluggish, Expensive and Just Awful","text":"I purchased this app because we have a Lutron system, and not a day goes by when we don't complain about it. The app itself is slow to load, ludicrously expensive at $59.99 / year, and ultimately offers less customization that good ole plug-in vacation timers. \n\nLutron insults their customers two ways: first, they don't allow you to customize your own system (you have to put in a service call to one of their Lutron technicians at $100+ an hour for any modifications), and second you are reminded of the lack of customization every single time you log into the app.\n\nFor instance, I wanted to create a new away mode \"scene.\" I am not talking major changes to the program here. All I want to do is set up an occasional vacation mode using the app. Imagine paying thousands of dollars for a system, and the app won't even let you program a vacation mode! It's utterly maddening. \n\nOf course, you can chose not to purchase the app, and then you are left with a bunch of hand-operated light switches that cost you thousands of dollars. \n\nAs soon as we can find another home automation system that suits our needs, we're ripping this stuff out, and starting anew. This app and it's costs are simply awful. For the amount of money the system costs we shouldn't be nickeled and dimed just to use it.","updated":"2014-10-21T18:47:13-07:00","url":"https://itunes.apple.com/us/review?id=415374545&type=Purple%20Software"}]