[{"id":"7089390092","userName":"funtime","userUrl":"https://itunes.apple.com/us/reviews/id41700459","version":"8.7.0","score":3,"title":"Major flaw in solenoid alarm","text":"Had a false trust in their solenoid alarm. It is designed to monitor the AC current with some high and low threshold that isn’t settable. If the current exceed 800mA it assumes you have some sort of short. If it is at 0 it assumes you have an open. If it is anywhere between that it assumes all is well.  It all seems to be based on a single zone/ relay install. This is great in that situation as if there is a problem you are informed. However, many irrigation systems have an irrigation pump which is controlled via the MV relay. While you have to program this MV relay and the report says there are two solenoids, the solenoid current monitoring alarm is totally oblivious to the fact there are two relays. So if a zone opens from a fault there is still current going to the MV relay and still turns the pump on. The controller thinks all is fine as the current isn’t 0. Now the pump is pumping water but there is nowhere to send the water. After about a month of this I noticed my grass dying. Went to investigate and my pump melted and so did the PVC pipe. $1000 in repairs.  If only it knew what the MV current rating was or if it monitored the actual current versus the average over the last 10 runs it would easily shut of and given me an alarm.  So all this intelligence and it failed to do one of the basic of intelligence.","updated":"2021-03-10T20:46:00-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5932022954","userName":"banddood","userUrl":"https://itunes.apple.com/us/reviews/id102405511","version":"8.1.2","score":3,"title":"Good app but needs end user customization improvements","text":"Second season I have been using it and I do like the app a lot, but there are a couple things that drive me nuts.  I use the reports section quite a bit and it defaults to the last week. So the first thing I have to do is change it to today and it does not retain the end user changes from session to session. Also the total water usage totals don’t always jive with the flow meter totals. Would be really nice if the app let you download the data into your own spreadsheet for further analysis.  \n\nDon’t pay for the 5 weather stations service. For me it’s proven highly inaccurate.  The only modification trigger that has helped me is the % chance of rain to abort watering.  There is much room for improvement here to have it interface with your own weather observations at your exact location.  \n\nAll in all I like the app and hope they continue to enhance it. User defaults would be a huge plus.","updated":"2020-05-11T08:20:21-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"6275310272","userName":"assdertuhbcdetyjkcd","userUrl":"https://itunes.apple.com/us/reviews/id556295243","version":"8.2.3","score":2,"title":"Glitchy and not user friendly","text":"The performance is not very consistent- right now I can’t edit the zones - the pages won’t load. Every time I interact with the app there is always some different performance issue.  Other things: I constantly have to log in with my email address (no “remember me” option). This is a real pain if my hands are wet or I’m wearing gloves. I agree with the other reviewer about the default report to week and need to always switch to day. The overall intersections of options are really not intuitive- setting a time on a zone is required, then you put it on a program schedule that overrides that, so the zone schedule time is no longer used or relevant. It’s not clear what zone settings vs program schedules are driving at any point in time. Overall insight into my set up is lacking. My water usage grew dramatically last month (based on my water bill) - I didn’t have insight into that. Perhaps I’ll add a flow meter, but out of the box I’m not seeing something like “total minutes programmed per day” or something that would give me a sense of what I’ve programmed over time and to make sure I did not cross my wires among all the levels of set up. Finally, the help pages are well documented but aren’t consistent with what I see in the app. Thanks. Ps if this gets posted note that every nickname I was required to enter to post was taken.","updated":"2020-08-03T07:53:53-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"6285895563","userName":"Jlrodjr","userUrl":"https://itunes.apple.com/us/reviews/id328340895","version":"8.2.3","score":4,"title":"Overall I like it, but there’s room for improvement","text":"The app and controller have a lot of  features I like and opening the app and the app connecting to the controller is by far faster and app tuns smoother than the rainbird app and their ESP-TM2 that I had before purchasing and installing the hunter hydrawise pro hc. But theres still is a delay with loading when first opening the app that could be improved more. I’m not sure if it’s possible because havn’t figured it out if it is possible, being able to have the option to set each zone at multiple different watering run lengths for each program start time’s instead of only being able to set each zone at only one run length each for all the programmed start times it is set to run on. \nAlso would be nice to be able to see which exact zone the Reports chart is referring to under the Water Usage Flow Rates measurements when you click on one of the measurements instead of it only saying “There were 1 zones active at this time” without indicating what zone it was. Besides those things  I have no actual complaints.","updated":"2020-08-06T00:41:59-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7752118524","userName":"awinnie","userUrl":"https://itunes.apple.com/us/reviews/id106703028","version":"8.7.0","score":3,"title":"It’s good but it could be a lot better","text":"The app has a lot of stuff in it. But it’s not very intuitive and you have to dig around to find stuff sometimes. It could be a lot smoother. \n\nSeparately, I am surprised it doesn’t have a way to cancel or postpone upcoming waterings when you’re looking at the schedule. I may just be missing it but it seems the only want to cancel a particular scheduled watering is to either alter the schedule itself under “programs” or to wait for that watering to start and then go in through the remote and immediately cancel it.","updated":"2021-08-30T08:50:40-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"6447274070","userName":"Goodgnat","userUrl":"https://itunes.apple.com/us/reviews/id39990245","version":"8.2.3","score":1,"title":"Not user friendly","text":"I just had a new sprinkler system installed with this system.  When I first connected the app to my controller it had me set up the initial program which was fairly easy.  But I made my choices quickly just to get it up and running.  When I went back to change the start times or days it would run, I couldn’t find an option for “programs”.  I tapped around on but still couldn’t find it.  Finally I sent a message through the help option and THREE DAYS LATER got an answer that explained something about summer and winter schedules!!  In the meantime I kept trying different options and found that if I tapped on “Zones” there was a faint icon for “programs”.  I tapped this and it listed the program I had initially set up but when I tapped on it nothing happened.  Finally I discovered a little notepad icon that got me back to the place where I could change the program.  It was ridiculous!!","updated":"2020-09-19T17:46:41-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7872970911","userName":"Jdrosen","userUrl":"https://itunes.apple.com/us/reviews/id24686794","version":"8.7.0","score":2,"title":"A “Not Smart” Smart Sprinkler","text":"The weather data provided by the weather stations is inaccurate and delayed. The stations are not near my home, so their weather doesn’t match my house. Result: the sprinklers often are running while it’s raining, or after it has rained. I can download any number of weather apps which know the weather at any location in the US. But this app doesn’t know. \n\nThe app itself is bad. It’s clearly a web app ported to mobile. As a result, its touch responsiveness is bad and it feels slow. Page transitions are terrible. \n\nIt’s missing major features. Once a program starts, I cannot stop the whole program. I often need to do that because it’s running while it’s raining. The only thing you can do is stop an individual zone once it has started. So, I need to check back with the app every 20mins and stop each zone as it starts. Ridiculous. \n\nA smart sprinkler system is about good software. Clearly Hunter doesn’t agree and just assumes their distributors will sell whatever product they provide, even when the software is clearly sub par.","updated":"2021-10-03T05:36:54-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7077725217","userName":"Mitchohio","userUrl":"https://itunes.apple.com/us/reviews/id205776795","version":"8.7.0","score":4,"title":"Great combined with flow meter","text":"The main draw for me were three 1) predictability/tie to a weather station to stop from watering when it rains 2) the ability to control and review from my phone app and 3) the ability to install a flow meter to both a. tell me how much water I am using per zone and  b. Let me know of irregular water usage in a zone (a broken head or valve) and potentially shut down a zone automatically.\n\nIt does all of the above well. The only issue I had initially was false water usage readings from the flow valve - turned out it needed shielded cable to it to avoid interference.","updated":"2021-03-07T17:01:31-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"6495041321","userName":"JRtou","userUrl":"https://itunes.apple.com/us/reviews/id12777797","version":"8.2.3","score":3,"title":"Nice app when it works.","text":"This app is great when it works. It does lock up and requires me to delete it and then reload it. However, the newest version of iSO offered to move it to the library so I tried that.  Now I can’t seem to delete it, only open it. When I try to open it, it is in a locked up state and does nothing.","updated":"2020-10-03T01:09:00-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5972777515","userName":"scooct224","userUrl":"https://itunes.apple.com/us/reviews/id28700381","version":"8.1.2","score":1,"title":"Difficult to use","text":"The app is very complex and difficult to use. I think I have it mostly figured out after two years.  I still hate the circles you move with your finger to adjust the watering time. Just give me a box to enter the time numerically. Also, why not have a “basic” mode?  The problem with this app is it has advanced scheduling features that most people don’t care about or use. Just give me the basic, old school view so I can easily set my sprinklers to run on certain days for certain time periods. A nice toggle on/off button Basic Mode vs Advanced Mode. Make it happen please!!  Until then, 1 star. App is just too cumbersome and hard to use.","updated":"2020-05-20T20:01:07-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"6196311512","userName":"1sttenor1","userUrl":"https://itunes.apple.com/us/reviews/id270746606","version":"8.2.3","score":1,"title":"A great idea poorly done.","text":"When I bought an irrigation control head I was excited to see that Hunter had one that was Wifi capable and that I would be able to run from any location. However what is delivered is far less than capable. Many of the programming features will not let you complete a program. Trying to set up a cool down feature at noon, you can get to two screens and then it just stops. So I have one program, a long  20 minutes soaking in the system that I can get it to run, usually, but not always consistently. The only way that I can do a cool down is to run each zone individually, manually.","updated":"2020-07-14T03:35:31-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"6298614818","userName":"moral imperative","userUrl":"https://itunes.apple.com/us/reviews/id131185619","version":"8.2.3","score":2,"title":"Was ok till it stopped working","text":"First off the font is kinda small and hard to read, hunter says bigger lettering is more expensive and they where trying to keep it affordable, so who ever developed their app lied to them or they lied to me, now going for reinstall the n the app because it has stopped working entirely, 100 percent just the app I can turn the system on manually no problem also went out of my way to make sure my cell phone was on the same network, despite them seeing it wouldn’t need to be and no dice, before all this I’d say the app was ok at best","updated":"2020-08-09T06:07:47-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"6360011496","userName":"errl jones","userUrl":"https://itunes.apple.com/us/reviews/id1203874507","version":"8.2.3","score":1,"title":"To complicated","text":"I am an irrigation professional not an IT guy or part of geek squad.  To many steps to set up along with to many options. Also sometimes running manually interferes with program start times and run times. Also many customer think the app is over engineered and not user friendly. Between the watering triggers and the water reports something needs a major overhaul. Big fan of hunter controllers but I think they need to go back to the drawing board with this app. I spend more time programming and setting up the accounts for Hydrawise then I do installing the controller.","updated":"2020-08-25T10:13:23-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7859283509","userName":"HanmanAj","userUrl":"https://itunes.apple.com/us/reviews/id1061045118","version":"8.7.0","score":1,"title":"Unreliable","text":"It had always worked ok for me albeit a little cumbersome to do simple things like postpone a watering. The last few months have presented new problems with the app not controlling the HPC panel I have.  Ive deleted and reinstalled the app, even replaced the HPC panel. The panel is connected to our wifi with great strength but wont connect to the internet now so it does t take app updates, wont stop wattering with weather updates and I cant use the remote function to blow out the sprinklers for winter. Nothing changed on my end, but the app or webservice that these panels run on appears to be faulty.  Its pretty annoying.","updated":"2021-09-29T14:03:23-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7648145227","userName":"The tech Doc","userUrl":"https://itunes.apple.com/us/reviews/id41400080","version":"8.7.0","score":1,"title":"Doesn’t work","text":"Nice concept but it does not work. I spent at least 40 minutes to get it to work to no avail. Factory reset does not work either. Unit blinks amber and green with the WiFi indicating it is connected. When I return to the app it states it is not working. Customer support is no help either. Don’t waste your time or money on this product. Rule of thumb, if ratings are below a 3 don’t consider buying. I made an exception and got burned by this product. I generally don’t buy below a 4 star rating. My stupidity!! Hunter, please put out a better and well tested product. Evidently, that did not happen here😟","updated":"2021-08-02T16:31:19-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"6507570579","userName":"JLM-Oaktown","userUrl":"https://itunes.apple.com/us/reviews/id19847831","version":"8.6.0","score":4,"title":"Yes and...","text":"I agree, old architecture, overly complex and glitchy, and the app won’t let me add anyone as I am just the homeowner not the contractor. So I tried to upgrade and can’t get that to work. I asked for help via the website and not only received a reply within the hour but they fixed my mistake and added my user for me! Great customer service and response. Very impressed with that aspect of the app.","updated":"2020-10-06T11:49:29-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"6508663787","userName":"rrutland78","userUrl":"https://itunes.apple.com/us/reviews/id9210870","version":"8.6.0","score":2,"title":"Ok but needs some improvements","text":"When using the Remote tab to manually start the system, the lawn/flower/shrub icon needs to be displayed. The only way to know what type of plant you are watering is to remember the zone or take up space in the description. \n\nAlso there needs to be a simple way to stop a program after it has started running. Currently you have to go to the main screen, tap on each zone as it runs, and tap stop. There has to be a better way.","updated":"2020-10-06T19:49:16-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7869132249","userName":"freejack_1971","userUrl":"https://itunes.apple.com/us/reviews/id206900539","version":"8.7.0","score":1,"title":"I thought getting this would make things easier!","text":"I replaced my sprinkler controller with one that can use an app. I was thinking that it would be easier to set up schedules and watering times etc. with an app. Boy was I wrong! This thing tries to be too smart. And all I want to do is sit all my zones to run at 2 AM on certain days. I don’t care about weather predictions and blah blah blah. This app is very hard to use. I thought I can get my wife to use the app to plan schedules around her gardening. But she would never understand how to use this. I am very disappointed.","updated":"2021-10-02T05:43:16-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7755730608","userName":"Dad Iphone Anderson Broker","userUrl":"https://itunes.apple.com/us/reviews/id27839525","version":"8.7.0","score":5,"title":"Yes! Finally an app that works!","text":"As far as controller apps go, this is perfect.  I've only been using it for a week but I've been able to do everything I need to set my zones and schedules without ANY issues at all.  I'm so use to apps that have bugs I decided to write a review.  Who ever designed this app needs a raise!  Thank you!","updated":"2021-08-31T08:50:40-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"6556266794","userName":"Kim0875","userUrl":"https://itunes.apple.com/us/reviews/id16941360","version":"8.6.0","score":5,"title":"Great App","text":"Hydrawise works great for my home irrigation even when traveling.  Very easy to use and always working 5 years.  I note some people gave poor rating, they probably don’t know how to use the app, computer illiterate it is so easy to use or could be those people who love to complain about anything.","updated":"2020-10-20T13:19:32-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5669558185","userName":"Bunscuz","userUrl":"https://itunes.apple.com/us/reviews/id982266988","version":"8.0.9","score":5,"title":"Dial no more","text":"This technology is a contractors dream. No more gaining access to controllers and having to make trips when customers ask questions.  Second to none, the Hydrawise controllers and associated software have been a revelation for us. I don’t even present the customer with another option.","updated":"2020-03-16T12:17:50-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"6126260691","userName":"pmascare","userUrl":"https://itunes.apple.com/us/reviews/id397994668","version":"8.2.1","score":5,"title":"Nice Features","text":"I installed a new Hunter Pro HC12 controller (to replace a old manual controller) and set up the Hydrawise app in a couple of hours.  Been playing around with the advanced programming options and ‘smart’ watering features.  Found it all straightforward and reasonably intuitive.  So far no issues and a nice upgrade to my system.","updated":"2020-06-26T19:36:39-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7361007382","userName":"happy customer 2001","userUrl":"https://itunes.apple.com/us/reviews/id30859914","version":"8.7.0","score":2,"title":"App is not working well in 2021","text":"I had a Hunter control panel installed in 2020 and this app worked perfect. I might have had one issue the entire season. But now in 2022 I have had multiple issues in which the app is just not working. I have deleted the app multiple times and reinstalled it but to no avail. The Hunter control panel is connected to the WiFi so I don’t know what the issue is. Does anyone know if there is a support number to reach out to?\nThank you","updated":"2021-05-19T06:58:27-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5870741081","userName":"mwant999","userUrl":"https://itunes.apple.com/us/reviews/id42210797","version":"8.1.2","score":1,"title":"Keeps forgetting the log in details","text":"This app every month or so forgets the log in details! It’s also not a very clever app, tells me a zone has watered but has it really? Also the rain feature depends on a web site for info. Not sure which web site they using but its more wrong than right. People say we should have gone with Rainbird pity my installer did not give us the option. Will not work with this installer every again and have told the whole golf complex we live in.","updated":"2020-04-27T06:12:02-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7758758824","userName":"ffwright","userUrl":"https://itunes.apple.com/us/reviews/id48777293","version":"8.7.0","score":3,"title":"Decent, but needs an overhaul","text":"It could use an overhaul to make it more user friendly and also to be able to stay logged in without having to sign in every time or add the face and touch ID for easier login.","updated":"2021-09-01T05:43:48-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"6190795598","userName":"Damann431sft","userUrl":"https://itunes.apple.com/us/reviews/id42488385","version":"8.2.3","score":1,"title":"Bug found in watering zones","text":"There’s a bug that I’ve come across which is quite annoying and actually resulted in over watering my grass. I have three schedules setup:\n1: MWF for 1-7 zones of grass \n2: Sat for 6 zone of grass (note this zone should be water 4x due to the massive pine trees soaking up the water from the surface grass)\n3: MF for zones 8-9 (drip zones)\n\nThe problem lies in item 2 listed above. Items 1 and 2 use the same preprogrammed turf timer (35’ watering). Problem is that even though item 2 only list one zone 6. The bug in the SW somehow inherites the other zones for turf even though they are not scheduled. This is indeed a bug in the SW and not a user error. I’ve alleviated it by manually watering zone 6 once a week around the pine trees. Hopefully the SW app will be updated soon.","updated":"2020-07-12T16:12:33-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7627638442","userName":"Goatswillruletheworldsoon","userUrl":"https://itunes.apple.com/us/reviews/id43552731","version":"8.7.0","score":1,"title":"Not irrigating when I scheduled. Out dated.","text":"I have had the system for 4 years and it has got worse. Very disappointed. I have my garden zone set to water every day but it only waters once a week. Now having to hand water because it will only manually start if I start several times. Seems very glitchy.  Not user friendly. I have experience with other brands and would trust them more. Planning to switch controllers.","updated":"2021-07-28T06:46:24-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7454554805","userName":"hylton.b","userUrl":"https://itunes.apple.com/us/reviews/id49986664","version":"8.7.0","score":4,"title":"Use the website to program","text":"The app is for control, I’ve learned. Bust out the laptop to set your programs and schedules. Being able to copy zones and schedules would be very helpful for the app though. \n\nStrange behavior after starting zones from remote. Strange behaviors elsewhere.","updated":"2021-06-11T20:03:05-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7852498550","userName":"Avoid!!!!!!!!!!!!!!!","userUrl":"https://itunes.apple.com/us/reviews/id87835023","version":"8.7.0","score":1,"title":"Worst app on my phone","text":"Without exaggeration or embellishment this is the least reliable app on my phone. It’s difficult to log in, won’t stay logged in, won’t allow you to paste a password, and doesn’t save your info to easily log in. Have to close and open repeatedly just to get it to open. They must have saved a fortune on developing this thing and it shows.","updated":"2021-09-27T18:39:42-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5610530523","userName":"951Steve","userUrl":"https://itunes.apple.com/us/reviews/id1140747504","version":"8.0.4","score":5,"title":"Everything I need","text":"This app and controller gives me a remote and also tells me how much water I’ve saved. This has been the best internet controller by far.","updated":"2020-03-03T04:51:41-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7819226847","userName":"Monkeygirl48","userUrl":"https://itunes.apple.com/us/reviews/id125237569","version":"8.7.0","score":2,"title":"Sudden glitches","text":"This app has been working great until past 2 weeks. Now to use the app, I have to reboot my controller every time to reconnect app. Whatever changes you made has messed things up. Contractor reports numerous complaints from customers with same issues starting at the same time.","updated":"2021-09-18T07:38:18-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7798358233","userName":"Genoa Salami","userUrl":"https://itunes.apple.com/us/reviews/id259546510","version":"8.7.0","score":1,"title":"Green screen? Really?","text":"Any error on a log in attempt sends me to a green screen that hangs around for hours.  Then, if I attempt to reload or refresh my app, same dang green screen. And, then it magically will load my home page hours later.  Very poor app that unfortunately I am stuck with to use to operate my sprinkler system.  Wish my lawn was as green as the Hydrawise app screen.","updated":"2021-09-12T05:36:42-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7263135138","userName":"hartmandesign","userUrl":"https://itunes.apple.com/us/reviews/id171726807","version":"8.7.0","score":3,"title":"Random logouts a nuisance","text":"App works pretty well and offers a lot of watering flexibility for users. Handy to have to run zones start/stop just after install to check drips, heads, and tweak performance. Just wish it didn’t log me out every other day or so.","updated":"2021-04-25T09:55:32-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7895634853","userName":"UnknownUser136","userUrl":"https://itunes.apple.com/us/reviews/id44054280","version":"8.7.0","score":3,"title":"Needs updating","text":"The UI experience could use a vast update. I’ll give it a few more months but might switch over to Rachio system","updated":"2021-10-09T08:10:32-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7291266379","userName":"Martinazo66","userUrl":"https://itunes.apple.com/us/reviews/id169120215","version":"8.7.0","score":1,"title":"Lame","text":"This app won’t hold settings and randomly assigns watering times duration and frequency. It has over watered costing a LOT of money and wasting water during drought. I really want it to work and it seems simple enough, but I have entered settings so many times which is time consuming and complicated only to have it disregarded settings and full in on its own.","updated":"2021-05-02T18:42:30-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"6429242475","userName":"Tom's opinion","userUrl":"https://itunes.apple.com/us/reviews/id307680317","version":"8.2.3","score":1,"title":"Stupid","text":"I feel so stupid for assuming that this was compatible with Google Home. I just dropped all this money on upgrading my system and controller and it doesn’t work with my existing smart home. I just assumed because it’s basically standard... but nope.. no google compatibility. Why a company would alienate such a large base of customers is beyond me.","updated":"2020-09-14T12:30:48-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7240119058","userName":"Gvfunkingruvee","userUrl":"https://itunes.apple.com/us/reviews/id129321600","version":"8.7.0","score":4,"title":"Number of heads per zone please","text":"Seems like a simple additional feature: Number of heads in this zone. \nRight now I have it in the title of the zone. \nOtherwise pretty good for me.","updated":"2021-04-19T07:27:40-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5887223369","userName":"Releasethehounds","userUrl":"https://itunes.apple.com/us/reviews/id4875654","version":"8.1.2","score":1,"title":"Nothing works as it should.","text":"A huge pain to setup your controller. It’s horribly slow and always stalls. Don’t bother using it if someone owned the house before you, as you can’t connect the serial number number. Nothing about this is simple, or thought out correctly. The app and touchscreen are terribly finicky. I’m throwing it away and getting a B-hyve.","updated":"2020-04-30T23:05:53-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7152683256","userName":"commodore mark","userUrl":"https://itunes.apple.com/us/reviews/id16847137","version":"8.7.0","score":1,"title":"iPhone Version Still Broken","text":"I can’t paste a password into the app to log into it because it jumps around the screen. This has been broken for at least the last three versions. It makes the app unusable. Are you going to fix this?????","updated":"2021-03-27T17:52:06-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"8009855524","userName":"DuaneTheMonkey","userUrl":"https://itunes.apple.com/us/reviews/id43631143","version":"8.8.0","score":2,"title":"Dumb name. Can’t ever find.","text":"Can’t stand when developers name apps like this. I want to type Hunter or Sprinklers into my search to find on phone. Hydrowise is hard to remember so I need to flick through pages of apps to find. Use meta keywords so the app can be found.","updated":"2021-11-10T11:58:31-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7491345254","userName":"Sladicp","userUrl":"https://itunes.apple.com/us/reviews/id248269991","version":"8.7.0","score":2,"title":"Ugh, I dread going into this app everyday","text":"Why can’t there just be a week, you click the days you want, you choose the time for each day and how long the water will be on. It’s 2021, this can’t be that difficult. Cmon!!!","updated":"2021-06-21T17:22:52-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"6202227782","userName":"mjeshurun","userUrl":"https://itunes.apple.com/us/reviews/id43330076","version":"8.2.3","score":4,"title":"Nice!","text":"My contractor is really glad we switched to a smart irrigation system. Now he can set watering times remotely with ease. \niOS Dark Mode UI will be a welcomed aesthetic addition to the app.","updated":"2020-07-15T14:17:29-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7490356364","userName":"dgerman104","userUrl":"https://itunes.apple.com/us/reviews/id31604812","version":"8.7.0","score":1,"title":"Can’t order irrigation with IPad","text":"The Controller attached to the house is working, but with the IPad nothing happens anymore. My Wi- Fi is not great but the Controller is receiving signal very well, so why I can’t do anything anymore with the IPad. When I go to the Controller the Icon below has a Red Triangle even though is working.\nTerrible System!","updated":"2021-06-21T10:36:40-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5686063173","userName":"SunnyReed","userUrl":"https://itunes.apple.com/us/reviews/id27055527","version":"8.0.9","score":2,"title":"ignores rainfall, buggy app","text":"All zones are set to stop watering if rainfall is at least 0.1”\nThe controller diagnostics show good internet and server connection. It also confirms rainfall the past day is 0.3”\n(it rained all day). Yet it started watering.\n\nI tried filling out the contact form in the latest iphone Hydrawise app but none of the selectable fields work and it refuses to send the comment while complaining about unselected fields. A bit frustrated.\n\nVery buggy system and corresponding app.\nPro HC 24 Station Controller\nsw version 4.05","updated":"2020-03-20T01:58:39-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7442978746","userName":"Jelly the car guy","userUrl":"https://itunes.apple.com/us/reviews/id179121701","version":"8.7.0","score":2,"title":"Needs A Redesign","text":"This app has so many awesome possibilities! \n\nPlease update.\n\nBetter smart home integration, easier navigation, voice control, and better schedule planning interface all would be a great start.","updated":"2021-06-08T18:00:16-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"6113110277","userName":"Bumbed99","userUrl":"https://itunes.apple.com/us/reviews/id235505912","version":"8.2.1","score":1,"title":"Programming Just Doesn’t Work Right","text":"I’m an experienced computer user (and designer), but I am completely frustrated by this app. Even when I think I have figured out how to program different zones on different days, it doesn’t show the schedule I have programmed. Really, really bad app.","updated":"2020-06-23T10:31:45-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7214832380","userName":"PJBERBSR","userUrl":"https://itunes.apple.com/us/reviews/id1004304969","version":"8.7.0","score":4,"title":"Great Customer Service","text":"My irrigation contractor made a typo setting up my account in the app. Long story short Hydrawise Support responded in minutes with a simple fix. Kudos to Aaron Gagnon at Hydrawise.","updated":"2021-04-12T10:57:16-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7598819324","userName":"37 Clover","userUrl":"https://itunes.apple.com/us/reviews/id206742158","version":"8.7.0","score":1,"title":"Horrible App","text":"This app frequently “freezes” and gives a green/yellow hue blank screen for minutes and sometimes hours at a time .  I spent several hundred dollars for this system to get this horrible, broken App. I would give ZERO stars if possible Fix  It!","updated":"2021-07-20T11:35:19-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7499251615","userName":"Yoitzdro","userUrl":"https://itunes.apple.com/us/reviews/id113732621","version":"8.7.0","score":1,"title":"Smart home comparability","text":"They need to make it so you can use google home to control functions. I’m going to sell my controller to find a controller the is compatible with google home. Love Hunter products but disappointed the lack of compatibility with google.","updated":"2021-06-23T20:36:58-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"6930577078","userName":"AirTran for life","userUrl":"https://itunes.apple.com/us/reviews/id224629268","version":"8.6.3","score":1,"title":"App doesn’t talk to controller","text":"I got an email saying my controller was offline.  Well when I went to check it was showing connected.  So I went ahead and set it back to factory settings redid the wifi tool connect it to my modem.  It still doesn’t talk to the app!!!","updated":"2021-01-29T19:10:03-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"6117397220","userName":"astro.dave","userUrl":"https://itunes.apple.com/us/reviews/id18178377","version":"8.2.1","score":3,"title":"Controller not installed yet","text":"Just starting to use the app.\n\nKeyboard input is brutal - when trying to enter runtimes it takes multiple hits to get a keyboard to come up.\n\nAfter entering my zones - very painfully - it tells me that I need to choose a controller first - why the heck did you let me even start...\n\nAlso, I have my own weather station I don’t see how to use it (Davis Vantage 2 Pro).","updated":"2020-06-24T12:37:13-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5892092310","userName":"Gdenii","userUrl":"https://itunes.apple.com/us/reviews/id124866101","version":"8.1.2","score":2,"title":"Triggers","text":"Triggers don’t work. Two zones programs set with exactly the same settings. One goes, one doesn’t. Also wind is set for 12mph. Your forecast says 9. Won’t start until trigger is raised to 15.  Makes no sense at all.","updated":"2020-05-02T00:34:16-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7573580456","userName":"yo-GreenJean","userUrl":"https://itunes.apple.com/us/reviews/id283761598","version":"8.7.0","score":5,"title":"Great irrigation app and simple to use","text":"Thanks Hunter Industries for developing this irrigation app.  It’s simple to use and every one of my customers love it.  \n\nGino \nAqua Fiori Inc.","updated":"2021-07-13T18:00:30-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7548190650","userName":"DebRosie","userUrl":"https://itunes.apple.com/us/reviews/id42064837","version":"8.7.0","score":1,"title":"Hate this app","text":"This is a truly frustrating piece of software, clumsy and unresponsive with a poorly conceived user interface which requires three steps when one should do. If I’d known it was so poorly done I never would have purchased a Hunter system.","updated":"2021-07-06T22:40:14-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"6501003090","userName":"Bagelguy","userUrl":"https://itunes.apple.com/us/reviews/id33938037","version":"8.6.0","score":2,"title":"Not easy to use","text":"One of the worst designed apps I’ve ever used. Good connectivity but not easy to use or navigate through because it’s so poorly designed. They need a design team to rebuild it.","updated":"2020-10-04T14:46:27-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"6558430769","userName":"jk12345678901","userUrl":"https://itunes.apple.com/us/reviews/id39586213","version":"8.6.0","score":3,"title":"Freezes and crashes and bugs","text":"This app frequently seems to forget that I’m logged in, but if I force-quit the app it comes back (good!  don’t log me out!)\n\nMoving the cursor in a textbox will stop all hit the backspace from working.\n\nHad the app freeze up at least once.\n\nIt would be nice if it could understand that not all zones need to be mutually exclusive.","updated":"2020-10-21T05:43:53-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7517092553","userName":"Iffvjjggffhigg","userUrl":"https://itunes.apple.com/us/reviews/id254822164","version":"8.7.0","score":1,"title":"Extra purchase required","text":"Despite the “WIFI compatible” marketing scrawled all over your sprinkler controller it does not actually connect to wifi. You have to buy a “wifi module” in order for this all to work.","updated":"2021-06-28T15:59:04-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7501295786","userName":"ebuhrendorf","userUrl":"https://itunes.apple.com/us/reviews/id25041841","version":"8.7.0","score":3,"title":"No password manager support","text":"Logging in for the first time and no password manager support… ugh. Not a great start. Let me guess… no support for MFA TOTP next.","updated":"2021-06-24T09:35:12-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"6447018906","userName":"okie12764","userUrl":"https://itunes.apple.com/us/reviews/id333256056","version":"8.2.3","score":2,"title":"Loading problems","text":"Half the time I open app it fails to load. Have to delete and reinstall to get it to work.","updated":"2020-09-19T15:56:27-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"6213069612","userName":"Mattrizal McMillions","userUrl":"https://itunes.apple.com/us/reviews/id959877949","version":"8.2.3","score":1,"title":"Can’t even type in the fields","text":"The concept makes sense, and it does function (once it’s set up), however, you can’t even type in the fields to name your zones.\n\nThe app also crashes all the time.","updated":"2020-07-18T08:15:59-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5989701102","userName":"Optimus sub-prime","userUrl":"https://itunes.apple.com/us/reviews/id115875763","version":"8.1.2","score":1,"title":"Terrible - get something else","text":"The app is a nightmare of usability, setup and reliability. It’s like they looked for the most unintuitive way of doing anything. I finally gave up and tried Rachio...no doubt why they exist, their experience is miles ahead of this.","updated":"2020-05-24T16:50:27-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7616042193","userName":"LordCambridge","userUrl":"https://itunes.apple.com/us/reviews/id120024599","version":"8.7.0","score":1,"title":"App won’t load","text":"90% of the time I try to use the app it won’t load. this is the only app in my iPhone where I have this problem. In addition, frequently makes me re-login.","updated":"2021-07-25T04:20:38-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7106598350","userName":"woodruffpc","userUrl":"https://itunes.apple.com/us/reviews/id87639305","version":"8.7.0","score":1,"title":"Won’t connect to Eero Mesh Wi-Fi","text":"After upgrading my router to an Eero, this Hydrawise system cannot connect to Wi-Fi. All 30 of my other devices have no issues whatsoever. Now I am forced to manually start the sprinklers without the help of a Wi-Fi connection.","updated":"2021-03-15T11:38:44-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"6224462254","userName":"veedoubleugee","userUrl":"https://itunes.apple.com/us/reviews/id142296698","version":"8.2.3","score":2,"title":"Forgets your password with every update","text":"The app is acceptable but nothing to write home about. Hunter makes top notch products but their app is bottom of the barrel.","updated":"2020-07-21T08:34:14-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7564970818","userName":"bullman2410","userUrl":"https://itunes.apple.com/us/reviews/id30062790","version":"8.7.0","score":1,"title":"Needs updated","text":"The app crashes every time I try to get my wireless controller connected to Bluetooth or wifi. Extremely frustrating.","updated":"2021-07-11T09:48:09-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5608887408","userName":"doubleTdoubleN","userUrl":"https://itunes.apple.com/us/reviews/id902854158","version":"8.0.4","score":5,"title":"Easy Setup","text":"Up and running in 10min","updated":"2020-03-02T20:05:47-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7759023955","userName":"dg/play","userUrl":"https://itunes.apple.com/us/reviews/id1143353384","version":"8.7.0","score":1,"title":"Only loads 33 pics","text":"Tried adding a picture to each station on a large commercial system and it stops at 33! I have a 38 zone system, so frustrated.","updated":"2021-09-01T07:00:31-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"6541262837","userName":"William680","userUrl":"https://itunes.apple.com/us/reviews/id32261302","version":"8.6.0","score":1,"title":"App hangs every time I open","text":"I literally have to force quit the app every time I open. My builder installed in writing to them to let them know not to work with thud company in future.","updated":"2020-10-16T07:09:14-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"6212140342","userName":"DyR6774","userUrl":"https://itunes.apple.com/us/reviews/id112834112","version":"8.2.3","score":3,"title":"Useful but needs improvement ...","text":"I really like the idea of this app, The predictive watering all but eliminates the need for a rain sensor ... this alone makes the Hydrawise worthy of keeping. However, it could use one major improvement to make it more customizable and user friendly.  With its current settings, to run multiple programs at different times/days during the week, and for different durations, you have to stack programs ... or use the remote function to adjust the duration and zones to water, but the remote function has to be set manually each time and can’t be set as a recurring program. The Preconfigured Program in the app defaults to your original watering duration time, in this case we’ll use 30 min, which it won’t let you adjust.  To run a second program with a different duration you have to “stack” programs. An example of stacking would be if your normal watering time is 30 minutes at 7am, but you also wanted to syringe (spray or cool down) your lawn for 5 minutes at 4pm during the summer months ... the preconfigured watering program is almost useless in my opinion. To set up this program so you could syringe for 5 minutes, you would have to stack your main programs in 5 minute increments i.e. 7:00-7:05, 7:05-7:10, 7:10-7:15, 7:15-7:20, 7:20-7:25, 7:25-7:30, then you could set a schedule for syringing for 5 minutes at 4pm ... because now your main watering time is 5 minutes. Now imagine doing that for multiple zones .... and by the way, these are the instructions that Hunter has on their site!!  With the state of technology today, and all of the great, fantastical, and mind boggling things we can do with it, I only have one question .... why, why, why, why, and why???  I guess I’m just having a hard time trying to understand why I can’t go in and set up a 2nd, 3rd, 4th program etc, at the time of my choosing, for the duration of my choosing, on the days of my choosing, without having to jump through all these hoops, and stacking programs, to get it done?  This seems like it should be a fairly easy update to add .... shouldn’t it?  Having to make all of these ridiculous work arounds to do something so simple rates a 3 Star review, bordering on 2 stars ... with a couple of tweaks though, this could easily be a 5 Star review and a 5 Star app.","updated":"2020-07-18T03:01:13-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7156387431","userName":"KMacs New Mac","userUrl":"https://itunes.apple.com/us/reviews/id39043274","version":"8.7.0","score":1,"title":"Possibly the worst app ever","text":"Tried it, all sorts of issues. Doesn't connect, disconnects, faulty data, errors all over the place. A UI from 2002 to navigate. Good luck, keep your money.","updated":"2021-03-28T15:52:48-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7446468727","userName":"Olé dude","userUrl":"https://itunes.apple.com/us/reviews/id489685400","version":"8.7.0","score":3,"title":"Good app but logs you out frequently","text":"Good app but logs you out frequently","updated":"2021-06-09T16:02:10-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"6185053817","userName":"ace142000","userUrl":"https://itunes.apple.com/us/reviews/id546366100","version":"8.2.3","score":5,"title":"Custom parameters","text":"Enable custom parameters for things like, {if above 92°F, water 5 mins/station}","updated":"2020-07-11T05:28:09-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5966632979","userName":"Joe1blow","userUrl":"https://itunes.apple.com/us/reviews/id22560159","version":"8.1.2","score":1,"title":"Need To Pay for Additional Users","text":"If multiple family members need access to the app, you must upgrade to a yearly ‘Enthusiast’ membership for $63/year. \n\nOne star due to greed.","updated":"2020-05-19T10:28:27-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5890340613","userName":"Rosterbater","userUrl":"https://itunes.apple.com/us/reviews/id261381953","version":"8.1.2","score":1,"title":"Stalls","text":"App stalls upon opening. Takes too long from the point of clicking on it until it is up and running.","updated":"2020-05-01T14:54:34-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"6229701914","userName":"DFWorth","userUrl":"https://itunes.apple.com/us/reviews/id28825364","version":"8.2.3","score":1,"title":"Setup is awful","text":"If I could give this less than 1 star I would. Setup and ease of use is terrible. Only 2nd to trying to reach support","updated":"2020-07-22T15:03:31-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5603742578","userName":"Peeejjj","userUrl":"https://itunes.apple.com/us/reviews/id38907365","version":"8.0.4","score":1,"title":"Trash","text":"Updated to 1-star - absolute trash. All sorts of bugs in set up (you’ll have to use a browser versus the app) and only works 50% of the time. Go with Rainbird.","updated":"2020-03-01T16:33:28-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7430851691","userName":"OCFA ARFF","userUrl":"https://itunes.apple.com/us/reviews/id416059383","version":"8.7.0","score":1,"title":"Keeps crashing","text":"Crashes every time I get to step 3……..wish I never bought this controller and wand.","updated":"2021-06-05T13:53:09-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7618203489","userName":"thirsty lawn","userUrl":"https://itunes.apple.com/us/reviews/id23119914","version":"8.7.0","score":1,"title":"Most frustrating app","text":"Worst experience of any app!  Simply rework it and try again. 3rd graders could do better.","updated":"2021-07-25T18:14:38-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7891211896","userName":"Ali_Husain_110","userUrl":"https://itunes.apple.com/us/reviews/id382786711","version":"8.7.0","score":1,"title":"Please update the app","text":"App is crashing when trying to connect to Wi-Fi. It is if no use to me at this moment","updated":"2021-10-08T03:44:02-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7287294948","userName":"Kiki1234455677","userUrl":"https://itunes.apple.com/us/reviews/id157973441","version":"8.7.0","score":1,"title":"How does this thing even work?!?!","text":"I hate this program. It’s unnecessarily confusing and complicated.","updated":"2021-05-01T19:18:37-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7852721618","userName":"sweet potater","userUrl":"https://itunes.apple.com/us/reviews/id104647596","version":"8.7.0","score":1,"title":"Actual worst app?","text":"The UX is nearly impossible to figure out (same with the control panel) and the app routinely freezes.","updated":"2021-09-27T20:21:02-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"3945593266","userName":"TM in 78418","userUrl":"https://itunes.apple.com/us/reviews/id539711888","version":"7.0.3","score":3,"title":"Relatively good app","text":"I’ve been using this app off and on (mostly off) for over a year now.  The app is fairly intelligent as it integrates with external sources to provide predictive watering which is really nice - helps minimize water usage.  In terms of “usability”, The scheduling functionality is relatively simple although I am a really infrequent user and when I have had to go back in and tweak the schedule, it takes me time fumble around with the controls on the screen (drop down lists, etc).  Some appear disabled (greyed out) even though they are enabled, etc. If the scheduling was a bit more graphical, that would be beneficial.  In any case, it’s still fairly usable for an infrequent user.  \n\nThe one big thing I don’t like about this application is the manual login.  I should be able to authenticate using my fingerprint.  But, I don’t see that as an option and, is also the reason why I have been mostly “off” than on.  I forgot my password finally only after a few months got time to change my password and log back in.  You build a great app, but if it’s pain in the neck to get into, chances are you won’t use it to its maximum benefit.","updated":"2019-03-30T02:41:25-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7714661731","userName":"Scook2","userUrl":"https://itunes.apple.com/us/reviews/id298480091","version":"8.7.0","score":1,"title":"Horrible","text":"Doesn’t save password. Locks up.","updated":"2021-08-20T06:59:00-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"4826039160","userName":"Ernestom79","userUrl":"https://itunes.apple.com/us/reviews/id18066920","version":"7.3.4","score":3,"title":"Only a day ...","text":"I’ve only been using this for about a day. It’s nice to have control over the irrigation system from my phone. And so far, that seems to be working well. As far as I can tell it has all the same features as my old (no WiFi enabled controller) from the palm of your hand. \n\nHowever, there is in feature I cannot seem to locate after searching for hours. So, I tried using the “contact us” feature within the app and it’s awful. Most of the fields that require info don’t work (🤷🏽‍♂️). The words I’m typing into the fields don’t show so I have no idea if I’m typing the correct info or not. The field to select your model would drop a menu, I’d make my selection and nothing would happen so then I tried submitting anyway and it says please make a selection(even though I already did). Went through this a few times before finally giving up. \n\nI will continue to work towards a resolution for this issue and explore the new toy and report back with an update(hopefully raving)after a few weeks of use.","updated":"2019-09-22T18:49:31-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"2550753077","userName":"SprinklerLightingProTN","userUrl":"https://itunes.apple.com/us/reviews/id276892318","version":"6.0.11","score":3,"title":"Lots of Promise, yet Inconsistent Results","text":"As a long time fan of Hunter Industries, we install this controller for every new installation we provide. The efficiency is great. For the most part, the features provided by the software are far more useful that the competition.\n\nWith that said, there are several issues we continually deal with. iPhone 7+ and other devices will not load the app with notifications turned off. Tech support could not help and it is a continual issue. Notifications are off due to the issues with the proprietary flow sensor that gives false readings and we have had failures ever since we started installing them. We constantly get false alerts to leaks and waste time on service calls that are not there. But on the flip side, if there is a true leak, when don’t know what’s accurate and what’s not.\n\nOver all there is good promise with this app. The UI and UX needs a major overhaul. Notifications need to be fixed. And The Flow sensor errors need to be addressed as well. That could just be a hardware related issue.\n\nOther than those continual issues, in my professional opinion, this is a reliable and useful option for any true professional.","updated":"2018-05-15T07:14:02-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"820643945","userName":"JedWare","userUrl":"https://itunes.apple.com/us/reviews/id33226577","version":"2.0.1","score":4,"title":"Best Wi-Fi Sprinkler","text":"Researched many different companies and decided to go with Hydrawise.  It was easy to order and arrived quickly.  I had some issue with connecting to my wi-fi network but customer support resolved quickly and were very helpful.\n\nThus far I am very pleased with purchase.  The only downside is that it doesn't offer auto adjustments for rainfall unless you pay $60 a year.  For those of us that only water a max of 6 months a year it seems unlikely you can recoup that cost in water savings.  So now I have to manually delay but now I can do that even when I am away from home.\n\nThe auto adjustments for temperature and the ability to manually run while out in the yard and see actual watering time for week are invaluable.","updated":"2013-06-14T16:13:06-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"833600244","userName":"packerryan","userUrl":"https://itunes.apple.com/us/reviews/id32408570","version":"2.0.1","score":5,"title":"Best App I've Used In A Long Time!!!","text":"I have been searching for an automated sprinkler system for years.  This system and app is the best out there by far.   Within 10 minutes I unscrewed my old wires from the controller and screwed them back again into the Hydrawise unit.   I entered my wireless password and I was up and running.  I can walk around my yard and test the zones and sprinkler heads.  I can also get very sophisticated on how and when the system goes off based on the local weather and other factors.   \n\nDownload the trial and check it out.  It works EXACTLY as it says on the web site and EXACTLY how the trial works.  It's refreshing to spend money and have zero regrets.  Congrats Hydrawise!","updated":"2013-07-08T18:51:13-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"2664145209","userName":"jaymcq03","userUrl":"https://itunes.apple.com/us/reviews/id16268667","version":"6.1.1","score":5,"title":"Great Controller and App","text":"The Pro-HC controller has been exactly what we wanted in a residential controller with WIFI. Installation and setup was simple and has great connection to our router without slowing down our WIFI speed. The Hydrawise App is simple to use for setting up zones and preconfigured watering schedules. Having the app on my phone while installing or adjusting irrigation makes my life so easy instead of walking back and forth to the valves or the controller on the opposite side of the property, while responding very quickly through the App with little to no wait time. I would highly recommend this controller to anyone looking for a residential or small commercial project.","updated":"2018-06-08T21:05:20-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"2487213460","userName":"Pb39374","userUrl":"https://itunes.apple.com/us/reviews/id400945344","version":"6.0.7","score":3,"title":"Lots of Options","text":"Lots of options on here, but the display and functionality doesn’t seem fully compatible with iPhone X. When you type into the app, say changing the minutes to run a zone, it is not very responsive in terms of punching in the numbers. You have to keep pressing for it to register. In addition, there is no BACK button in this app. So you can’t just easily go in and out of different portions of the app. One more thing, for the iPhone X, the display of the buttons at the bottom of the screen are somewhat cut off at the ends and also in the middle with a little black line.","updated":"2018-04-30T03:52:28-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"2513593289","userName":"light_it_⬆️","userUrl":"https://itunes.apple.com/us/reviews/id668912442","version":"6.0.11","score":5,"title":"I can actually see what my controller is doing","text":"Change is tough especially when it comes to electronics but now that devices and platforms like Hydrawise are here, we can actually see how much water we are using and make changes to our sprinkler controllers from anywhere we have access to the internet. Thank you Hunter and Hydrawise for providing the most flexible and easy to manage platform on the market. Now we can actually manage our clients sprinkler timers and troubleshoot their problems remotely. The ability to print out reports to show clients their water usage is amazing and the ability to connect a flow meter to the controller is brilliant.","updated":"2018-05-06T15:18:42-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5563308990","userName":"kscorza","userUrl":"https://itunes.apple.com/us/reviews/id274118192","version":"8.0.2","score":5,"title":"Very good very simple app to use","text":"I have been installing The Hydrawise controllers for quite some time now and have used and taught 100’s of costumers to use this app. It has been very easy for most people to understand and navigate. It can be as simple or as powerful as needed. \n\nOf all the controllers I have used (which is just about all of them) this controller and the app are my favorite. It is simple to install, it is simple to use and Hunter tech support has been great for the few times I have needed them","updated":"2020-02-21T18:39:30-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5129030287","userName":"STE-3","userUrl":"https://itunes.apple.com/us/reviews/id28948255","version":"7.4.2","score":5,"title":"Works for me","text":"This is perfect. The app works with my sprinkler timer and does what it’s supposed to do. It increases the watering duration when it gets hotter outside and lowers the duration when it’s cooler. It’ll shut off when it’s going to rain. It takes a little knowledge to set the correct watering triggers. Anyone who gives it a bad review doesn’t know how to set up the app correctly. Once I set it up it worked perfectly and know I can see the history of what it’s watering and I don’t need to touch it again.","updated":"2019-11-12T12:53:27-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"4552226577","userName":"Someone took my nicknames","userUrl":"https://itunes.apple.com/us/reviews/id6427560","version":"7.2.7","score":1,"title":"App and controller not supported by anyone.","text":"Irrigation installers had no idea how to set up the app to work with the controller.  No phone number for them to call when we had problems with set up.  I though I figured it out and got it working, but got an email from support@hydrawise saying I needed to set up account.  So guess I didn’t.  😡😡😡 Emailed support for help, automated response.  The irrigation techs have no idea how to resolve the app and controller issue and have recommended I not use it, since there is zero support for the product.  But paid extra for a controller with WiFi and app.  But if app doesn’t work with the controller it came with and there is no wY to get support.  Looks like I will have to get a new irrigation company to get a product that works that is isnt this brand or app.","updated":"2019-08-01T13:28:32-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"1698009287","userName":"Boz Racing","userUrl":"https://itunes.apple.com/us/reviews/id34232043","version":"5.0.0","score":5,"title":"Let it Rain","text":"i actually used the App to configure my system even before the system went in. When the controller arrived i simply paired it up with the App and then wired in the zones\n\none bummer is that the report graph legends get cut off in the app so they are actually better viewed on the desktop - hopefully that can be fixed soon - finally an advantage to desktop use right?\n\ncoolest thing ever is controlling the system from your phone and watching the system do its thing from the comfort of your deck. Modern life is awesome","updated":"2017-07-25T12:25:43-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"1659988376","userName":"thisnicknameistakensdfsdfsdf","userUrl":"https://itunes.apple.com/us/reviews/id24130622","version":"5.0.0","score":4,"title":"Seems good, a few issues","text":"I can't compare this to other online irrigation control systems, but this one is the one our installation company uses, and it seems fine.  There are all kinds of different settings you can adjust, which is great.\n\nMy only two nitpicks:\n\nFirst, some of the settings are difficult to understand, for the consumer.\n\nSecond, the \"Observations\" panel on the Dashboard seems to be broken: it's blank where it should show current temperature and rainfall.\n\nThird, the system needs better information about rainfall, closer to real time.  I paid extra for this to avoid those embarrassing moments when the sprinklers are on in the middle of a rain storm.  But that literally happened last night.  For whatever reason, the information that we were being literally deluged with rain didn't make it to the system, so the sprinklers turned on during the storm.","updated":"2017-06-27T15:09:05-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5546368724","userName":"Houston Irrigator","userUrl":"https://itunes.apple.com/us/reviews/id135494242","version":"7.5.1","score":5,"title":"Get a Hunter Hydrawise controller!","text":"I’ve tried Rachio and Rainbird’s apps for their WiFi controllers and Hunter has nailed it. I also love that Hydrawise is available as a desktop website as well. \n\nThe reports are fantastic:\nWeather forecasts and historical weather data. \nWeather station based watering triggers are saving me a lot of money on my water bill while keeping my landscaping looking great. \nI can see when my system will not run due to forecasted weather triggers. \n\nEverything I need from a smart controller app is in Hydrawise. Plus, if I ever have any questions about my controller or app, Hunter has free technical support that can view activities in my controller log. This helps in correcting any mistakes I may have made to my programming or adjustments. \n\nGet a Hunter Hydrawise controller and the Hydrawise app, you’ll love it.","updated":"2020-02-17T20:57:04-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5548026759","userName":"Mikezots","userUrl":"https://itunes.apple.com/us/reviews/id41752390","version":"7.5.1","score":1,"title":"Loses data feed, wastes water. No fix in app!","text":"My chosen weather station stopped sending data. But can’t choose a new one, since I have too many for my plan. It should be simple, just deselect all stations and pick a new one. No, there is no deselect in the app where I can find it. The thing waters every day in the winter! Had to pause manually so I don’t waste water! So I try logging on in safari to change weather stations. Incompatible, “your browser blocks cookies”. It says click here to log in, brings up a blank screen and that’s it! No login!","updated":"2020-02-18T05:16:05-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"974953337","userName":"ASC7979","userUrl":"https://itunes.apple.com/us/reviews/id170427427","version":"2.1.4","score":5,"title":"STOP....this is the one you want!","text":"This is a great product, which is supported by a great staff. I can change the duration of watering from my iPad in less than 5 sec. When I was setting it up, I had to use 2 expanders which required tweaking of the software. They stayed with me to make sure everything was working.\n\nIt's exactly what I wanted, at a reasonable price, supported by a company with obviously has great leadership. (I was not paid for this review)","updated":"2014-04-10T14:32:16-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"652726637","userName":"Kevin Cheetham","userUrl":"https://itunes.apple.com/us/reviews/id34793295","version":"1.2","score":5,"title":"Great, simple and easy to use app!","text":"Very easy setup on website. Looked good so I ordered the controller. A few days later it arrived, took about 10 minutes to swap my old one out. Logged into website and put in controller ID and I was up and running!\n\nThe latest release allows for the saving of login information which makes it easier to use!\n\nHighly recommend this easy to use app!","updated":"2012-09-03T21:46:39-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"557423986","userName":"JerryGomez2002","userUrl":"https://itunes.apple.com/us/reviews/id151795386","version":"1.1","score":5,"title":"Great App, easy setup","text":"Did a ton of research on wifi sprinkler controllers. Most are too large (too many zones) and much more expensive than this one. Some of the lower cost wifi capable controllers, like open source solutions out there are primitive http intranets that require NAT or DMZ them to the Internet to control. With Hydrawise, you can leverage the cloud, similar to the Nest thermostat. I'm still new to this product, will provide more feedback soon.","updated":"2012-04-04T23:24:58-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"1602314448","userName":"PWilfred","userUrl":"https://itunes.apple.com/us/reviews/id101408382","version":"4.6.1","score":3,"title":"Decent concept","text":"I am a techie at heart.  The concept behind this app is decent.  Control your sprinklers with an app remotely through WiFi.  It seems to have most of the features that are needed to control so theoretically I will give it a 4 foe features.  \n\nBut who the heck designed the app???  In this day and age having such a terrible user interface is terrible.  \n\nMy advice is to hire a UI designer and make your awesome features work well.  So it gets 3 overall stars.","updated":"2017-05-01T06:18:33-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"2525831932","userName":"Cool kid422","userUrl":"https://itunes.apple.com/us/reviews/id7471869","version":"6.0.11","score":5,"title":"Not so App Savvy!","text":"Installed it this morning by myself and was worried about working through the app to load the 12 zones I have . Had one issue my own fault . I forgot to add WiFi password . But as soon as I added it ... Wa La !!! I was able to walk my yard and check I had zones labeled correctly and that they all worked properly ! Great product glad I added this system . Good job guys !","updated":"2018-05-09T16:35:25-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"586997449","userName":"ACSS","userUrl":"https://itunes.apple.com/us/reviews/id104205886","version":"1.1","score":5,"title":"Awesome!","text":"Being a Defense Contractor who travels constantly abroad, I was looking for a way to control my irrigation system here in the states while working in the war zones. I looked everywhere until I stumbled across Hydrawise. Fast shipping and easy installation and set up was a godsend. Works as advertised and flawlessly! A huge \"wow factor\" when friends are visiting :) Highly recommended!","updated":"2012-05-20T14:01:55-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"4455623268","userName":"Rane1011","userUrl":"https://itunes.apple.com/us/reviews/id260606285","version":"7.2.7","score":5,"title":"Awesome app!","text":"For someone who has the control box in the lower level of the house, this app is super convenient! The days of running up and down steps to configure the sprinklers are over! This app is very intelligent (sensing weather, humidity, and custom settings for temperatures) and very easy to use. Graphical interface is very chic and modern!! HIGHLY recommend this app!","updated":"2019-07-13T13:05:39-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"3896634720","userName":"kd5lef","userUrl":"https://itunes.apple.com/us/reviews/id652249079","version":"7.0.3","score":3,"title":"Decent until update","text":"Pretty good app until the latest upgrade. It pretty much went to hell after that. \nDefaulted suspensions and sprinklers went of when it was 6 degrees out. Lost 2 rotors as a result. Also changed language settings and I had to guess my way back to English. \nGoing through all settings and doing a basic reconfiguration to rule out more bugs.\nHope they get it straight on the next upgrade.","updated":"2019-03-18T05:27:46-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"1440332499","userName":"Coomie227","userUrl":"https://itunes.apple.com/us/reviews/id29433778","version":"4.2.0","score":5,"title":"Great app, 2 years of use","text":"I got the controller 2 years ago and have never regretted the extra money spent. I haven't had any issues with the hardware or this app. No bugs of crashes, just a product that works as advertised. Good job hydrawise. Hunter realized they were doing smart controllers right and acquired them earlier this year as well.","updated":"2016-08-27T17:15:00-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"2597396941","userName":"Upndair767","userUrl":"https://itunes.apple.com/us/reviews/id42364444","version":"6.0.11","score":1,"title":"Latest update stopped May 25, 2018 schedule.","text":"I have 26 stations I run every day starting at 7:00 pm and cycle until about 3:30 am the next morning. There is a grove that runs for 3 hours currently. The most recent update screwed everything up and the system failed up start the normally scheduled Friday run times. \n\nI am losing faith in your programming updates. The last three have not worked well. There seems to be un-intended negative results lately. Very bad and becoming unreliable.  The old program three revisions ago was much better.","updated":"2018-05-25T23:11:22-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"2548055800","userName":"AEH202","userUrl":"https://itunes.apple.com/us/reviews/id182629108","version":"6.0.11","score":1,"title":"Not really an App just a website link too small to read","text":"How do you rate an App that isn't? - 1 star since 0 isn't available. \n\nWanted to get this to the point that it was useful, but my invested time was rewarded with increasing frustration. \n\nThings you can't do: 1. Set a zone for every other day (only Even or Odd, with no adjustment for 31 day months), 2. Suspend just the next watering - 24 hours is minimum, 3. Override a bad weather forecast - my local station kept predicting 30-40 mph winds when we just had gentle breezes, 4.  Water based on High and Low temps for the day - it kept skipping early AM grass zone because the temp was low at 5:30 am, but was headed for the 90's. \n\nJust scratching the surface. My contractor specified this, I may bite the bullet and replace Hunter controller at my own additional expense. \n\n\"Loading awesomeness ...\" is the greeting. More like awfulness.","updated":"2018-05-14T17:30:26-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"2079325675","userName":"Whiznwilly","userUrl":"https://itunes.apple.com/us/reviews/id148397672","version":"5.3.2","score":3,"title":"Decent App","text":"It’s a decent app when it works and it’s convenient for me and my lifestyle. They app no longer will open up, just sits in opening screen. I’ve deleted the app and reinstalled several times. Each time the app opens the first time like it should but after that it will just freeze.","updated":"2018-01-11T11:15:13-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"2514537213","userName":"Whom pus","userUrl":"https://itunes.apple.com/us/reviews/id232580833","version":"6.0.11","score":5,"title":"Super easy to run","text":"I’ve had my Hydrawise for almost two years but probably only touched the controller three or four times. I don’t change my times that often but if I do it on my phone. The controller makes any day to day changes based off the forecast. Great product.","updated":"2018-05-06T21:33:42-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"2514352522","userName":"Bulllandscape LLC","userUrl":"https://itunes.apple.com/us/reviews/id107364425","version":"6.0.11","score":5,"title":"Love the app and my controller even more!","text":"I’ve been using the Hydrawise controller for about a year now and love it! I have called the Hunter technical service line twice now and both times found I programmed the controller incorrectly but they were happy to help me out anyway and now I’m doing awesome. Thanks Hydrawise!","updated":"2018-05-06T20:28:23-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"4319740805","userName":"Sunset5850","userUrl":"https://itunes.apple.com/us/reviews/id27303899","version":"7.2.3","score":1,"title":"Really buggy delivers False reports.","text":"This system and app should have been tested more extensively. It delivers reports of so called actual watering that are false. So your dealer, when monitoring remotely, thinks it’s working, and so do you, but it’s not. I’ve moved WiFi points to deliver a strong signal but it still delivers false reports and works intermittently. And the app works with some of my zones and not others despite both the dealer and my setting it up together. Thank goodness this month has been rainy anyway.","updated":"2019-06-15T06:46:35-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"1687416235","userName":"Scalptrash","userUrl":"https://itunes.apple.com/us/reviews/id31382816","version":"5.0.0","score":1,"title":"App hasn't worked for days","text":"Pros:\nOnce set up (not straight forward, simple or logical), it works. \nReports are nice and give pertinent information. \nEasy to pause sprinklers for any amount of time (in days).\n\nCons:\nBig learning curve, not logical or straight forward like competition. \nDifficult to adjust schedule, watering times, basically anything.\nScreen on unit is tiny and really only good for service people to start/stop zones while servicing. \nApp has worked fine for a year, but hasn't worked at all for several days now, just spins in loading screen. Have reset router, verified connection, tried three different devices. \n\nVery frustrated, I currently have no control via the app, making this worthless. If you are on the fence, go with the Rachio or RainMachine (if you need a screen).","updated":"2017-07-18T05:59:06-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5356597272","userName":"EliTheWolf","userUrl":"https://itunes.apple.com/us/reviews/id514773796","version":"7.5.0","score":1,"title":"Needs work","text":"Could the developers please rework the app? It is incredibly unintuitive to use and seems overly cluttered and disorganized. I also turned on one of those “don’t water if it rains” checkboxes, and a month later I discovered my orange tree was almost dead. The app was disabling its watering each week and I have no idea why. I just have no trust for the automatic features anymore, and I’m deeply regretting not going with another company.","updated":"2020-01-03T11:05:04-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"3021172990","userName":"@J11D","userUrl":"https://itunes.apple.com/us/reviews/id13188887","version":"6.2.0","score":2,"title":"Needs some work","text":"Clunky user interface and poor description of how various functions operate need to b cleaned up.  Selection of weather stations is limited to a few percent of those available unless you pay mor for a “enthusiast”plan to get accurate rainfall data (why not advertise THIS on the box?).  A good idea, but they need an experienced UX/UI person to take over the project and rework it.","updated":"2018-08-05T06:59:40-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"4394227496","userName":"j.coy","userUrl":"https://itunes.apple.com/us/reviews/id658486451","version":"7.2.7","score":5,"title":"Best Wi-Fi controller.","text":"After using and working with many other Wi-Fi controllers, this platform and the support that goes with it is absolute the best. Clients have found it to be more user friendly. Could be more satisfied with Hunter Irrigation","updated":"2019-06-30T18:36:35-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"2368355179","userName":"knigjteider","userUrl":"https://itunes.apple.com/us/reviews/id456376222","version":"6.0.2","score":1,"title":"Watering schedule is useless","text":"Now when you go to the watering schedule screen, you don’t see all your times, it shows a few tells you there is xmore, when you click on it it brings you to a day view but your schedule of when your zones will run are all smashed up and you see just colored lines can’t eve tell what it is. \nBring back the old display at least you can see things.","updated":"2018-03-31T11:09:43-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"3906087830","userName":"AMaench","userUrl":"https://itunes.apple.com/us/reviews/id41063601","version":"7.0.3","score":3,"title":"Bring back the slider for manually selecting time","text":"Who ever thought it was smart to remove the slider for the manual time selection should be fired. If you keep the wheel add a small button to make it easier to grab. Right now it’s a bad design.","updated":"2019-03-20T19:02:35-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"2887258955","userName":"DeanBlitzer","userUrl":"https://itunes.apple.com/us/reviews/id41392892","version":"6.1.3","score":1,"title":"Unable to use the app","text":"I have downloaded and deleted this app over 5x just to try and make it work. I have also reset my password to ensure I am using the correct password when attempting to log into the app. No matter what I do it will not let me log in to control my system. I have to keep a safari tab open just to access the system since the app doesn’t work. Pretty useless!","updated":"2018-07-11T14:25:35-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"2662739931","userName":"rcesp1","userUrl":"https://itunes.apple.com/us/reviews/id122297061","version":"6.1.2","score":5,"title":"Great App","text":"Use this app for my irrigation system and love the features and controls available to me while I am away. I would recommend this app if you have the Hydrawise  system.","updated":"2018-06-08T13:28:34-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5548236568","userName":"kevint81","userUrl":"https://itunes.apple.com/us/reviews/id27859081","version":"7.5.1","score":5,"title":"Flawless integration","text":"It was so easy to update my older hunter system. Hooked up super easy to out homes WiFi.  We love the new hydrawise system!","updated":"2020-02-18T06:13:47-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"2777276803","userName":"wneblett","userUrl":"https://itunes.apple.com/us/reviews/id32831867","version":"6.1.3","score":1,"title":"User interface is TERRIBLE","text":"I don't know if anyone could design a worse user interface. This is a kind of spreadsheet programming with multiple screens that don't relate. Was this written by the company CEO's daughter who is taking a web design in high school?  Someone should explain that the G in GUI is Graphical. It could not be worse. The sad part is that the hardware works perfectly if you can ever get the program right.","updated":"2018-06-26T16:01:48-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"2423294391","userName":"dansmitty","userUrl":"https://itunes.apple.com/us/reviews/id35340958","version":"6.0.6","score":5,"title":"Schedule view fixed, thanks!","text":"The daily watering schedule view is usable again.  No complaints now.","updated":"2018-04-14T14:54:48-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5296705470","userName":"mp ID for Apple","userUrl":"https://itunes.apple.com/us/reviews/id15520489","version":"7.4.7","score":5,"title":"Excellent support","text":"Updated yesterday, now it’s spinning and will not load the awesomeness. \n\nWith in an hour, I got the reply with fix. \nThank you Hydrawise...","updated":"2019-12-20T10:53:44-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"2451959527","userName":"Up1421","userUrl":"https://itunes.apple.com/us/reviews/id150117232","version":"6.0.7","score":2,"title":"Needs changes","text":"Watering schedule needs to be like it used to be. Can’t see what is what. Also, I don’t see a way to manually run an entire program. I can manually run individual zones, or all zones, but I can’t manually run a program. Would have to change the schedule in which it is set.","updated":"2018-04-21T19:09:04-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"3175873003","userName":"Kim3317","userUrl":"https://itunes.apple.com/us/reviews/id24543186","version":"6.3.1","score":1,"title":"Weather stations don’t record rain","text":"The change to the weather stations made spotty reporting of rain to no reporting of rain.  It has been raining hours per day for the last 4 days.  \n\nRain reported 0 inches.\n\nIf it were up to the ET function, I would need to water although there are pools of water in the streets which makes it basically useless.","updated":"2018-09-10T13:58:33-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"4048075152","userName":"bealsjon","userUrl":"https://itunes.apple.com/us/reviews/id140005938","version":"7.1.1","score":1,"title":"Poor messaging feature","text":"I am trying to send a message to my irrigation specialist via the app and the messaging feature does not allow me to see or edit what I type. \n\nThe app is what I expect from small company. Poorly designed with slow responding interface. But why offer writing and sending a message if it doesn’t work?","updated":"2019-04-22T18:40:42-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"3219614481","userName":"BaldGuysRock","userUrl":"https://itunes.apple.com/us/reviews/id104797514","version":"6.3.1","score":1,"title":"Bad Update","text":"My scheduled run times are not showing when I open each zone.  Refreshing the page per the embedded help does not fix anything.  Also, they did away with the global suspension removal function.  Now you have to open each zone, hit pause (not intuitive) then remove suspensions zone by zone.  Square this away now.","updated":"2018-09-22T20:00:56-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"4382922750","userName":"Pwrdbym","userUrl":"https://itunes.apple.com/us/reviews/id134747611","version":"7.2.7","score":3,"title":"Functional but cumbersome","text":"Overall this app works well but I find the scheduling function for zones/times to be incredibly cumbersome.  Good luck if you want to add a second watering schedule for a zone in the same day.","updated":"2019-06-28T14:31:28-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"2969369559","userName":"pepsgmc","userUrl":"https://itunes.apple.com/us/reviews/id633645277","version":"6.2.0","score":5,"title":"Love it","text":"Can you guys update the flow meter sensor and put alerts like a text message when it goes off & on  thanks","updated":"2018-07-25T18:04:57-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"1711403110","userName":"Mb_4126","userUrl":"https://itunes.apple.com/us/reviews/id580442686","version":"5.0.0","score":5,"title":"Omg luv it!!😘😘","text":"I use it for my backyard and it is the bomb. I would highly recommend this to anyone!! Don't listen to the people who hate this app is great!😀😀","updated":"2017-08-03T10:00:49-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5599294926","userName":"Sparky4ta","userUrl":"https://itunes.apple.com/us/reviews/id39885859","version":"8.0.2","score":1,"title":"Doesn’t work anymore","text":"When I first got this app it worked well.  Now I can’t even log in without it getting the ‘beach ball of death.’  The interface on the actual irrigation is so small that this was easier to use. Not anymore.  Please fix it.","updated":"2020-02-29T18:26:54-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"4993283138","userName":"Trekker63","userUrl":"https://itunes.apple.com/us/reviews/id137982075","version":"7.4.2","score":3,"title":"Reports issue after last update","text":"Report view no longer stays at monthly view, always reverts back to weekly.","updated":"2019-10-21T08:37:13-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"1895675931","userName":"live4Sports","userUrl":"https://itunes.apple.com/us/reviews/id35772648","version":"5.2.2","score":2,"title":"IPhone X","text":"App looks pretty terrible on the new iPhone. Being able to control your system from the phone is nice, but doesn't seem very smart. The system needs more babysitting then I would like instead of just set it and forget it.","updated":"2017-11-03T19:02:22-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"4334834878","userName":"denver24312","userUrl":"https://itunes.apple.com/us/reviews/id33083076","version":"7.2.7","score":2,"title":"Please modernize","text":"The app still feels amateur.  There see to be frequent updates and I do not understand why those updates do not include visual design support for the iPhone XS Max.  The icons at the bottom are difficult to select and interfere with the home bar.","updated":"2019-06-18T07:50:06-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"4227756339","userName":"Hox 313","userUrl":"https://itunes.apple.com/us/reviews/id348997729","version":"7.2.0","score":2,"title":"Very difficult to use","text":"Your application managers need to do some major work on making this app easier to use.\nI’d gladly trade in all of the “gee-whiz” functions regarding hot weather settings for a much simpler way of turning my sprinklers on / off or adjusting the schedule.","updated":"2019-05-28T19:09:50-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"4354481882","userName":"billyjoebobernest","userUrl":"https://itunes.apple.com/us/reviews/id7013582","version":"7.2.7","score":2,"title":"Needs work","text":"So far I’m not impressed.  Controller set up and connection with app went fine.  The manual operation of the controller though the app does not work and it is not clear why.","updated":"2019-06-22T13:21:51-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"4391702911","userName":"k_e_i_t_h","userUrl":"https://itunes.apple.com/us/reviews/id30826780","version":"7.2.7","score":1,"title":"Frustrating product","text":"Working fine, then logs me out and will not connect to my controller serial number... about to give up with Hydrawise’s extremely low effort to improve their user interface, customer service and product quality control.","updated":"2019-06-30T06:51:37-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"1943328910","userName":"Edgartv1","userUrl":"https://itunes.apple.com/us/reviews/id214429410","version":"5.3.2","score":4,"title":"Needs more work","text":"Unable to add a delay between a cycle, if I set to run all stations for 2 minutes, I can’t add a 20 or 30 seconds delay.","updated":"2017-11-23T10:17:38-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"4765431992","userName":"FrankTheTank014","userUrl":"https://itunes.apple.com/us/reviews/id128147702","version":"7.3.4","score":1,"title":"Not good at predicting","text":"We just had the largest rain of the year last night and this morning but my sprinklers still went on this morning even though my grass is a ocean due to the rain. The predictive/intelligent nature of this product needs work","updated":"2019-09-12T06:55:24-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"840664817","userName":"OnTheJobinCA","userUrl":"https://itunes.apple.com/us/reviews/id203138206","version":"2.0.1","score":5,"title":"Really nice","text":"Very impressed with the controller, app and customer support. All works extremely well.","updated":"2013-07-21T20:41:31-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"4004068208","userName":"s-p-m","userUrl":"https://itunes.apple.com/us/reviews/id33239608","version":"7.1.1","score":1,"title":"iPhone X Support","text":"Disgraceful lack of iPhone X home button-less screen support.  The only app on my phone that can’t seem to support the screen size with a proper buffer at the bottom. Every update that comes out I Hope is the one to fix it...but it never is...","updated":"2019-04-12T11:38:50-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5566602202","userName":"bannedinhillvalley","userUrl":"https://itunes.apple.com/us/reviews/id21969909","version":"8.0.2","score":1,"title":"App freezes every time I use it","text":"Every time I open the app and try to do anything it freezes and I have to force quit the app. Please fix this so I can actually set up my controller","updated":"2020-02-22T10:19:56-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"4481692615","userName":"Jim20191950","userUrl":"https://itunes.apple.com/us/reviews/id468700697","version":"7.2.7","score":2,"title":"Older iPad","text":"The recent updated app negates my ability to use it. I have an older iPad version 9.3.5. The newer app requires a much newer os.\nA request to offer the earlier version, evidently was not accepted.","updated":"2019-07-18T13:41:17-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"4306186980","userName":"LawBeforeGrace","userUrl":"https://itunes.apple.com/us/reviews/id32744980","version":"7.2.2","score":5,"title":"7.22 broke the app for me","text":"Watering via the app stopped working in the latest release (7.22).","updated":"2019-06-12T13:48:27-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"2550495596","userName":"The name not mentioned here","userUrl":"https://itunes.apple.com/us/reviews/id27996064","version":"6.0.11","score":5,"title":"Remote","text":"Still loving the remote access from my IPAD.","updated":"2018-05-15T06:01:56-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5305100489","userName":"#smarthomenot","userUrl":"https://itunes.apple.com/us/reviews/id38062830","version":"7.4.7","score":1,"title":"Won’t work with new iOS version","text":"This app is dead in the water using updated iOS.....Have to log in through the website to use my controller- help please","updated":"2019-12-22T08:01:18-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5300262340","userName":"jas092308","userUrl":"https://itunes.apple.com/us/reviews/id29990660","version":"7.4.7","score":2,"title":"New version is broken","text":"Awesome app usually but new version doesn’t load on my iPhone XS now. It just spins. Please fix it!!","updated":"2019-12-21T06:39:22-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"2589947252","userName":"realtt","userUrl":"https://itunes.apple.com/us/reviews/id41103210","version":"6.0.11","score":4,"title":"So far so good","text":"Works as designed but, not configured properly for IPhone X. The menus at the bottom need fixing.","updated":"2018-05-24T06:44:59-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5589138908","userName":"jiimy","userUrl":"https://itunes.apple.com/us/reviews/id35026782","version":"8.0.2","score":1,"title":"Great when it works","text":"The app keeps on locking up.  Makes running your automated water system difficult.  Disappointing.","updated":"2020-02-27T14:27:39-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7014128194","userName":"SC Frisbee","userUrl":"https://itunes.apple.com/us/reviews/id161261699","version":"8.6.3","score":3,"title":"Can't paste into login box after update","text":"Since the last update, I haven't been able to paste in login or password information from my password manager into login modal box.\n\nUpdate 2/19/21: Developer sent message that this bug was fixed. Per directions, I deleted Hydrawise app completely from phone running current iOS 14.4 and installed the latest version of the app. \n\nNow I can paste the username from 1Password but still cannot paste the password. Also the keyboard stays up and gets in way when trying to paste either the username and password. \n\nAdded a star for developer response and partial solution.","updated":"2021-02-19T09:30:24-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"2257134566","userName":"Den Den Pet","userUrl":"https://itunes.apple.com/us/reviews/id275309794","version":"5.4.2","score":1,"title":"App stopped working","text":"After last app update, this App stopped working on both iPad and iPhone 6s. Says the controller is stopped. However, I can manually run from the controller. Please fix!!!","updated":"2018-02-28T13:56:25-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"3042390265","userName":"jameenh","userUrl":"https://itunes.apple.com/us/reviews/id153795950","version":"6.2.0","score":2,"title":"Inconsistent","text":"The app works inconsistently. I’m sitting in view of my yard and the app says it started a sprinkler region yet I can see it is not on. I have to start from the unit.","updated":"2018-08-09T18:06:54-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"4327830526","userName":"ElBroBro","userUrl":"https://itunes.apple.com/us/reviews/id456021550","version":"7.2.3","score":1,"title":"Garbage app - doesn’t work at all","text":"This app stinks, won’t launch - it’s been over a year now with updates, and it won’t load properly.   Unusable!!","updated":"2019-06-16T19:21:24-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5293233911","userName":"grumpyolddude","userUrl":"https://itunes.apple.com/us/reviews/id1064367535","version":"7.4.7","score":1,"title":"Stopped working","text":"Updated the app and now it won’t load, just sits there trying.","updated":"2019-12-19T16:23:23-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"4243230221","userName":"mk2533","userUrl":"https://itunes.apple.com/us/reviews/id379733735","version":"7.2.2","score":1,"title":"Reports Dashboard Crashing","text":"The reports dashboard is no longer functional, at all, since last update. Please fix soon","updated":"2019-05-31T18:45:56-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"2355304474","userName":"UnprofessionalReviewer","userUrl":"https://itunes.apple.com/us/reviews/id114481461","version":"6.0.2","score":1,"title":"Simply does not work","text":"I can access my unit just fine via the web portal, but app just spins infinitely despite multiple re-installs. Garbage.","updated":"2018-03-28T03:56:01-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"3295929353","userName":"GTSJEFE","userUrl":"https://itunes.apple.com/us/reviews/id235758505","version":"6.3.1","score":1,"title":"Why!!","text":"Why is it that the forecast calls for rain, it’s raining, but your controller still turns on to water? Hydrawise is....","updated":"2018-10-13T00:33:44-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"4336404484","userName":"Highvoltage_3","userUrl":"https://itunes.apple.com/us/reviews/id35551150","version":"7.2.7","score":1,"title":"Homeowner","text":"Latest version loads but does not launch on iPhone 4s.","updated":"2019-06-18T16:58:03-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"1928250021","userName":"Humble GOAT","userUrl":"https://itunes.apple.com/us/reviews/id30090569","version":"5.2.2","score":1,"title":"Needs Updated","text":"Looks terrible on iPhone X.","updated":"2017-11-17T11:43:50-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"4004762267","userName":"ruined a good product","userUrl":"https://itunes.apple.com/us/reviews/id133398435","version":"7.1.1","score":1,"title":"Garbage","text":"Absolutely terrible","updated":"2019-04-12T16:07:42-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7813295190","userName":"Rb-fan","userUrl":"https://itunes.apple.com/us/reviews/id112075851","version":"8.7.0","score":1,"title":"Weak","text":"Facebook login doesn’t work, and this app makes you enter username and password every time you open it up.","updated":"2021-09-16T14:03:08-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7631360896","userName":"2muchnoise","userUrl":"https://itunes.apple.com/us/reviews/id217729638","version":"8.7.0","score":2,"title":"What’s going on?","text":"This app was fine but has become consistently stuck . I have deleted and replace it 4 times in the last week.It needs attention !","updated":"2021-07-29T06:16:18-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"7113016146","userName":"dajohnson17","userUrl":"https://itunes.apple.com/us/reviews/id225317820","version":"8.7.0","score":2,"title":"Frustrated","text":"Worked great for 6 months.  Wifi on my Hunter X2 stopped working and when I tried to reconnect via the app, the app just closes.  No way to access the WiFi adapter.   \n\nThe system went offline on Monday (app last date and time)3/15/2021.  Just noticed today 3/17/2021.  I don’t know if this is related to the latest release with Bluetooth capability.  Very frustrated.","updated":"2021-03-17T06:18:06-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"6362725959","userName":"80AM","userUrl":"https://itunes.apple.com/us/reviews/id133149067","version":"8.2.3","score":3,"title":"Poor layout","text":"I don’t understand why you would set the run time for the zone... The run time should be stored in the Program.  I want to be able to run a program in the afternoon for a shorter amount of time to keep new grass seed wet. This issue makes me wish I bought a different product.\n\nEdit: changing my rating from 1 to 3 stars because I figured out how to set up different run times. Basically you need to set the zone to 10 minutes (for example) then give it 3 start times if you want it to run for 30 min. \nEek..\n\nUpdate 8/26/2020\nIf you want a much easier way to control your Hydrawise system you can add it to HomeKit using a PC program called Homebridge. No extra hardware needed.","updated":"2020-08-26T05:04:59-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"6614953615","userName":"massivepool","userUrl":"https://itunes.apple.com/us/reviews/id484430398","version":"8.6.0","score":1,"title":"App needs work","text":"With a large complicated system, you should have more functionality. \n\nAlso, several glitches so far as well. \n\n- Need ability to swipe a program on/off\n- Add a total runtime Calc on the program\n- need ability to run zones in different numerical order. Not just in the order it was programmed. (Ex. 7/14/32/9/10)\n- Need to be able to save more than 6 programs. Large systems and seasonal changes need more. \n\nHas such a great potential to be amazing, just needs a couple more things to make like easy.","updated":"2020-11-06T05:22:56-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5994619297","userName":"979KC","userUrl":"https://itunes.apple.com/us/reviews/id887937712","version":"8.2.0","score":2,"title":"Pain in the butt to use","text":"Using this with a new irrigation install. This app is a pain in the butt to use. While it is neat to run the sprinklers at the tap of the phone screen, it takes 15 minutes to remember where I go to even shut the sprinkler off when I don’t want it to run. I’d rather have a basic non-WiFi box like my last house. \n\nThe KISS principle would help wonders!","updated":"2020-05-25T21:00:53-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5961509583","userName":"VintageBeachgirl","userUrl":"https://itunes.apple.com/us/reviews/id104388470","version":"8.1.2","score":4,"title":"Our 2nd yr using this app with the Hunter WiFi Controller","text":"Overall I like this app as it enables me to adjust watering schedules to separate zones even when we’re out of town. \nI’ve set up weather stations in our area and a virtual weather station at our home and our irrigation runs based on the weather reports averaged between the stations. We do pay a yearly fee to allow us to use more weather stations but it’s worth it to us. \nThe setup for basic watering using multiple zones is fairly painless.\nHowever setting up the parameters for current weather information from weather stations to control irrigation is a bit more complicated. \nThe complication arises from the fact that you cannot see both the page you’re working on and the instructions at the same time. \nUsing screen shots of the instructions on my iPhone and the setup page on my iPad made the process somewhat simpler.\nThe one complaint I have is user support: \nTyping into the help screen is a joke, I find it almost impossible to correct typos as there seems to be no back function, no way to use the curser for correction and sometimes it freezes up completely and I have to close then reopen the app and begin again. \nThat’s all very frustrating but that’s not the worst!\nOn 09/05/19 I was finally able to send a coherent message about using the run time calculator, which requires setting up a separate account. \nI had numerous times attempted to set up that account but the program would recognize neither the username nor the password I’d set up when I tried to log in. \nAfter numerous attempts I send an email  about this problem giving the information about the app not recognizing the username or password. \nI was told I needed to set up a separate account...... really? \nI replied that I was aware of that and explained again what the issue was and in next email I received I was asked had I tried to use the “forgot Password” option.\nI affirmed I had but since the program did not recognize my username that was useless. \nOn 09/06/19 I received a reply stating that the gentleman I was corresponding with would contact a rep who could assist me with this issue....... to date I have had no reply. \nI did receive another email on 09/07 asking what I thought of the customer service I received...... I only wish there had been an option other than “Good, I’m satisfied” and “Bad, I’m unsatisfied”...... I checked “Bad” but again have had no reply.\nIt appears to me that customer service here is rather nonexistent.\nUPDATE 05/15/2020\nClearly no one at Hunter cares about customer issues or reads these reviews. \nI have yet to receive a reply from anyone at Hunter for my September 2019 issue. \nIf I hadn’t already bought the Hunter WiFi controller and gone to the trouble of setting up this app I would probably look for something else to use. \nThat’s sad because this app has such great potential for homeowners who care about their landscaping!","updated":"2020-05-18T07:43:17-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"4246514031","userName":"WeAreNotAmusedEither","userUrl":"https://itunes.apple.com/us/reviews/id197401826","version":"7.2.2","score":1,"title":"Took something that should be very simple and reeeeallly effed it up.","text":"How frustrating. Not sure how many updates there have been but both iOS and Android versions now have THE BUGGIEST tap-to-fill-fields and even the “Next” buttons and pull down menus are hinky. \n\nWhat should be a delight to use just keeps getting worse. :( Get it together Hunter.","updated":"2019-06-01T08:29:23-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5631404797","userName":"homm99","userUrl":"https://itunes.apple.com/us/reviews/id24276765","version":"8.0.8","score":5,"title":"Best wifi controller on the market!","text":"I have tried several WiFi enabled controllers, Hydrawise by far is the most complete and intuitive sprinkler controller on the market! Very simple to set up as it walks you through step by step. \n\nI did install a flow sensor that works incredible! This Hydrawise controller has so many features compared to others. I am able to program from the controller, has predictive watering, monitors electrical current and also monitors flow to alert you if there is an electrical issue or broken water lines. The other controllers I have tried are not capable of these items. It also works with Amazon Alexa!\n\n Rain bird WiFi controller is only app based not web based so, zero control on others devices such as tablet or PC. The weather pulls from a zip code so it’s not very accurate with the weather and adjusting the schedule. Because it’s app based, if you loose your phone you have to reprogram all zones with your phone. \n\nRachio controller is okay but must be programmed with the phone. No walking up to the controller to start a zone. \n\nHydrawise by far is hands down the  best WiFi controller on the market!","updated":"2020-03-07T22:10:24-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"},{"id":"5309947597","userName":"High End User","userUrl":"https://itunes.apple.com/us/reviews/id15692790","version":"7.4.8","score":5,"title":"Connection Issue","text":"Connection Issue fixed. Thank you Hydrawise. I’ve updated my rating to 5 Stars :)\n\nAfter the last update 12/15/2019 the app no longer reaches Hydrawise web link. I can connect to my unit via the Hydrawise website, but app just continues to spin when opened with the message “Loading awesomeness.....” update the last update it worked. Please fix this issue.","updated":"2019-12-23T11:20:27-07:00","url":"https://itunes.apple.com/us/review?id=490594689&type=Purple%20Software"}]