[{"id":"1627910872","userName":"Dirk D.","userUrl":"https://itunes.apple.com/us/reviews/id25053893","version":"1.15.3","score":2,"title":"One word: Buggy","text":"It took me over a year to finally get my two homes (primary and vacation) working perfectly. Some wired units had to be replaced for failure to connect - may be my fault for mis-wirring. I'm giving them the benefit of doubt. I've bought range extenders. I've changed outdoor timers. I have my primary wired with lots of lamps and outdoor lights on a schedule. I have cameras to monitor my vacation home - which was a primary factor in my purchase. It took lots of tech support to get the cameras operating correctly for remote viewing, but when working they were great.\n\nLots of upfront cost, BUT I prefer that over monthly fees some systems require. I don't like the fact that I can't have more than one schedule to come on at sunset - everything that turns on at sunset must go off at the same time.\n\nNow I go on vacation and I can't connect. My lake house alarm goes off and my alarm app tells me it's a motion sensor. Insteon fails to connect and I can't see inside. I can't connect to anything. I get home and still can't connect. I can't even connect inside my primary residence. Frustrating is an understatement. Is this a result of the hubs planned - and then delayed - updated?","updated":"2017-05-29T10:31:36-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3768652601","userName":"Tyhtytyn","userUrl":"https://itunes.apple.com/us/reviews/id145781215","version":"1.15.4","score":2,"title":"Getting better but missing some things","text":"The UI is a little cumbersome to navigate. Alerts are nice but need their own menu section to allow me to view, edit, and add all the alerts from one screen. Also, alerts need a schedule of their own. I may only care about an alert at a certain time of day or day of the week. My garage door app has that and it makes a lot of sense.\n\nUpdate:\nPlease make some updates to the feature set of this app. Allow for multiple schedules per device or seen. Allow time flexibility within those schedules so it doesn’t look like a computer is turning the lights on and off every day.\n\nI downgraded the rating because this app gets updated once a year and even then it’s not adding new features. Please start putting some development effort into the app and hub.","updated":"2019-02-14T04:19:17-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"2277241786","userName":"YanceMaster","userUrl":"https://itunes.apple.com/us/reviews/id100308139","version":"1.15.4","score":1,"title":"Would be 4-5 when they fix fatal flaw in App","text":"Your iOS App has a fatal flaw; I am writing to hope that your developers can fix this problem. For those who have multiple sites under \"House Management: Current House\", you need to fix the app so that the user can chose the current house at startup. At the present, the app defaults to the last chosen Current House, and this leads to preventing the user from connecting to any of their Houses, if the last house chosen has lost power. In the event of a power failure, the App ALWAYS continues to connect to the house with no power when that was the last house chosen, which prevents the user to connecting to any house, as there is no way to get to the settings menu to allow the user to change to a house that has power, so the app becomes useless for any account that has multiple houses.  There needs to be a user choice at startup to allow the user to switch Current House settings in the event that the app cannot connect to the last setting, in the case that either the server cannot be reached for any reason: power outage, internet connection problems, etc... you get the point.","updated":"2018-03-06T06:43:37-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"7626428000","userName":"Mike199","userUrl":"https://itunes.apple.com/us/reviews/id43514035","version":"1.15.4","score":5,"title":"Stop Complaining and Use This App!","text":"It’s July 28, 2021 and I just let my $50/year MobiLink subscription expire because this app does everything I need to do when away from home.  My Insteon system currently has 20 scenes (7 of which are scheduled), 32 KeypadLink buttons, and 23 other devices including an IO Link.  Everything is set up and managed via the ISY Admin Console on my Mac.  I don’t need to run every scene or set up any schedules when away from home, and it was no big deal to reprogram four scenes into this app.  This app runs the IO Link whereas the newer Insteon app does not, and this app works faultlessly across both my wife’s and my iPhones running the current iOS.  I have the newer Insteon Hub installed and I highly recommend this app to everyone who does.","updated":"2021-07-27T23:26:23-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"6578056175","userName":"zorkguy","userUrl":"https://itunes.apple.com/us/reviews/id37560565","version":"1.15.4","score":1,"title":"Awful, awful.","text":"Minimum number of features, not to mention very buggy. Two of my water sensors show as being triggered all the time. There seems to be no way to reset them, despite having rebooted everything multiple times and gone through the forget and reinstall procedures several times. These sensors work perfectly with the Indigo home automation program, just not with Insteon's own app. Update: it shows the wrong IP address for all three of my cameras, and yet it still controls them. End it won’t allow me to change the IP address to the correct one. Poorly written software.\n\nEdit: You can’t change your email address without change in your account name. This means if you get a new email address you have to wipe all of the information in the app and start all over again adding devices. Whoever wrote this software should be fired.","updated":"2020-10-26T20:44:07-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1671636976","userName":"Den CO T","userUrl":"https://itunes.apple.com/us/reviews/id25975174","version":"1.15.3","score":1,"title":"Too basic and out of date","text":"The app is years behind the state of the art and the abilities that are available in competing products/apps. Insteon is not user friendly nor is it flexible, compatible with other systems, or capable of some basic type of programming. \n\nFor example, you cannot use a sensor to turn on a light for 10 minutes (or any other duration). \n\nYou cannot have two scenes (programs) that start at the same time (e.g., sunset). The app actually tells you to combine the scenes. That does a user no good, if the scenes are supposed to end at different times (or duration... if the app actually supported durations).\n\nInsteon, please update the app and your hub to modern standards.\n\nFollow-up: I tried using Alexa with the hub/app. That also barely works. Alexa shows notes that it cannot control scenes. Also, if you say, \"Turn off the porch light,\" Alexa does not work, because it does not know it is a light. It only understands, \"Turn off the porch.\"  It is a bit of a bigger deal with the garage door opener, because it is much more unnatural to say, \"Turn on garage door\" to open the garage. \n\nInsteon, please add interoperability with Wink.  Their hub is hardware agnostic and works well for programming different scenarios and works well with Alexa.","updated":"2017-07-06T12:26:13-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3613965974","userName":"cjohnson14086","userUrl":"https://itunes.apple.com/us/reviews/id101413854","version":"1.15.4","score":1,"title":"Absolute garbage","text":"We can rarely connect to the app. Somehow the existing connected dimmer switch devices still function through Alexa, but accessing the Insteon app after login just yields a spinning wheel and the eventual error message stating it can’t connect to the hub. This is our second unit, we replaced the first for similar issues before it stopped working all together. The hub spends most of its time in a disconnected error state which means it has to be unplugged and re-plugged in to regain a solid green light and connection. It’s literally four inches from the range extender it connects to! This thing is becoming more frustration than its worth. If we are unable to get a resolution we’ll be returning it again and going with a different brand next time around. Very disappointing.","updated":"2019-01-04T22:40:28-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"4349310195","userName":"Opinion90","userUrl":"https://itunes.apple.com/us/reviews/id336625035","version":"1.15.4","score":5,"title":"Works great for me.","text":"I just bought the Insteon Hub and linked 5 devices (4 modules and a switch).    I had it all up and running in 45 minutes, including wiring in the switch.  Linking devices takes 1 minute per device and is super easy.  The App design is good in my opinion.   This new system replaced an older X10 system that was fraught with problems so maybe my expectations were low, but I am thrilled so far and didn’t expect to like it this much.   I won’t ever have 20 devices on it like some people — for how I use it, it is great so far.","updated":"2019-06-21T13:08:52-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"7103426800","userName":"BobcatALR","userUrl":"https://itunes.apple.com/us/reviews/id451597584","version":"1.15.4","score":1,"title":"What a complete joke","text":"Featureless. Even those features that do work are severely handicapped. You cannot have more than one scene respond to sunrise/sunset? Really?! Even the old x10 junk could do that. And just try to set a schedule time in ios14.X. It’s like trying to use a slot machine to set time- minutes constantly scroll, and it ignores touches to reduce the number. This is basic stuff they’re failing on. I guess they want everyone to spend a couple hundred on an isy994i - but that’s overkill for most installs - and also fails at some very basic programming functions (like no calendar. Really?!).\n\nLosing my appetite for insteon, and have been an insteon user since its earliest days. Shameful.","updated":"2021-03-14T14:40:21-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"4902241472","userName":"Manuel_Alonso","userUrl":"https://itunes.apple.com/us/reviews/id135959728","version":"1.15.4","score":1,"title":"Sad future","text":"I have been faithful to Insteon for over 17 years ... but in recent years they have not improved ... there is no progress in the application that certainly stopped working with Apple Watch a long time ago ... I used other devices like isy ... that helped mitigate the lack of advances in its platform ... the arrival of cheaper and more compatible technologies is taking away the Market from Insteon... to that we must add the unfulfilled promises they make when they talk about system updates.  .. where for months nothing changes ... it is sad but gradually I am migrating to other alternatives ...","updated":"2019-10-06T18:41:46-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1694160123","userName":"ZombieGod2","userUrl":"https://itunes.apple.com/us/reviews/id34623405","version":"1.15.3","score":4,"title":"Sensors notifications master on/off needed","text":"The setup works OK. I wish there was an option to turn sensor notifications on/off when I am at home (kind of like arm/disarm option where you can create and manage a group of devices for which you want the functionality). I just do not want to get alerts every time door/motion/window sensor goes off when I am at home. How about that Insteon team?","updated":"2017-07-22T19:57:50-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3763017067","userName":"Rwp120","userUrl":"https://itunes.apple.com/us/reviews/id87430358","version":"1.15.4","score":2,"title":"Used to be happy","text":"I used to love this app as it worked great with my 70+ devices but it’s been over a year since the last app update and it hasn’t worked with the Apple Watch in months. A company that blatantly ignores cries from its customers and won’t update applications is an indication that the company is about to abandon its product line. I won’t buy another Insteon device for fear that I’ll never be able to replace them if they break in the future. Insteon needs to update its app and I’ll update my review.","updated":"2019-02-12T15:02:33-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3261459641","userName":"Tboy2009","userUrl":"https://itunes.apple.com/us/reviews/id43203472","version":"1.15.4","score":2,"title":"App Keeps Making me Login - Apple Watch Broken","text":"App is mediocre and now Apple Watch doesn’t work with ios5. Would love a more consistent experience and a little more love for those who rely on it daily. Too bad Insteon doesn't ever read these reviews and use them as bug fix requests. Seems like they could benefit by trying to release a version that gets decent reviews at least once during its lifecycle. Also, it would be nice if the sunrise/sunset schedulesworked like they were supposed to.","updated":"2018-10-03T22:10:30-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3580139105","userName":"themeparkdad","userUrl":"https://itunes.apple.com/us/reviews/id39051267","version":"1.15.4","score":2,"title":"Abandoned developer support on Apple Watch","text":"This app has always had rocky support. Apple Watch connectivity last worked on WatchOS 3. Doesn’t work on anything newer. It’s a good product but has been neglected for a long time. If I was starting over creating my automated house, I probably wouldn’t choose these modules and software package again due to low interest by the developer.","updated":"2018-12-27T07:52:43-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1951358437","userName":"BatesJF","userUrl":"https://itunes.apple.com/us/reviews/id227632141","version":"1.15.3","score":1,"title":"Take it back to the store","text":"Terrible product. Apple Watch app works about 10% of the time. iPhone app works much better, but still unreliable and as such, totally unacceptable. Occasionally, the app won’t connect to Insteon account servers, rendering one unable to use the equipment. I should not have to sign in for a light switch to work. Come on. \n\nI’ve never been so frustrated with a light switch in my life. I never thought a light switch would be something that I could be frustrated with multiple days of the week. Thanks, Insteon?","updated":"2017-11-26T15:43:55-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3435932262","userName":"Trail walker 2020","userUrl":"https://itunes.apple.com/us/reviews/id245471084","version":"1.15.4","score":3,"title":"Unreliable","text":"Great concept however continues to suffer from shortcomings in the app.  The app doesn’t save your login information and credentials.  For non tech savvy users and users who only bought a few modules will eventually tire of the lack of UI improvements and poor quality application. \n\nLooking for a better, more secure and reliable system to replace my insteon system with in the near future.  \n\nInsteon user since 2015","updated":"2018-11-19T05:27:25-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"2263270195","userName":"Cali Fornia","userUrl":"https://itunes.apple.com/us/reviews/id42487574","version":"1.15.4","score":1,"title":"The worst app I have on my phone","text":"Difficult to connect to the internet.  The app is extremely slow, I hate that I have to wait up-to 1.5 minutes for my devices to become active and manageable.  \n\nI’m on my second hub, the first one died at 11 months.  I got a free replacement, but I’m having second thoughts about setting it back up, since I’m trying to eliminate hubs around my house, specially that ones that don’t cooperate and make my life more difficult.  I tried for at least 30 minutes to connect it and I gave up.","updated":"2018-03-02T08:20:40-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3642943686","userName":"Insomniac62","userUrl":"https://itunes.apple.com/us/reviews/id6947965","version":"1.15.4","score":5,"title":"First day using","text":"So far, so good! All devices added and are controlled perfectly, time will tell! Wish there was an option to select based on time when to receive notifications instead of just on or off.","updated":"2019-01-12T14:11:36-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3671879438","userName":"what1234567890","userUrl":"https://itunes.apple.com/us/reviews/id3711241","version":"1.15.4","score":1,"title":"Bugs and slow","text":"Takes forever to load. Every time I want to turn on or off a lamp I have to wait 10-20 seconds to load. Sometimes longer other times it never loads and make me login in again. When I go edit a schedule I have to do it two, three or four times before it actually gets saved. Really. Find a software developer that has an ounce of integrity and actually takes pride in what they develop. And use beta testing. This is not rocket science!!!!","updated":"2019-01-19T20:03:44-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"4018199982","userName":"TheFegman","userUrl":"https://itunes.apple.com/us/reviews/id122080518","version":"1.15.4","score":1,"title":"Hub died after 2 years","text":"Never buy a hub that has a proprietary network. Only buy devices and hubs with open-source protocols i.e. Zwave or Zigby.  Insteon hubs die after 2 years just past their warranty.  To replace it you need to abandon your account and start your configuration all over from scratch. There are thousands of devices that operate using Zwave and or Zigby protocol and universal hubs i.e. Wink.  My hub died So I will bite the bullet and reprogram a new hub but as the devices die I will replace them with ones that will work with my Wink.","updated":"2019-04-15T19:45:06-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"6031661248","userName":"Bryan is my guy","userUrl":"https://itunes.apple.com/us/reviews/id36796997","version":"1.15.4","score":5,"title":"Works great","text":"I’ve had Insteon for over three now , set up was a breeze. I have two homes on it with thermostat and cameras . the only thing I can’t figure out is how to record on the camera","updated":"2020-06-03T15:22:44-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3773763293","userName":"OMRON disapointed APP user","userUrl":"https://itunes.apple.com/us/reviews/id402579056","version":"1.15.4","score":3,"title":"20 Amp remote switches","text":"This App is “okay”, \n\nI would like to see;\n\nTime interval selections for the App. I’d like to be able to have particular switches (devices) on for a particular length of time, and not for just a calendar selection on-off (which also is not available, BTW). \n\nInstant on-off changes on the switches when a “Favorite” is turned on should show up on the App   As of now I have to go to the drop down menu and select “devices” to know if a particular switch is on or off.  When a device is included in favorites, its status should show under “favorites” immediately upon any change.","updated":"2019-02-15T12:18:08-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1971518033","userName":"Maui Kid","userUrl":"https://itunes.apple.com/us/reviews/id43835701","version":"1.15.4","score":5,"title":"Works perfectly!","text":"Not sure why the low reviews other than there are not many and they are possibly older.\n\nI love this app and the Insteon products. They have always worked well.\n\nI did have to call support for help with a camera, but all went well. The tech person was very kind and very helpful. He answered all my questions and explained the settings. I didn't feel rushed and when done everything worked. \n\nThis is such a great and reliable system that is very affordable.","updated":"2017-12-04T20:39:38-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"4656362588","userName":"cooper1961","userUrl":"https://itunes.apple.com/us/reviews/id220380400","version":"1.15.4","score":1,"title":"Don’t waste your money","text":"I have had Insteon devices for years , the app will not connect on iPhones , I have hub and purchased another hub , still won’t work properly! I have wasted over 2000 on cameras , bulbs , motion sensors and program is terrible ! I have to pay monthly for OWLR service , they no problem and getting service is horrible , said last week was going to be update and still waiting ! Haven’t had update in two years !","updated":"2019-08-22T13:34:58-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"6796476310","userName":"TechInTx","userUrl":"https://itunes.apple.com/us/reviews/id289848750","version":"1.15.4","score":1,"title":"Wrong choice for home automation","text":"They cannot fix something as basic as scheduling?  Also, app stability is clearly an issue as I am unable to reach my hub today from within my own house.  If cannot control devices on demand or via a reliable schedule, I have clearly made the wrong choice by going with Insteon.  Also, deleting scenes and devices prior to factory resets is garbage and the app just loops and loops.","updated":"2020-12-26T10:36:58-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"6775102982","userName":"crsssss","userUrl":"https://itunes.apple.com/us/reviews/id370277961","version":"1.15.4","score":1,"title":"Worst hardware and software","text":"If your considering this system, look elsewhere or don't bother even reading these reviews.     Had my hub fail and it's impossible to get the replacement hub installed.   I even worked with support and still no working system.   Time now to donate this system to the local dump and go by a more reliable system that works.    It must be made in China and supported by Californian's....... oh yeah.....it is.","updated":"2020-12-20T10:46:12-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"6441653558","userName":"babadaboopee8867","userUrl":"https://itunes.apple.com/us/reviews/id155656596","version":"1.15.4","score":5,"title":"Just works!","text":"Works well most of the time for all devices and cameras.  A little slow and clunky at times but overall solid.","updated":"2020-09-18T05:55:09-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"5390945928","userName":"Dr. Format","userUrl":"https://itunes.apple.com/us/reviews/id37723802","version":"1.15.4","score":5,"title":"Baffled by bad reviews","text":"The Insteon switches and devices have always worked great for me, and have been using them since 2007. \nThis app is fine for what it does; the ISY hub truly expands the programming capabilities of Insteon devices.","updated":"2020-01-11T11:12:30-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"5277054866","userName":"TxBay","userUrl":"https://itunes.apple.com/us/reviews/id9849331","version":"1.15.4","score":2,"title":"Scheduling","text":"Wish the app could schedule something like Sunrise + 1 hr or sunset - 1 hr \nOverall good products\nI will also like this App to allow to reschedule recurring events / scenes . Example : Turn on / off switch every hour starting from a time until a time \nThere are newer smart switches and their apps allow advanced scheduling .","updated":"2019-12-15T12:38:55-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3371287186","userName":"QSick","userUrl":"https://itunes.apple.com/us/reviews/id30890342","version":"1.15.4","score":3,"title":"Not compatible with Apple Watch Series 4","text":"I was spoiled by being able to control my home from my Apple Watch. Now that I updated to the Apple Watch Series 4, the Insteon for Hub app no longer even loads in the Apple Watch app or in the Watch. Please update for compatibility and take advantage of the larger watch face. Otherwise I’m happy.","updated":"2018-11-02T00:34:08-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3525703561","userName":"Tiger150123","userUrl":"https://itunes.apple.com/us/reviews/id13875626","version":"1.15.4","score":2,"title":"Slow and buggy","text":"Unfortunately I can get up off the couch and turn off the light, fan or any other device before Insteon can do it. The app is slow to open. It is a shame with a good product they cannot compliment it with a good, fast app. The last update was 12 months ago. Get cranking SmartLabs!","updated":"2018-12-13T03:06:59-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"2402867703","userName":"BT1993","userUrl":"https://itunes.apple.com/us/reviews/id42626136","version":"1.15.4","score":3,"title":"Overhaul","text":"This app seriously needs an overhaul.  It needs to be updated with a more modern UI with updated Icons for the labels.  It also needs to be updated for the iPhone X screen at the very minimum.  I spent a lot of $ on Insteon gear to make my home “smart” and the hardware IS top notch.  Can we please get an app that matches the quality of the hardware?","updated":"2018-04-09T10:32:04-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"5462957613","userName":"Camaleon-69","userUrl":"https://itunes.apple.com/us/reviews/id197379276","version":"1.15.4","score":4,"title":"Log","text":"Hello, please add to the app a place of registration where you can see all the events that were made with time and date.  This is very necessary to see if there were some scheduled activities ... thanks.","updated":"2020-01-29T08:55:54-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"2357265470","userName":"KrisOlsch","userUrl":"https://itunes.apple.com/us/reviews/id131280727","version":"1.15.4","score":1,"title":"What a crap it becomes","text":"Nobody is cable to fix issue with outside hard wired receptacle , it worked fine for years then came update and never could be fixed again , one side of the House works the other dosen’t ! Even got talked into range extender and new receptacle and still no change ! So tired of this product , app is out dated programming is complicated and just not worth it \nStay away from it","updated":"2018-03-28T16:37:34-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"2137911301","userName":"insteonuser","userUrl":"https://itunes.apple.com/us/reviews/id244739721","version":"1.15.4","score":4,"title":"Works as expected","text":"Works great. I have the older hub with x10 control. I I’ve slowly added modules over the years. Everything works as expected. Only had one problem with hub connectivity, and it was caused by a bad transformer on a radio.","updated":"2018-01-28T14:37:19-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1621259145","userName":"Sweetoothtkc","userUrl":"https://itunes.apple.com/us/reviews/id249101238","version":"1.15.3","score":1,"title":"Buggy App, Terrible Support","text":"The app, itself can be buggy and slow but it does work pretty well most of the time. The dev team does seem to be updating things regularly. However, last month they fired their tech support team and outsourced it to India. The people there were not trained well and can be extremely confusing. Would advise to stay away from this failing company!!!!","updated":"2017-05-22T09:52:50-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1618525611","userName":"krums","userUrl":"https://itunes.apple.com/us/reviews/id23231333","version":"1.15.3","score":1,"title":"Outdated and Basic","text":"This app is seriously outdated and just downright basic. Allows only the most rudimentary control of devices and basic timers; it lacks the ability to actually automate your home in any meaningful fashion (i.e.- randomization timers, IFTTT, geofencing, multiple timers on a single device, etc) It's been years since there has been zany real development or features added, opt for another technology and skip Insteon!","updated":"2017-05-19T17:09:25-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3172441994","userName":"mekelly5","userUrl":"https://itunes.apple.com/us/reviews/id87513236","version":"1.15.4","score":1,"title":"Slow","text":"When you have more than 20 insteon devices the app is painfully slow to update the current status.  App needs serious usability redesign as well. Things are way behind what the competitors are doing.  Please modernize this as the X10 resemblance is well over a decade.  Also, what happens if the hub dies?  This seems like a potential major design flaw because I see no way to migrate my config to a new hub.","updated":"2018-09-09T13:05:40-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"7862576693","userName":"beekay20","userUrl":"https://itunes.apple.com/us/reviews/id20187374","version":"1.15.4","score":3,"title":"iOS 15 hangs","text":"Since upgrading  to iOS 15, camera live views will pause and hand after about 5 seconds.  You can switch to another camera and back again, but that’s a hassle.","updated":"2021-09-30T11:26:01-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"4176214779","userName":"Neda Navidnia","userUrl":"https://itunes.apple.com/us/reviews/id531036979","version":"1.15.4","score":5,"title":"Slow but great","text":"It is not the fastest app but works perfectly with everything. We have light and fan switches, camera, all doors and windows and garage door plus the leak sensors.","updated":"2019-05-19T09:35:23-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"2712798258","userName":"Angel mutt","userUrl":"https://itunes.apple.com/us/reviews/id188697646","version":"1.15.4","score":5,"title":"Love it!","text":"I’ve had zero problems with it in the 2 years I’ve had it. Easy to set up schedules and scenes. I have an almost all Insteon house. Switches, outlets, etc. Works with Alexa flawlessly.","updated":"2018-06-17T08:57:12-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3350980085","userName":"Rcsam","userUrl":"https://itunes.apple.com/us/reviews/id15388553","version":"1.15.4","score":5,"title":"Works great","text":"I have had app and Insteon with over 20 devices and had no real issues.  The hub died after 1 year but they are replaceable. Very pleased with system.","updated":"2018-10-27T11:59:59-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3002400146","userName":"Jaye w","userUrl":"https://itunes.apple.com/us/reviews/id158515066","version":"1.15.4","score":2,"title":"Desperately needs an update","text":"I’m sad to see this app hasn’t had any major update in over a year. They have fallen really behind on integrations and functionality compared to other companies. I think they make solid hardware but if they don’t change something soon, they’ll be obsolete.","updated":"2018-08-01T11:53:06-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1605732486","userName":"Rgoldo","userUrl":"https://itunes.apple.com/us/reviews/id28396603","version":"1.15.3","score":3,"title":"Good news, bad news","text":"The good news is the app works most of the time, but the bad news is that Insteon has the worst UI ever!  Even when I call their support they have a hard time getting it right the first time.   I hate having to edit \"scenes\".","updated":"2017-05-05T04:05:47-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"5699820602","userName":"SFMuscular","userUrl":"https://itunes.apple.com/us/reviews/id7411140","version":"1.15.4","score":2,"title":"Countdown Timer","text":"Insteon discontinued the countdown timer switches.  So, they really should add a way to program switches to automatically shut off after a prescribed period.  We should have auto-shutoff for fans and closet lights.  It’s a no-brainer to add to an app and would be an important feature.","updated":"2020-03-22T22:32:04-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3210947284","userName":"ParksProblems","userUrl":"https://itunes.apple.com/us/reviews/id114260976","version":"1.15.4","score":3,"title":"Please Update App","text":"I’m quite fond of Insteon, but the app desperately needs to be updated. \n\nA couple issues, and/or Improvements:\n1. Ability to force delete a device when it’s part of a scene. I have a dimmer switch which broke and has been replaced, yet the app will not allow for it to be removed. \n2. Ability to adjust the time on cameras, and adjust the brightness and contrast remotely. \n3. Ability to pinch to zoom with cameras. \n4. Ability to add/use non Insteon cameras.","updated":"2018-09-20T11:31:58-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3771007531","userName":"Jimz57","userUrl":"https://itunes.apple.com/us/reviews/id75033627","version":"1.15.4","score":1,"title":"Don't bother with insteon","text":"If you just bought their products, return them now, It's not worth the weeks of your life it will take to get even a partially operational system. It's too late for me, save yourself!! Any company who doesn't do an update in over a year has lost confidence in themselves and have given up. Time to move on to Lutron!!","updated":"2019-02-14T20:07:10-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1972317191","userName":"Armanmomin112","userUrl":"https://itunes.apple.com/us/reviews/id138721572","version":"1.15.4","score":5,"title":"Great app","text":"Works perfectly sometimes a bit slow but in all it works great needs iPhone X support to fit sxreen","updated":"2017-12-05T04:35:04-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3298535001","userName":"pjpjpjpjpjpjpjpjpjpjpjpjpj","userUrl":"https://itunes.apple.com/us/reviews/id40023761","version":"1.15.4","score":1,"title":"Agree with fatal flaw","text":"Power went out at one of my four locations, specifically the last location I had open when using the app. As a result, app will not login AT ALL because that ONE hub is offline. \n\nInsteon, get your act together. The comment I read mentioning this issue is from over 6 months ago. Fix it.","updated":"2018-10-13T15:33:45-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3240994691","userName":"DiosRev","userUrl":"https://itunes.apple.com/us/reviews/id636877881","version":"1.15.4","score":3,"title":"Love Insteon Products please update your app","text":"The app has been lacking in polish and now that the OS 5 for Apple watch I can no longer control from my watch the app is gone...shame because it was helpful.  Please bring this app upto speed.","updated":"2018-09-28T13:22:39-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"6257197349","userName":"Hipkat111111111","userUrl":"https://itunes.apple.com/us/reviews/id104922970","version":"1.15.4","score":2,"title":"Hurry up","text":"This app has been in beta for way too long. You are bleeding customers. Just put out something pretty and then updated it on a frequent basis instead of doing it all in one fell swoop.","updated":"2020-07-29T16:44:44-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1605300342","userName":"Bartdehaven","userUrl":"https://itunes.apple.com/us/reviews/id49000232","version":"1.15.3","score":3,"title":"Needs a UI change","text":"More icons better colors more colorful design background customization. App works just ugly and so limited to icons when u have 50 devices it makes it confusing and a pain.","updated":"2017-05-04T18:55:04-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"4486756483","userName":"whitywhitelight","userUrl":"https://itunes.apple.com/us/reviews/id351162818","version":"1.15.4","score":1,"title":"Absolutely frustrating","text":"If the app is closed before it connects to the hub or it fails to connect, it immediately signs me out. I shouldn’t have to constantly sign back into this app every single day for an absurd reason just because I accidentally opened the app. Extremely frustrating!","updated":"2019-07-19T11:10:27-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"2903582171","userName":"desertmanyv","userUrl":"https://itunes.apple.com/us/reviews/id588242856","version":"1.15.4","score":5,"title":"Works great","text":"Works as described. No issues for any of the customers I’ve installed for. \nEasy to use.","updated":"2018-07-13T20:29:21-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"2785282778","userName":"1123325437","userUrl":"https://itunes.apple.com/us/reviews/id209720558","version":"1.15.4","score":1,"title":"Worst system","text":"Do not get this system. Hub will die after 2 years. When installing a new hub to replace you will have to make a new user ID. There is no way to add a hub and keep the same ID.\n\nOnce you install the new hub and create a scene with lights, you will no longer be able to operate the light with a switch or manually. Totally terrible.\n\nI will buy a different system so that my nearly blind dog will be able to have lights on a schedule when I am not home.\n\nI’m an engineer and the engineers for this system should be ashamed of the poor quality.","updated":"2018-06-27T19:53:05-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3336616419","userName":"jfbloom22","userUrl":"https://itunes.apple.com/us/reviews/id30902074","version":"1.15.4","score":2,"title":"Works ok","text":"The app and watch app have worked well for me and the handful of devices I own. I wish the watch app let me control the temperature.   I have updated to watch OS 5, the app no longer works. Please update the watch app.","updated":"2018-10-23T19:55:02-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3434382777","userName":"Isotnojoke","userUrl":"https://itunes.apple.com/us/reviews/id104186541","version":"1.15.4","score":1,"title":"iOS 5 for watch","text":"Over a month later and still waiting for Insteon to update their app so that watch can control Insteon devices. For some reason Insteon is always slow on updates. Will Insteon buy back their equipment since it’s outdated? Have to use a different system. Hoopteon","updated":"2018-11-18T19:15:43-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3207937468","userName":"Bjk675","userUrl":"https://itunes.apple.com/us/reviews/id109474572","version":"1.15.4","score":3,"title":"Apple Watch and iOS","text":"Apple Watch doesn’t work any more also need a way to adjust sunset and sunrise to have an offset so we can turn on 15-30 before or after.","updated":"2018-09-19T16:21:46-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"6754383634","userName":"Sparky56789","userUrl":"https://itunes.apple.com/us/reviews/id143302415","version":"1.15.4","score":1,"title":"IOS 14.3","text":"IOS 14.3 today killed the app. Keep getting unable to establish connection with Insteon hub. I can still log in with any IOS device not running 14.3. Downloaded the n ew Insteon app and works fine with IOS 14.3 but is missing older devices I use and another older hub. Please fix.","updated":"2020-12-14T19:01:01-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3146426746","userName":"PastaBall","userUrl":"https://itunes.apple.com/us/reviews/id18581643","version":"1.15.4","score":5,"title":"Works great.","text":"Been using this with Hub for over 2 years with no issues and 2 houses.","updated":"2018-09-02T16:25:20-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"6609589352","userName":"Takoateli","userUrl":"https://itunes.apple.com/us/reviews/id23726436","version":"1.15.4","score":1,"title":"The app is problematic and they don’t fix it","text":"Because basically you have no other option than to use their app. Once you’ve started building and it’s Dion system you’re locked in.\n\nIt’s way better to go Z wave.","updated":"2020-11-04T15:40:21-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3958006712","userName":"Dentite","userUrl":"https://itunes.apple.com/us/reviews/id16944724","version":"1.15.4","score":1,"title":"No wonder everyone left this platform","text":"The concepts are great but the hardware is poorly made. On top of that, this software is poorly designed and a burden to use. If I have a device out of service I can’t remove it from a scene and I can’t delete the scene. Very poorly designed software","updated":"2019-04-01T19:21:48-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3224041425","userName":"Mrjsuss","userUrl":"https://itunes.apple.com/us/reviews/id9274803","version":"1.15.4","score":3,"title":"Mediocre app","text":"Needs to be updated to support Apple Watch os5. \nOverall app interface is rudimentary but it gets basic scene creation done.  It works solidly but it’s more of a “set it and forget it” setup.","updated":"2018-09-23T23:25:22-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3011485982","userName":"Brando159","userUrl":"https://itunes.apple.com/us/reviews/id38009469","version":"1.15.4","score":1,"title":"Complete garbage, save your money","text":"The Insteon hardware is unreliable and fails. The hub is junk. The app is poorly designed and about as inefficient as possible. The only thing that makes these products usable is Alexa or Google. There are much better smart home products available.","updated":"2018-08-03T06:48:15-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1696982010","userName":"a.b.creative","userUrl":"https://itunes.apple.com/us/reviews/id39296036","version":"1.15.3","score":2,"title":"Frustrating","text":"This review is for the app itself, not the insteon technology. 1. If a scene update fails, and I choose \"Skip\" don't keep retrying! 2. More icons would be nice (or let us load our own) 3. App icon looks nearly identical to nest's","updated":"2017-07-24T20:10:53-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"5172281448","userName":"olegdulin","userUrl":"https://itunes.apple.com/us/reviews/id27226018","version":"1.15.4","score":1,"title":"Is this company still in business?","text":"The app has not be updated in years in any meaningful way. Their hardware is outdated and requires replacement every few years. Next time my Hub dies I am switch away from Insteon.","updated":"2019-11-20T04:04:32-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"4048613972","userName":"iQwerty","userUrl":"https://itunes.apple.com/us/reviews/id12755661","version":"1.15.4","score":2,"title":"Long overdue for a facelift","text":"It would be greatly appreciate if the app / product dev’s looked at other home automation apps for inspiration on giving the Insteon one a facelift that is long overdue. Sorry to put it so blunt.","updated":"2019-04-22T22:05:15-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"6187198771","userName":"California listeneer","userUrl":"https://itunes.apple.com/us/reviews/id122323177","version":"1.15.4","score":1,"title":"USELESS APP— months of not being able to control lights","text":"Have been unable to use the app for months and there has been ZERO updates or developer communication as to any solution","updated":"2020-07-11T18:05:54-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3321544656","userName":"SIRDAG","userUrl":"https://itunes.apple.com/us/reviews/id18633143","version":"1.15.4","score":1,"title":"No longer runs on updated Apple Watch","text":"In addition to to startup fatal flaw, the Apple Watch posts a message saying the App must be refit to latest update.  It’s been nearly a year since any updates.   App support requests are rejected when called in.","updated":"2018-10-19T20:29:14-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3225493495","userName":"rwb712","userUrl":"https://itunes.apple.com/us/reviews/id229367412","version":"1.15.4","score":3,"title":"No support for an app in Watch OS5","text":"One of my favorite things about my Insteon setup was that I could control it from my Series 1 Apple Watch-I opened the apps on my new Series 3 with OS5 and no Insteon app.","updated":"2018-09-24T08:31:15-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1982154682","userName":"rickatone","userUrl":"https://itunes.apple.com/us/reviews/id43533305","version":"1.15.4","score":1,"title":"No connection","text":"This only works when your Insteon hub and your iPhone are connected to the same WiFi. The moment you leave home you are cut off and they have not resolved this. I will switch brand.","updated":"2017-12-09T01:17:21-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"4290542547","userName":"nealtx","userUrl":"https://itunes.apple.com/us/reviews/id36589269","version":"1.15.4","score":1,"title":"Will this ever be updated?","text":"They have ignored Apple users for years. The HomeKit hub was a total flop. This product hasn’t been updated in a year. Apple Watch support for this product also has been dropped. No hope for Apple users.","updated":"2019-06-09T10:31:31-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"2180295178","userName":"Dawg8it","userUrl":"https://itunes.apple.com/us/reviews/id32707262","version":"1.15.4","score":1,"title":"Crashes immediately after opening up camera","text":"App crashes immediately after opening the SD insteon camera. This makes the app useless for viewing the SD cameras. \nThis has been happening for months nows","updated":"2018-02-07T18:57:40-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3514392207","userName":"newspapers","userUrl":"https://itunes.apple.com/us/reviews/id165985627","version":"1.15.4","score":1,"title":"Cannot login in anymore any getting a new phone","text":"I just got the iPhone XR and downloaded the Insteon app, now I am unable to log in to my account so I can’t control my lights or manage any devices. Please help and fix your products.","updated":"2018-12-09T22:08:02-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3402145460","userName":"idagroup","userUrl":"https://itunes.apple.com/us/reviews/id100791482","version":"1.15.4","score":1,"title":"Apple Watch no longer works","text":"Ever since the update of the Apple Watch OS to version 5, the app only shows „the developer of this app needs to update it“ but after month there is still no sign of an update.","updated":"2018-11-10T05:59:52-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3294894904","userName":"fbourd","userUrl":"https://itunes.apple.com/us/reviews/id683820630","version":"1.15.4","score":2,"title":"Smartphone is sleeping","text":"No longer works with my Apple Watch. \nDoes not take advantage of new Apple iOS. \nScores of my other apps all updated for iOS 12. Could use a face lift too!","updated":"2018-10-12T17:55:15-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"5283697210","userName":"G4b3-18","userUrl":"https://itunes.apple.com/us/reviews/id578546681","version":"1.15.4","score":1,"title":"The worse smartphone app","text":"It hasn’t been updated for 2 years now. The once useful Apple Watch was not updated and stopped being offered altogether.","updated":"2019-12-17T07:18:50-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"5554421341","userName":"ands68","userUrl":"https://itunes.apple.com/us/reviews/id29373848","version":"1.15.4","score":1,"title":"No updates and no info","text":"They may have gone under because after promises from the new ceo there is no thing. No info. No update.","updated":"2020-02-19T18:07:28-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"5399725885","userName":"issameanangryhuman","userUrl":"https://itunes.apple.com/us/reviews/id1121939511","version":"1.15.4","score":1,"title":"Waste of money","text":"My cameras won’t connect to the app anymore because apparently Insteon discontinued their line of cameras?? Now what am I supposed to do with all these cameras that don’t even work anymore??","updated":"2020-01-13T12:57:50-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"5213994727","userName":"Always logging in","userUrl":"https://itunes.apple.com/us/reviews/id38611274","version":"1.15.4","score":1,"title":"What happened","text":"The product worked great, now it will not even open. What the hell I have my entire house wired with all these switches and I’m about to rip them all out.","updated":"2019-11-29T16:35:52-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3201202403","userName":"FireRunt","userUrl":"https://itunes.apple.com/us/reviews/id136136081","version":"1.15.4","score":2,"title":"WatchOS5 compatibility","text":"Please update the app to work with the latest watchOS....it worked fine since version 3 but doesn’t work with the newest operating system. Thanks.","updated":"2018-09-17T18:39:52-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"2145099648","userName":"Hggbhttbg","userUrl":"https://itunes.apple.com/us/reviews/id206955974","version":"1.15.4","score":2,"title":"Every so often credentials are lost","text":"This app is aggravating. Every so often it’ll lose credentials for the hub and they have to be reentered. Usually it’s when I need to use the app. Argh!","updated":"2018-01-30T02:58:09-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"5471946578","userName":"Dms514","userUrl":"https://itunes.apple.com/us/reviews/id28822312","version":"1.15.4","score":2,"title":"Please update app","text":"Major update promised in letter from new CEO in June but still no where in sight, please make the several thousand dollars I spent on Insteon relevant again.","updated":"2020-01-31T15:43:05-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3121514242","userName":"Daddyagogo","userUrl":"https://itunes.apple.com/us/reviews/id39111405","version":"1.15.4","score":1,"title":"Works fine until it doesn’t","text":"...just stops working every few weeks, getting it back online is always a pain.","updated":"2018-08-27T09:49:47-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"2548538861","userName":"Grizz0224","userUrl":"https://itunes.apple.com/us/reviews/id268773012","version":"1.15.4","score":1,"title":"Lousy system","text":"Works ok during the day, the problem is at night when you need to turn things off, the insteon hub will not load. Very frustrating! 😡😡😡🤬🤬🤬","updated":"2018-05-14T20:18:06-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"2036207599","userName":"Simon Taylor","userUrl":"https://itunes.apple.com/us/reviews/id42874403","version":"1.15.4","score":3,"title":"Time for an update. iPhone X ?","text":"It’s been ages since I’ve seen a significant update to this app. What’s the plan smartlabs and what’s the future for Insteon ???","updated":"2017-12-28T14:26:18-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3369961483","userName":"Peter Zarka","userUrl":"https://itunes.apple.com/us/reviews/id207730951","version":"1.15.4","score":2,"title":"Not up to date","text":"The app works on the latest IOS on my iphone, but not on Watch OS 5.0.  Someone at Smartlabs needs to keep this app up to date.","updated":"2018-11-01T14:58:48-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"6171231236","userName":"Myntmd","userUrl":"https://itunes.apple.com/us/reviews/id35049331","version":"1.15.4","score":3,"title":"Suddenly Stopped working July 2020","text":"I’m getting a spiral of death when attempting to log in","updated":"2020-07-08T00:54:36-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3301335354","userName":"Bluesteel124","userUrl":"https://itunes.apple.com/us/reviews/id104180063","version":"1.15.4","score":1,"title":"App hasn’t been updated in over 10 months","text":"Looks like the Insteon developer has given up on supporting this app.  Apple Watch app doesn’t work and the iPhone app is slow.","updated":"2018-10-14T08:06:33-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"4835567317","userName":"Makin points","userUrl":"https://itunes.apple.com/us/reviews/id307511615","version":"1.15.4","score":2,"title":"Improve please","text":"Needs updated. It’s been a yr. that’s a long time for home automation updates.  And a APPLE widget would be a great addition. Thanks. \n\nGod Bless\n〽️","updated":"2019-09-25T03:59:54-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3461136780","userName":"Landon went","userUrl":"https://itunes.apple.com/us/reviews/id873022245","version":"1.15.4","score":1,"title":"Garbage app and items","text":"Complete trash nothing works or connects you try to scan something it says nothing and won’t let u continue","updated":"2018-11-25T19:35:57-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3079455796","userName":"ckellar33","userUrl":"https://itunes.apple.com/us/reviews/id113755881","version":"1.15.4","score":1,"title":"Not very good","text":"App is slow to load. Styling is old and doesn’t even fit full screen on the iPhone 10. Desperate need of a modern update. The Insteon products are great, but lack good software.","updated":"2018-08-17T17:45:51-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"2300502834","userName":"CAD.Bear","userUrl":"https://itunes.apple.com/us/reviews/id443346416","version":"1.15.4","score":2,"title":"Please fix DST","text":"Already 2 days since the switch, but my stupid Insteon hub is now an hour off.","updated":"2018-03-12T21:46:56-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"4082182246","userName":"TylerButtkiss","userUrl":"https://itunes.apple.com/us/reviews/id418153600","version":"1.15.4","score":1,"title":"No updates for a year?","text":"Literally no updates for an entire year, no new products, my guess is Insteon is dead.","updated":"2019-04-30T13:19:38-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"4420690866","userName":"Tulvox","userUrl":"https://itunes.apple.com/us/reviews/id182275022","version":"1.15.4","score":1,"title":"Terrible","text":"Very slow and hasn't been updated since Long time ago","updated":"2019-07-06T10:44:12-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3466954168","userName":"Yitzy Aussie","userUrl":"https://itunes.apple.com/us/reviews/id149003724","version":"1.15.4","score":1,"title":"Needs updating!","text":"App has not been updated in extremely long time - no iPhone X screen support and watch app does not work with WatchOS 5. Unacceptable.","updated":"2018-11-27T09:39:08-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3175007754","userName":"summer5156","userUrl":"https://itunes.apple.com/us/reviews/id240799938","version":"1.15.4","score":1,"title":"Not working at all","text":"It works good at beginning, but is not working now , I can not open the app , so , all my lights can tune on , and can not open garage too","updated":"2018-09-10T07:36:21-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3432618095","userName":"Bald Guy","userUrl":"https://itunes.apple.com/us/reviews/id36838742","version":"1.15.4","score":1,"title":"SLOOOOW","text":"The point of home automation is to make things easier, right? This app is SO SLOW to load that it creates more frustration than creating the ease of automation.","updated":"2018-11-18T07:34:54-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1667868463","userName":"Divisionday","userUrl":"https://itunes.apple.com/us/reviews/id534357341","version":"1.15.3","score":1,"title":"Does not work","text":"Doesn't want to connect any longer. Completely worthless","updated":"2017-07-03T19:28:26-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3848701720","userName":"Philomathius2","userUrl":"https://itunes.apple.com/us/reviews/id41911414","version":"1.15.4","score":1,"title":"Do not buy","text":"This is the worst app and hardware I’ve ever purchased. Almost never works. I wish I could give it no stars.","updated":"2019-03-06T01:54:35-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3738014956","userName":"Miles267","userUrl":"https://itunes.apple.com/us/reviews/id19784666","version":"1.15.4","score":2,"title":"Needs updated for iPhone X and Watch","text":"Severely outdated and buggy. May migrate from Insteon.","updated":"2019-02-05T19:08:44-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"5871917438","userName":"dolce far niente","userUrl":"https://itunes.apple.com/us/reviews/id29989862","version":"1.15.4","score":1,"title":"Total Useless Garbage","text":"These products and the app that controls them are useless\n\nThis app is crap","updated":"2020-04-27T11:57:51-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"7583293936","userName":"love2breathe","userUrl":"https://itunes.apple.com/us/reviews/id703836666","version":"1.15.4","score":1,"title":"Joke","text":"You call it an App? Ha ha ha\nBetter walking to the devise turn it on or of than\nusing the app.\nSlowly but surely SmartHome going to the trash can of history.","updated":"2021-07-16T07:25:11-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"6743399290","userName":"Bingnano","userUrl":"https://itunes.apple.com/us/reviews/id195651078","version":"1.15.4","score":1,"title":"Mr. Requester","text":"This app is out of date! They need to update for new Apple Watch! My new Apple Watch is not see of anything for installing!!","updated":"2020-12-11T18:44:33-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3575972849","userName":"Tristanbroth","userUrl":"https://itunes.apple.com/us/reviews/id186796189","version":"1.15.4","score":1,"title":"Doesn’t work","text":"Needs updating. Reason enough to not buy Insteon.\nSimply broken.","updated":"2018-12-26T08:37:21-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1605808595","userName":"Jonnybegood6","userUrl":"https://itunes.apple.com/us/reviews/id41692568","version":"1.15.3","score":1,"title":"Needs a makeover already","text":"Time to redo this app and add color and life to it. Also needs to be more flexible to move icons around.","updated":"2017-05-05T06:00:27-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3246138952","userName":"Khorton","userUrl":"https://itunes.apple.com/us/reviews/id49389174","version":"1.15.4","score":1,"title":"Does not work on watchOS 5","text":"While the app works on the iPhone with iOS 12, it no longer runs on the Watch with watchOS 5","updated":"2018-09-29T20:54:50-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3585356813","userName":"Tubbyp003","userUrl":"https://itunes.apple.com/us/reviews/id137151722","version":"1.15.4","score":2,"title":"App stopped Working","text":"Needs to update app, nothing working???","updated":"2018-12-28T15:26:05-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1867481092","userName":"never buy la crosse again","userUrl":"https://itunes.apple.com/us/reviews/id101135951","version":"1.15.3","score":1,"title":"Insteon is “CRAP”","text":"The set-up instructions are wrong!  The app has s/w bugs.....crap!  The Hub app is missing options that should be there.....crap! Don’t buy!","updated":"2017-10-22T12:43:51-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3425342287","userName":"John Verdonck II","userUrl":"https://itunes.apple.com/us/reviews/id326721411","version":"1.15.4","score":1,"title":"Connectivity","text":"Disappointing.  Worked well initially.  But very poorly as of late.  Can’t connect with iPhone or iPad","updated":"2018-11-16T11:17:53-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"2526267281","userName":"T9876","userUrl":"https://itunes.apple.com/us/reviews/id85962141","version":"1.15.4","score":1,"title":"Terrible coding.","text":"Directions should say, remove from box and place directly in garbage.","updated":"2018-05-09T19:32:20-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"4005127783","userName":"Mexico Magico","userUrl":"https://itunes.apple.com/us/reviews/id38138942","version":"1.15.4","score":2,"title":"User interface awful","text":"Think Windows 1997 versus Mac 2019. The GUI is awful and confusing.","updated":"2019-04-12T18:17:57-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1478122874","userName":"Blogography","userUrl":"https://itunes.apple.com/us/reviews/id39578426","version":"1.13.2","score":2,"title":"It works... but needs a lot of work.","text":"This app does work for me. And that's about the only thing good I can say about it. From the obscenely loud button beeps you can't turn off to having to dismiss a useless, non-working initial control screen to get to the actual control screen... there's just too many irritating things about the app that keeps it from being a tool you want to use. What's even more inexplicable is how the app recognizes specific sensors... like a garage door opener... but had a confusing and generic interface for it. Is having the app say \"Door Open\" and \"Door Closed\" instead of the cryptic \"Relay Open\" and \"Sensor Closed\" really too difficult? Why isn't there a preset configuration for the FanLink switch that automatically populates the light on/off and fan speed buttions? Configuring that monster manually is not just horribly difficult, but you don't get actual radio buttons that light up properly. Somebody please put some effort into making this a more logical, helpful, and configurable app. The entire Insteon system isn't nearly as useful without it.","updated":"2016-11-03T18:57:26-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"2174899337","userName":"Joyman74","userUrl":"https://itunes.apple.com/us/reviews/id36554593","version":"1.15.4","score":3,"title":"iPhone X support?","text":"Waiting for X Support 5 months now","updated":"2018-02-06T11:09:06-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"8047996815","userName":"ztqr35","userUrl":"https://itunes.apple.com/us/reviews/id650096008","version":"1.15.4","score":1,"title":"Very poorly done","text":"Non intuitive and clunky","updated":"2021-11-21T06:52:26-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3332655675","userName":"miamibeef04","userUrl":"https://itunes.apple.com/us/reviews/id36520578","version":"1.15.4","score":1,"title":"Apple watch support gone","text":"Bring back watch support please","updated":"2018-10-22T18:07:12-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1644494493","userName":"Ambitian","userUrl":"https://itunes.apple.com/us/reviews/id7933251","version":"1.15.3","score":5,"title":"User(s) Error(s)???","text":"Based on reviews, I warily installed 12 switches last year to control a few 3-way switches and other lights in my living room, family room and kitchen. \n\nInstallation was fairly easy and the one problem I had was very adeptly handled by Insteon support team. \n\nI put the switches into several scenes and onto sunrise/sunset timers and everything  performed flawlessly for the last 14 months.\n\nNow I'm in a bit deeper. Over the last few days, I swapped out 74 more switches and added a few dimmer modules and four outdoor controllers for my landscape lights. I also added 20 leak detectors. \n\nI was incredibly pleased by the fact that not a single device failed to function properly during installation. They all communicated flawlessly with the Insteon Hub and are now assigned to their various rooms and scenes and behaving well. \n\nI find the iPhone app to be quite easy and intuitive to use. There are a few things I'd tweak if I were in charge, including allowing for more flexible scheduling, conditional events and allowing and offset to the sunset/sunrise times, but these are all \"nice to haves\" not \"must haves\". \n\nAll my switches are the 2477D model. \n\nAlexa works perfectly after reworking my naming conventions to suit her demands (hint: if you have a three-way switch, name the primary switch, for example, \"family floods\" and switches two and three \"fam flds 2\" and \"fam flds 3\"). \n\nI'm a big fan of my Insteon setup, so am puzzled by all the negative reviews.  My guess is most of the reported problems are user errors.","updated":"2017-06-14T16:03:14-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"2369146562","userName":"Born4TheSky","userUrl":"https://itunes.apple.com/us/reviews/id41360541","version":"1.15.4","score":5,"title":"Great","text":"Please add iPhone X support.","updated":"2018-03-31T17:19:49-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3655561700","userName":"Allen Alsamarraie","userUrl":"https://itunes.apple.com/us/reviews/id256054484","version":"1.15.4","score":1,"title":"iPhone x support","text":"iPhone x screen size need to be fixed and redesign required","updated":"2019-01-15T22:51:42-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1871308503","userName":"Agentmikeyd","userUrl":"https://itunes.apple.com/us/reviews/id144574238","version":"1.15.3","score":1,"title":"Horrible","text":"No support for Siri w hub 2.","updated":"2017-10-24T03:15:58-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"803014970","userName":"MoColBeck","userUrl":"https://itunes.apple.com/us/reviews/id32977569","version":"1.3.0","score":3,"title":"Basically functions but clunky and has some bugs","text":"I've been setting up the hub today with a bunch of different existing devices and while it basically functions as it is supposed to it is fairly cumbersome to work with and there are a few things that just don't work properly, like support for I/O Linc devices. Regardless of the setting in the UI (where I am trying to control a gate with the on command closing the relay, off opening which is a listed option) only appears to be working in latching mode. I have not been able to add certain devices to scenes that have never been a problem with other applications, icons only show two lines for the name under the icon which truncates things often and there is no way to reorder the icons which aren't in any particular order. Note that you can only configure the hub from an iOS device - no web interface, no programming from the Insteon connect cloud offering and nothing on Mac or PC. Hoping for updates and improvements soon as this definitely does not reflect the quality of most Smarthome products and the Insteon brand at this point.","updated":"2013-05-11T15:08:06-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"722836874","userName":"LDW 46","userUrl":"https://itunes.apple.com/us/reviews/id138334893","version":"1.1.0","score":1,"title":"Not complete & not reliable","text":"I have over 50 Insteon devices & this held the promise of a more elegant solution than previously available.  Unfortunately is doesn't deliver. Initial setup with the Hub is effortless & setting up individual devices is implimented well.  However many functions are not yet implemented, and there are major problems with both the software interface & functionality. There is no manual & the app interface is not very intuitive, requiring you to call tech support for many answers.  The software/hardware combination doesn't reliably communicate with the Insteon devices. I set up one scene just fine, but adding a second using the same lights resulted in unreliable reporting of  device status & lighting levels no matter what I did.  The second scene took some values from the first scene repeatedly making it's use problematic. \n\nI have spent many hours trying to set up automated lighting with this App & their Hub, but it has been a frustrating undertaking with 1 defective hub, several app reinstalls and hours of work by myself & their great tech support staff. This combo may suffice in some specific (and limited) situations, but it just doesn't work well overall.","updated":"2013-01-04T16:31:16-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1414785372","userName":"TroyusRex","userUrl":"https://itunes.apple.com/us/reviews/id32386894","version":"1.13.1","score":5,"title":"Great app. No real issues.","text":"I've been using the app for about three months now. I had originally planned to use a different app after I got all of my Insteon switches installed but this one works fine so I haven't bothered to switch. \n\nThe best thing about the app is the ability to see all of my lights and sensors in one place. In seconds I can tell if any lights were left on and if any doors are open. I can then turn off any lights that are on (open doors, unfortunately, can't be closed remotely 😊). \n\nOnce the app is loaded up lights respond instantly which is a big improvement over other brands I've tried. \n\nScheduling works great. I'm not sure why some people have trouble with it but mine is easy and flawless. My pool is on one timer and I have various lights on other timers. Especially useful is having the ability to have lights set to turn on at sunset and off at sunrise. \n\nAll that said, the app isn't perfect. It can take a good fifteen to thirty or more seconds to start up. That means you never just pull out you iPhone to turn on/off a nearby light. It's great for checking all lights but not so great individually. \n\nAlso, the layout is a bit cumbersome what with devices, rooms and scenes and then having status vs edit in different places. Even now I almost always go to the wrong place to edit a device. \n\nAll told, however, I'm very pleased with the app.","updated":"2016-07-18T09:10:15-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1501841059","userName":"Doug526","userUrl":"https://itunes.apple.com/us/reviews/id7003126","version":"1.14.1","score":2,"title":"so many serious flaws","text":"I keep getting signed out and have to constantly re enter my password when trying to access over my cellular connection. This technology in theory is great but it is really tedious to use, and set up. Creating a scene is not intuitive with the included videos. It took me awhile just to figure out how to trigger my lamps from my motion sensor. They have a pointless little 6 second movie clip but it does nothing to help. when I finally did figure out how to configure the motion scene it had to have me hold the button on the back of the motion sensor every time I wanted to make a change to the scene which was tedious. Imagine if you had multiple motion sensors or door sensors mounted on the ceiling and had to constantly get up there and press buttons every time you wanted to change a scene??!! Needs to be a better way to use this system. With how much all the proprietary hardware costs, you'd think it would all work elegantly. Not so much... i'm thinking of switching to Z wave since it's an open platform.","updated":"2016-12-14T09:41:46-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1221329453","userName":"DiegoA.","userUrl":"https://itunes.apple.com/us/reviews/id193251390","version":"1.9.32","score":2,"title":"Very beta at the moment","text":"The app definitely shows promise and there are glimmers of hope, however this system is more beta than production quality. \n\n-Setup is relatively easy, however adding devices via the sync feature doesn't work as well as manually entering in the device ID, so if you have a home full of numerous Insteon devices prepare an Excel spreadsheet before mounting your switch plates.\n-The app occasionally takes a long time to load.\n-No Roomie support, device list does not manifest\n-Devices randomly stop working after hours or days of successful functionality.\n-Siri integration works great but that's only when devices are actually detected which from my 1.5 weeks experience is about 50:50.\n-No sunset schedule option\n-No notifications\n-No support for sensors \n-No support for IP cameras\n-etc...\n\nThe list goes on, I'm just hoping Insteon provides several major updates especially considering the new WWDC HomeKit announcements. I know that HomeKit is a limiting factor to some of the missing features for the Insteon Hub Pro but there's a lot to be desired. For anyone looking to upgrade from ISY, I would wait a while unless you plan on using this solely for lighting with Siri control in mind and even then I would wait.","updated":"2015-07-02T18:22:04-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1553373366","userName":"waasy","userUrl":"https://itunes.apple.com/us/reviews/id42160034","version":"1.15.1","score":5,"title":"Really nice. Almost perfect!","text":"This is a great App that is perfect excel you should be able to set lights or other things to come on randomly within what ever time period you chose. This would be a great security feature that a competing company has. Everything they make is slick & easy to use & install (forme). It is absolutely great for home security & convenience! It helped me save money on my electricity bill as well. It's hard to pick apart something this good however, the only thing I can say is that if very bad is if you hub goes bad you can't import the old hub setting to you new hub and it's very difficult, almost impossible, to connect a previously connected LED light to a replaced hub. I know I've had to replace a hub. They need to have a web interface where you can retrieve your old settings. Other than that it's perfect!","updated":"2017-02-26T17:45:28-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"868820595","userName":"Wakeboyx5","userUrl":"https://itunes.apple.com/us/reviews/id111139567","version":"1.4.0","score":5,"title":"Great security device","text":"I bought this for a basic function, when a door is opened, send me a SMS text. I bought the Insteon Hub, and a single Insteon Wireless open/close sensor. With this app, it took me less then 15 minutes to install and configure the Hub and open/close sensor. Everything was VERY straight forward. When does that ever happen when configuring Internet devices??? I positioned the Hub and sensor only 5 feet apart, so I can't speak to the range of the RF. I also get emails when the door is opened. I also didn't bother configuring my router to support remote (over the Internet) connection between the iPad add and the hub, so I can only configure my system when at home, but I still get emails and Text messages away from home.\n\nThis was so easy to set up that I want to buy more Insteon sensors and controls, but I really don't need them.","updated":"2013-09-11T14:24:40-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1073279403","userName":"rshanahan","userUrl":"https://itunes.apple.com/us/reviews/id12317028","version":"1.9.0","score":3,"title":"Update and still no Landscape mode on iPad!","text":"I too add my request for landscape/rotate mode.  I have an iPad mini wall mounted (for this and other home controls) and it’s not very appealing having this app sideways.  Would also like to have customizable icons (add your own as most of the supplied icons don’t really fit most locations/devices I have set up).  One more thing, maybe some color?  Kinda boring everything being sky blue.\n\nOtherwise, I really like it.  Because I have scene control switches in the walls, use of the iPad is mainly for setting up scenes, and for now can just use my iPhone or my full sized iPad.  This leads me to how nice the hub keeps all connected iOS devices in sync.  When I was using Hue, if you set a scene/schedule up on one iOS device, it did not show up on others, so to edit the scene you had to go on the device it was created on.  They may have resolved that by now.","updated":"2014-10-01T06:44:06-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1271213507","userName":"Cal Reviews","userUrl":"https://itunes.apple.com/us/reviews/id33979159","version":"1.10.1","score":5,"title":"All in all good product","text":"I've been using Insteon throughout my home for 2 years now (60 plus wired-in light switches and 4 thermostats).  For the most part everything is been completely smooth and reliable.  I was able to set it up and just use it without it becoming a time draining science project.  From changing out all the light switches and thermostats, to getting them paired with the hub for which I relied 100% on the Insteon iphone App to do.   Super simply and intuitive.  I just upgraded to the Hub2 and that was bumpy but I've managed.  My call into technical support yesterday had a 3 hour wait or call back which if not improved is sadly going to end this company.","updated":"2015-10-13T16:35:50-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1108629876","userName":"Sasha K NY","userUrl":"https://itunes.apple.com/us/reviews/id78011576","version":"1.9.6","score":2,"title":"Great hardware; immature software","text":"Insteon's dual-band (plc + radio) mesh networking capability is the most robust home automation protocol on the market today (short of native RESTful ip implementations yet to emerge).\n\nBut it's held back by software such as this app. Consider:\n1) There's not a way to back up / restore your entire house's configuration - not on the hub, not offline. If a lighting strike messes it up (which happened to me, even though I have a whole-house surge suppressor installed), you need to reset everything and start from scratch. From scratch!\n2) There's no officially supported synchrony among configurations done via this app / hub, in the House Link desktop application, and locally on the devices. Unofficially there's evidence of engineering bias to push whatever capability the switches/devices can support by themselves, onto them - which is good as it minimizes a single point of failure / bottleneck. But you can't officially have a clear view yet if a particular scene or config resides in the device, in the hub, or in the software.\n3) After the current update, this app consistently crashes in iOS6.1 right after the interface is populated from the house config and it begins reading device states.","updated":"2014-12-05T23:16:15-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1068532075","userName":"NotCranium","userUrl":"https://itunes.apple.com/us/reviews/id41247016","version":"1.8.0","score":3,"title":"Works ok but crashes","text":"I initially had many problems but after contacting Insteon and them walking me through a complete reset of the hub it started working.   Odd that it needed to be reset out of the box. \nI am now able to control and see the status off all of my Insteon devices.   I love being able to turn on the fan and turn off the lamps in the MBR from my bed. \nNow the major issue with the software is that I can not rename any device, room, scene without the application crashing.  This may be specific to IOS 8.0 because in the past, I was able to do this.  \nNow I have 5 leak detectors and all are named the same.  It's a good thing I don't have the issue with Houselink application.   \nThis should be an easy fix and I hope they get it fixed soon.","updated":"2014-09-22T06:06:15-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1183820496","userName":"Hey yeah man","userUrl":"https://itunes.apple.com/us/reviews/id177388142","version":"1.9.29","score":3,"title":"Great product - not so great app","text":"I have had mine for over a year.  Camra and other devices.  Mine works fine home or away.  However, my issue lately is it gives different colors on open/close status.  Usually you get \"grey/white\" for closed and \"red\" for open.  After latest updates I get yellow randomly and have no clue what that means. So if you are away you have no idea of your status.  I have not called in yet so maybe it's fixable.  Other issue is text alerts never come with correct time zone.  Did call that in and never resolved it.  Have not tried after this update yet.  Just got this update and it is terrible.  Can't control any  garage door now and status is solid Yellow.  Regular openers work fine but now my Insteon is a paper weight.","updated":"2015-04-16T20:29:37-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1497326885","userName":"DrJEB","userUrl":"https://itunes.apple.com/us/reviews/id142303738","version":"1.14.0","score":4,"title":"IMPORTANT for Setup","text":"Insteon is fantastic, and this app is fine IF a bit quirky. I'm going to echo what at least one other reviewer has said: once you get the hub set up this is fantastic. Do not give up!\n\nThe key is to keep switching wireless channels until you succeed. Most routers today are at least dual channel. I have three logins set up on mine, two at one frequency and one in another. Interestingly, neither of my primary logins worked when connecting to the hub. Then I switched to my guest login and there it was. Once you've connected to the hub, you're golden, no matter how you're logged in.\n\nGranted, Insteon should fix this. It's too finicky. But once you get it working, it's flawless.","updated":"2016-12-06T20:04:33-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1336580646","userName":"JimCSanJose","userUrl":"https://itunes.apple.com/us/reviews/id39757957","version":"1.12.2","score":5,"title":"Working perfectly ! Sonos Control !!!","text":"Not sure where the negative comments below are coming from.  \n\nDelete the app and re-install it from the Apple AppStore.  I’ve had apps crash before and doing this resolved it every time - next time try this first and don’t blame the app manufacturer.  I have over 100 Insteon devices in my home and the app and the devices are all working perfectly. Seriously go try VisiaRF or one of the other guys - I’ve personally wasted thousands of dollars on that junk and hung up on overseas tech support call centers.  No one beats dual path with Insteon - hands down. It just works in big homes or small homes.\n\nI recently switched over to Sonos Amps in my home and am using 8-button Insteon keypads to control them and they ROCK !!!  It’s not a luxury to have the keypads controlling Sonos - it’s a necessity.  How often do you leave a room with music playing and then can’t find your iPhone / iPad to pause or change the volume?  \n\nI have yet to be disappointed in Insteon.","updated":"2016-02-21T09:13:23-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1393342828","userName":"Dr Braz","userUrl":"https://itunes.apple.com/us/reviews/id215565026","version":"1.13.0","score":2,"title":"Fair interface but disapponting","text":"I prefer Insteon devices to all the other HA hardware (and I've sunk money and time into four others looking for the best solution).  The hub and hub app fails too short to be a mainstay for dependable use for one reason. Total reliance on cloud service. No internet-no app control.  This system should have a fallback with local network control for at least limited control via phone or tablet. I've replaced hub in my house with an ISY and it is perfect other than slight complexity in setup. It'svery good at what it does on local network as well as remote operation when away from home.   I'll be replacing hub in my other building with an ISY soon.   I just hope the hub and hub app lack of offline operation doesn't cause the rest of Insteon to suffer.","updated":"2016-06-12T10:44:08-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1202805240","userName":"stateside","userUrl":"https://itunes.apple.com/us/reviews/id40156112","version":"1.9.29","score":5,"title":"Very Solid App","text":"This app is very polished and I've been very pleased with the pace of new features added over time (matches iOS interface, iWatch support). This app complements iOS and the Insteon ecosystem very well. My guess is that some of the other reviewers are having issues with signal interference over powerline. I have a lot of dual band devices and a new home with new wiring. I used to have an issue with my garage door showing as unknown status but adding a bridge fixed that so it wasn't the app anyway. My one request would be to add events and conditions to the app since HouseLinc is no longer being developed.","updated":"2015-05-26T00:36:24-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1519258750","userName":"DT2801","userUrl":"https://itunes.apple.com/us/reviews/id114979905","version":"1.14.1","score":5,"title":"Decent App for is purpose","text":"I wanted to write a review because I feel like there are a lot of negative reviews and this system (insteon) doesn't get enough good reviews. At least that is what I found when researching and deciding in which system to go with. I have been using this app and associated hub for over a month now and have had zero problems. In fact I love it and he flexibility it gives. I did a lot of research before settling in on using insteon over others such as Wink, Wemo, and Smart Things. I do not regret my decision and for me so far this app and system has worked flawlessly.","updated":"2017-01-10T07:34:36-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1103175973","userName":"GregGoff","userUrl":"https://itunes.apple.com/us/reviews/id15149567","version":"1.9.6","score":4,"title":"Great system, just a few bugs...","text":"I chose Insteon for my whole home security system instead of a paid monthly service and I don't regret it at all. I have my door locks, smoke alarms, thermostat, CO detector, and even flood detectors hooked up to my phone and IFTTT to creat a self monitored system that make me feel safe. I have video for my babies room as well as outside security cameras. The only issue I have is the range extender doesn't always connect to one of my end points. I have net been able to trouble shoot successfully yet. It's still worth the price to monitor and configure this myself. I know what's happening with my house all from my phone. It's fantastic.","updated":"2014-11-25T15:47:37-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1391255686","userName":"Thomasj106","userUrl":"https://itunes.apple.com/us/reviews/id101022524","version":"1.13.1","score":2,"title":"Still the same old horribly pathetic interface.","text":"I have two houses with Insteon products in both (I've discovered that this was a bad decision.)  If you cannot sign into one because of a power failure, modem failure, network failure, or whatever the case may be, you can't sign into either, even if everything else is fine with the other.  If all is good and you can sign into your account, the gyrations you have to go through to switch houses is insane.  It should be a simple choice.  If you want to see a simple interface that works flawlessly, look at Chamberlain's MyQ garage door controllers app.  NOW THAT\"S AN INTERFACE!  I am most likely going to just eBay all my Insteon stuff and go with better products and an app that's a little more modern.","updated":"2016-06-08T19:12:38-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1453182030","userName":"Adam V.","userUrl":"https://itunes.apple.com/us/reviews/id30849033","version":"1.13.2","score":2,"title":"Apple Watch integration is broken","text":"It would be great if I could reliably use this app on the Apple Watch.  The reason I can't do so is because within a minute or two of launching the watch app, my iPhone is logged out of the Insteon app for some unknown reason.  If I don't use the watch app, the Insteon app on my phone stays logged in for weeks or months at a time.  Once the watch app is launched, however, the phone app soon signs itself out; thereby making any further interaction with my Insteon devices from the watch impossible until I sign back into this app on my phone.  And the cycle repeats.  I finally just wised up and deleted the watch app, unfortunately.","updated":"2016-09-20T20:05:06-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1125122166","userName":"BruceJoyce","userUrl":"https://itunes.apple.com/us/reviews/id259854365","version":"1.9.13","score":5,"title":"Impressive for the Holidays !","text":"We rode to a TSO concert with friends, returning home after midnight.  The house was decorated with outside lights on all four sides using outdoor appliance modules and inside lights in five windows with plug-in modules.  All were in a Christmas scene set to turn-on at sunset and off at 11:30 pm.  As we pulled into the drive our friends were disappointed they never got to see the lights on.  Sitting in their car, I pulled out my iPhone, tapped the app and turned on the scene.  The entire scene came on simultaneously flooding the lawn with light.  They were impressed and amazed.  I was ecstatic.  Thanx Insteon & Insteon Hub.","updated":"2015-01-05T08:10:48-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1117330641","userName":"Ampdraw","userUrl":"https://itunes.apple.com/us/reviews/id243780276","version":"1.9.7","score":4,"title":"Minor Issued","text":"Overall we've been very happy with our Insteon products. The app has a few minor issues that need addressed, but overall it works good.\n\nThey need to fix how phone numbers are entered for text alerts. Even their tech support had issues getting it to work when we wanted to add a second number to also receive alerts. Now I have to call them again because my primary number changed and I can't edit it for the new number.\n\nAlso the little indicator that tells me if a wall plug in module is on or off use to work but now seems to have a mind of its own.","updated":"2014-12-22T00:16:10-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1158587465","userName":"Pete Coggi","userUrl":"https://itunes.apple.com/us/reviews/id27583809","version":"1.9.13","score":1,"title":"Hobby fun, but not reliable","text":"The app 'controls' the system, but the system is not reliable. Works sometimes, not others.  Hard to create scene to activate multiple door and motion sensors for perimeter security. X-10 works but not as part of a scene.  Not compatible with other automation systems. You can reach their tech support easily, but the technicians can't solve all problems, say they will escalate, but you never hear from them again.\n\nSays unlimited notificatons...but not true.  If they think you overuse they will cut you off without notice.  If you call, they will say they emailed.  But no email received.  Not to be trusted, and no options to upgrade to a better \"paid\" service.  Fun to turn lights on and off, but I wouldn't want these yahoos to be responsible for turning my heat on and off!","updated":"2015-02-25T17:25:21-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"875979631","userName":"Majohnss","userUrl":"https://itunes.apple.com/us/reviews/id143577314","version":"1.5.0","score":5,"title":"Great update!!!!","text":"I had just switched to the hub from smartlinc controller and was very disappointed that it didn't support the 6 & 8 button keypads very well.  I called support and was told they were working on it. I am very pleased to see it has been added and very easy to configure.  Great job... I have a second hub at vacation house. Would like to see better support for two locations. Currently have to sign out of one account and sign in with different email address. It would be great if I could switch locations within the APP.  Great update!!!","updated":"2013-09-27T10:30:06-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1512126966","userName":"evansb2","userUrl":"https://itunes.apple.com/us/reviews/id37313021","version":"1.14.1","score":1,"title":"Try Insteon+ app instead","text":"When I could not get this app to work with my Insteon Hub Pro, I contacted tech support and they instructed me to use the Insteon+ app. I was also told to bypass the app completely when registering new switches/dimmers. To do that, press the button on the back of the hub until it beeps and a green light comes on. Then go to the device you want to pair and press it's pairing button until it beeps. Press the devices button again until it beeps and return to the hub and press it's button till it beeps twice. The hubs LED will turn green and then switch back to blue, indicating you were successful. The devices are now linked to each other. Not The best way to do things, but it works every time for me. Now, I can use the Insteon+ app and Apple's Home app to control the lights.","updated":"2016-12-30T09:01:58-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1496294804","userName":"magneticmeridian","userUrl":"https://itunes.apple.com/us/reviews/id23456047","version":"1.14.0","score":4,"title":"No issues out of box","text":"Our main home is Nest centric. I decided to try out Insteon when I found it at Costco for my work pad. First, I tried scanning QR to set up hub - didn't work. But it did when I followed instructions...plug in router before to attempting to connect! \n\nI've set up one of two plug in modules that came in the kit. Module synced with router after touching button below arrow buttons. Light is very responsive to app both on timer and manual touch. \n\nOnly kicker...older house with tall baseboards. The size of the module covers both outlets when in top plug. Cool tool - but I loose 2 sockets for every module. I have to use top plug, because the module only has a plug for the light at the very bottom. If it had a plug port at the sides or top...would be highly functional in design. Having it at bottom only causes our cable to clash with trim and not sit in outlet safely. \n\nSays it \"works\" with Nest. This means you can add a Nest device in the Insteon app - not the other way around.","updated":"2016-12-04T23:39:43-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1116962613","userName":"ToeKnee182","userUrl":"https://itunes.apple.com/us/reviews/id277278415","version":"1.9.7","score":4,"title":"Even my wife uses the App","text":"The Insteon products themselves are very good and easy to setup and very very addictive. The App makes the above setup even easier. The presentation is great with a nice UI. I even integrated my NEST into it and it works nice. \n\nNow here's the bad and it's not a lot: I wish I can use Siri to access the commands natively. I wish logging in does not take as long. I wish I can arranged components in an order I choose besides the alphabetical order imposed. And that's it. \n\nMaybe the above wish list will come true hen Insteon will have a HomeKit interface. It is Xmas after all and I have been nice this year.","updated":"2014-12-21T07:35:42-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1521512620","userName":"Twomommy","userUrl":"https://itunes.apple.com/us/reviews/id326116296","version":"1.14.1","score":5,"title":"JUNK","text":"At first I thought it was an issue with the router making the hub not connect but the I realized that restarting the app would fix the problem. \n\nIt was nice setting up but once you open the app it takes over two minutes for it to pickup the switches and if your screen turns off before it finds the switches, well you're ish out of luck because the search starts all over once you turn your phone back on. \n\nThe layout of the app is nice I just wish it worked","updated":"2017-01-13T15:27:17-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1074894513","userName":"jakethesnake221","userUrl":"https://itunes.apple.com/us/reviews/id85382500","version":"1.9.0","score":1,"title":"Horrible since update","text":"Ever since they released the new version of this app, my entire Insteon system has been screwed up. First, about 80% of the time I tried to open the app up, it would say \"cannot connect to hub\". So, every single time I wanted to use the app, I would have to go and unplug the hub and reset its network settings. Then, for the limited times that I got to use the app, when I tried to turn something on, it would just show a red dot like it can't communicate. So, I tried resetting my ENTIRE system. And surprise suprise MORE ISSUES. Now, I don't even have a working Insteon system. Again, everything seemed to be going fine before the update. Bottom line - the Insteon Hub team really needs to get they're act together.","updated":"2014-10-04T07:03:03-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1144261441","userName":"Ken and Andy","userUrl":"https://itunes.apple.com/us/reviews/id404772443","version":"1.9.13","score":3,"title":"Ok but not great","text":"System right out if box will not link controllers to hub.  This requires you to think, go to website and go through a delete, factory reset and firmware flash procedure.  How do you sell something that RIGHT OUT OF BOX WONT WORK and needs firmware upgrade?  App is ok but not intuitive.  It will take a bit to get this running and your house won't be totally George Jetson like but pretty good. Example- I think the lights can come on and off once a day by a timer.  Not multiple to make it look like u are home.  I want to mainly monitor temp while away and also turn on lights as Wife gets home.  So good enough for now.","updated":"2015-02-09T06:13:01-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1333123982","userName":"Zed06","userUrl":"https://itunes.apple.com/us/reviews/id192411217","version":"1.12.2","score":2,"title":"Software cant find correct location","text":"Hardware seems to work fine, but the software, using gps puts the hub down the road from the correct location.  There is an option to put in an address or geocoords, but it wont use what you enter, sticking to where it wants to put you.  For some reason it then cant figure out what time it is, and therefore schedules are useless.  Setup worked fine other than this, and the interface is ok, but it is worthless if it cant figure out location and time.  Also appears to be no way to set the time manually.  I could live with location error, but the time problem is a killer.","updated":"2016-02-14T17:06:23-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1367716011","userName":"Silverware Software","userUrl":"https://itunes.apple.com/us/reviews/id3871102","version":"1.13.0","score":2,"title":"Push Notifications still not fixed","text":"I chose long ago to use Insteon in my home for automation.  It works well but the push notifications are seriously broken.  I have an on/off sensor which I have notifications enabled.  I receive the \"open\" push notification but not the “closed\" notification.  HOWEVER, if I make any change in the app to the alerts for this on/off sensor, no push notifications are received.  I have tirelessly worked with tech support since August of 2015 on this issue, each time getting no resolution.","updated":"2016-04-23T10:20:33-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1324000595","userName":"Mike4034099","userUrl":"https://itunes.apple.com/us/reviews/id103715455","version":"1.12.2","score":1,"title":"Could be so much more","text":"Update: I just don't understand how these guys just decide to add new features without refining or updating or addressing older unresolved issues with the app.\n\nAs long as this has been around I'm surprised at the lack of refinement. Insteon makes the hardware and the software. Hardware is great, software needs updating. Adding certain favorite devices or scenes to the Notification Center seems like an obvious convenience that should be available.  \n\nGarage door controller doesn't even have a true dedicated button. It shows up as an on/off switch.. And that doesn't even function properly half the time. I really wish the software could catch up with the hardware.","updated":"2016-01-28T14:51:32-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1483416401","userName":"Mr Windmill","userUrl":"https://itunes.apple.com/us/reviews/id41140438","version":"1.13.2","score":1,"title":"Clunky and primitive","text":"As long as INSTEON has been out I expect a lot more. This app works...  barely. If I'm going to use my phone to control lights, I expect it to work quickly, not wait for an app to boot up constantly. I expect a user interface that lets me easily adjust functions and settings. When I schedule a scene I expect it to work. I don't expect X-10esque limitations like can't make two commands work at the same time, no ability to vary times by day, no ability to do sunrise/sunset +/1 time. I don't expect to have to roam around the house pushing buttons to get the app to recognize working responders which were previously registered. I use both a hub and an ISY and find both deficient.","updated":"2016-11-12T16:22:31-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1185147709","userName":"Mikrotransynergy","userUrl":"https://itunes.apple.com/us/reviews/id124146058","version":"1.9.29","score":4,"title":"Push Notification features","text":"Such a great app to control and monitor my insteon products. One feature I would like to see added to the push payload is the ability to change the push notification sound which is set to apples default push sound. With the discontinuation of SMS, I can no longer use my (loud) custom tone to hear when a door or window is open. Now when I receive my push message, I only hear a quiet \"ding\" which is inaudible in my pocket. Other than that, Superb Job!!!","updated":"2015-04-19T08:23:06-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1110545734","userName":"Zip stone","userUrl":"https://itunes.apple.com/us/reviews/id17348174","version":"1.9.7","score":4,"title":"Good app, okay performance","text":"The app has a lot of convenient uses. Buy a camera, and set it up. No need to pay $30 a month for a security camera. Light switches as well. The only draw back is the Hi definition camera. The camera glitches and needs updates. The glitch causes the camera to keep moving in the direction you want it to go without stopping. Other than that, the app And the devices are great. It is also a much better option then a certain $30 a month deal.","updated":"2014-12-09T09:32:18-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1498811334","userName":"HScotty","userUrl":"https://itunes.apple.com/us/reviews/id100120997","version":"1.14.0","score":4,"title":"X-10 not working AGAIN","text":"I have been using Insteon equipment for years, and the devices work well, and reliably. But I still have many old X-10 devices in use, especially outside devices for Holiday lights. Every now and then, Insteon comes through with an update that makes X-10 non-functional. They've done it again. \n\nNo outgoing signal, either programmed or manual. No changing on/off times, no adding new devices; if you try, they all revert to address A1.\n\nCome on, Insteon: fix this!","updated":"2016-12-09T07:19:18-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1491464729","userName":"Paul Kleeberg","userUrl":"https://itunes.apple.com/us/reviews/id4408099","version":"1.14.0","score":1,"title":"I agree, worthless","text":"Just purchased the product from Costco. I agree it is worthless. I downloaded the app tried to configure the router and I could not. Tried resetting it, try different wall outlets, try different connections to my router to no avail. I did not want to spend 30 minutes on hold to speak with someone to see if we could fix it. I will wait to see if this app is upgraded before I return it to Costco.  I must say that the price was amazingly good for a router and two wall appliance modules but when I look to see what the cost of other ones are they appear more expensive. Must be like printers. Sell the printer cheap and the ink expensive.","updated":"2016-11-26T12:14:28-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1103173965","userName":"Tb009","userUrl":"https://itunes.apple.com/us/reviews/id113728510","version":"1.9.6","score":5,"title":"Great products","text":"I can't say how great the led bulb and the motion sensors are. I also have the camera, remote management made easy, the app walks you through setting up port forwarding on most major router manufactures. The app has worked flawlessly for me no crashes on a iPhone 4s and currently on a iPhone 6 both were running iOS 8.1.1. I would have been happy to pay for this app, five dollars for no crashes yes that's a no brainer.","updated":"2014-11-25T15:41:48-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"827608566","userName":"RBONESTARWOOD","userUrl":"https://itunes.apple.com/us/reviews/id20810471","version":"1.4.0","score":1,"title":"Does really program the insteon system","text":"I already have dozens of switches and keypads in my house programmed and linked .  Hub is fine but its a totally separate system which does not interact with the programming in the switches nor does it work with the keypads. So I would have to build and maintain a completely redundant and separate system on hub which does not make sense to me. Plus I cannot use hub to link or program the switches and keypads so it does not really help me program or control the insteon system I have. I did not really understand what it did but it's really just a new and separate way to control some of your insteon devices with your phone or pad.","updated":"2013-06-27T16:42:40-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1229004570","userName":"Chiphead","userUrl":"https://itunes.apple.com/us/reviews/id31961493","version":"1.10.0","score":4,"title":"Still logging out","text":"I actually had a decent run with the older version not logging me out and was able to control devices on my Apple watch. My wife had issues but now that we have both upgraded to this version it logs is out consistently rendering both the app and the watch app useless. Hope to see a fix soon. \nOn the bright side there were other welcomed improvements just nothing good for the watch.","updated":"2015-07-17T20:04:48-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"958578397","userName":"Eric Summers","userUrl":"https://itunes.apple.com/us/reviews/id38076902","version":"1.7.0","score":5,"title":"Great system","text":"Great device/app!  Besides controlling your Insteon devices, this app will also program them.  If you have a lot of Insteon devices, the Hub is indispensable to set everything up.  You need to make sure you do a factory reset on them first so that Hub knows all of the program settings.  The app will not change anything set outside the app.  \n\nIt is cool to see Nest support.  I hope they also add Ecobee wifi thermostat support.","updated":"2014-03-12T19:58:47-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"929268266","userName":"CoreTech IT","userUrl":"https://itunes.apple.com/us/reviews/id29713761","version":"1.6.0","score":2,"title":"Fails to connect after performing update!","text":"After installing the update, App fails to authenticate and connect. I've been on the phone with support for hours over hours and still unable to get it to work. I'm able to go on the web and log into my account using their beta app, but no devices are there. It would be nice if you're able to use the beta app on the web to create and control your devices. Nice app if it worked. Needs another update.","updated":"2014-01-22T06:36:15-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1322432150","userName":"Artsez","userUrl":"https://itunes.apple.com/us/reviews/id27943341","version":"1.11.0","score":1,"title":"Apple Watch fix","text":"How about fixing the Apple Watch software to allow users to actually use their watches to control devices rather than having to log into your phone to do so. What is the point of launching the app on your watch, then having to find your phone, which you left somewhere in your house, just to control your devices. At that point, I'll just use the phone since I went thru all the trouble of finding it. Incredibly stupid guys, don't even bother marketing your Apple Watch version, it's useless. Thanks for the other pointless upgrade, control your Sonos speakers, I really needed that.","updated":"2016-01-25T18:21:28-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1233588345","userName":"clinlx","userUrl":"https://itunes.apple.com/us/reviews/id108405589","version":"1.10.0","score":1,"title":"Problems saving login info, watch app is useless","text":"This version of the app does not save login credential or session token on the phone, every time you open the app you will have to login again.  Since the Apple Watch App requires the main app to be logged in to work, this essentially render the watch app useless.  It's very easy to persist the login token, and it doesn't seem like SmartHome has tested their app before releasing.  It will take any experienced developer just a couple hours to fix.  The company probably outsourced their app and don't know what they are doing.  I guess my next smart home setup won't be insteon anymore.","updated":"2015-07-26T14:46:15-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1008716809","userName":"Wizzzilk","userUrl":"https://itunes.apple.com/us/reviews/id331678512","version":"1.7.5","score":3,"title":"Decent...","text":"Biggest complaint is that it definitely needs to rotate for the iPad. Seriously, this is a huge drawback of the app. Also really wish it was possible to adjust the sensitivity of the Insteon camera motion detection from within the app rather than logging into the camera's web interface. The UI isn't the best or the most intuitive, but the app is very quick and responsive and adding / editing devices is a breeze. Also very cool how it links directly to the manuals for all the devices.","updated":"2014-06-11T19:20:02-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"934985637","userName":"Sdbirddog","userUrl":"https://itunes.apple.com/us/reviews/id12958002","version":"1.6.7","score":4,"title":"Awesome","text":"I really like this app. Although two way audio does not work on the IP cam which is why I bought the cam is still a great product. I do wish that you could fit more icons for your devices on the front page of the app therefore not have an escrow through second page after page to get to your other items to control. If those two things were different I would've given it five stars.","updated":"2014-02-01T11:02:21-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1501369018","userName":"JakeT2","userUrl":"https://itunes.apple.com/us/reviews/id38782000","version":"1.14.0","score":4,"title":"Needs more color.","text":"I like the app and the devices, but it could use more color than just blue and white. How about giving us some color icons for the devices? The little dot indicating when the device is on is confusing, since it's darker when on than when it's off. How about using a vertical bar to show brightness levels on dimmer switches? Use white or bright green, instead of dull blue. Use black color for off.","updated":"2016-12-13T16:00:42-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1523850618","userName":"Agentriegel","userUrl":"https://itunes.apple.com/us/reviews/id12756110","version":"1.14.1","score":1,"title":"More bugs. They never fix this app","text":"Two versions ago I could connect over cellular. Now I need to be on my local wifi for anything to work.\n\n***Figured out if you're using a static IP set it to DHCP then set it back to static IP. That'll update your external IP address which you can't update manually. Never had this issue before***\n\nIt's clear they either don't care or don't have the resources to fix this or the several other major bugs they've been ignoring. I won't be buying any more Insteon devices and I'll migrate onto a more supported product like SmartThings moving forward.","updated":"2017-01-16T19:32:34-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"946023510","userName":"apple1822","userUrl":"https://itunes.apple.com/us/reviews/id86119840","version":"1.6.7","score":3,"title":"Support could be better","text":"After calling support 4 times, spending hours to explain the bug that they have between this iOS app, insteon hub and the Morninglinc. They finally listened to me and went to test the combination and admitted that the iOS app has a bug that preventing unlocking the MI lock properly(double tap the \"off\" button will make the lock to be opened and lock back again within few seconds). Hope the new version will come soon.","updated":"2014-02-18T12:14:52-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1516130530","userName":"XxRakkMac101xX","userUrl":"https://itunes.apple.com/us/reviews/id37293069","version":"1.14.1","score":4,"title":"Super simple and works!!!","text":"I was able to install the app and get my first device working super quick. I was skeptical of this at first so I only bought the starter kit. I look forward to slowly upgrading.  The only reason I didn't give the 5 stars is because of the slightly annoying extra steps to coordinate it. It was not very difficult but it could be daunting to non-tech savvy people.","updated":"2017-01-05T18:24:47-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1545856310","userName":"Octygon1","userUrl":"https://itunes.apple.com/us/reviews/id279005112","version":"1.15.1","score":3,"title":"Great starter app, but...","text":"Really nice app for someone who's getting into the home automation kit. Also has plenty of custom features and schedules. Keep updating!\n\nOne thing that bugs me is the app randomly takes a long time to refresh device status, i.e., when I get home to use garage door opener or turn on a light. I often find myself waiting in front of the garage door for 20-30 seconds before device list refreshes and I can open door.","updated":"2017-02-16T11:15:56-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1503721074","userName":"Wasted spacer","userUrl":"https://itunes.apple.com/us/reviews/id180376675","version":"1.14.1","score":1,"title":"Terrible app - Needs a total rewrite!","text":"Convoluted, confusing, appalling app. Appears to be more like a random collection of bolted together utilities than a cohesive device control environment. Setting up and managing device schedules is possibly the most convoluted. For example you cannot appear to merge device schedules into a scene or even figure out how to delete an unwanted schedule! Even simple fader control to totally \"off\" seems beyond either this app and/or the device - there is still residual current flowing when scheduled unless the device is explicitly told to be \"off\"!","updated":"2016-12-17T11:26:52-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"725976743","userName":"Avenna","userUrl":"https://itunes.apple.com/us/reviews/id299181228","version":"1.1.0","score":5,"title":"Easy to use and very cool technology","text":"I was given this as a gift and everything has been easy to install and use.  I feel a lot safer and in control of my surroundings even when I'm not home now.  The app is really easy and I have not had any issues with it.  Now that I have it I cannot believe I didn't know about it sooner.","updated":"2013-01-09T07:58:03-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1110669850","userName":"Jpass1","userUrl":"https://itunes.apple.com/us/reviews/id126931996","version":"1.9.6","score":5,"title":"Great app","text":"This is a great app that just keeps getting better. I first installed Insteon devices in my home a couple years ago and have continued to add devices several times a year. They keep, updating the app and have made awesome improvements each time. Their investment in the app gives me the confidence to keep buying more Insteon products.","updated":"2014-12-09T15:41:22-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"969838931","userName":"Hank R. H.","userUrl":"https://itunes.apple.com/us/reviews/id101232282","version":"1.7.1","score":1,"title":"Useless!","text":"I have been an iPhone user since 2007 and have used countless apps! This is the first time I've ever felt compelled to write a review. This app hands down is the most useless app in the AppStore... Even more useless than the pocket therapist app... At least that one brought me some laughs! \n\nI have tried for the last 2 weeks to either A. Turn a light on... Or B. Turn one off with this app... It's hasn't worked.. Most of the time it takes 4-6 attempts to connect to the hub. After connecting to the hub(if it ever does) it cannot operate anything. \n\nThis app did work at one point, but has been completely screwed up.\n\nLet me close this by saying... I love Insteon products and I would recommend them to anyone  I know, with the exception of this app. It's an embarrassment to Insteon... Not to mention the money I wasted on the hub! \n\nAnyhow, I hope Insteon is able to fix this app!","updated":"2014-04-01T21:20:33-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1110620014","userName":"Dkkwi","userUrl":"https://itunes.apple.com/us/reviews/id326529546","version":"1.9.7","score":5,"title":"Insteon product","text":"Fantastic product! Installed extremely easy. Didn't have to read the instructions as the hub just took over and installed everything. Had a simple question for customer support and they called me back with the info! Extremely happy with the purchase.","updated":"2014-12-09T13:17:11-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1080463144","userName":"Schm9952","userUrl":"https://itunes.apple.com/us/reviews/id16652635","version":"1.9.1","score":3,"title":"Decent system","text":"I've had an X10 system for over 30 years. Slowly I've been upgrading to Insteon. This a significant improvement over the old X10 but the price tag for switches and interfaces are higher. The Insteon Hub however is a huge convenience. Being able to check in from anywhere is great. The app does occasionally hang. I've had to delete and reinstall it a few times but over all it performs well.","updated":"2014-10-14T15:15:20-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1067775716","userName":"LiftGuy4life","userUrl":"https://itunes.apple.com/us/reviews/id277604089","version":"1.8.0","score":4,"title":"iOS 8 update please","text":"Still like the app just need an update, after updating my apple products to iOS 8 there seems to be at least a couple of issues. One being not able to change the name of a device, when trying to change the name the app crashes. Good stable app, not flashy and complicated, just basic and easy to use.","updated":"2014-09-20T22:24:02-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1558225317","userName":"WantStuff2Work","userUrl":"https://itunes.apple.com/us/reviews/id40582016","version":"1.15.1","score":3,"title":"Starting to slow","text":"This is great app for what it does but it's really starting to slow to the point of being almost unusable as a handheld controller. It can take 45sec+ to figure out the status of the various modules and display them. And if you move to another page of control a device, it starts polling all over again. Hopefully they can figure out how to speed this polling up a little","updated":"2017-03-05T11:20:45-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1189006386","userName":"Rijoro","userUrl":"https://itunes.apple.com/us/reviews/id12118882","version":"1.9.29","score":2,"title":"Apple Watch portion","text":"The Apple Watch app looks great and I love the design but there is still a long way to go. I originally had posted that the watch app did not work but discovered that you have to launch or have recently launched the Insteon app from your phone. There is no feedback as to if a light is on or off or otherwise and I still can't get the camera to display through the watch. I think it is a good beta version but has a way to go still.","updated":"2015-04-27T15:50:47-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"870923813","userName":"Spandalicious","userUrl":"https://itunes.apple.com/us/reviews/id31226451","version":"1.4.0","score":1,"title":"Terrible Design","text":"Really poorly designed App. You can only have one scene mapped to the same starting time, like Sunset. Why can't two different scenes start at the same time, and end at different times? App makes it impossible to remove a start or end time, or just delete a schedule for a device. All you can do is change the time. INSTEON, please hire someone to do this and test it properly before selling the HUB which can only be accessed using this dumb App. The previous web app for Smartlinc was better than this, and that is not saying much.","updated":"2013-09-15T18:25:42-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1481691686","userName":"Shortsman Spiff","userUrl":"https://itunes.apple.com/us/reviews/id14914898","version":"1.13.2","score":2,"title":"Still not as good as X-10","text":"In theory, Insteon should leave X-10 in the dust. In practice, Insteon is more difficult to set up, less customizable, the Hub rarely operates in the same time zone that I live in, this app is painful to use, and to top it off, every time the app updates, it deletes my email and password, making my iPhone useless to run Insteon until I go look up and reenter all my data. Style does NOT beat substance. I'm really missing the usefulness and customizability of X-10.","updated":"2016-11-09T17:23:20-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1276334148","userName":"daveslc","userUrl":"https://itunes.apple.com/us/reviews/id29525005","version":"1.11.0","score":2,"title":"Great app (for sending them data)","text":"I tried the insteon hub and app, setup was easy and I liked the camera interface but their hub uses an external web service which means all of your home automation data is being sent through their servers. I have since trashed their device since their is no good reason that they should be privy to this data. Home automation devices should not rely on outside web services, period.","updated":"2015-10-24T04:55:31-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"733738042","userName":"AuVidGuy","userUrl":"https://itunes.apple.com/us/reviews/id25794631","version":"1.1.0","score":4,"title":"Install was easy","text":"I already had a bunch of Insteon devices installed.  \nI got a Hub and then started adding devices through the app.  \nIt was easy to add the devices, just follow the steps in the app.\nOnce I had a number of devices in the app, it was really easy to create scenes.\nI just had to click on the devices I wanted in the scene and the app pretty much did the rest.","updated":"2013-01-21T07:32:58-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1284518862","userName":"Snarky707","userUrl":"https://itunes.apple.com/us/reviews/id208076578","version":"1.11.0","score":3,"title":"Disappointed","text":"Before I bought the hub I used a 3rd party app and was able to use the 2 way audio and zoom. I got the hub with excitement because the insteon app is supposed to be better. HUGE DISAPPOINTMENT!!! No zoom and no 2 way audio. Only benefit is I can see whats going on using cellular instead of wifi. I need lots more items but may choose another brand if this cant be fixed soon.","updated":"2015-11-09T20:51:34-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"918281975","userName":"suchtrouble","userUrl":"https://itunes.apple.com/us/reviews/id113846079","version":"1.6.0","score":3,"title":"works well with all insteon hardware","text":"My only complaint is that SmartHome decided to change the thermostat access module.  It is very difficult to use with the slider.  It would be much better if they went back to the old thermostat where one could hit up or down arrows to change the temperature.  I would have given this app a '4 Star' if it hadn't been for the thermostat. Please fix the thermostat.","updated":"2014-01-01T08:05:48-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1173090055","userName":"javiMac","userUrl":"https://itunes.apple.com/us/reviews/id41976946","version":"1.9.22","score":5,"title":"Excellent...And getting better and better!","text":"I think INSTEON is the best company when we talk about home automation. \nIf you are new in this and you're trying to find the right supplier,think in INSTEON,thry have the hardware,software and attention.\n\nNow,when you are going to release the new version for the new HUB?","updated":"2015-03-25T06:01:42-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1265342940","userName":"Libra42","userUrl":"https://itunes.apple.com/us/reviews/id33087377","version":"1.10.1","score":4,"title":"Good start!","text":"The app, and the hub/cloud, is a very start for home automation.   \n\nI would really like to see some form of offline management.   If your home internet service is out, you can't control any of your devices.  Even if you are in the same room, the app is hard coded to communicate with your devices via the Internet.","updated":"2015-10-01T05:37:53-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"788642064","userName":"MCB1230125","userUrl":"https://itunes.apple.com/us/reviews/id177947530","version":"1.3.0","score":4,"title":"Better","text":"This new version of the app is a big improvement over previous releases. \nI was hoping for more some functionality after waiting almost 2 months for an update, but this version seems faster and my camera loads a lot quicker.  Haven't seen any crashes yet.","updated":"2013-04-15T12:15:01-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1137753623","userName":"Hgfffffgfsdvjkjh","userUrl":"https://itunes.apple.com/us/reviews/id3063391","version":"1.9.13","score":1,"title":"Poorly designed","text":"I don't understand all the positive reviews. This gives you the ability to control, but the interface is ridiculously poor. Very not intuitive, very hard to find many varied settings. Doing something as simple as setting a schedule to disable the controller is amazingly difficult. For a first release app from a developer that doesn't know anything about iOS, this isn't very bad. But for an app that several years old? This is stunningly badly designed.","updated":"2015-01-28T16:13:26-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1538152960","userName":"Ipsprod","userUrl":"https://itunes.apple.com/us/reviews/id27961038","version":"1.15.0","score":1,"title":"PLEASE FIX THIS APP!!!!!!!!!!!","text":"This is incredibly frustrating that this new update has made the entire app useless. I cannot turn anything on from it anymore, none of my timers will work and now I can't even simply turn lights on from the Insteon light switches without doing a hard reset... seriously I can't even turn on a light anymore. I spent several hundreds of dollars on this and its installation and now it doesn't even work. PLEASE FIX THIS!!!!! Or at least offer a chance to load the old app","updated":"2017-02-05T18:08:13-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1228842341","userName":"Three Locations","userUrl":"https://itunes.apple.com/us/reviews/id187275448","version":"1.10.0","score":3,"title":"Logging in issues","text":"I have insteon systems in three locations. When I launch the app it doesn't show which of my 3 locations I am logging into. I cannot determine the location I am loging into until I connect to the hub. Why not add the ability before logging in to choose a location. If a hub cannot be accessed then you cannot log onto other locations.","updated":"2015-07-17T12:54:38-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1535745636","userName":"iHateMSFT","userUrl":"https://itunes.apple.com/us/reviews/id111593670","version":"1.14.1","score":2,"title":"Removing more functionality...","text":"I want this to work independently from the internet, you know, off the grid. Each version of the hub and app seems to remove functionality I once enjoyed. This version removes adding a device by id. Sometimes I just want to write the ids down, install the switches and add them later instead of running around the house. Now I can't. Stop removing features or releasing buggy software.","updated":"2017-02-02T12:11:43-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1228653300","userName":"JeffWhalen","userUrl":"https://itunes.apple.com/us/reviews/id40044147","version":"1.10.0","score":1,"title":"Broken Apple watch app","text":"Don't update! This version still logs you out of your iPhone when using the apple watch app and the iPhone app isn't open. Unlike the older version you could use the back button and log back in. This version clears your credentials all together! \n\nThe apple watch app would be such a great app if it would work right! It's been broken since they released it, and I keep waiting on a fix for it. Still waiting after this version too!","updated":"2015-07-17T05:02:26-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"906393867","userName":"Sumguyinfl18","userUrl":"https://itunes.apple.com/us/reviews/id101874714","version":"1.6.0","score":5,"title":"Works perfect","text":"Love the updates. Keep them coming! Everything works as stated. I have 6 scenes set up and 14 devices at home. All work like they should. Not one complaint. Works well on both iPhone and IPad. Not sure why others are having such issues.","updated":"2013-12-08T17:52:18-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1022101611","userName":"wwwxxxx","userUrl":"https://itunes.apple.com/us/reviews/id27337712","version":"1.8.0","score":3,"title":"Works, but lacks features","text":"The app works well and is reliable.  However it lacks very basic features like allowing offsets (ex. turn lights on 30 minutes before sunset or vary turn off time slightly for security). These are very basic things - X10 did this 20 years ago!  While I love the Insteon technology for its reliability, the software needs work to be more than flashy \"scenes\".","updated":"2014-07-04T07:10:02-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1560975788","userName":"hafeezfamily","userUrl":"https://itunes.apple.com/us/reviews/id19079576","version":"1.15.1","score":3,"title":"Fixed last issue.","text":"I removed my last 1 star because they fixed the issue but more importantly they owned up to the issue and said sorry (stuff breaks, got it, but you need to own it).\n\nThey app is getting better. Still too slow.\n\nThe Insteon system however is still the best of you want end to end home automation.","updated":"2017-03-09T15:50:26-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1381101347","userName":"BD35","userUrl":"https://itunes.apple.com/us/reviews/id34250640","version":"1.13.0","score":1,"title":"Doesn't work most of the time","text":"It takes several minutes to recognize even a few Insteon devices and then, after it recognizes them, only works a small fraction of the time.  When you find that you can save considerable time by walking over to the light switch and turning it on manually, the old-fashioned way, you know that the remote control app you're using is bad.  \n\nThis app is a waste if time, and the hub it required a waste of money.","updated":"2016-05-19T13:38:19-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1124320180","userName":"Carlwo68","userUrl":"https://itunes.apple.com/us/reviews/id273042313","version":"1.9.7","score":1,"title":"3 hrs trying to install camera","text":"There are no words to describe just how frustrated I have become in trying to install this system into my iPhone. I followed the directions to the T and my phone could never found the camera. It did not matter if I tried every which way from Sunday it absolutely would not work. I'm not even going to bother trying to install the door sensor or worse yet the thermostat. Forget it! I give up and am returning the product disgusted.","updated":"2015-01-03T21:15:30-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1275582067","userName":"burned by a pretty face","userUrl":"https://itunes.apple.com/us/reviews/id11030665","version":"1.11.0","score":2,"title":"It works but FAR from easy set-up","text":"Used this with their \"hub\" to build a basic water leak system. I've been able to get a motorized valve to work with one leak sensor (after MUCH trial and error). No luck yet in adding additional sensors or one of their remote switches. I can also turn the valve on/off via iPhone. Instructions and web support very weak. Go this route only if you don't mind fiddling -- it is NOT plug and play.","updated":"2015-10-22T15:29:03-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1525236703","userName":"KMahoney20698","userUrl":"https://itunes.apple.com/us/reviews/id33264032","version":"1.14.1","score":4,"title":"LOVE THIS APP","text":"I use this app from all over the world. I have cameras, thermostat, lights and Sonos (need more help here though - otherwise I would have given it 5 stars). App works flawlessly and do not understand how other people are having problems. \n\nI am about to set up my garage door opener, motion detectors and front door lock with it as well. \n\nThe cameras are the best! I can talk to my kids through the cameras and help them out at home and make sure everything is ok. \n\nI would have everyone buy the products and free app. Also, contacting Insteon is easy and extremely helpful. \n\nHave fun IoT!","updated":"2017-01-18T15:19:20-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1268661811","userName":"Luuuuch","userUrl":"https://itunes.apple.com/us/reviews/id16118183","version":"1.10.1","score":2,"title":"Functions ok, but is Ugly","text":"The app does what it is supposed to do, it turns on and off devices and created scenes. \n\nHowever, I find the menu structuring to be not very intuitive. Getting from devices to scenes and back is awkward.  \n\nFinally, the graphics are just awful they remind me of 1999. Can we get some more modern theming and iconography?  I know you are capable because the app for the HomeKit-enabled hub looks a bit better.","updated":"2015-10-08T04:32:14-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1162215488","userName":"johnthegreen","userUrl":"https://itunes.apple.com/us/reviews/id32471501","version":"1.9.13","score":3,"title":"Fair","text":"After a hard time getting this bird up off the ground it is flying pretty well now.  Tech support was needed. Once they worked the bugs out of account creation adding devices was smooth and effortless.  The ability to do things that I had presumed would be possible may in fact not be.  I'll update as time goes on.","updated":"2015-03-02T19:31:48-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1292605325","userName":"SecretLims","userUrl":"https://itunes.apple.com/us/reviews/id18457912","version":"1.11.0","score":1,"title":"Unreliable","text":"Just like their other insteon devices, it's unreliable. Need better quality management. I replaced whole home with insteon devices and lots of them failed. The hub application has dependency on their server, they're sever fail which i seemed to experience, means you can't login to your hub. Now that happened, i see that lots of complain about how they may gather your usage information. Think twice before adopting them. The hub is going back.","updated":"2015-11-27T17:55:41-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1376570033","userName":"sharpie000","userUrl":"https://itunes.apple.com/us/reviews/id102415190","version":"1.13.0","score":2,"title":"When will the Today screen be utilized?","text":"It's such an inconvenience to have to open the app each time I want to access my favorites. Cant you implement quick access buttons to scenes and devices from my favorites on the Today screen in the pull down notification area? I know the Universal Devices app has been doing it for the longest time when using the iSY hub. Come on, Insteon.","updated":"2016-05-10T11:57:08-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"925609476","userName":"Solitaireplayer9876","userUrl":"https://itunes.apple.com/us/reviews/id19320021","version":"1.6.0","score":5,"title":"Works Great - need badge notifications","text":"This is great app so far and has been handy to use on indoor and outdoor lighting. One feature lacking would be a badge icon to indicate a light is on or the number of items turned on currently.","updated":"2014-01-14T22:40:50-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1508280972","userName":"TheWasabi","userUrl":"https://itunes.apple.com/us/reviews/id100542257","version":"1.14.1","score":1,"title":"Now I couldn't connect to my hub on the cellular!!","text":"I used to be able to connect and control my hub from away from home via cellular connection.  After couple app updates including this latest updates, now I couldn't.  It also seems to hung up on the Apple Watch app as well and don't work as good as before.  Just bought this Insteon Hub kits from Costco and it is a bargain but now, returning it is the next option.  Please fix you app a.s.a.p.","updated":"2016-12-24T12:18:40-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1479222423","userName":"IsitTadow","userUrl":"https://itunes.apple.com/us/reviews/id108284819","version":"1.13.2","score":2,"title":"Need to start over","text":"It's time to scrap this app and start over. I use it to add devices and that's about it. 3rd party apps are faster and have more features. Maybe that's the point, but insteon, at least open the API for all of your devices if you guys choose to try to spend development time on this inherently poor app. It's not to late to start over and come out with a modern mobile app.","updated":"2016-11-05T11:44:33-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1172816870","userName":"Funky Visions","userUrl":"https://itunes.apple.com/us/reviews/id43439536","version":"1.9.24","score":5,"title":"Getting better","text":"The latest version connects to the hub fast!  And no more slow statuses from devices. Hooray! Now if you'd only create a notification widget so I could get to the controls faster. Can't wait for the HomeKit enabled hub.","updated":"2015-03-24T14:11:04-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"868648271","userName":"AVijar","userUrl":"https://itunes.apple.com/us/reviews/id235152105","version":"1.4.0","score":1,"title":"Insteon App","text":"Lacks basic features. Appears like a high school project and not like a professionally written app for a device costing $130. Very disappointing. I keep waiting for an improved version with obviously required improvements but I have not seen anything in many months. I have been using insteon products for several years now and the Hub and it's app have been a complete disaster from the beginning. Looks like the company has lost it's way and is headed south.","updated":"2013-09-11T05:49:32-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"816486965","userName":"Porsche_kid","userUrl":"https://itunes.apple.com/us/reviews/id186135067","version":"1.4.0","score":5,"title":"Cool!!","text":"Way better than the Smartlinc app. With the latest update, this app is getting to be the best of home automation. I just wish that it can support the EZFlora so i can totally get rid of my Smartlinc. Or add the option of creating events so I can send custom commands to the EZFlora.","updated":"2013-06-06T15:39:44-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1085256396","userName":"dpcarls1598","userUrl":"https://itunes.apple.com/us/reviews/id22514044","version":"1.9.1","score":4,"title":"Like the system but...","text":"The last update broke the ability to turn on at sunset.  I have now lost one of the main functions I used it for.  Not sure if a fix is planned but it's frustrating that an update that does one thing breaks something else.","updated":"2014-10-23T19:15:26-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1509800197","userName":"NylonNicole","userUrl":"https://itunes.apple.com/us/reviews/id157816744","version":"1.14.1","score":1,"title":"Can't control via app","text":"Wish I could give it zero stars. At first I was able to control the thermostat via my app over cellular connection now I cannot. The whole reason I bought Insteon was for this purpose now I am just wasting money heating my business after my employees for nothing.  Very upset! I find I can do it while I'm connected to Wi-Fi but that is it. Big fat waste! This is the first app review I've ever written that how upset I am- Shame on you Insteon!","updated":"2016-12-26T20:06:26-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1507762536","userName":"Firecat82","userUrl":"https://itunes.apple.com/us/reviews/id162762520","version":"1.14.1","score":1,"title":"Round,round,round,round it goes.","text":"I NEVER leave reviews but this app is so frustrating I just had too. Every time we open it to turn on or off the lights plugged into the devices it just stares at us with that annoying circle going round and round and round and round.....  Restart app, start all over. It's not like our phones or internet equipment is old. iPhones 6s & 7. Latest Uverse gateway and fast internet. Please fix or it's all going back to the store.","updated":"2016-12-23T19:06:12-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"713305936","userName":"liuping","userUrl":"https://itunes.apple.com/us/reviews/id42072789","version":"1.1.0","score":2,"title":"not done yet","text":"It's missing tons of feature, including basic ones like being able to edit the favorites (right now every device is automatically added to favorites and cannot be deleted.\n\nThere is also no way to set triggers, so while you can set up a scene, you cannot tie it to any controller other than this app.","updated":"2012-12-21T22:30:21-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1228427015","userName":"CoyoteMo","userUrl":"https://itunes.apple.com/us/reviews/id15613568","version":"1.10.0","score":5,"title":"Coyote","text":"This is a good app & easy to set up and use. I turn lights on, off, dim no matter where I am. It has always been dependable. I am little by little adding more to my network & the Insteon app makes it easy. Thanks.","updated":"2015-07-16T18:30:48-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1285355139","userName":"Chrispaco","userUrl":"https://itunes.apple.com/us/reviews/id11518745","version":"1.11.0","score":3,"title":"So much potential","text":"When you think of what could be done with insteon devices and a good hub / application you can't help but to see all the missed opportunities.  I would not recommend insteon devices to anyone if they are starting from scratch - I have an existing investment so I am stuck for now.  App is a huge disappointment.","updated":"2015-11-11T18:37:33-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1220787218","userName":"mattdot","userUrl":"https://itunes.apple.com/us/reviews/id15269076","version":"1.9.32","score":3,"title":"Slow and clumsy interface","text":"I generally like my insteon system, but this app needs professional help.  The UX is not that helpful, and hamburger menus for everything make it hard to navigate.  If I could only ask for one thing, it would be to add a cancel/skip button when programming cant find a device.","updated":"2015-07-01T15:42:09-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1110214039","userName":"Tilo G","userUrl":"https://itunes.apple.com/us/reviews/id122016979","version":"1.9.6","score":1,"title":"Hub 2 installation failure","text":"Hub 2 could not be installed using the app. I spent hours trying myself and 70 min with tech support. The app kept losing connection to the hub during the verification step of the automatic firmware update. Waiting for a replacement hub and will report hopefully soon whether this was a problem with the specific device I was shipped or is a systemic issue. I was told bugs like this are to be expected with new products. What a business philosophy....","updated":"2014-12-08T18:38:06-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"751895966","userName":"Dave Gwyn","userUrl":"https://itunes.apple.com/us/reviews/id41875753","version":"1.2.0","score":1,"title":"Worst piece of crap ever","text":"This device and software seem to be the product of a high-school computer class. You have to watch a video every time you add a device. There is no direct access to device settings at the detailed level. For example, I just added a camera. It was a wansview brand, not Smarthome's rebranded version. The software found the device and I'm able to view. However it couldn't identify the model so I can't pan and tilt.","updated":"2013-02-15T12:28:35-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1366061302","userName":"druluv","userUrl":"https://itunes.apple.com/us/reviews/id25594211","version":"1.13.0","score":5,"title":"Great app. Never fails.","text":"I’m going 5 stars on this. I’ve been using it for almost a year and have never had any problems. It seems like it could get some updates but I’m very happy with it regardless.","updated":"2016-04-20T02:21:07-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1303605583","userName":"Dbacker","userUrl":"https://itunes.apple.com/us/reviews/id37738129","version":"1.11.0","score":1,"title":"Poorly designed, buggy.","text":"I started using this app 2 months ago and found it to be very user-UNFRIENDLY and difficult to set up.  After not using for several weeks, I tried using it only to find it’s forgotten my email address and password.  If I indicate I’ve “Forgot” my password and then enter my email address in order to re-set it, I get the response: “Account Doesn’t Exist”!  Now I seem to be faced with setting up a new account.  What a PITB!","updated":"2015-12-20T14:19:30-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1070746691","userName":"Rick4ls","userUrl":"https://itunes.apple.com/us/reviews/id20116929","version":"1.8.0","score":1,"title":"limited X10 support","text":"This app will not allow you to schedule more than one x10 device to turn on or off at sunrise/sunset.\n\nThe problem is that the combination of the app and the Hub only allows one device to be schedule for a specific time.  Sunrise/sunset counts as one time!  The work around is to us a “scene”, but the software does not support X10 devices in scenes, only Insteon devices.\n\nThis is less functionality than the older Smartlinc device and app.","updated":"2014-09-26T15:18:26-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1203318755","userName":"Sorry4Me","userUrl":"https://itunes.apple.com/us/reviews/id161149186","version":"1.9.32","score":3,"title":"Desperately needs encryption!","text":"The developer refuses to encrypt communication over the Internet.  Data is wide open to those that know how to 'sniff' it.  You logins and passwords are unprotected without common protocols like SSL (https:) and others.  \n\nMake sure you at least change your default passwords, and careful what you automate - who knows who might be watching...","updated":"2015-05-27T05:14:57-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1452133010","userName":"technojerry","userUrl":"https://itunes.apple.com/us/reviews/id27309945","version":"1.13.2","score":4,"title":"Reliable App","text":"I have no problem logging in locally or remotely into my hub to control my 20+ switches. I wish that app had more scheduling options, but it does work well for checking the status and turning things on and off.","updated":"2016-09-18T20:38:10-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"884856715","userName":"ekrub","userUrl":"https://itunes.apple.com/us/reviews/id16748051","version":"1.5.1","score":3,"title":"Room for improvement","text":"Better than nothing; however, could easily be improved.  For example: avoid starting with login screen every time and allow thermostat high/low levels to be controlled independently without having to switch between modes.","updated":"2013-10-19T08:58:12-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1171874783","userName":"Nyitalbear","userUrl":"https://itunes.apple.com/us/reviews/id100176702","version":"1.9.22","score":1,"title":"X10 still supported but takes extra step","text":"I don't like the update from March 20, x10 modules still supported but require you to first push the + sign below the on off, then press the on off that appears after you push the plus sign.\nThe old app was better, for those of us that have x10 products and bought insteon for that reason.\nI guess we have to remember that this is an insteon product and not x10.","updated":"2015-03-22T11:14:10-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1229313283","userName":"timmcgraw04","userUrl":"https://itunes.apple.com/us/reviews/id224396300","version":"1.10.0","score":1,"title":"OMGosh!!!  Apple Watch Issues","text":"I'm extremely disappointed. It's like they are completely ignoring that there are integration issues with the Apple Watch. I would be more than happy to loan my 17-year-old son who writes iOS apps to help you fix this problem. How hard can it be?\n\nI have more than 30 Insteon devices in my house that are rendered useless to me without this integration working properly. Please fix this.","updated":"2015-07-18T09:31:45-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1078909388","userName":"digphil","userUrl":"https://itunes.apple.com/us/reviews/id39589418","version":"1.9.0","score":2,"title":"Scenes don’t work","text":"I added devices simple enough and can control them manually. But I try to add a scene to turn on/off a device (a wired light switch) at a certain time, go through all the steps and save it, but then the scene doesn’t appear under scenes. Plus, the portrait and landscapes modes are a mess. Half the time the dialogs appear up side down. Very rough app.","updated":"2014-10-11T17:03:24-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1228754619","userName":"hln98","userUrl":"https://itunes.apple.com/us/reviews/id34737090","version":"1.10.0","score":5,"title":"Nice update","text":"The app is now a pleasure to use. Setting up devices are perfect now. \n\nSchedule scenes are working flawlessly now.  Thank you.  \n\nIf they can fix their other Insteon+ app for homekit is another story.","updated":"2015-07-17T08:54:19-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1103278404","userName":"Nash0001","userUrl":"https://itunes.apple.com/us/reviews/id87260200","version":"1.9.6","score":5,"title":"Cool app","text":"I find this app useful for our home monitoring. Very reliable. We don't have to even pay any monthly fee for this reliable system. I hope they support iPhone home kit soon.","updated":"2014-11-25T20:32:07-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1148648975","userName":"@@$);","userUrl":"https://itunes.apple.com/us/reviews/id101237654","version":"1.9.13","score":2,"title":"Far from perfect","text":"Problematic at best. Works ok with WiFi connection but doesn't work at all over cell phone signal. Hub only works with gadgets that are a few feet away. Anything past 25 feet and the hub doesn't read anything. Insteon has a great idea but I think they need to wait a year or two so they can catch up with current technology.","updated":"2015-02-14T13:55:51-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"837946405","userName":"Taeron","userUrl":"https://itunes.apple.com/us/reviews/id48801581","version":"1.4.0","score":2,"title":"Still needs work","text":"Not thrilled with this version... I was running the beta version (1.3.11) as a tester and am stilling running the beta! V1.4 is slow and keeps popping up with connecting to hub error messages.  Overall I love the hub and having everything all in one place- able to control my house from anywhere ... Even in bed!","updated":"2013-07-16T22:37:26-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1080071809","userName":"Mjwillson23","userUrl":"https://itunes.apple.com/us/reviews/id127940396","version":"1.9.0","score":2,"title":"Needs iPad landscape mode","text":"In general the app works well enough but I desperately want it to have landscape capability at the very least on the iPad.  Like I have seen others mention I too have an iPad wall mounted for home control and this app's lack of landscape capability makes it difficult to use in comparison to every other home auto app I use.","updated":"2014-10-13T19:50:38-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"728913034","userName":"Micr0driguez","userUrl":"https://itunes.apple.com/us/reviews/id17401976","version":"1.1.0","score":4,"title":"Pretty Solid","text":"The only gripe I have is that you it doesn't have auto log in.  It would be nice to have the option to do auto log-ins for those who want it.  Personally I hate entering my email and password each time.","updated":"2013-01-13T19:34:28-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1480046499","userName":"NuggetsRule","userUrl":"https://itunes.apple.com/us/reviews/id19946714","version":"1.13.2","score":5,"title":"This App Works Well - What am I missing?","text":"I was braced for a terrible app experience based on the previous reviews… But I plugged everything together and it worked perfectly.","updated":"2016-11-06T19:43:38-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1172493519","userName":"daslled","userUrl":"https://itunes.apple.com/us/reviews/id14858606","version":"1.9.22","score":3,"title":"Completely broken","text":"I wish I'd read the reviews of the latest release and stopped the update.  Ugh!!!!  None of my X10 devices are controllable from the app now.\n\nUpdate 3/23:\nOk, I read the review that explained the trick to use the X10 controls. They all work now. I raised my rating from one to three stars.","updated":"2015-03-23T20:32:26-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1081213827","userName":"Worthless app 151","userUrl":"https://itunes.apple.com/us/reviews/id355548653","version":"1.9.1","score":1,"title":"Lost control","text":"After the update to \"quash iOS8 bugs\" it no longer controls any of  the controllers. It shows them as all on, even if they are off. Attempts to switch them off and on shows activity then still on even though they are off. Also one controller was on prior to the update and remains on, but not controllable. This is on an IPAD mini. Resets and reboots did not fix the problem for me.","updated":"2014-10-16T05:38:59-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1542971438","userName":"BFI66","userUrl":"https://itunes.apple.com/us/reviews/id164648207","version":"1.15.0","score":2,"title":"New Update Problems","text":"I have a 3 car garage using 3 IO Lincs.  prior to update all 3 worked flawlessly.  With update when I use the app to open a door.....all 3 open at the same time and inaddition turn on some of my in home lights to include my home theater projector......a definite problem Insteon needs to fix or roll back prior software version.","updated":"2017-02-12T06:22:26-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1503696364","userName":"Johazeleyes","userUrl":"https://itunes.apple.com/us/reviews/id49463462","version":"1.14.1","score":5,"title":"Easy set-up..works great!","text":"I purchased the entire home security package and the installation was easy and quick. Now I'm connecting everything with Alexa. Great product.","updated":"2016-12-17T10:18:34-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1105585766","userName":"Gr8scooter10","userUrl":"https://itunes.apple.com/us/reviews/id103750101","version":"1.9.6","score":5,"title":"The entire Insteon product line has a solution for all my needs!","text":"This app allows for control of my entire smartphone, including all of my Insteon devices.","updated":"2014-11-29T21:10:58-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1274516842","userName":"jayemko","userUrl":"https://itunes.apple.com/us/reviews/id85726370","version":"1.10.1","score":1,"title":"App signs out if Watch is used","text":"If control is initiated from the watch, nothing is actually controlled and session is logged out from the phone app. Watch says I turned a light on but nothing was turned on. Open phone app, have to re sign in. What crap. Between this and the Hub scam (release new hubs for Each new technology instead of supporting existing Hub), I will not be using Insteon devices again.","updated":"2015-10-20T06:40:49-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1174443456","userName":"Gpeckman","userUrl":"https://itunes.apple.com/us/reviews/id29696354","version":"1.9.24","score":4,"title":"March 24th update working like a charm","text":"Insteon team responded quickly to a release that change X10 functions.  They answered phone calls addressed the complaint of many users and corrected the issue.  Very pleased with their support and this app.","updated":"2015-03-28T07:00:17-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1182717084","userName":"lmco_eng","userUrl":"https://itunes.apple.com/us/reviews/id42711323","version":"1.9.29","score":4,"title":"Push is Good!","text":"Finally, no more email notifications unless I specifically want them. Nice!  I'd give 5 stars if I could change the notification settings for all devices (I have 35) that I monitor at the same time.","updated":"2015-04-14T10:02:46-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"881366962","userName":"aglazier","userUrl":"https://itunes.apple.com/us/reviews/id32831882","version":"1.5.1","score":4,"title":"Why not use iOS notifications?","text":"The app works great, very easy setup! Now we just need more specific items added for control and a switch from the SMS/email to real iOS notifications!","updated":"2013-10-10T15:34:37-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1391572841","userName":"Scarecrow724","userUrl":"https://itunes.apple.com/us/reviews/id125914753","version":"1.13.1","score":4,"title":"Home Automation","text":"I've been using Insteon for 10 plus years now (X10 convert) and have enjoyed the ability to do anything from the convenience of my easy chair or while away from home.","updated":"2016-06-09T07:52:08-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1175150713","userName":"RKyler","userUrl":"https://itunes.apple.com/us/reviews/id12972393","version":"1.9.24","score":5,"title":"Thanks for supporting x-10","text":"Thanks for fixing the x-10 bug and not dropping x-10 support.  I wish the new hubs would support x-10 also. I guess I need to start updating my legacy switches and plugs to insteon.","updated":"2015-03-29T16:47:07-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"991538147","userName":"DiabloDan2001","userUrl":"https://itunes.apple.com/us/reviews/id138844709","version":"1.7.5","score":5,"title":"Does everything I expected it to.","text":"I love the clean modern look. Doesn't appear to be too complex, but let's me do all the basic stuff one would expect it too!","updated":"2014-05-11T20:44:18-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1228480565","userName":"Eduardo Ventura","userUrl":"https://itunes.apple.com/us/reviews/id120182824","version":"1.10.0","score":5,"title":"What a change!!!","text":"Congratulations on the new app. \n\nChanges and bug fixes were an amazing change on my day to day use. \n\nKeep the good job!","updated":"2015-07-16T21:03:12-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1201317122","userName":"Justwanttoshop","userUrl":"https://itunes.apple.com/us/reviews/id105454215","version":"1.9.32","score":2,"title":"Only works once in awhile","text":"I use this specifically to adjust the thermostat. Unfortunately it only works a third of the time. Most days all the connections are made in the log in screen but once I try to access my thermostat it doesn't find the reading. Very frustrating.","updated":"2015-05-22T22:48:25-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1112232872","userName":"JPehkonen1","userUrl":"https://itunes.apple.com/us/reviews/id8311658","version":"1.9.7","score":5,"title":"GREAT Product / App","text":"This is a great product. Very durable and robust. The software is flexible and the operation has been flawless in the year I have had it.\n\nUpdates are great, and it works with the iPad and the iPhone.","updated":"2014-12-12T16:52:05-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1079864355","userName":"rstaten63","userUrl":"https://itunes.apple.com/us/reviews/id5644150","version":"1.9.0","score":1,"title":"Major app issues","text":"This app has many issues that need to be resolved. Clearly people are frustrated with the build based on the postings. Insteon sells a physical product that relies on this app to work. Scheduling is one area that does not work. The schedule does not work appropriately when you use Sunset or Sunrise. \n\nDevelopers- please address our concerns as paying customers of your product!","updated":"2014-10-13T09:20:49-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"739136699","userName":"MICP777","userUrl":"https://itunes.apple.com/us/reviews/id104138593","version":"1.2.0","score":4,"title":"WOW...huge update","text":"Now we're talking!  Been waiting for the fixes from the initial release and it's been worth it.  Works great with my home set up and I like the easy way I can add devices. Keep the updates coming!!","updated":"2013-01-28T21:37:23-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1462845105","userName":"imlanman","userUrl":"https://itunes.apple.com/us/reviews/id16457484","version":"1.13.2","score":1,"title":"Welcome to 1996!","text":"The app, hub and switches are OH SO BAD!  Literally the x10 technology of 20 years ago was 5x better than this junk!  This app is ridiculous, as is Insteon \"technology.\"  Insteon is great in theory, but falls short across the board.  Insteon is riddled with firmware and reliability issues, and this app is no better.\n\nEven with the hub discounted down to $35, it is still not worth the price, as it requires this worthless app to control it.\n\nPathetic, simply pathetic...","updated":"2016-10-07T15:26:01-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1208723281","userName":"hcet","userUrl":"https://itunes.apple.com/us/reviews/id22301103","version":"1.9.32","score":3,"title":"Apple watch interface useless","text":"The app is ok, but the apple watch interface in useless. Almost every time one tries to use the apple watch app the iPhone app logs you out! Then you have to start the iPhone app and login, making the watch app useless. Please fix","updated":"2015-06-07T13:50:07-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1182408760","userName":"Jonecool","userUrl":"https://itunes.apple.com/us/reviews/id4497629","version":"1.9.29","score":5,"title":"Love the new push notification","text":"The new push notification is a great improvement!  App has been working fine, happy camper :-)","updated":"2015-04-13T17:19:14-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1020366958","userName":"Trinityacres","userUrl":"https://itunes.apple.com/us/reviews/id19223129","version":"1.8.0","score":5,"title":"Very easy to use.  Wow!","text":"I installed the devices and hub, was up and programmed in minutes on first device!  Very easy to do scene setups. Nice.  I want to buy more parts now to automate other things.","updated":"2014-07-01T08:58:43-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1172900276","userName":"Ramster Kewl","userUrl":"https://itunes.apple.com/us/reviews/id160477507","version":"1.9.24","score":5,"title":"Awesome.. Love it","text":"Can control my dimmer switches from anywhere. Turned on off from office to home for testing. Cool product..\nHope they get garage door openers too..then it becomes complete for me..","updated":"2015-03-24T18:40:14-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1203883808","userName":"EngineerDeb","userUrl":"https://itunes.apple.com/us/reviews/id103883741","version":"1.9.32","score":2,"title":"Update logout issues","text":"With the latest update, my apple watch now works, however the app on my phone now keeps asking me to login so now my watch and phone are both useless unless I log in to my phone app every time I want to use the app from either my watch or phone.","updated":"2015-05-28T10:05:16-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1095622184","userName":"Aviation2","userUrl":"https://itunes.apple.com/us/reviews/id112007031","version":"1.9.4","score":2,"title":"Camera not working","text":"The Camera's before the update use to come through as video.  With the latest update the format has changed to MJPEG and for some reason the camera will not initiate with this format.  Can see the camera throughthe online access but not the Insteon Phone APP","updated":"2014-11-11T19:13:55-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1549939421","userName":"TC4791","userUrl":"https://itunes.apple.com/us/reviews/id351856454","version":"1.15.1","score":5,"title":"Latest version 1.15.1 works as expected","text":"Latest version has critical bugs fixed.","updated":"2017-02-22T02:46:59-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1495995700","userName":"Mickarma","userUrl":"https://itunes.apple.com/us/reviews/id42613714","version":"1.14.0","score":5,"title":"First time","text":"Unbelievably easy to set up.\nFollowed the instructions step by step. Worked first time.\nI have tried Wink, Z-Wave, and X10.\nThis was a Million times easier.\nAn easy five Stars🌟🌟🌟🌟🌟","updated":"2016-12-04T09:22:26-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1229443348","userName":"Thing person","userUrl":"https://itunes.apple.com/us/reviews/id49391350","version":"1.10.0","score":5,"title":"Great","text":"Latest version of app huge improvement. Login issues fixed for me.  Apple watch app works well.  Great update.","updated":"2015-07-18T16:26:37-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1200948756","userName":"raymondwild","userUrl":"https://itunes.apple.com/us/reviews/id29357894","version":"1.9.32","score":3,"title":"Still could use improvements","text":"1) The app would look a lot better on my iPhone 6 if the app supported 6/6+ screen sizes, and I believe since you have an Apple Watch app, you should be able to do that\n2) I'd enjoy Insteon if there was a Pebble Smartwatch app","updated":"2015-05-22T04:11:10-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1110529930","userName":"N0 L1FE SWAG","userUrl":"https://itunes.apple.com/us/reviews/id386148166","version":"1.9.7","score":2,"title":"Needs improvement","text":"Honestly your products are really good but your app never actually lets me connect to my hub from anywhere unless I'm at my house on the wifi! You'd think this is made for when you're not home, but you can't even use it unless you are!","updated":"2014-12-09T08:50:08-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1172512393","userName":"Baseman 76","userUrl":"https://itunes.apple.com/us/reviews/id429723861","version":"1.9.22","score":4,"title":"Me","text":"Upgraded to 1.9.22. Nice app, almost fun to use but what happened to the \"on level\" local property? And somewhat frustrating to use the dimmer slider since the slide gesture also causes the screen to slide to the main menu.","updated":"2015-03-23T21:41:23-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1124256074","userName":"zrdean","userUrl":"https://itunes.apple.com/us/reviews/id42846961","version":"1.9.7","score":5,"title":"Great app; great product!","text":"Just bought the hub, two outlets, and a thermostat today. I absolutely love it! I'm controlling from three iPhones, an iPad, and a Windows 8 machine. All of them work seamlessly! Great job!","updated":"2015-01-03T18:35:16-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1545671269","userName":"jrogersmn","userUrl":"https://itunes.apple.com/us/reviews/id36328888","version":"1.15.1","score":5,"title":"Addicted to Insteon","text":"Love being able to control the lights, open the garage, monitor doors and motion, etc. Looking forward to future enhancements (and more icons 😊)","updated":"2017-02-16T04:48:58-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1391261197","userName":"MedUser09","userUrl":"https://itunes.apple.com/us/reviews/id7604528","version":"1.13.1","score":1,"title":"Cannot schedule devices","text":"I bought a bunch of insteon devices so I could schedule my lights on and off. Literally have never been able to schedule them. The app won't save when I set a time by device. I create scenes and the let me save the time but never work. I'm ready to jump to another device manufacturer, this is a deal breaker.","updated":"2016-06-08T19:25:34-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"722686422","userName":"Mr P1P","userUrl":"https://itunes.apple.com/us/reviews/id42802565","version":"1.1.0","score":1,"title":"Low quality","text":"The app could be a lot better. It crashes, needs to be started frequently, setup was a struggle, layout a basic/beta with no customization options like other home automation SW. On top of all this, the system is very slow to update especially to dimming features. I wish they would invest more in developing this app.","updated":"2013-01-04T11:11:10-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1307229352","userName":"Sylvain Kalache_","userUrl":"https://itunes.apple.com/us/reviews/id114574792","version":"1.11.0","score":1,"title":"annoying","text":"I've been Insteon customers for years, their products are not changing: unreliable, not working as documented.\n\nThis app randomly lose connection with the Insteon Hub or simply can't connect (while the beta web version on the same wifi network works perfectly).\n\nI need to unplug the Insteon hub so that it can connect.","updated":"2015-12-27T16:21:48-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"895300166","userName":"mike roanoke","userUrl":"https://itunes.apple.com/us/reviews/id24374469","version":"1.5.1","score":2,"title":"Frustrated","text":"Tough for a Mac user who is accustomed to user friendly fully functional operation to accept the fact that this app does not allow connection and login. I can not get past the “can’t find hub” screen even though I have used Smartlink for the past year.","updated":"2013-11-13T18:16:20-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1083916494","userName":"tybird Indiana","userUrl":"https://itunes.apple.com/us/reviews/id109750852","version":"1.9.1","score":5,"title":"Really like the app.","text":"I been using X10 for years. So far with insteon been great. Customer service been great. So easy to set it up over wifi.","updated":"2014-10-21T06:09:38-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1455157616","userName":"BFasterling","userUrl":"https://itunes.apple.com/us/reviews/id106968957","version":"1.13.2","score":1,"title":"Unusable with Apple Watch","text":"App appears to be logged in, correctly showing devices, favorites and scenes. However, when trying to turn on/off a device, no commands are sent. When I open the app on my iPhone, I discover that I'm logged out. I've removed this from my Apple Watch until the integration is fixed.","updated":"2016-09-24T08:53:59-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1533938186","userName":"BadGTO","userUrl":"https://itunes.apple.com/us/reviews/id210707802","version":"1.15.0","score":1,"title":"Issue on latest update!","text":"After latest update I've had issues with my garage door open/close. Every time I open or close my garage door it turns on various lights in my house and turns on my AC. Came home to a house at 59 degrees and a house lite up in lights. Tried removing and re-adding the io/Linc for the door and issue continues. Beware if you update!!!","updated":"2017-01-30T20:09:52-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1511670884","userName":"Jriveraarguinzoni","userUrl":"https://itunes.apple.com/us/reviews/id139082195","version":"1.14.1","score":1,"title":"App doesn't work!!!","text":"Since the last updates we could not connect remotely. We can only do it when we are in the same network or if our devices are connected to some wi-fi internet connection. We will greatly appreciate your prompt response and arrangement on this. My devices are Apple (iPhone 7, iPad Air 2).","updated":"2016-12-29T17:58:41-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1085259899","userName":"dmp0588","userUrl":"https://itunes.apple.com/us/reviews/id38272068","version":"1.9.1","score":3,"title":"No Screen Rotation","text":"The app provides a straightforward way to program and control Insteon devices. The one issue I've found is the app doesn't support screen rotation. This is a problem on an iPad and results in a 3-star rating from me.","updated":"2014-10-23T19:25:02-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"988393842","userName":"Wooolllfriiik","userUrl":"https://itunes.apple.com/us/reviews/id42799567","version":"1.7.5","score":3,"title":"Some tweaks needed.","text":"I have to admit I like the old version with the tabs better.   The drawer is much more cumbersome.   \n\nAlso, the sliders used to work perfect but now when you try to slide a light switch you can accidentally open the drawer.","updated":"2014-05-05T19:54:17-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"978777057","userName":"knealy","userUrl":"https://itunes.apple.com/us/reviews/id24840332","version":"1.7.1","score":3,"title":"Needs help","text":"Can't turn IR light on or off. Can't put it in scan horizon mode. Both of these functions are available through the IP Camera tool app on the computer.\n\nInterface is badly designed. Really needs an overhaul.","updated":"2014-04-17T23:01:59-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1573439988","userName":"jcsmith78","userUrl":"https://itunes.apple.com/us/reviews/id131396335","version":"1.15.2","score":2,"title":"Ehh","text":"Started using it, but very limited unless you like specific timing. How about instead of sunset and sunrise, add before last light or minutes before sunset. I like the lights on before it is too dark not after you can't see","updated":"2017-03-26T17:42:57-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1553124415","userName":"DGuilianelle","userUrl":"https://itunes.apple.com/us/reviews/id318248771","version":"1.15.1","score":4,"title":"Awesomeness","text":"Love Insteon but since update we can no longer log onto the app and control anything. Including viewing our baby monitor/camera .","updated":"2017-02-26T07:11:30-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1364522738","userName":"Da11ch1","userUrl":"https://itunes.apple.com/us/reviews/id105785520","version":"1.13.0","score":4,"title":"App works and works well","text":"I have used this hardware for years.  This app is great if you are a guy like me who is reading in bed and doesnt want to get up to turn off the lights.  Way awesome in all respects.","updated":"2016-04-16T15:09:18-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1267396656","userName":"Aprilcregg","userUrl":"https://itunes.apple.com/us/reviews/id30037736","version":"1.10.1","score":5,"title":"Love it, once you have it, you can't live without it!","text":"I've had a lot of good luck with this app and use it every day.","updated":"2015-10-05T09:01:57-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1202625851","userName":"Kdemaria","userUrl":"https://itunes.apple.com/us/reviews/id100667558","version":"1.9.32","score":1,"title":"Reset required monthly","text":"I have used this app and the insteon hub for almost two years, and it requires a complete ground up troubleshooting of connecting to the hub about once a month.  It's also slow, the ui requires three times as many clicks as it should, and a total lack of ifttt connectivity. Buy something else instead.","updated":"2015-05-25T14:16:49-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"903080206","userName":"RyanWN","userUrl":"https://itunes.apple.com/us/reviews/id197957994","version":"1.6.0","score":3,"title":"New version","text":"Don't like updated version with changes to thermostat. Keeps disconnecting link with device and I preferred the old version interface with he arrows to change the temperature up and down.","updated":"2013-12-01T05:43:05-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1336162105","userName":"oldsneakers","userUrl":"https://itunes.apple.com/us/reviews/id42906462","version":"1.12.2","score":1,"title":"Junk","text":"So are you guy ever going to fix this awful program. It crashes all the time. It disconnects from the hub regularly. The watch doesn't work because this app doesn't work. I don't know what you were trying to improve with this last version but you just made it all unusable.  Real pro","updated":"2016-02-20T16:30:09-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1088976240","userName":"casahome","userUrl":"https://itunes.apple.com/us/reviews/id13578770","version":"1.9.4","score":5,"title":"Finally...landscape.","text":"Been a long time INSTEON user and they finally allow rotation on the iPad, like most apps. Now I can mount this this right way.  Thanks","updated":"2014-10-30T20:16:58-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1186194143","userName":"Play with knives","userUrl":"https://itunes.apple.com/us/reviews/id136832306","version":"1.9.29","score":5,"title":"App works as advertised","text":"I would love to see more innovation from insteon developers though.  I feel NEST and HUE will surpass insteon because of the R&D dollars they spend on development.","updated":"2015-04-21T13:38:57-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1069142604","userName":"BigBHaller","userUrl":"https://itunes.apple.com/us/reviews/id85361578","version":"1.8.0","score":1,"title":"Broken in IOS8","text":"This isn't necessarily a problem with the app since IOS 8 is new.  However I want to call attention to the fact (at least for my multiple IOS8 devices) the app no longer works in IOS8.  It cannot connect to the hub. My Windows Phone can connect so it isn't a hub issue.  \n\nPlease do update the app as soon as possible.","updated":"2014-09-23T09:37:30-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"968865737","userName":"Kona37","userUrl":"https://itunes.apple.com/us/reviews/id18286062","version":"1.7.1","score":3,"title":"Nice App - needs multi-hub support","text":"App works great.  Need to add multi-hub support so its easier to manage hubs in different locations with out having to have multiple accounts and logging in/out to switch locations. \nAdd multi-hub support for 5 star!","updated":"2014-03-31T07:25:55-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1373083852","userName":"Timtceee","userUrl":"https://itunes.apple.com/us/reviews/id418537408","version":"1.13.0","score":2,"title":"Push motivations an issue","text":"Push notification needs to have a unique sound and not use the default sound so I know the difference between an email coming in and my front door opening.","updated":"2016-05-03T16:34:30-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1493090949","userName":"Type1J","userUrl":"https://itunes.apple.com/us/reviews/id23062561","version":"1.14.0","score":5,"title":"Awesome","text":"This hub and app have been great!\n\nThe 1 star reviewers must not have known what they are doing. I have had no problems at all!","updated":"2016-11-29T15:14:48-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1228612494","userName":"Wonkie eye","userUrl":"https://itunes.apple.com/us/reviews/id43107558","version":"1.9.32","score":3,"title":"Camora","text":"So I wish I could use the 2 way audio function on the Camora.  It works with other apps just not insteon or computer app. Wish their next update would include their selling point...","updated":"2015-07-17T03:13:54-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1327392968","userName":"CaptainG","userUrl":"https://itunes.apple.com/us/reviews/id10893950","version":"1.12.2","score":1,"title":"On levels do not work","text":"On levels do not work, it's either off or 100%. Disappointing. I had high hopes, but the simplest feature doesn't work. I could only imagine if I had a more complex setup with scenes and such.\n\nEdit: timers don't work either. I'm glad I saved the box. Time to return the hub.","updated":"2016-02-03T18:04:58-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1238622961","userName":"MrHops","userUrl":"https://itunes.apple.com/us/reviews/id5481124","version":"1.10.0","score":1,"title":"Really blows","text":"Notifications don't work. App shows that my devices are on when they are actually off. Have to completely close out of the app and reopen it for changes to appear. \"Saving Changes\" to devices never really completes within app. Horrible no good very bad app. Software engineers should be fired","updated":"2015-08-05T17:53:13-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1406758411","userName":"Sainc56","userUrl":"https://itunes.apple.com/us/reviews/id113713225","version":"1.13.1","score":1,"title":"Slow and forgetful","text":"I'm very sick of at least once a day having to re enter my email and password because for some reason it doesn't want to remember it for more than 24 hours. iPhone 6plus verizon\nAlso the app is garbage you guys spent no time on it. It's pathetic  I wouldn't recommend insteon to anyone ever","updated":"2016-07-06T19:37:47-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1103184333","userName":"Myleneh","userUrl":"https://itunes.apple.com/us/reviews/id149066446","version":"1.9.6","score":5,"title":"Awesome.","text":"App works very smoothly, doesn't crash and devices turn on/off and are detected pretty fast.","updated":"2014-11-25T16:11:51-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"725595201","userName":"Oclisamarie","userUrl":"https://itunes.apple.com/us/reviews/id24520565","version":"1.1.0","score":4,"title":"EASY setup (v1.1.0)","text":"Took no time to setup my Hub and link to various devices in my house. Some small bugs - looking forward to the next round of app updates.","updated":"2013-01-08T16:54:31-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1175141244","userName":"Hiredweapon","userUrl":"https://itunes.apple.com/us/reviews/id41665093","version":"1.9.24","score":5,"title":"Works awesome!","text":"I took the plunge and bought a while house full of Insteon devices: wall switches, dimmers, lamp modules. \n\nThe app works ALL the time. \nHow often can you say that about technology? \n\nLately they updated the X10 functionality. It also works great. \nBreathes new life into X10 gear I bought 10 years ago, now works with this system.","updated":"2015-03-29T16:15:55-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1071286149","userName":"Boater400","userUrl":"https://itunes.apple.com/us/reviews/id165444802","version":"1.8.0","score":2,"title":"App crashing when trying to rename a device.","text":"Worked fine until IOS8.  Not going to buy more sensors until they fix this.  Cannot identify the sensor that detected motion.\nAlso should allow landscape mode.","updated":"2014-09-27T12:46:39-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1109661769","userName":"Ow8888","userUrl":"https://itunes.apple.com/us/reviews/id31378966","version":"1.9.6","score":1,"title":"One star","text":"This is really a terrible app. The GUI isn't especially user friendly. Also when the Hub has any kind of problem at all, the app will not load as it needs to be connected to the Hub just to sign in. When it feels like working the Hub itself really is useful but app needs a lot of work,","updated":"2014-12-07T18:15:41-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1368358304","userName":"Jon_8ball","userUrl":"https://itunes.apple.com/us/reviews/id4221102","version":"1.13.0","score":1,"title":"Huge issue!!","text":"I had a break in and had one huge issue please allow me to record manually from my iPhone to my videos there's no way to show the police who it was besides a description that I had seen of the guy and trying to push screenshot at the right moments. Thx","updated":"2016-04-24T17:31:54-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1257056082","userName":"194262male","userUrl":"https://itunes.apple.com/us/reviews/id197813806","version":"1.10.0","score":3,"title":"Unable to contact Hub","text":"No improvement since last update.  Still not able to connect to Hub outside my local network.","updated":"2015-09-13T09:42:01-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1114114187","userName":"mnjmoore1","userUrl":"https://itunes.apple.com/us/reviews/id42928458","version":"1.9.7","score":5,"title":"Good product and app","text":"I use the products to create scenes and it works great. I use the app to control the products and my Nest Thermostat.","updated":"2014-12-16T02:19:37-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1099591450","userName":"howbacha","userUrl":"https://itunes.apple.com/us/reviews/id26388077","version":"1.9.4","score":1,"title":"Unneeded login","text":"Absolutely ridiculous to have to login to an Insteon account  to use this app. Why do I need to login to Insteon account to control my own devices in my own house? I love Insteon products but until I can access them without logging in I will not purchase the new Hub II & this app and I encourage everyone else to do the  same.","updated":"2014-11-19T08:16:04-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"877218848","userName":"SoBayJake","userUrl":"https://itunes.apple.com/us/reviews/id27650559","version":"1.5.0","score":3,"title":"Now has better KeypadLinc support","text":"KeypadLincs (KPLs) are supported more with the latest update. Individual buttons can be responders, controllers, or both. However, still no FanLinc control for fan speed, just fan lights.","updated":"2013-09-30T09:42:33-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1300529770","userName":"MikeP54","userUrl":"https://itunes.apple.com/us/reviews/id21634078","version":"1.11.0","score":4,"title":"Good App","text":"The app did what I expected. The setup got a little confusing and I was in the wrong time zone. Took me a while to find why the scedule wasn't working.","updated":"2015-12-14T07:09:23-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1126130171","userName":"d19sand","userUrl":"https://itunes.apple.com/us/reviews/id23125989","version":"1.9.13","score":4,"title":"Easy enough!","text":"I only use this to control my lights, which it does really well! Once I figured out how to set \"scenes\" the app was intuitive.","updated":"2015-01-07T08:10:52-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1022751249","userName":"JkellyIA","userUrl":"https://itunes.apple.com/us/reviews/id15741482","version":"1.8.0","score":1,"title":"Doesn't connect after update","text":"Updated and now says FAIL when trying to connect to hub. I assumed they would be quick to update, but nothing...... Using an iPhone 5S. I uninstalled and reinstalled but it still doesn't work. Old version still works on my iPad so I will not be updating that.","updated":"2014-07-05T08:17:03-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1355165662","userName":"Jim314159","userUrl":"https://itunes.apple.com/us/reviews/id110175158","version":"1.12.2","score":1,"title":"Needs Work","text":"The app works okay at home on WiFi but connecting in from anywhere else takes a very long time to connect and half the time doesn't work at all.  When it doesn't work it doesn't give any indication why, it just doesn't do anything.","updated":"2016-03-28T19:21:19-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1350479361","userName":"DanaJones-MI","userUrl":"https://itunes.apple.com/us/reviews/id275208624","version":"1.12.2","score":3,"title":"When is geofencing going to be included?","text":"Love Insteon and building my network quickly.  Disappointed in no geofencing capability without significant 3rd party effort.  This is a basic feature of your top competitors.  Please add!!!","updated":"2016-03-19T19:42:50-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1172032209","userName":"Rock Music Lover","userUrl":"https://itunes.apple.com/us/reviews/id31052209","version":"1.9.22","score":5,"title":"LOVE Insteon!","text":"Our whole house is Insteon! \nNo more annoying requests from the wifey to get up and adjust the lights! Money well spent!","updated":"2015-03-22T19:22:31-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1111490730","userName":"nadiamusic","userUrl":"https://itunes.apple.com/us/reviews/id107054710","version":"1.9.7","score":5,"title":"Todd","text":"Thanks for your help and clarity.   You got my insteon up and running after months of frustration.   Thanks.","updated":"2014-12-11T05:55:04-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1595175534","userName":"RJGroves","userUrl":"https://itunes.apple.com/us/reviews/id42300745","version":"1.15.2","score":1,"title":"Does not work with \"Insteon Hub for HomeKit\"","text":"I contacted support via email. I was told to use the HomeKit app instead of their Insteon Hub app. I did download their Insteon+ app, (which is not an iPad app) and it works fine. I don't know why they have this hub app if it will not work with the hub designed for HomeKit. Don't waist time on this app if you bought the \"Insteon Hub for HomeKit\".","updated":"2017-04-22T11:56:55-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1103470298","userName":"Michael Martin","userUrl":"https://itunes.apple.com/us/reviews/id32773137","version":"1.9.6","score":2,"title":"Voice control","text":"After investing so much, we feel like we are being slapped in the face with voice control not being offered on the other more popular platforms.","updated":"2014-11-26T05:23:21-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"903348025","userName":"MoreThanPlanes","userUrl":"https://itunes.apple.com/us/reviews/id8517648","version":"1.6.0","score":5,"title":"Great update","text":"Finally have proper Fanlinc support and the interface is faster loading.","updated":"2013-12-01T19:25:18-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"897956378","userName":"gordonross","userUrl":"https://itunes.apple.com/us/reviews/id36239192","version":"1.5.1","score":3,"title":"Confusing","text":"Very strange and confusing UI. It works, but not without some head scratching. Also, does not use iOS Keychain so it repeatedly asks for login info every launch. Very annoying.","updated":"2013-11-19T19:51:46-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"816966603","userName":"TBSP","userUrl":"https://itunes.apple.com/us/reviews/id16511031","version":"1.4.0","score":2,"title":"Not a great app","text":"the app is not very polished - evern after adding devices via address - it still asks to press the set button.  Adding a scene - app askes to press the set buttons even after the devices have been added.\n\nno way to bulk add devices (i have 75).","updated":"2013-06-07T14:37:20-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1253539780","userName":"Peck68","userUrl":"https://itunes.apple.com/us/reviews/id314875563","version":"1.10.0","score":2,"title":"Do not work on all devices.","text":"iPhone 6+ and iPad 3rd gen garage door operates ok. However, on 6 it did not work. This is on verizon network while the 6+ is on ATT. This app seems to need a lot of work, it is unlike Apple to take on mediocre apps no matter it free.","updated":"2015-09-05T09:32:46-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1289895166","userName":"DannyRokit","userUrl":"https://itunes.apple.com/us/reviews/id173813773","version":"1.11.0","score":5,"title":"Awesom","text":"This things incredible I don't know why so many low ratings","updated":"2015-11-21T18:33:22-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"981769291","userName":"Denildo!!","userUrl":"https://itunes.apple.com/us/reviews/id114003658","version":"1.7.5","score":4,"title":"Navigation bar","text":"Prefer old version with navigation bar","updated":"2014-04-23T11:10:14-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"711696527","userName":"JackrtheRipper","userUrl":"https://itunes.apple.com/us/reviews/id237966415","version":"1.1.0","score":1,"title":"Beta Software, at best","text":"Software is very primitive. Does not have KeypadLinc as a device type, as far as I can tell. Selecting many features gets you a \"Available Soon\" apology box. I'll keep it until I get to thirty days, and then back it goes if it doesn't improve a whole lot. Too bad.","updated":"2012-12-19T10:07:02-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"679318634","userName":"DillonJFontaine","userUrl":"https://itunes.apple.com/us/reviews/id11967032","version":"1.0.0","score":1,"title":"What is \"The Hub\"","text":"The photos of the UI look nice but there seems to be no actual hardware that this app can be used with. Im not sure why you would release an app for something that doesn't yet exist.. I will change my rating once you guys give more details such as where can I get this Hub!!","updated":"2012-10-23T17:52:32-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1494279323","userName":"ScottieD doesn't do reviews.","userUrl":"https://itunes.apple.com/us/reviews/id156854930","version":"1.14.0","score":1,"title":"Worked great until 1.14.0 update","text":"Been an Insteon customer for 9+ years. I've never had any major problems until this newest update, 1.14.0. Now my lights randomly turn themselves off and refuse to stay on, sort of defeats the whole purpose of the technology.","updated":"2016-12-01T17:12:48-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1237155174","userName":"Ketzelle","userUrl":"https://itunes.apple.com/us/reviews/id31368438","version":"1.10.0","score":2,"title":"Poor user interface","text":"Confusing and difficult to use. Really disappointed.","updated":"2015-08-02T18:18:59-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1564671982","userName":"Zmtnbik","userUrl":"https://itunes.apple.com/us/reviews/id253781874","version":"1.15.1","score":1,"title":"Useless","text":"Not sure when the last update occurred, nor should I care, as it just worked.   That was until DST this past Sunday.   Lights never turn off, app never connects to devices.   Once I could dim lights remotely, now I can't even turn them off.","updated":"2017-03-14T21:24:27-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1432444298","userName":"TeddyiMan","userUrl":"https://itunes.apple.com/us/reviews/id87787203","version":"1.13.1","score":1,"title":"Not well thought out","text":"This app could be much much better. Very slow to respond. It's a mystery why after so long in the marketplace the engineers at insteon could not figure out how to make this app and hub much faster to respond.  Still disappointed.","updated":"2016-08-13T16:51:01-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1076781399","userName":"USAF E.........","userUrl":"https://itunes.apple.com/us/reviews/id371201452","version":"1.9.0","score":1,"title":"No Camera View since latest update.","text":"Cameras (indoor and Outside) were working fine.  Now theey cannot even connect.  I can still access through the internet app but not through the Iphone APP.  Please fix this ASAP!  All other modules are working.","updated":"2014-10-07T13:25:44-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"933185716","userName":"Mykytt","userUrl":"https://itunes.apple.com/us/reviews/id49747601","version":"1.6.7","score":5,"title":"Excellent app","text":"Needs some improvement, but it's a nice and easy to use.","updated":"2014-01-29T11:19:11-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1489628593","userName":"Mike’s Mac","userUrl":"https://itunes.apple.com/us/reviews/id365538650","version":"1.14.0","score":1,"title":"Really screwed the pooch on this update","text":"After update can't get half of my stuff to work, can't connect to hub, have no current time and can't set a time and won't adjust to DST. Schedules now have stopped working. Taking to tech support is like talking to a hole in the ground. TOTALLY WORTHLESS","updated":"2016-11-23T07:09:47-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1475903397","userName":"kjerred","userUrl":"https://itunes.apple.com/us/reviews/id150097073","version":"1.13.2","score":5,"title":"Works very well","text":"I have been using Insteon devices and the app for about a year and a half  and have had no problems, I have 72 devices and eleven cameras and they all seem to work reliably. I still had to call customer support to help add some of the cameras but that was with an older version of the app. I added the last 2 cameras using the newest version myself and I'm not very techy. When I refer to adding cameras, I'm including the ability to view them remotely when not at home which requires port forwarding of your router. If you only want to view while home and connected to wifi, the process is simpler, but once installed everything has worked well. I also use the Apple Watch application and that all works well also. You have great control of most of your devices through the watch and can even view the cameras. Amazon's Echo also works with this format.   I don't understand all the negative reviews, if you have any problems, call the free technical support line. They are very accessible and knowledgeable about the devices. Sometimes there are long waits, but they have a great system where they ring you back when it's your turn in line. There is also a Insteon/ Smarthome forum with some brilliant users willing to help figure out most problems if you need additional help. The Insteon hub and app is a great way for anyone with little or no experience with home automation to get started and of the apps available for Insteon that I've looked at, this one does the most and works the best when using the non-Apple HomeKit compatible Insteon hub. The HomeKit compatible Insteon app & Hub are a whole different system and I have had no experience with it, but for now this works great and I'm very happy with it.","updated":"2016-10-30T12:23:27-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1437036245","userName":"Reviewer8711","userUrl":"https://itunes.apple.com/us/reviews/id5647785","version":"1.13.2","score":1,"title":"Latest update fails to login","text":"The latest update has broken the ability to login. \nGet 'unable to establish a connection with your Insteon hub'.\nHave deleted and reloaded app but does not work on any iOS device anymore.","updated":"2016-08-21T18:54:39-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1492077452","userName":"jim15022","userUrl":"https://itunes.apple.com/us/reviews/id134923675","version":"1.14.0","score":1,"title":"Just purchased starter kit. Hub can't connect. Returning it","text":"New out of the box and cannot even connect to it to set it up.   If it is the latest app update that is causing this then it needs to be fixed.  Returning this and going to try a competitors product","updated":"2016-11-27T14:49:37-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"945534919","userName":"J35203","userUrl":"https://itunes.apple.com/us/reviews/id33795797","version":"1.6.7","score":4,"title":"Needs password protection","text":"Works good but needs password protection. Push alert would be good too","updated":"2014-02-17T17:24:14-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1489881753","userName":"Boznoko338","userUrl":"https://itunes.apple.com/us/reviews/id43371502","version":"1.14.0","score":1,"title":"Keeps logging me out","text":"This stupid app keeps logging me out and making me re-enter my password. Insteon's products have been nothing but buggy--I wish I'd gone with one of their competitors instead, but now I'm locked into their awful ecosystem.","updated":"2016-11-23T19:25:27-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1189037987","userName":"Anonymous app lover!!!","userUrl":"https://itunes.apple.com/us/reviews/id356788738","version":"1.9.29","score":5,"title":"Insteon is Amazing!!!","text":"Great app!!! Works great with the products and really helps to keep my house organized!!! Great investment!!!","updated":"2015-04-27T17:39:55-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1071421978","userName":"ManTownRC","userUrl":"https://itunes.apple.com/us/reviews/id237113194","version":"1.8.0","score":2,"title":"Buggy app iOS 8 reboot","text":"Please fix the app so that we can rename devices    .   It crashes every time I try to rename a device, room, or scene.    Long time insteon customer but may have to switch to z wave!","updated":"2014-09-27T19:19:38-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1453221034","userName":"sbarab","userUrl":"https://itunes.apple.com/us/reviews/id34670001","version":"1.13.2","score":2,"title":"Has problems with OS 10","text":"Does not consistently work with OS 10 on the Alexa hub. Old model connects but not Alexa on two phones with iOS 10 but other phones with older os works fine. Please fix.","updated":"2016-09-20T21:54:15-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1208570235","userName":"JC2002jc","userUrl":"https://itunes.apple.com/us/reviews/id38385651","version":"1.9.32","score":1,"title":"Sign on problem","text":"As others have said, the sign on issue is a problem.  The apple watch app is worthless if I have to continually use my phone to log in every time.  Please fix this soon!","updated":"2015-06-07T07:02:40-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"957425206","userName":"lest54","userUrl":"https://itunes.apple.com/us/reviews/id14874520","version":"1.7.0","score":1,"title":"UI affected by iOS 7.1","text":"The bottom menu and AC control is all messed up on iOS 7.1. Haven't checked any other screens. Other than that, great app! I'll update the review as soon as it is fixed - just reviewing to report the problem.","updated":"2014-03-10T17:35:06-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1219371080","userName":"Gtas55","userUrl":"https://itunes.apple.com/us/reviews/id5400745","version":"1.9.29","score":5,"title":"Great tool!!!","text":"Get to have a video monitor on my phone...light switches are really nice too!!!!","updated":"2015-06-28T19:20:44-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"734757264","userName":"Mjmercadante","userUrl":"https://itunes.apple.com/us/reviews/id31588441","version":"1.1.0","score":1,"title":"It's beta","text":"Sadly the features of the app and ihub don't yet support all insteon devices, the supported features are simplistic, and support is matter of fact about the whole thing. I would buy this controller again buy isy 99 instead","updated":"2013-01-22T19:30:53-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"948410310","userName":"X Vault X","userUrl":"https://itunes.apple.com/us/reviews/id35243112","version":"1.6.7","score":2,"title":"iOS does not write the Hub correctly","text":"iOS does not write several commands properly to the Hub.  It is known this app does not work properly.  Doesn’t seem to bother Insteon though.","updated":"2014-02-22T12:45:54-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1125149399","userName":"Ausmos","userUrl":"https://itunes.apple.com/us/reviews/id238248842","version":"1.9.13","score":3,"title":"Meh","text":"It's alright for basic functions, but the lack of advanced features make insteon mostly pointless and overpriced.","updated":"2015-01-05T09:19:20-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1008198265","userName":"Wolfer","userUrl":"https://itunes.apple.com/us/reviews/id28276948","version":"1.7.5","score":4,"title":"Just missing rotate option","text":"Great app. Making it rotate with the IPad would make it 5 star!","updated":"2014-06-10T18:33:58-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1318429553","userName":"Fjvfukseh5883236","userUrl":"https://itunes.apple.com/us/reviews/id474668786","version":"1.11.0","score":2,"title":"Way too Glitchy","text":"Scheduling scenes or devices is way too glitchy. I updated a schedule, saved it, but it will not save! So frustrating!","updated":"2016-01-18T05:48:19-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"746927789","userName":"Tunaman forever","userUrl":"https://itunes.apple.com/us/reviews/id200991085","version":"1.2.0","score":4,"title":"Ok","text":"It works well, what I don't like is the icons and lettering are hard to see. Icons and lettering are white on a light blue background.","updated":"2013-02-08T06:57:09-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"719505000","userName":"openkimono","userUrl":"https://itunes.apple.com/us/reviews/id38401253","version":"1.1.0","score":1,"title":"Buggy","text":"The hub is not ready for prime time. Scenes do not work. Many devices are not yet controllable. Does not support multi function keypads.  App is an improvement over the smart link app, but still doesn't make up for the hub.","updated":"2012-12-30T17:52:58-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1165557938","userName":"Ywest512","userUrl":"https://itunes.apple.com/us/reviews/id39744313","version":"1.9.13","score":5,"title":"Perfect","text":"Love this app and my insteon hub. Works perfectly for simple programs.","updated":"2015-03-08T22:33:27-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1068278824","userName":"JJ Help","userUrl":"https://itunes.apple.com/us/reviews/id141446249","version":"1.8.0","score":2,"title":"IOS 8 Crash","text":"I updated to iOS 8 and now the app crashes when you try to change the \"name\" of a scene or device.  Please fix!","updated":"2014-09-21T17:25:22-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"893149112","userName":"beave408","userUrl":"https://itunes.apple.com/us/reviews/id37007722","version":"1.5.1","score":1,"title":"Headache to set up!","text":"How am I supposed to know the user name and password if I never was asked to provide initially?  This older version of this software was easy to install before.  This has been a horrible experience.","updated":"2013-11-08T20:55:10-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"755414214","userName":"Pass don't buy","userUrl":"https://itunes.apple.com/us/reviews/id13215381","version":"1.2.0","score":3,"title":"Much better","text":"I was about to give up. Update came and waited before re review. Very good please keep update going!!!","updated":"2013-02-20T10:26:56-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1468690976","userName":"DJ’s Apple Account","userUrl":"https://itunes.apple.com/us/reviews/id140535075","version":"1.13.2","score":1,"title":"Crashing and locking up app!!!!!","text":"So I have to reboot my iPhone every time I want to turn on or off the pos insteon controlled light!  Great.   Will be returning to costco for $49. and it started at over a $100.   \n\nFix the app or eat the returns and lost business!!","updated":"2016-10-17T22:29:35-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1182656458","userName":"Anthem!!","userUrl":"https://itunes.apple.com/us/reviews/id25981741","version":"1.9.29","score":1,"title":"Push doesn't work","text":"I updated to the latest version and no where did ask me to allow push notifications. Now, my app does not work!","updated":"2015-04-14T07:13:23-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1078794497","userName":"Archer 911","userUrl":"https://itunes.apple.com/us/reviews/id25122657","version":"1.9.0","score":1,"title":"Rotten Tech","text":"Totally unreliable!\nTotally unacceptable!\nThis system may compromise your home security.\nUpdate:\nThere are no words to describe how rotten this app and system are. I am on vacation and have no control of my system because my hub won't respond.","updated":"2014-10-11T11:16:15-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1489188814","userName":"Jeffjeff1512","userUrl":"https://itunes.apple.com/us/reviews/id30047569","version":"1.10.1","score":1,"title":"Schedule","text":"You still can NOT save a schedule for a device (and have it actually turn a light on and off) in this version on the xxxx-222 insteon hub.   When will this be fixed???","updated":"2016-11-22T13:28:12-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1212989718","userName":"Gbenj","userUrl":"https://itunes.apple.com/us/reviews/id235149848","version":"1.9.32","score":1,"title":"App doesn't remember login information","text":"Doesn't work with apple watch because app keeps logging me out and I need to open it and log in before I can use it on apple watch.","updated":"2015-06-15T19:32:10-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"957999703","userName":"DanJ22","userUrl":"https://itunes.apple.com/us/reviews/id103269763","version":"1.7.0","score":2,"title":"OK app, but lots of bugs","text":"The app is fine for the basic things it does.\n\n\"Schedule at sunset\" option continues to be broken as with previous versions. \n\nAs with all other Insteon software I've used, the user interfaces are a bit clunky and could be better.  Not really up to modern standards. \n\nBut otherwise it gets the job done.","updated":"2014-03-11T19:17:11-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1035481796","userName":"Rtdo","userUrl":"https://itunes.apple.com/us/reviews/id30832630","version":"1.8.0","score":1,"title":"Trouble linking","text":"The hub was easy to install and connect to. Unfortunately it says \"trouble linking\" when trying to connect device.  The same device works fine in HouseLinc.  Clearly buggy.","updated":"2014-07-26T15:28:02-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"787058056","userName":"Nepal nnnn","userUrl":"https://itunes.apple.com/us/reviews/id165344719","version":"1.3.0","score":1,"title":"Crap","text":"At least I could use little of prior ver. This ver does not work for me at all :( \nSpend $120 for hardware that doesn't work, I hope in future they will have upgrade where we can use PC to program this hub","updated":"2013-04-12T22:02:57-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1197986397","userName":"Streamtime","userUrl":"https://itunes.apple.com/us/reviews/id40979776","version":"1.9.29","score":1,"title":"Slow and buggy watch app","text":"The watch app is buggy - every time I launch the watch app it clears out my login and password in the phone app - useless and frustrating.","updated":"2015-05-15T22:53:13-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1337343300","userName":"lemmon","userUrl":"https://itunes.apple.com/us/reviews/id29071749","version":"1.12.2","score":1,"title":"App is a train wreck","text":"While Insteon hardware is surprisingly good, this app is just unbelievably bad. The most simple tasks are just bug riddled or needlessly complicated. They need to stop adding new features and just fix the basics. Very infuriating. Please update!","updated":"2016-02-22T22:36:06-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"906223296","userName":"mbourge","userUrl":"https://itunes.apple.com/us/reviews/id27279121","version":"1.6.0","score":1,"title":"Worse than x10","text":"Bought to replace x10 at least that worked some of the time should have read the reviews before purchasing","updated":"2013-12-08T09:04:14-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"904868372","userName":"MLebahn","userUrl":"https://itunes.apple.com/us/reviews/id185853197","version":"1.6.0","score":1,"title":"Doesn't program wall outlets into scenes anymore","text":"Old version 1.5 worked fine for scene building. Great update, now worthless, I will try to do something with Houselinc and control only from iPad .","updated":"2013-12-05T10:20:45-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1171507805","userName":"Lagrafx","userUrl":"https://itunes.apple.com/us/reviews/id85092474","version":"1.9.22","score":1,"title":"DO NOT UPDATE!!!","text":"Just installed the March 20 update and it is confirmed you will get the yellow status dot applied to and lose all control of any x10 devices.  \n\nThanks a lot Insteon.  X10 was the ONE reason I bought your product.  \n\nFix this!","updated":"2015-03-21T18:56:42-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"956011604","userName":"MayankAg","userUrl":"https://itunes.apple.com/us/reviews/id47693043","version":"1.6.7","score":2,"title":"Slow response & lags","text":"Pretty slow response. Lags. Not built in native IOS Platform. Could be much better.","updated":"2014-03-08T02:53:25-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1493458613","userName":"Daup82","userUrl":"https://itunes.apple.com/us/reviews/id313570254","version":"1.14.0","score":1,"title":"No Longer Accessable","text":"After the latest update, I can no longer log into my account. Hope they fix this soon.","updated":"2016-11-30T06:35:56-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1173058475","userName":"-alan","userUrl":"https://itunes.apple.com/us/reviews/id42763210","version":"1.9.24","score":5,"title":"New version does not work","text":"Works great with X10. I love this app!","updated":"2015-03-25T04:29:16-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"877819172","userName":"Cccccccccccggggggffffff","userUrl":"https://itunes.apple.com/us/reviews/id105782574","version":"1.5.1","score":1,"title":"Still does not allow you to get past login","text":"Keeps asking for id and password over and over again.","updated":"2013-10-01T23:53:11-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1068557345","userName":"S2H_inDaHouse","userUrl":"https://itunes.apple.com/us/reviews/id102746620","version":"1.8.0","score":2,"title":"Unstable with iOS8","text":"Since upgrading my iOS8 I no longer can change name or update SMS number on my devices. Keeps crashing!","updated":"2014-09-22T07:01:39-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1556103222","userName":"Jon29485","userUrl":"https://itunes.apple.com/us/reviews/id453962322","version":"1.15.1","score":1,"title":"Insteon","text":"App was working fine before the most recent update. All my devices were easily oucked up and controllable. Now simce the update, it doesn't see my devices.","updated":"2017-03-02T16:28:36-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1492080266","userName":"Qfjskskvmxmdldpgokf","userUrl":"https://itunes.apple.com/us/reviews/id123722573","version":"1.14.0","score":1,"title":"Latest App Update","text":"Same problem as others, haven't been able to connect to my hub since the latest app update...","updated":"2016-11-27T15:00:19-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1084598192","userName":"BRAD GILMARTIN","userUrl":"https://itunes.apple.com/us/reviews/id164540728","version":"1.9.1","score":3,"title":"Broke schedule","text":"This update broke my ability  to turn on lights at sunset. Please help","updated":"2014-10-22T13:10:58-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1492062309","userName":"mikestreb","userUrl":"https://itunes.apple.com/us/reviews/id28557643","version":"1.14.0","score":1,"title":"Can't login after update","text":"This update broke the app. Can't login to my hub to do anything. Need to fix this ASAP because the hub is nearly worthless without the app.","updated":"2016-11-27T13:52:56-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1110829950","userName":"ShalomLokom","userUrl":"https://itunes.apple.com/us/reviews/id341563584","version":"1.9.7","score":5,"title":"Great value for the money","text":"Good products and good app. Works great.","updated":"2014-12-09T23:18:54-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1077584441","userName":"John Sch54701","userUrl":"https://itunes.apple.com/us/reviews/id358765923","version":"1.9.0","score":1,"title":"Just horrible does not work","text":"The Hubble connect my PC and my Mac but will not work for my iPhone or iPad apps. I cannot believe that Apple would allow such a poorly programmed app in their store.","updated":"2014-10-09T05:23:57-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1172491894","userName":"Sweetpealaura","userUrl":"https://itunes.apple.com/us/reviews/id137463551","version":"1.9.22","score":1,"title":"Fix please!","text":"Did the updated an cont context to the hub. Could before but not now. We can connect on our computer just not our phones!","updated":"2015-03-23T20:26:57-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1511041923","userName":"Technology Poet","userUrl":"https://itunes.apple.com/us/reviews/id181067099","version":"1.14.1","score":1,"title":"Can't even connect the hub. Useless","text":"I tried all the connection options and they failed. Can't even get hub connected to the app. Useless.","updated":"2016-12-28T18:08:45-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1436303090","userName":"Dyags","userUrl":"https://itunes.apple.com/us/reviews/id177132168","version":"1.13.2","score":1,"title":"App won't even open","text":"Used to with well but now it won't login at all on my iPhone 6 after last update.","updated":"2016-08-20T10:51:36-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1370347586","userName":"Adam Boltz","userUrl":"https://itunes.apple.com/us/reviews/id201170990","version":"1.13.0","score":1,"title":"Crash on open","text":"The current version crashes on open; unusable now.","updated":"2016-04-28T15:49:26-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1071942224","userName":"PRGIII","userUrl":"https://itunes.apple.com/us/reviews/id37690027","version":"1.8.0","score":2,"title":"Broken in iOS 8","text":"Can't do much editing of anything.  Just crashes.","updated":"2014-09-28T16:06:48-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1489049719","userName":"Rojen88","userUrl":"https://itunes.apple.com/us/reviews/id142883627","version":"1.14.0","score":1,"title":"My Insteon is useless now!","text":"After this update I can't establish connection to my hub! It seems like I can't get help from anywhere either!","updated":"2016-11-22T06:53:39-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1434102316","userName":"jrapex","userUrl":"https://itunes.apple.com/us/reviews/id35700783","version":"1.13.2","score":1,"title":"POS","text":"The software for the hub/controller is a piece of $#!&  Adding and removing devices and scenes is EXTREMELY cumbersome!  There used to be PC software available that was palatable.  No more.  Ugh!!  I'm literally 3 hours in to trying to remove 3 scenes.","updated":"2016-08-16T16:34:52-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1484169664","userName":"©®","userUrl":"https://itunes.apple.com/us/reviews/id42180475","version":"1.13.2","score":1,"title":"Apple Watch (dis)integration Logs out of app.","text":"Not that insteon cares. I have a house full of this stuff. Great hardware. Horrible apps & app support. If I were to do it again, I'd probably buy another system.","updated":"2016-11-13T21:48:14-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1324132275","userName":"j_d_home","userUrl":"https://itunes.apple.com/us/reviews/id489838134","version":"1.12.2","score":1,"title":"New update crashes my hub daily","text":"Fix it, worked perfect before latest update.","updated":"2016-01-28T20:56:13-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1283346702","userName":"Joe£^%~{","userUrl":"https://itunes.apple.com/us/reviews/id10819250","version":"1.11.0","score":1,"title":"User beware","text":"Suggest reading terms you need to agree to carefully before using this app, especially end of Privacy section.","updated":"2015-11-07T09:54:35-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1026640835","userName":"SBSII","userUrl":"https://itunes.apple.com/us/reviews/id23328994","version":"1.8.0","score":2,"title":"Sketchy","text":"Replacing Cortexa device... Too bad as it was great. I have 9 Venstar stats... Cannot control schedule at 1st blush... Who needs this if it falls apart here! Noticed the app runs Nests - why ?","updated":"2014-07-11T20:44:53-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1362097471","userName":"Scottr55","userUrl":"https://itunes.apple.com/us/reviews/id3923987","version":"1.12.2","score":2,"title":"Push notifications stopped working w iOS 9.3.1","text":"Please address this","updated":"2016-04-11T13:55:57-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1171132249","userName":"J in DC","userUrl":"https://itunes.apple.com/us/reviews/id120189829","version":"1.9.22","score":1,"title":"Lost all support for X10","text":"No where on the update did it say anything about X10. I updated and now no x10 devices work. This needs to be fixed ASAP.","updated":"2015-03-21T03:35:09-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1061822620","userName":"bpb2875e","userUrl":"https://itunes.apple.com/us/reviews/id158853331","version":"1.8.0","score":4,"title":"Another vote for landscape mode","text":"Please add support for iPad landscape mode for a wall mounted iPad.","updated":"2014-09-09T21:17:16-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1078157673","userName":"Dukenukem14846357894","userUrl":"https://itunes.apple.com/us/reviews/id108108458","version":"1.9.0","score":1,"title":"Update killed my video feed","text":"Update killed my camera video fees, rendered my system useless-puzzling why Insteon hasn't fixed this?","updated":"2014-10-10T08:03:23-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1440344139","userName":"fundtimer","userUrl":"https://itunes.apple.com/us/reviews/id200298694","version":"1.13.2","score":1,"title":"Can't Install X10 Device","text":"When trying to install an x10 device, the on level and ramp rate spin continuously. Please fix.","updated":"2016-08-27T17:48:50-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1330511367","userName":"Whatajoke8457","userUrl":"https://itunes.apple.com/us/reviews/id114163266","version":"1.12.2","score":2,"title":"Iwatch interface","text":"Cannot turn scenes off. On works fine.","updated":"2016-02-09T13:57:50-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1261612121","userName":"TomasN","userUrl":"https://itunes.apple.com/us/reviews/id42113613","version":"1.10.1","score":1,"title":"Won't connect","text":"After the latest update can't connect to the hub anymore.","updated":"2015-09-23T03:29:59-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1171441601","userName":"CSTProf","userUrl":"https://itunes.apple.com/us/reviews/id16251030","version":"1.9.22","score":1,"title":"Mini-controllers don't function","text":"They add to app but are not controllable.  Please fix time issue (texts show wrong time zone) with hub also please","updated":"2015-03-21T16:10:37-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1164893095","userName":"Good Computer Guy","userUrl":"https://itunes.apple.com/us/reviews/id104625596","version":"1.9.13","score":1,"title":"Can't create account","text":"I've tried over and over and Insteon won't create my account so I can't use the app to see my cameras. Useless.","updated":"2015-03-07T13:58:51-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1528553588","userName":"mhlester","userUrl":"https://itunes.apple.com/us/reviews/id37803034","version":"1.14.1","score":1,"title":"No Longer Runs","text":"Crashes immediately on launch. Don't bother.","updated":"2017-01-22T22:26:46-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1230056181","userName":"mill1099","userUrl":"https://itunes.apple.com/us/reviews/id35907456","version":"1.10.0","score":1,"title":"Still garbage","text":"Seriously, why can't you fix the auth issues? Now, not only does the AW logout and cause reauth, but the iPhone app does too.","updated":"2015-07-19T19:18:41-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1071972760","userName":"ZeroFail","userUrl":"https://itunes.apple.com/us/reviews/id25483137","version":"1.8.0","score":1,"title":"CRASH","text":"App crashes when trying to rename device. Also, no landscape mode.","updated":"2014-09-28T17:38:47-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"901470856","userName":"jakebathman","userUrl":"https://itunes.apple.com/us/reviews/id39894537","version":"1.6.0","score":2,"title":"iPad orientation?!","text":"How many iterations has this app gone through, and it's STILL upside down on iPad??","updated":"2013-11-27T16:02:52-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1376168196","userName":"VanillaShake","userUrl":"https://itunes.apple.com/us/reviews/id24453801","version":"1.13.0","score":1,"title":"Brand new iPad user, crash on open","text":"Crashes immediately","updated":"2016-05-09T17:40:03-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1070298881","userName":"Mchristensen80","userUrl":"https://itunes.apple.com/us/reviews/id28599833","version":"1.8.0","score":1,"title":"Not iOS 8 compatible","text":"Terrible! I wish this company tested and maintained its software as fast as they take my money for their insteon devices.","updated":"2014-09-25T18:10:54-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1215519432","userName":"Owno","userUrl":"https://itunes.apple.com/us/reviews/id39572818","version":"1.9.32","score":1,"title":"You have to login every time open the app!","text":"Stay away from insteon!","updated":"2015-06-21T00:30:24-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1089321265","userName":"Ctazjazz","userUrl":"https://itunes.apple.com/us/reviews/id231728580","version":"1.9.4","score":1,"title":"V1.9.4 Insteon Camera STILL DOES NOT WORK!!!","text":"V1.9.0 Broke the insteon camera -still no picture after v1.9.1. The latest v1.9.4 still DID NOT FIX the Insteon cameras. Please help get the cameras working again!","updated":"2014-10-31T09:19:36-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1174068078","userName":"Rblack335","userUrl":"https://itunes.apple.com/us/reviews/id263185722","version":"1.9.24","score":1,"title":"Can't connect to HUB","text":"After update I have been unable to connect my HUB for out side of my network.","updated":"2015-03-27T11:23:42-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1172338845","userName":"-sascott","userUrl":"https://itunes.apple.com/us/reviews/id14202764","version":"1.9.22","score":1,"title":"Range Extenders","text":"New update also will no longer give status of Insteon range extenders. Gray dot. Reinstall of device did not help.","updated":"2015-03-23T12:13:06-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1066725801","userName":"Fris1234","userUrl":"https://itunes.apple.com/us/reviews/id107803440","version":"1.8.0","score":1,"title":"Crashes when correcting alert info in motion module","text":"Please fix this app!!\nCrashes since ios8 update","updated":"2014-09-19T03:37:32-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"855450367","userName":"bmbuell","userUrl":"https://itunes.apple.com/us/reviews/id42228000","version":"1.4.0","score":2,"title":"X10 control","text":"Cannot add x10 devices to scenes so you can't create an all off command! What the heck!","updated":"2013-08-17T01:48:22-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1021775171","userName":"JR597","userUrl":"https://itunes.apple.com/us/reviews/id34951421","version":"1.8.0","score":1,"title":"Does not work since update","text":"Works intermittently since update. Please fix ASAP","updated":"2014-07-03T18:09:07-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1171969158","userName":"G30qtip","userUrl":"https://itunes.apple.com/us/reviews/id5589357","version":"1.9.22","score":2,"title":"X10  v1.9.22 warning!","text":"If you are a X10 user do not update to version 1.9 .22\n\nThis version will not support X10.","updated":"2015-03-22T15:57:30-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1010334184","userName":"adro01","userUrl":"https://itunes.apple.com/us/reviews/id359248197","version":"1.7.5","score":3,"title":"Good app!","text":"Overall its a good app, could add more features to make it a much better app such as:\n\n- to add more schedule instances per device\n- to arm and disarm sensors by a scene\n- rotate screen (ipad, iphone)\n- more drives for hd cameras","updated":"2014-06-14T13:58:18-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1262790348","userName":"Jwguid","userUrl":"https://itunes.apple.com/us/reviews/id12825177","version":"1.10.1","score":1,"title":"Lost login","text":"App keeps dropping credentials since the last update.  Please fix!!!!","updated":"2015-09-25T18:13:40-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1105314281","userName":"N1CRZ","userUrl":"https://itunes.apple.com/us/reviews/id169453410","version":"1.9.6","score":4,"title":"Great Stuff - BUT !!","text":"I have tons of insteon products, switches, light, lamp and appliance modues etc.   And for the most part they work great.  However I consistantly have problems getting Smarthome / Insteon to recognize users like myself who have multiple locations.  Lets look at the latest example on Insteon for HUB.\n\nInstead of thinking  (location, room, device) hierachy.  You must login all the way to the last location you have selected, go to setting, then house management and then pick your other location, at which time it re-logins to that location.   \n\n(1) Scenario: Now image you have 4 locations like I do.  And the power fails at that location (being the last one you used).   You can't login (cause there is no power at this location),you get a \"FAIL\" message.  Because you can't login.. you can't get to setting to change locations.... You are \"locked out\" of all 4 locations.\n\n(2) These hubs have been around at least a year now and the web app, still won't do thermostats, and will only do the first location you setup the account on.\n\n(3) The older smartlinc's which are all failing one by one...(I have 1 left still working out of 5), would allow you to directly access them through a web interface, but now with the hubs, you don't have direct access to a web server on the device.   The old smartlinc app (similar to this one) also required you to \"login\" to the first one in alphabetical order...but at least that one when it gave you the \"fail\" message would eventually allow you to choose another location.\n\nBlocked out at (1), (2), and (3).   Frustrating","updated":"2014-11-29T09:42:30-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"901438754","userName":"ExbritSD","userUrl":"https://itunes.apple.com/us/reviews/id191728130","version":"1.6.0","score":1,"title":"11/27 update fails to sync with hub","text":"After installing the latest update, the app fails to log on to the hub.","updated":"2013-11-27T14:05:40-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1501100658","userName":"Nick LkWorth","userUrl":"https://itunes.apple.com/us/reviews/id42510905","version":"1.14.1","score":1,"title":"Worthless update, embarrassing fail","text":"Facepalm. Does not work over cellular data.","updated":"2016-12-13T04:29:49-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"718514374","userName":"gfaherty","userUrl":"https://itunes.apple.com/us/reviews/id21390310","version":"1.1.0","score":5,"title":"Excellent","text":"Great product (Insteon Hub), great app!","updated":"2012-12-29T09:11:05-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1300294404","userName":"Paweldryba","userUrl":"https://itunes.apple.com/us/reviews/id119172604","version":"1.11.0","score":1,"title":"The app randomly forgets my user name/ password","text":"The app randomly forgets my user name/ password. Please fix it","updated":"2015-12-13T18:29:10-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1488688426","userName":"huedaman","userUrl":"https://itunes.apple.com/us/reviews/id29816985","version":"1.14.0","score":1,"title":"Worthless","text":"Update the app and it forgets your account.  Unbelievable.","updated":"2016-11-21T16:39:46-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1491883353","userName":"GregJ_Columbus","userUrl":"https://itunes.apple.com/us/reviews/id179599635","version":"1.14.0","score":1,"title":"Horrible update!","text":"Lost my login credentials!?! Poor testing, not happy!","updated":"2016-11-27T05:49:44-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"822966246","userName":"Juan_F-Correa","userUrl":"https://itunes.apple.com/us/reviews/id158349293","version":"1.4.0","score":2,"title":"Insteon HUB and insteon fanlinc","text":"What's the ETA on when the hub is going to fully support the insteon fanlinc","updated":"2013-06-18T21:54:39-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1510752339","userName":"Mwm10","userUrl":"https://itunes.apple.com/us/reviews/id335030366","version":"1.14.1","score":1,"title":"Very buggy","text":"App Dev,\n\nDoes not work over cellular connection.","updated":"2016-12-28T05:51:09-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"818634941","userName":"John Review 1","userUrl":"https://itunes.apple.com/us/reviews/id144121960","version":"1.4.0","score":1,"title":"Typical Insteon!","text":"The app is currently stuck on \"Searching for Hub\" after 2 resets.","updated":"2013-06-10T18:09:44-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1473449080","userName":"Ethel$$","userUrl":"https://itunes.apple.com/us/reviews/id460903587","version":"1.13.2","score":2,"title":"It's a start","text":"I have just begun using this application to schedule security type lighting.   I had been using similar software in the past (X10). Best thing this software provides for me is the capability to monitor and/or change lighting remotely.  However, I am not sure how the system recovers from a power outage.  I suspect that it is able to recover your settings via internet connection to your account but it is not clear how that will affect scheduled lighting (e.g., will the system turn on a light that would have already been on if there was no power outage).\n\nThe software has a limitation that only allows one device or scene to be schedule to go on or off at a particular time.   It does include the capability to schedule for sunset / sunrise but there is no capability to adjust the calculated sunset / sunrise times to have your security lighting appear more natural (keep from having all/many of your lights going on / off at once).  There is capability to create scenes where you can group devices or setup manual on/off times but these times would have to be manually  adjusted coincide with the changing length of day/night hours. \n\nHopefully, this application will get better as times goes on.  I have included a list below of some capabilities I wish it included now or in the future.\n\nBe able to create schedules at the device level (sunset / sunrise), including ability to offset the calculated on/off time to make lighting appear more natural / lived-in.\nRearrange icons on Favorites or Room screens to make it easier to use.  It appears the icons are being arranged in alphabetical order only.\nWould be nice to have separate Edit selections for each type of thing (Favorites, Devices, Scenes).   Currently there is only one Edit selection pointing to one of the types.  You have to select a different type before you can Edit it.  I understand this now but it was confusing when I first started.","updated":"2016-10-26T13:08:26-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"713648923","userName":"White1235","userUrl":"https://itunes.apple.com/us/reviews/id105553231","version":"1.1.0","score":1,"title":"Hub gets a D at best","text":"I've got 6hrs of time invested in there hub and still nothing.","updated":"2012-12-22T09:59:40-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"897433273","userName":"Wrapper 23456","userUrl":"https://itunes.apple.com/us/reviews/id17509531","version":"1.5.1","score":1,"title":"Horrible","text":"Cannot see login keyboard is blocking screen.  \n\nTerrible documentation for port forwarding.  \n\nTerrible user interface.  \n\nNot ready for prime time.  \n\nNot a good start.","updated":"2013-11-18T13:31:52-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"4069916012","userName":"CaptainVideoJW","userUrl":"https://itunes.apple.com/us/reviews/id32999817","version":"1.15.4","score":2,"title":"More Features","text":"Update 09/27/19 Come on guys, y’all haven’t updated the app in over a year! 👎👎\n\nUpdate 6/5/15\n\nHope sales of new hub versions will benefit app improvement. #Invest\n\nTakes 10-15 seconds for app to \"log in\". Way too long and inconvenient. \n\nQuicker now. But ideally would be great to be around one second.\n\nAlso, it'd be great if the app would stay open in the background. It often doesn't. More delays/latency on app login...\n\nMoving dimmer slider erroneously pulls side bar controls open.  \n\n1) Give me more icons to choose from or let me upload custom ones\n\n2) Let me choose to show the full device control screen by default. I use these controls every time. Having to tap the added + step is a drag.\n\n3) Give me test controls in the device adding sequence like SmartLinc...\n\n4) Give the ability to edit device setting while in the 'Edit this' room screen. I can change names and icons but not device settings\n\n5) Ability to reorder devices in rooms & scenes etc\n\n6) Timers - a random feature would be nice for vacation or when away.\n\n7) The timer conflicts are very irritating.\n\n8) Sunset/Sunrise offset options would be awesome.\n\nOr I want sunset scene on and then off 4 hours after sunset. Without complicated workarounds. \nBasic timers can do this.","updated":"2019-04-27T20:28:46-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"993520178","userName":"Boonedawg00","userUrl":"https://itunes.apple.com/us/reviews/id27776448","version":"1.7.5","score":3,"title":"IPad","text":"Please make it rotate for ipad!","updated":"2014-05-15T18:13:55-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1110651072","userName":"Bashar Tobia","userUrl":"https://itunes.apple.com/us/reviews/id371674727","version":"1.9.6","score":5,"title":"Cameras, Dimmers and App","text":"AMAZING. I LOVE THE PRODUCTS.","updated":"2014-12-09T14:47:37-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"902709514","userName":"Critica iTunes","userUrl":"https://itunes.apple.com/us/reviews/id168512582","version":"1.6.0","score":1,"title":"Not working with iPad","text":"!!!!","updated":"2013-11-30T10:29:36-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"4398878165","userName":"Digrazzz","userUrl":"https://itunes.apple.com/us/reviews/id38277289","version":"1.15.4","score":1,"title":"Terrible product","text":"I bought 10 leak sensors and the hub. I followed the instructions to the T. All 3 brand new ordered from Smarthome.com worked with initializing but then when you go into the app they are all yellow and cannot communicate to the hub. This is absolutely garbage. I called tech support Day 1. This is a known issue since 2015 on these things so I’m wondering why I didn’t just listen to my gut and not order them. I figured well I’m tech savvy and I can figure it out but these other fools just didn’t follow the directions. I did everything including resetting the hub with 3 quick button presses and the leak sensors (resetting to default). Nothing works. I am beyond annoyed as the support guy goes it’s too far. My response - I’m 3’ away with not obstruction. Then he said it’s RF noise. Come on! Seriously.  This technology is prime for acquisition so someone can come in and make it work like Google Nest or Amazon as it has potential but clearly lacks product input from customers and engineering development to make the thing work. If I don’t get an answer I’m 24 hours (which I doubt I will) I plan to return $300 worth of this FAULTY equipment and deleting the app permanently.","updated":"2019-07-01T18:20:46-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"4365779568","userName":"Sid Stein","userUrl":"https://itunes.apple.com/us/reviews/id4330573","version":"1.15.4","score":1,"title":"Doesn’t work","text":"I scanned the qr code and it keeps telling me that something went wrong configuring the hub.\nReturning the hub and deleting the app","updated":"2019-06-24T19:01:03-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1657675659","userName":"dlleon","userUrl":"https://itunes.apple.com/us/reviews/id39921577","version":"1.15.3","score":2,"title":"Great software...for 1987","text":"I don't who the sadist is that programmed this thing, but it is one seriously counterintuitive and clunky bit of code. \n\nThings that should take one click take ten. For example, you can't edit devices when you're using them from the \"Device\" menu. (how about an \"edit\" button or \"add to room\" or \"related tasks\" next to all the wasted screen space in the device menu?) \n\nInstead, you have to navigate out of Devices and into Edit Devices, then reselect the device, then edit, save and navigate back to to the \"other\" devices menu. Did they forget this was a GUI? A command line interface is less convoluted.","updated":"2017-06-25T18:24:47-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3464432943","userName":"goorfnd","userUrl":"https://itunes.apple.com/us/reviews/id353180493","version":"1.15.4","score":1,"title":"Don’t buy","text":"Monumental piece of garbage. Unable to scan the QR code, no ability to troubleshoot or enter in manually. Their garbage app has rendered the plugs useless - great work.","updated":"2018-11-26T17:20:11-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"3200994476","userName":"Meisterbrau","userUrl":"https://itunes.apple.com/us/reviews/id4254225","version":"1.15.4","score":5,"title":"Simple easy to use.  Integration with amazon Alexa is built in","text":"This app is really easy to set up and control all my lights and electrical in the home","updated":"2018-09-17T17:00:11-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1784193710","userName":"DesertWinds1952","userUrl":"https://itunes.apple.com/us/reviews/id3852441","version":"1.15.3","score":5,"title":"BEWARE!!!!","text":"Update 9/10/17: I found the issue with the LED's not turning off who is due to bulbs that were not compatible with Insteon Hub. in CNN has the wrong bulbs which are about 30 bucks a pop and I didn't want to go that route so I went to one of the big box hardware stores talk to some of the guys and they suggested trying smart bulb from Phillips which was considerably less expensive and works just fine now dimming etc.. i've expanded my system from to plug in modules to four with an out door module to turn out door lights on and off and a wall switch which right now I'm having trouble getting the app to see it.otherwise it would get five stars. What is that give it five stars. Took me a while since thedocumentation is not real intuitive figured out how scenes and rooms work. FYI using this on an iPhone 6s and an iPad. No software issues.\n\nThis app works absolutely great! No issues at all easy to set up but has one BIG BIG problem... it cannot turn off LED bulbs!!! They dim to almost off but they can't ever turn off completely I confirmed this with a call to their support team. It seems that the modules need to have power all the time in order to connect to your Wi-Fi and the LEDs pick up on that and will power themselves on and cannot be turned completely off as long as that power source is there. Big big disappointment! It says nothing on the box about this issue although Support says it's a known issue.\n\nOne other major problem is that unless you've been living in a hole under ground somewhere with no media contact at all, incandescent bulbs have been outlawed and you will soon no longer be able to buy them or if you can they will be very very expensive!!!","updated":"2017-09-10T16:40:29-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1658862941","userName":"nolan-void","userUrl":"https://itunes.apple.com/us/reviews/id31350685","version":"1.15.3","score":5,"title":"Great and getting better with each update","text":"I love the Amazon echo integration with the hub 2, Apple Watch, and Logitech control. Just set up my sonos to be controlled from my bathroom keypad. What's next?","updated":"2017-06-26T18:12:00-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1289156837","userName":"eaparsons","userUrl":"https://itunes.apple.com/us/reviews/id6300711","version":"1.11.0","score":2,"title":"Fix the login","text":"Can you please add the ability to save the username and password to the Insteon Hub app when initially logging in, I'm constantly having to renter this information every other day.","updated":"2015-11-20T06:43:14-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1605275176","userName":"Dpl76ers","userUrl":"https://itunes.apple.com/us/reviews/id318911949","version":"1.15.3","score":1,"title":"If you want to watch an app load slowly this is for you","text":"If you want to watch an app load slowly this is for you.  I have my Insteon lights switches and garage connected to my Insteon hub.  Beginning to think I went with the wrong company.  Insteon works well with Amazon echo... but turning the lights or closing the garage door with this app, I mind as well wait for the sun to come back up or fly back home to close the garage door. Not my network believe me.  Everything else in my house is blazing fast.","updated":"2017-05-04T18:14:53-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1601375176","userName":"Ryan Oberndorf","userUrl":"https://itunes.apple.com/us/reviews/id28031643","version":"1.15.2","score":1,"title":"Sooooooooo slooooooooooow","text":"This app is terrible. It takes FOREVER to connect to the devices. At least the hardware is good. Everything works great when controlled by an Amazon Echo Dot. It's just the app that's practically unusable.","updated":"2017-04-30T02:47:23-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1573268200","userName":"tbarn","userUrl":"https://itunes.apple.com/us/reviews/id35221366","version":"1.15.2","score":4,"title":"Enable bigger fonts BIGGER FONTS","text":"Upgraded hub to 2245. Surprisingly easy. Had to create new acct, didn't see hub with old login. Also had to rediscover all devices. Would recommend because of very smooth Alexa integration. Once scenes are created, tell Alexa 'discover,' and it works fine thru amazon shopping app mic or dot. Dated insteon app GUI? Gladly won't have to use much once set up. Bigger fonts bigger fonts bigger fonts I've been asking for this for five years!","updated":"2017-03-26T09:12:15-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1526805200","userName":"Absead","userUrl":"https://itunes.apple.com/us/reviews/id481086718","version":"1.14.1","score":3,"title":"Can be infuriating sometimes","text":"Can be super slow sometimes (take 20 seconds to turn on a lamp - boot, app load, etc.). A few weeks ago it suddenly stopped working over cellular (fine if on same Wi-Fi). The worst part? The app has more than a 60 second timeout! What dev thought that made sense. (and no error code just please retry).","updated":"2017-01-20T17:08:06-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1518874464","userName":"TheRealBB","userUrl":"https://itunes.apple.com/us/reviews/id31231944","version":"1.14.1","score":4,"title":"Working well for me","text":"Just starting to set up my system, currently 13 devices are installed including: wired in On/Off switches and dimmers, In-LineLinc dimmer, mini-remote, 6 button keypad, and plug-in dimmer modules.  No problems were encountered in installing, setting up and linking, although I found the setup  instructions lacking for some of the devices.   I used the app to do much of the setup and found it a little tedious to use at first,  but the learning curve was short.  On one occasion while editing a scene I managed to get it to hang (spinning wheels) but moving the app out of memory and restarting cleared it up.\n\nI have not had any problems connecting the app to the hub over AT&T LTE, but I have tried it only a few times.  I have integrated it with Amazon Echo Dots and that is working really well.  I found that while you can't adjust brightness of an Insteon app scene, with the Echo, you can create an equivalent group in the Alexa app that does permit setting brightness of multiple members with one command, albeit they are set sequentially.","updated":"2017-01-09T18:55:40-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1497124445","userName":"gothambeat","userUrl":"https://itunes.apple.com/us/reviews/id32181235","version":"1.14.0","score":3,"title":"Need logout ability","text":"I have two hubs because the old one does not support Logitech Harmony and Amazon Echo and the new one does but doesn't support all my legacy x10 devices.   In order to switch accounts I have to delete the app from my device and reload to login to my other account.\n\nPlease either add multiple house (hub) support or give us a freakin logout option","updated":"2016-12-06T09:14:05-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1490982945","userName":"Jhealy03","userUrl":"https://itunes.apple.com/us/reviews/id201992913","version":"1.14.0","score":1,"title":"You really screwed up the latest update!!!!!!","text":"This version completely screwed up the app. I startup and it's forgotten my login then I get in by pure chance (it wants me to setup a new hub) and it kicks me out. Back to scan the barcode when my house has been fully setup for a couple of years!!!!! Please Fix this ASAP!!!! I can't login so I can't remotely control anything!!!! What's the use in that??? The schedules are still working but I can't remote access anything and can't login including scanning the QR code again which it doesn't recognize!!!!","updated":"2016-11-25T17:46:03-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1452591126","userName":"Wiltonh","userUrl":"https://itunes.apple.com/us/reviews/id198237848","version":"1.13.2","score":3,"title":"IOS10 notifications","text":"IOS10 seems to have broken notifications.  I have 5 Leak sensors 2852-222 connected to a 2245-222 hub.  Worked in IOS9.","updated":"2016-09-19T17:06:50-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1444630513","userName":"gil_83","userUrl":"https://itunes.apple.com/us/reviews/id154818533","version":"1.13.2","score":1,"title":"👎🏽","text":"Could not scan code, could not manually install, and all other methods of setup would not work","updated":"2016-09-04T15:17:27-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1350918722","userName":"Memphistein","userUrl":"https://itunes.apple.com/us/reviews/id38395196","version":"1.12.2","score":4,"title":"Slow to show status but overall good","text":"Could use more features but it works for my setup. It takes a long time for all lights to show their status in app as it checks them one at a time. Amazon Alexa works well, quickly.","updated":"2016-03-20T14:52:44-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1317526901","userName":"tomagain748","userUrl":"https://itunes.apple.com/us/reviews/id13669799","version":"1.11.0","score":1,"title":"Absolute garbage","text":"I don't usually write reviews and especially not bad ones but this is so bad I want to warm people. After about five times taking a shot of the QR code on the hub, it finally recognized the hub. But when you try to add a device it only tries for ten seconds and then times out.  I have tried and tried and tried to add a device but it always times out. At the least you would think it would have a \"keep trying\" option. I have high-latency satellite internet and you can't set anything up in ten seconds if it has to connect through the internet. If it doesn't then why does it time out.  Long story short it looks like I'll have to return my Insteon equipment because the app is too lame to let me connect. It didn't occur to me when I bought the gear that the app was the only way to connect. I thought it would be like my router and also allow a local connection to my computer so I could set it up that way, but apparently not. Garbage","updated":"2016-01-16T13:38:04-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1300760638","userName":"DanGio","userUrl":"https://itunes.apple.com/us/reviews/id13948931","version":"1.11.0","score":1,"title":"Awful","text":"Randomly forgets my username and password, setting a schedule just simply doesn't work and devices show as on when they are off. This app doesn't seem to do anything right.","updated":"2015-12-14T19:30:02-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1264763766","userName":"Sfranjames","userUrl":"https://itunes.apple.com/us/reviews/id39131545","version":"1.10.1","score":2,"title":"Very buggy","text":"The app needs some work.  After adding a dozen devices it starts randomly dropping them when you try to add any more.  The Amazon Echo integration is cool, however.","updated":"2015-09-29T23:05:04-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1228426752","userName":"cxHITMANcx","userUrl":"https://itunes.apple.com/us/reviews/id172996643","version":"1.10.0","score":1,"title":"Barely works with Apple Watch","text":"07-16-15\nDO NOT UPDATE!!!\n\nI updated to the newest version in hopes it would resolve the sign out issue when attempting to use my watch to control my devices. The issue still exists where if the app is not running in the background prior to using my watch the app signs you out and your credentials have to be re-entered to sign back in. At least in the previous version you could click on back and then login which would auto-populate your credentials but now you're just completely signed out. PLEASE FIX THIS. \n\nIf you're not using an Apple Watch the update is a huge improvement on the 6 & 6+ devices. But otherwise I really regret updating to this version\n\n06-14-15\nThe app by itself is very functional and with a few updates could be perfect. Apple Watch integration is very broken and only works if you open the app on your phone prior to interacting with it on the watch.  After the app has been opened EVERYTHING works as expected. But if you quit the app (actually exit and close the app) the watch will still display your devices but will not communicate or send commands. The app \"appears\" to log you out but if you click on \"back\" then click \"already have account\" it will log you in without having to re-enter credentials. Please fix the authentication issue.","updated":"2015-07-16T18:30:10-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1262765239","userName":"jtmoderate876","userUrl":"https://itunes.apple.com/us/reviews/id155027751","version":"1.10.1","score":4,"title":"Like the app, love the Echo integration","text":"Wow, I just learned of an added the Amazon echo integration and am completely thrilled with its operation.","updated":"2015-09-25T16:54:50-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1170869598","userName":"DGKuhn","userUrl":"https://itunes.apple.com/us/reviews/id153994315","version":"1.9.22","score":1,"title":"Trouble","text":"Just installed latest update 3/20/15 and Lost Control of X10 Devices! Insteon devices still controlled! Need a Fix to restore control over X10!","updated":"2015-03-20T14:26:20-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1159907438","userName":"Don Hoeshoe","userUrl":"https://itunes.apple.com/us/reviews/id32255368","version":"1.9.13","score":1,"title":"Very poor","text":"I setup and they text an authorization code to text back to them but when I do it returns \"Invalid code try again\". It's the code they sent. Set up a different email and got the same thing. When I reply to the email authorization it say user not found. Poor poor poor.","updated":"2015-02-27T15:37:49-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1085311523","userName":"DW2014-10","userUrl":"https://itunes.apple.com/us/reviews/id414682063","version":"1.9.1","score":1,"title":"PTZ cameras are still broke","text":"The app worked well until the release on September 30th broke the Insteon 75790 camera video.  I deleted and re-added it, still no video.  Please fix quickly. It is still broke on the October 14th release.","updated":"2014-10-23T21:56:36-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"970244521","userName":"sportsFan80","userUrl":"https://itunes.apple.com/us/reviews/id26748958","version":"1.7.1","score":1,"title":"Worst app ever","text":"This is by far the worst app that I have used. Does not connect , freezes and full of pop up dialogs.someone please rewrite this app.","updated":"2014-04-02T15:17:21-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"},{"id":"1064574388","userName":"OldeJim","userUrl":"https://itunes.apple.com/us/reviews/id27827977","version":"1.8.0","score":4,"title":"Still Another Landscape Mode Request","text":"Yes, I also want landscape mode. \n\nI have 8 switches that I formerly controlled with a 2412n and 1 IP camera.  I love that I can now see all of these in one app. I also love:\nhow easily the devices paired,\nthe user interface, and\nthe single setup for all attached devices\n\nThe cons are:\nNo conditional logic in the hub,\nLack of landscape mode, especially in the iPad app\n\nI am also concerned about its reliability/longevity  as I went through 2 2412s that just quit working.","updated":"2014-09-14T20:17:12-07:00","url":"https://itunes.apple.com/us/review?id=564887346&type=Purple%20Software"}]