[{"id":"3613021037","userName":"The Peab","userUrl":"https://itunes.apple.com/us/reviews/id37900462","version":"3.8.0","score":3,"title":"Important Export Improvements Needed","text":"When exporting data from any device the App should first of all generate the PDF or CSV or spreadsheet data, and then after that allow the user to send that output to email or any other app of their choosing. As it is, the only thing I can do when creating data for export is use the Apple email program directly. \n\nMany of us do not use built-in apple mail and we may want to simply export a PDF and take that into the doctor. Also, I want to be able to examine the export the data, especially if it's a PDF, before I do anything with it.  The point being that, we need to have flexibility when exporting. The iGlucose App handles exporting perfectly. The iHealth App simply needs to follow suit. Thanks so much for seeing to this at your earliest possible convenience.","updated":"2019-01-04T16:47:12-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"7865711997","userName":"Barbarian Reviews","userUrl":"https://itunes.apple.com/us/reviews/id1334012368","version":"3.11.14","score":1,"title":"So you need to know my birthday and where I live to use your product? Nope.","text":"Guys, I bought your blood pressure monitor a couple years back, and really liked how it connected to the app on my phone. So now when I decided to start monitoring my weight for my new fitness routine, you were the first company I thought of to purchase a scale from. But then I download your app, and it says I have to create an account with my email address (red flag #1). Then it says I have to download the new “pro” app, which according to the apple app store collects and stores my data on the cloud (red flag #2). So I go to your website (without downloading the new app) and find where I can create an account online, which prompts me to enter my name, date of birth, location, weight, height… \n\nI “nope” out of that and go back to the original app (which according to the apple App Store you claim does NOT collect my information on the cloud and it now allows me to login to the app, and promptly requests that I enter my height and weight. Which then shows up in my online cloud account… sorry guys, but nope. You don’t need to know this information about me, and I don’t know you. Even if I did trust you not to sell my data to advertisers ( and who has time to read your privacy policy anyway) I certainly don’t trust that you won’t get hacked and my data will be out there anyway.","updated":"2021-10-01T07:32:36-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5281207471","userName":"Sonoma473","userUrl":"https://itunes.apple.com/us/reviews/id87585929","version":"3.10.7","score":1,"title":"WHY wont you FIX this dang app!??","text":"I love the convenience of the bluetooth cuff aside from the times when it wont actually connect to the app which is numerous. You would think after spending over $100 on the bp cuff that these app decs would FIX the friken app so it would actually connect. I have been on these people for four years now to fix their connection issues. Crickets. It is astonishing they simply seem not to care about this junk app which is incredible. They spend millions of dollars on ihealth bp/health hardware yet they dont care that the app is useless which makes all the hardware useless as well. I wish a more competent company would creat a bluetooth bp cuff with an app that actually worked. The only reason these people havent went bankrupt yet is because they have no competition. This is like buying a fancy new car yet you cant drive it because the software won't allow you to actually start the car. Their non chalance & ineptitude is absolutely incredible when you think about it. Wow.","updated":"2019-12-16T15:28:21-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"3592060620","userName":"Luxomni","userUrl":"https://itunes.apple.com/us/reviews/id216051368","version":"3.8.0","score":4,"title":"No hardware problem, Diary could stand improving","text":"I have been using MyVitals with the BPL3 for several years. I got a new phone with the lightning connector and had to get the Ease. I have now added the Core scale and the Wave watch. Absolutely no hardware issues. Everything works\nThe reasons I am withholding the last star is improvements I need for the app. One, it will only allow two blood pressure readings a day. Not acceptable.\nTwo, while the integration of the “diary” to the calories and activity is smooth, it is not user friendly.\nFirst of all, is finding this feature, which by its nature will be the most accessed, is difficult. It is buried deep in the app under settings.\nNext, food entries are exclusively in ounces, while every nutrition guide I have found so far is in grams.\nWhile they include a food list rivals Nutritionix, it will have everything but what you eat. Entry of new items often means deconstructing an item to its basic parts, translating grams to ounces and adding sub parts to the database as well. But there is no was to go back and edit you entry. Also it would be easier to make those entries on a large screen like a PC rather than an iPhone screen, but there is no Windows program or app.","updated":"2018-12-30T07:45:03-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"7277112695","userName":"White8612","userUrl":"https://itunes.apple.com/us/reviews/id114298352","version":"3.11.9","score":3,"title":"Once you weigh you cannot look at your stats","text":"Here is my 2 cents.  Once I weigh myself I’m able to make a note,  great   But, there is no menu bar or way to transition from my current weight that I just measured to my history or to a graph/chart or even just a home button. So once I weigh and make a note, I have to close the app, then I have to  swipe to completely close the app so I can then go back and open the app to the home page and I can check my history or look and the graphs.  It would make sense to have a “save” button that takes you back to your weight history so you would see your trending.  Help.","updated":"2021-04-29T06:09:11-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"3497923418","userName":"Ivan J.E. Crespo Acevedo","userUrl":"https://itunes.apple.com/us/reviews/id550635170","version":"3.8.0","score":5,"title":"App support","text":"I like all the details it brings with all the reading because I have all the gadgets pulse Oximeter, scale and blood pressure. When is the app going to support better the Apple Watch or Apple health environment to include MyFitnessPal? Apart from those question IHealth is an awesome health tracker but it needs the merge of information for those platform. It says coming soon but is been like that for a bunch of months and another one apart from the BMI it should include body measurements it will make it perfect. Apple Watch support and MyFitnessPal. Most other health apps got ahead like Nokia or withings but at least this app has more details","updated":"2018-12-05T16:49:22-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"7501181113","userName":"MacFanMr","userUrl":"https://itunes.apple.com/us/reviews/id37433038","version":"3.11.10","score":3,"title":"So far, some easily fixable annoyances","text":"I got to the third screen of creating an account, then left the app to go generate a password in my password manager. When I returned, it took me back ot the home screen and I had to enter it all again!\n\nI did my first reading, it was a bit high, so I spent a few minutes relaxing, only for it to tell me I already did a reading today, come back tomorrow! It's my device, let me do what I want! Especially when it's new, and requires proper placement, and proper positioning for accurate results, saying you can't do it again, is absurd.","updated":"2021-06-24T08:56:23-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1670257336","userName":"Sentinel587","userUrl":"https://itunes.apple.com/us/reviews/id198541083","version":"3.5.2","score":5,"title":"Great App","text":"So far I have not had any of the problems that anyone else has had with the app or any other iHealth hardware monitoring. I use 1byone Bluetooth scale, iHealth Ease and Sugar Sense. They all interface nicely sharing data between each other seven they're all in one location so that when I see my doctor everything is right there. It wasn't as hard as others made out to start using the blood pressure monitor the instructions were really simple that came with it you just need to download the one functionality which is the iHeath vitals.","updated":"2017-07-05T13:25:51-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6027686084","userName":"60DeviceGuy","userUrl":"https://itunes.apple.com/us/reviews/id415141028","version":"3.11.3","score":5,"title":"app unable to connect pulse oximeter","text":"my oximeter from ihealth arrived today, paid $80 (including tax and shipping) for something i can get for $10, i was confused as i thought it will connect like all other bluetooth devices, but it didnt, you have to open the \"connect devices\" menu and add the device from there, once connected it works nicely, i have become a fan of bluetooth LE, ihealth if you are listening all your devices should use bluetooth LE its awesome.","updated":"2020-06-02T16:49:59-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2162881675","userName":"jsamsen","userUrl":"https://itunes.apple.com/us/reviews/id32641449","version":"3.6.1","score":4,"title":"UPDATE,  Does not work as advertised with pulse oximeter","text":"I want to set the record straight.  I did finally figure out how to get the stored data on the pulse ox to work.  It is not obvious.  After connecting via ere is a small text in the lower left corner in a subdued color that says “filter data”.  Selecting that brings up a screen that allows uploads. \n\nI really like the product and that app is pretty good.  I will give it 4 stars due to poor documentation.  Help for this was neither on the website or the included manual.   Note to developers.  Include in docs section called “uploading stored data”.","updated":"2018-02-03T08:31:27-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5967332703","userName":"Luis-IT","userUrl":"https://itunes.apple.com/us/reviews/id230459569","version":"3.11.2","score":3,"title":"Please update and fix","text":"Thank you for the most recent update to the dark mode UI. That was quick and we appreciate it. There’s a typo or at least not proper English in the “set up my device.” If the device is not connected you have the option to forget it although instead it state “forgot it.” Please adjust . I saw another review here that talked about the app crashing when you first initially log in. I had the same issue initially. Please advise, thanks","updated":"2020-05-19T14:20:21-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1668677108","userName":"LLow55","userUrl":"https://itunes.apple.com/us/reviews/id385139537","version":"3.5.2","score":2,"title":"Aggravating app","text":"Using with the iHealth \"Ease\" blood pressure device.  Unit appears to work OK, and has fair documentation manuals. However, the app has virtually no documentation and requires considerable trial and error to understand. Difficult to set up multiple profiles for different people to track their BP numbers.  I have been able to use the \"triple check\" feature on only one profile.  The app gives the \"you've already been tested - wait until tomorrow\" warning when attempting to \"triple test\" another setup profile.  At this time, I would not recommend the app or the \"Ease\" blood pressure monitor since the \"Ease\" only works with the iHealth app.","updated":"2017-07-04T08:53:53-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1630184086","userName":"Daniel Wellington","userUrl":"https://itunes.apple.com/us/reviews/id514252495","version":"3.5.2","score":4,"title":"Love but don't like the sleep stages","text":"I love that iHealth Wave automatically tracks my steps and exercise activity and even the total miles walked, along with approximate calories burned.  I'd recommend this to anyone who wants to pay attention to their health. I don't care for the sleep stages though that shows you deep sleep times and light sleep times. It's hard to read.  I love the slim width design and all the wrist band options. It would be great if the height from the wrist was a little slimmer.  Also I hope the app supports iphone7plus as soon as possible.","updated":"2017-05-31T23:23:03-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2093052186","userName":"Rafael Alicea","userUrl":"https://itunes.apple.com/us/reviews/id201329068","version":"3.6.1","score":4,"title":"Could be a Great App if...","text":"Been using this app on and off for over four years to monitor my blood pressure and weight using their hardware  (cuff and scale) and has worked with no problems. Only downside is I have to use a separate iHealth app (iGluco) for my BG and a separate one for sleeping…wish iHealth could connect with my iPhone/Watch ‘Sleep Watch’ app. That way I could have all my health information in one place to share with my doctors (kidney transplant patient). Overall I’m happy with this app.","updated":"2018-01-15T16:59:25-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1922940445","userName":"Jimmyg59","userUrl":"https://itunes.apple.com/us/reviews/id118477904","version":"3.6.0","score":1,"title":"Categories","text":"This app needs to have the following inputs.... Blood Pressure, pulse Ox, glucose, temperature, weight and heart rate! Disappointing they don’t!\n\nRE: response\nWhy would I have to use an add’l app when everything could be within the one app. If I use this to show my doctor my vitals I have to open two apps instead of one!! This is why I quit using I health. Just develop an app that includes ALL categories of vitals! I don’t want to have to utilize two or three apps to keep track of my vitals. Thank you for your response but I guess IHealth isn’t for me I will track my vitals manually on paper. I only have to show one form that way at my doctor visit.","updated":"2017-11-15T07:22:44-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1685349769","userName":"Sebastian Jame","userUrl":"https://itunes.apple.com/us/reviews/id590833507","version":"3.5.2","score":5,"title":"Beautiful and intuitive, but...","text":"I love the app, it's easy to use, extremely well designed, and the goal make it immersive and fun. I only wish there was more feedback on our accumulated data. I would love to be prompted with information regarding progress or lack thereof, as well as possible correlations. Sometimes I have trouble getting excited about all the wonderful information I'm collecting.","updated":"2017-07-16T19:41:54-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"4109070378","userName":"KnittingEmily","userUrl":"https://itunes.apple.com/us/reviews/id178559355","version":"3.10.1","score":4,"title":"Works fine but limited functionality","text":"I connected fine and have been using the scale and app for about 2 months now. I just wish the app would give better graphs. For example would be great to see 2,3,4 month ranges. 1 month is too short to really see my progress and 1 year is much too long. Would also be nice to see overlays like BMI or Body fat %. \n\nI am only using the scale for now but conserving adding the blood pressure device","updated":"2019-05-06T05:02:40-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"3958965295","userName":"GothamSenator","userUrl":"https://itunes.apple.com/us/reviews/id570909179","version":"3.9.0","score":1,"title":"Buggy products with terrible support","text":"I was really excited when my wife surprised me with this. A buddy and I had been talking about exactly this type of product the night before - seemed meant to be! (We have the Core). \n\nUnfortunately this product does not work properly from wild variances in how it estimates % body fat to refusing to sync despite being reconnected over and over again. To top it off, customer service and support is HORRENDOUS and NONEXISTENT! \n\nI hope Apple sues this company and they go bankrupt because I’m sure my wife was hypnotized buy the small i before Health. I for one will leave the feedback with the better business bureau.","updated":"2019-04-02T01:10:30-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6588442671","userName":"Cj3flyer","userUrl":"https://itunes.apple.com/us/reviews/id107298093","version":"3.11.6","score":3,"title":"Worked great for 2 weeks....","text":"Ok so the cuff worked great with my iphone for 2 week. I took my BP in the morning and again in the evening. Each time with the triple check. For the past couple of days i cannot do the triple check as i am keep getting a message that i have checked too many times today and try again tomorrow. For the manufacturers.... i bought this cuff. Its my iphone i want to know why i cannottake my Bp as often as i want!","updated":"2020-10-29T18:59:59-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1624462132","userName":"Leander Deeny","userUrl":"https://itunes.apple.com/us/reviews/id572724716","version":"3.5.2","score":4,"title":"Using app with Wave","text":"So far the app has been pretty straight forward.. this is only my second day ever using a iHealth, and I do really enjoy it. I mainly bought a Wave to track my sleep and workouts so other functions are just extra for me. It's pretty cool  if the app has the challenges and workout videos  in the future. I feel being able to interact with other people in the iHealth community could be very helpful and motivating.","updated":"2017-05-25T22:59:15-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1990994531","userName":"Griffggd","userUrl":"https://itunes.apple.com/us/reviews/id9045288","version":"3.6.0","score":3,"title":"Like but dislike","text":"iHealth try’s to keep track of a lot data. Apple Product users (iPhone & Apple Watch) are at a disadvantage.  The software does not take advantage of Apple  Health is which means data has to be entered manually if the devIces are not on there approved list. The data entry for the software is only comparable with a few selected devices. Apple Health is compatible with a lot more devices which both load to and download from Apple Health.","updated":"2017-12-12T08:53:07-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1677335208","userName":"Soup-Dream","userUrl":"https://itunes.apple.com/us/reviews/id569204004","version":"3.5.2","score":5,"title":"Love it","text":"I love there dedication and support they fulfill to their customers (also me). They listen to you and add things/fix things when you tell them. The app is complex, but extremely easy to use. It's compatible with Apple health, so my data syncs seamlessly with Apple health. Fitbit doesn't even let you sync your data with external sources, probably so they can take more of our money.","updated":"2017-07-10T20:07:08-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"4559871953","userName":"Padre–J","userUrl":"https://itunes.apple.com/us/reviews/id246482566","version":"3.10.1","score":2,"title":"Not All Accessable","text":"Overall I like the security and tracking capabilities of the app, however, it only connects by Bluetooth to the developer’s own equipment and not other Bluetooth devices.  In most cases it has a “manual input” capability for most of the vital signs trackers.  The sleep and exercise does not have a manual input so I can’t track my sleep from my APAP machine nor can I track my steps or exercise.  The app does not include any method of tracking blood glucose so I cannot track my glucose tear readings at all.  So in this respect I can only give it 2 stars.","updated":"2019-08-02T23:04:26-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1804726346","userName":"michaellporter","userUrl":"https://itunes.apple.com/us/reviews/id86064412","version":"3.5.2","score":3,"title":"Don't Buy","text":"Couldn't connect to my wifi network because the device kept timing out. Tech support sent out another scale had the same problem. Following the troubleshooting guide doesn't work and tech support was limited. No other problems with using my wireless devices connecting to my home network!","updated":"2017-09-22T20:33:24-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6152522895","userName":"Buy-SD.com","userUrl":"https://itunes.apple.com/us/reviews/id280080798","version":"3.11.4","score":2,"title":"Bad customer support. Bugs in the app","text":"The app worked for a while and then it started showing the wrong time and date. It switched to a different time zone somehow. Emailed customer support twice. After the first initial email nobody contacted me and there is no way to find any how-to information in the internet. Very upsetting. It also crashes when you click on certain buttons within the app. It needs to be updated...","updated":"2020-07-03T06:33:14-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6102053529","userName":"LJA42","userUrl":"https://itunes.apple.com/us/reviews/id24491949","version":"3.11.3","score":2,"title":"No App Support","text":"Sent them an email about a problem about 2 months ago and still have not received a response.  The program is very basic and buggy.  Will not turn and requires you to change orientation of you devise.  Can not export blood pressure traces.  Some of the problems discussed two years ago have not been fixed.  Suggest you look for an alternative if you have not yet purchased the product.","updated":"2020-06-20T15:51:03-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"7585865985","userName":"worldtravellermc","userUrl":"https://itunes.apple.com/us/reviews/id781745275","version":"3.11.10","score":1,"title":"app cannot find the scale","text":"I bought the H5S some years ago. In the beginning, it would work intermittently. As of the latest iOS and app version, the app cannot find the scale. The troubleshoot as described in the app is useless. It prompts the user to check for obvious issues, I.e. the devices should be in the same network. They are. Yet, I the app cannot find the scale. I tried resetting the scale, the network settings, and reinstalling the app. Nothing worked. The device is worthless without the app.","updated":"2021-07-17T00:11:34-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6013632086","userName":"Dog10000000","userUrl":"https://itunes.apple.com/us/reviews/id13234064","version":"3.11.3","score":2,"title":"Can not log in","text":"I was using this app to monitor my blood pressure. Then all of a sudden, the app told it was no longer free to me. Had to delete the app then reinstall it. I forgot my password. Tried to reset my password by entering my email address. Said email was sent to reset my password, the email never showed in my in box no matter how many times I asked for a reset. Now my blood pressure machine is useless because it will not without the app","updated":"2020-05-30T06:30:03-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5461349807","userName":"paxacha","userUrl":"https://itunes.apple.com/us/reviews/id40560839","version":"3.10.7","score":2,"title":"Irritating UX","text":"The app is irritating to use and I wish I’d bought a different Bluetooth BP device. It keeps refusing to take my measurements because it says I’ve already taken them today, even when I haven’t taken them in days. Why would you ever design a feature to refuse to take measurements? And worse, implement it incorrectly so it refuses when it shouldn’t. Disappointing, will look elsewhere for health tracking in the future.","updated":"2020-01-28T23:43:50-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"3822065718","userName":"flboy99","userUrl":"https://itunes.apple.com/us/reviews/id508927379","version":"3.8.0","score":4,"title":"Demands an account!","text":"Edit: misunderstanding about the need of the account wanting my email password! I would still like to be able to run the device without an account! But as of this point it seems to be working as advertised! Still do not understand why an Apple Watch is not in a list as others have said.","updated":"2019-02-27T14:55:37-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2828291027","userName":"sophillyDave","userUrl":"https://itunes.apple.com/us/reviews/id33008104","version":"3.7.1","score":5,"title":"Wireless scale lite","text":"No complaints. It syncs fast with my phone. It recently updated software through the phone. Batteries last a long time. Bright big readout. Would recommend for those who just want weight, buy the other scale for more metrics. Would buy again. No issues with the app.","updated":"2018-07-03T07:36:31-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2030721195","userName":"Phil Astro","userUrl":"https://itunes.apple.com/us/reviews/id403654464","version":"3.6.1","score":5,"title":"iHealth Bluetooth BP monitor/iOS works great","text":"Great value for the quality and at least with my iOS iPhone 7, it along with my unrelated but compatible smart scale both work very well and I'm looking forward to future tech by iHealth, since it syncs data seamlessly to the Apple iOS Health UI app.  Great work, software engineers!","updated":"2017-12-26T19:10:00-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5420317974","userName":"Northern Geomatics","userUrl":"https://itunes.apple.com/us/reviews/id113965963","version":"3.10.7","score":1,"title":"Bluetooth failure","text":"My iHealth Feel Wireless Monitor has quit connecting automatically with my new iPhone 11. To use it with my app I have to open settings and connect manually. A real pain in the neck. When I tried uninstalling everything and starting over the app quit working saying my account did not exist even though I could go online with my laptop and sign in. In my opinion this product is one I would not use again after my experience.","updated":"2020-01-18T12:13:54-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"7004240474","userName":"daveisfun","userUrl":"https://itunes.apple.com/us/reviews/id12437087","version":"3.11.9","score":1,"title":"I have a feeling the people who developed this app don't use the products.","text":"This app could be amazing but it is not. Many flaws and no way to report them or get support. The most glaring is when you use the app to record your weight the screen locks. It won't do anything once it weighs you. You have to manually close the app by exciting and then swiping up. This is so annoying I am thinking about returning all the iHealth products not scale.","updated":"2021-02-16T23:20:39-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2609953222","userName":"joedavenport","userUrl":"https://itunes.apple.com/us/reviews/id193894848","version":"3.7.0","score":4,"title":"iHealth Core Scale","text":"I like the scale, but the body values are very questionable when compared to other more accurate methods or scales for body fat. \n\nThere would be value in the scale recognizing the time of day when the measurement is taken to better identify trends.  \n\nMy next scale will have the hand sensors to get better body composition readings.","updated":"2018-05-28T17:21:59-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2476326032","userName":"I can't think of anickname","userUrl":"https://itunes.apple.com/us/reviews/id79014530","version":"3.6.2","score":1,"title":"Worthless","text":"I bought the blood pressure monitor only to find out that the app won’t allow you to use the device without creating an account with the company I have no idea why they need my email address birthdate and so much information but if I don’t feel inclined to share that information there is no way to use it the app will not let you just use the device to see your blood pressure without sharing your life story with the company","updated":"2018-04-27T16:10:37-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2481413367","userName":"SaraKateinDixieLand","userUrl":"https://itunes.apple.com/us/reviews/id42499443","version":"3.6.2","score":1,"title":"Turn the music off!!!","text":"The music is so annoying I can’t even think!  Why?  It’s not necessary at all.  This will be returned if I can’t turn the music off and take care of my business in peace.  I weigh early in the morning when my spouse is sleeping, I can’t turn off my volume because I’m on call so unless you can offer an alternative I’ll be buying something else. Honestly, you may have a great app but I won’t listen to this music long enough to find out.","updated":"2018-04-28T20:12:37-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6341403700","userName":"Bleeber","userUrl":"https://itunes.apple.com/us/reviews/id133725264","version":"3.11.6","score":1,"title":"A really really annoying app","text":"Font, like so many app designers do, is a fine light grey and unreadable to me. IOS  has made such type nearly microscopic in recent upgrades, and it won’t stretch. \n   I have serious doubts about the scale accuracy but time will tell. \nDoesn’t interact with anything else: MyFitnessPal which I’ve used 5 years, nor Apple health app.  \n  I entered my weight to Myfitnesspal manually for years I don’t need this terrible app. DELETE","updated":"2020-08-20T07:03:05-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5891237094","userName":"tx6607","userUrl":"https://itunes.apple.com/us/reviews/id36249676","version":"3.11.1","score":3,"title":"Unable to Edit","text":"This app does not allow you to edit your readings. I use my own BP device and must manually input my data. But should I click on the wrong wheel setting, it becomes a permanent record and I can’t change it. If I had that ability, it would get 5 stars.","updated":"2020-05-01T19:43:43-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1762774330","userName":"myberg","userUrl":"https://itunes.apple.com/us/reviews/id37907382","version":"3.5.2","score":3,"title":"Trouble with Bluetooth connection","text":"I opened the package and followed all the directions as I have other iHealth devices.  It connected fine the first time but I haven't been able to connect the scale lite to the Bluetooth on my phone.  What could be the problem.  Help please. The glucose blood kit and app are outstanding.","updated":"2017-08-30T19:08:22-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"4706623722","userName":"NYEllenCA","userUrl":"https://itunes.apple.com/us/reviews/id25215939","version":"3.10.1","score":2,"title":"Meh","text":"Dodgy software. \nSeemed to work when first arrived. After couple of months, keeps telling me I’ve already completed my test for the day and to return in the morning.  Except I haven’t used the unit for a few days. \nOther problem,  it will only take reading at certain times. If you try outside of those parameters, you won’t get reading.  \nDon’t understand reasoning for the restrictions.","updated":"2019-08-31T20:32:18-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"4205258328","userName":"M.UDT","userUrl":"https://itunes.apple.com/us/reviews/id49772614","version":"3.10.1","score":5,"title":"Wrong information in Czech translation","text":"Hi,are you realy sure that Office working is High activity in daily activity setting under account? Because you have it in Czech translation of this app.\nWhat must be set for olympic sportsman’s or for miner?\n\nPlease correct.\nThank you","updated":"2019-05-24T23:10:21-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2280439195","userName":"TJsGTR","userUrl":"https://itunes.apple.com/us/reviews/id43434603","version":"3.6.1","score":4,"title":"Good product","text":"I have had the BP cuff and app for about a year and I use it each morning and evening. It syncs with the app without issues and is accurate. I have checked it against an analog BP Cuff during my doc visit. \n\nIf your into tracking your vitals this is worth the spend.","updated":"2018-03-07T05:00:06-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5872379570","userName":"sayenew","userUrl":"https://itunes.apple.com/us/reviews/id262583983","version":"3.11.1","score":1,"title":"Order never showed up.","text":"I think they are out of business. I placed order few weeks ago they said they will ship it 1-2 business days now it’s almost three weeks. I tried to reach them they don’t pick up their phone. I emailed them many times they don’t respond. Now I am looking my options. Don’t order any product through their website.","updated":"2020-04-27T14:42:50-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2554727564","userName":"Richard.w.3","userUrl":"https://itunes.apple.com/us/reviews/id187581777","version":"3.6.2","score":1,"title":"Why not private mode?","text":"I bought a couple of your associated products and I used them in the past.  However, I stopped using your devices when I realized I really don’t want my vitals stored on a server for which  have no control.  Why don’t you include a private mode where my information is stored in a local file or at worst in my private iCloud account?   I really do not wish to share my information with your company.","updated":"2018-05-16T04:43:59-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1943846228","userName":"LTFPF","userUrl":"https://itunes.apple.com/us/reviews/id283610619","version":"3.6.0","score":5,"title":"Bluetooth","text":"This App does work, you must make sure no other App is running on Bluetooth at the same time, I had another health app open in background and iHealth app would not connect to my cuff or scale","updated":"2017-11-23T15:30:16-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1655907044","userName":"Elijah Jordan Wood","userUrl":"https://itunes.apple.com/us/reviews/id570099470","version":"3.5.2","score":5,"title":"Good Work!","text":"The software is easy to use, and the connection is fast. I am losing weight, the daily weight and target lines are useful to me, and I hope that the software can add some custom dietary adjustments to me that will be a good supplement!","updated":"2017-06-24T05:18:07-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6510532719","userName":"Bam 16","userUrl":"https://itunes.apple.com/us/reviews/id38649162","version":"3.11.6","score":1,"title":"Loses Data after Sync","text":"I bought this to use with the iHealth blood pressure cuff. The cuff seems to work very well and I think it is accurate. However when you sync the data to this app it erases it from the blood pressure cuff and only stores the last reading in the app. Totally useless for looking at trends or past history. The app is a little clunky to use as well.","updated":"2020-10-07T08:48:38-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1919107848","userName":"A Country Music Fan","userUrl":"https://itunes.apple.com/us/reviews/id3771645","version":"3.6.0","score":5,"title":"IHealth App","text":"A great App!  I have been using it for years. I use it with my scale, blood pressure devise, and blood oxygen meter. I did have trouble pairing when I upgraded to iPhone X, but that was corrected on the last update. I recommend the app and the associated devises.","updated":"2017-11-13T16:38:18-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6947178967","userName":"josephkravis","userUrl":"https://itunes.apple.com/us/reviews/id518823550","version":"3.11.9","score":1,"title":"Network Error 102","text":"Your application no matter what device used on  will not connect through network. Any network that I have access to. I bought the finger O2 meter so I could use it properly with this application and since the App connect the device is basically useless for gathering the history of data. it works as a device but that’s it","updated":"2021-02-02T20:08:35-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2548094147","userName":"keidp","userUrl":"https://itunes.apple.com/us/reviews/id119452570","version":"3.6.2","score":3,"title":"App is inactive in Health app","text":"Hello! I bought the blood pressure monitor it works perfectly but from few days ago it doesn't register the BP it appears inactive the app under Health app it doesn't store the results in the Health app from iPhone other than that works good. Is there anything you can do to fix this issue.\nThanks!","updated":"2018-05-14T17:44:50-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6010320664","userName":"LSDavis1980","userUrl":"https://itunes.apple.com/us/reviews/id1112040376","version":"3.11.3","score":2,"title":"it’s ok, but.......","text":"I have the iphone 11 and bought the ihealth wave after a recommendation. Once the phone was connected to the watch, I noticed that the step counts in the ihealth app doesn’t match the step count in the apple health app. It’s off by, at least, 3500 steps. I’m wondering how they would be able to sync up and record evenly.","updated":"2020-05-29T11:36:46-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1838507324","userName":"HeartWarriorKTM","userUrl":"https://itunes.apple.com/us/reviews/id233819194","version":"3.5.2","score":4,"title":"Pulse Oximeter","text":"I have a congenital heart defect that causes my oxygen saturation to be quite low. This allows me to track this and the app keeps the data for me so that I can know where I am as well as pull it up for my physicians. Only wish they offered an Apple Watch version.","updated":"2017-10-09T20:07:39-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5455754970","userName":"Kaledh","userUrl":"https://itunes.apple.com/us/reviews/id244541554","version":"3.10.7","score":3,"title":"Why is not syncing the app with my Health Apple App?","text":"It’s a good product, but kind annoying because besides of seeing my readings in this app, I want also to be able to see in my Apple health App. I granted the permissions, but stills unable to see there. Any insights on to this?","updated":"2020-01-27T10:34:48-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5969205201","userName":"Sengoku_us","userUrl":"https://itunes.apple.com/us/reviews/id175471941","version":"3.11.2","score":1,"title":"Could not even register an account.","text":"Kept saying network error 999 on my iPad (which the app will not even support landscape mode). I would be using it on the iPhone, but it is easier to download, installs and register stuff on the iPad first.\n\nI recommend trying the app (if you can get it to work) before buying any of the companies actual products.","updated":"2020-05-20T00:57:26-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5417168769","userName":"andrewapplefan","userUrl":"https://itunes.apple.com/us/reviews/id234142654","version":"3.10.7","score":5,"title":"Pretty easy to use and export my data to my doctor super easy","text":"Like what iHealth claimed, take charge of your health. Sharing is easy , device is accurate.","updated":"2020-01-17T18:53:35-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1887866500","userName":"BurntFlami","userUrl":"https://itunes.apple.com/us/reviews/id528935849","version":"3.5.2","score":5,"title":"Nice APP","text":"This app is great at helping me stay within bounds each day. It's really helping me with my weight loss goals. It really works. I have been using it for a month and have lost 26 pounds. It's so easy to use.","updated":"2017-10-31T08:14:04-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"7820558292","userName":"linden blvd","userUrl":"https://itunes.apple.com/us/reviews/id244599384","version":"3.11.13","score":1,"title":"This scale is awful.","text":"Stay as far away from this scale as possible. After it requiring a lot of your personal info just to get it started, it only uses Kilos which is fine if you aren’t an American raised in Lbs as weight measurement. Even Stones as a measurement would have been ok. Just wanted a good accurate scale that you step on and get a result. This ones a giant pain.","updated":"2021-09-18T16:46:01-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6577544521","userName":"RCCOLA74","userUrl":"https://itunes.apple.com/us/reviews/id407611007","version":"3.11.6","score":5,"title":"Works very well with My iPhone","text":"This is great!!! I’ve been able to record all of my blood pressure readings and send them to my doctor whenever necessary. So cool!!!","updated":"2020-10-26T16:44:41-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5836602084","userName":"CK8516","userUrl":"https://itunes.apple.com/us/reviews/id156893735","version":"3.11.1","score":1,"title":"Won’t connect to Apple Watch","text":"I’m not sure why Apple even allows this app? You have zero options to connect to Apple Watch. I’m not going to go out and spend another $500 for a specific set of watches your app allows. As far as I know, the Apple Watch is the only FDA approved heart rate monitor for the wrist watch series. Maybe allow it and stop monopolizing (which is illegal by the way).","updated":"2020-04-19T18:17:30-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"4948540814","userName":"Zekmoe","userUrl":"https://itunes.apple.com/us/reviews/id315208971","version":"3.10.4","score":2,"title":"Some stuff works, some doesn’t","text":"After a botched order probably on my part, the three items I ordered arrived. Scale, pulse/oxygen monitor and wrist blood pressure monitor. 2 out of three, the scale and the pulse monitor, seem to work fine but the wrist blood pressure device is a dud. Worked once, then nothing. \nIt’s probably a good idea, poorly executed. I’d reconsider if I knew the devices failed so easily.","updated":"2019-10-14T16:37:04-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"3260716661","userName":"Mowmanmark","userUrl":"https://itunes.apple.com/us/reviews/id566751624","version":"3.8.0","score":1,"title":"IHealth Wave","text":"The iHealth unit is great......The wrist bands are weak and they break very easily. I have been trying to get a hold of them so I can buy replacement bands but I’ve been waiting now over a month for a response to my email or respond to my telephone call you think they would get back to you with the price, you would think they would get back to you quickly for the price they have this unit?","updated":"2018-10-03T17:15:37-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"7396961574","userName":"NowSlimmer","userUrl":"https://itunes.apple.com/us/reviews/id8344974","version":"3.11.9","score":2,"title":"Not all data flows to Apple Health","text":"I have the Nexus scale which records body fat, lean mass, body water, muscle mass, bone mass. The data transfers well to the iHealth app. Some of the data loads to the Apple Health app but not all.  For example, Lean Body Mass does not transfer even though the app is listed in the “Data Source” section.  This needs to be fixed.","updated":"2021-05-27T22:12:20-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1910653157","userName":"silyman1","userUrl":"https://itunes.apple.com/us/reviews/id33102504","version":"3.5.2","score":4,"title":"iOS 11.1.1 fixed bug :)","text":"Originally: Can’t get the app to recognize the cuff on iPhone X. Love to rate this when that Happens!\n\nUpdated: working now. A little different readings from my Withings cuff. But who knows who’s right anyway? Much easier to get on than an upper arm cuff.","updated":"2017-11-10T04:03:23-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6000710775","userName":"lampis21","userUrl":"https://itunes.apple.com/us/reviews/id239075786","version":"3.11.3","score":1,"title":"Doesn’t work","text":"I create a new account and get network error 99 but my email box receives the “new account created”. Then I can’t log in. Done it several dozen times. My email is flooded with “welcome, congrats on creating a new account”. I’m about the return the blood pressure monitor to the store because the app doesn’t work. I wish this would work offline","updated":"2020-05-27T07:03:36-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6520108501","userName":"KT May","userUrl":"https://itunes.apple.com/us/reviews/id41212231","version":"3.11.6","score":1,"title":"App no longer connects to scale via Bluetooth","text":"After the last IOS update, the scale connects to my phone via Bluetooth but the app won’t connect to the scale. It just displays a Bluetooth connection spinning icon. The readout on the scale has not been legible for some time so now it’s useless! Please fix the problem. I’m considering purchasing a different brand of scale!!!","updated":"2020-10-10T04:31:54-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6160903818","userName":"MommaB22","userUrl":"https://itunes.apple.com/us/reviews/id33953024","version":"3.11.4","score":3,"title":"Support is lacking","text":"I love my Core scale and the fact that I can review the details in this app.  BUT, the time log is off and shows wrong times and even days, depending on when I weigh.  I tried contacting support, but they never replied.☹️","updated":"2020-07-05T09:25:34-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1815842350","userName":"hdjd1010","userUrl":"https://itunes.apple.com/us/reviews/id12483548","version":"3.5.2","score":1,"title":"very disappointing","text":"bought The iHealth blood pressure monitor clear their newest latest one thinking it work with your iPhone directly because all the ad show it and the iPhone side-by-side nothing else but no you have to have a home Wi-Fi service with someone for it to connect to then it goes to your phone through that does not connect straight to your phone's Wi-Fi","updated":"2017-09-28T18:25:40-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"8139555476","userName":"intelligent","userUrl":"https://itunes.apple.com/us/reviews/id19315935","version":"3.11.16","score":5,"title":"Works great with Apple Health","text":"App easily imports data into Apple Health data base which is the main reason I purchased their oximeter.  Also good app privacy statement.","updated":"2021-12-17T05:38:51-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"7729173330","userName":"Barkmaker","userUrl":"https://itunes.apple.com/us/reviews/id260225752","version":"3.11.11","score":1,"title":"Weak","text":"Bare minimum effort on this app to sell the expensive hardware. Hasn’t been updated in the many years that I’ve had it. Can’t look at older data. First orient the screen at all. Seriously lame software for the great hardware. The owners of this company should be ashamed of themselves. It wouldn’t take much cash outlay to improve this software immensely. Tight wads!","updated":"2021-08-24T06:30:19-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"7671382692","userName":"jessbcuzz","userUrl":"https://itunes.apple.com/us/reviews/id979710042","version":"3.11.10","score":1,"title":"Awful","text":"The devices show they are connected but the app states the devices are connected. Once in a blue moon the app will connect. Why Bluetooth settings show the devices are connected that the app won’t connect beats the heck out of me. I have tried restarting my phone, in pair and re-pair devices and  still the same issues.","updated":"2021-08-08T20:53:51-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6584591759","userName":"dvdk0","userUrl":"https://itunes.apple.com/us/reviews/id209153659","version":"3.11.6","score":1,"title":"Instacrashes","text":"The app crashes immediately within 1-2 seconds of being started. Giving the amount of money I spent on a blood pressure monitor, and the fact that this app is the only way to control it, this is incredibly frustrating and disappointing. I’ll probably throw my monitor in the trash and buy another one.","updated":"2020-10-28T16:37:22-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"4961995786","userName":"BaldLars","userUrl":"https://itunes.apple.com/us/reviews/id16256407","version":"3.10.4","score":1,"title":"Won’t connect to WiFi or set up properly","text":"Over time either this app or the device won’t complete the setup ... most of the time my device finds my WiFi and then starts the setup process, but it fails to complete the setup every time. Fortunately the device works for taking my blood pressure, it’s just I can’t take advantage of the features in the app.","updated":"2019-10-17T12:44:30-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2350195706","userName":"Neel74","userUrl":"https://itunes.apple.com/us/reviews/id6395138","version":"3.6.1","score":1,"title":"Do not ever buy an iHealth product","text":"Rule#1 for a company making. Connected device- ensure device doesn’t fail repeatedly to connect to the phone. I bought a iHealth weight scale and the device fails to connect to my phone. I am pretty tech savvy, so this isn’t about user error but the device times ou constantly. No help or support from the company. Take your money elsewhere","updated":"2018-03-26T16:56:22-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2141587704","userName":"Loudottoli","userUrl":"https://itunes.apple.com/us/reviews/id112310805","version":"3.6.1","score":4,"title":"So Far So Good","text":"I have the need to have my blood pressure results handy at all times and this app works very well for me. There is no writing anything down, the app stores all your vitals. The Bluetooth blood pressure cuff is absolutely wonderful.","updated":"2018-01-29T06:44:48-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"7730418193","userName":"Ramón del Bosque","userUrl":"https://itunes.apple.com/us/reviews/id238319352","version":"3.11.11","score":1,"title":"HS5 scale doesn’t connect","text":"There is a new update of the app today, steal my scale HS5 cannot connect to the Apple or ios devices. It has been two months since I can’t connect my scale. I hope soon they can fix this issue so I can continue using my scale. It is really frustrating trying to connect the device.","updated":"2021-08-24T14:20:12-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1657874101","userName":"Аchille","userUrl":"https://itunes.apple.com/us/reviews/id36883130","version":"3.5.2","score":1,"title":"Forces you to scan a barcode","text":"The app and device don't seem to work until after you scan a barcode. The process is buggy, slow and makes the experience painful for no good reason other than making iHealth more money. I sure hope you guys go out of business when Apple and Google release their non invasive glucose tests.","updated":"2017-06-25T21:47:34-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6559722156","userName":"Kamikaze74b","userUrl":"https://itunes.apple.com/us/reviews/id108080774","version":"3.11.6","score":1,"title":"App force closes so now I lose out on HSA rewards","text":"This app continually force closes on iOS. I log in (why do I have to keep doing this?) and it shuts down. I have uninstalled and reinstalled. I have restarted my device. There aren’t many more details that could be provided other than this app does not function.","updated":"2020-10-21T13:12:26-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"4067449618","userName":"Disasterensures","userUrl":"https://itunes.apple.com/us/reviews/id49805368","version":"3.10.1","score":3,"title":"No Apple Watch Support","text":"Unable to use full functionality because of lack of support for Apple Watch. The app seems to be very complete otherwise but Apple Watch is my only tracker and I can’t input this data into the app. Please add support for the watch.","updated":"2019-04-27T06:47:29-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5172951246","userName":"mad03max","userUrl":"https://itunes.apple.com/us/reviews/id26025790","version":"3.10.5","score":1,"title":"App is unable to connect with the oximeter in the latest iOS 13.1.3 on an iPhone XR","text":"After I contacted the developer I received a call explaining that this is am known problem.  Kudos for the prompt call back. I’m hoping for a resolution soon because the ability to collect readings by Bluetooth is the reason I choose this device.","updated":"2019-11-20T07:01:56-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6782763440","userName":"erynnsheakelly","userUrl":"https://itunes.apple.com/us/reviews/id24930859","version":"3.11.7","score":1,"title":"Is there lower than one star?","text":"I just got the iHealth blood pressure cuff for Christmas and I’m trying to connect this app to the device and it’s not happening. I’ve gone through all of the “tips“ that they suggest and nothing is working. I tried emailing their support and just got a condescending response back telling me to follow the instructions.","updated":"2020-12-22T15:15:46-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"4112003948","userName":"ord97","userUrl":"https://itunes.apple.com/us/reviews/id207755385","version":"3.10.1","score":2,"title":"Very buggy Bluetooth connection","text":"Ever since this app was upgraded, I’ve constant Bluetooth connection issues/failures that require repairing or forgetting the device(older BP5 blood pressure monitor) to make it work. I also used to see a display on battery life that no longer exists from the older app versions.","updated":"2019-05-06T20:15:14-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6118083618","userName":"jgates57","userUrl":"https://itunes.apple.com/us/reviews/id112946278","version":"3.11.4","score":3,"title":"Update Failure corrected","text":"The new update seems to have fixed the problem.  I think everything is back in good order.","updated":"2020-06-24T17:21:08-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1678667189","userName":"jackdajew","userUrl":"https://itunes.apple.com/us/reviews/id121391174","version":"3.5.2","score":4,"title":"Great App, love it. 🏅🖖🏽👍🏼","text":"Been using this app for years, most other things were great for me. \nWish it would show the percentage of battery use for the unit. \nI am using the BP7, hardware version 1.0.0; firmware version 2.2.1 - with my IPhone 6.\nWhen I go to My Devices, details, the offline measurement & device battery does not work. \nI noticed, about two updates back, that it stopped working.\nCan you fix this problem? \nThank,","updated":"2017-07-11T19:27:43-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"7958919795","userName":"MikeW301","userUrl":"https://itunes.apple.com/us/reviews/id25168336","version":"3.11.15","score":4,"title":"Great app, but some BP measurements stay on device even after uploading","text":"Be careful when you press “Sync” and only choose your BPs to upload","updated":"2021-10-27T04:36:38-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"7577362361","userName":"Mad at stupid updates","userUrl":"https://itunes.apple.com/us/reviews/id278659432","version":"3.11.10","score":1,"title":"Stopped working with HS5","text":"Whoever is the person who approved this update is an idiot.  It has completely stopped working with my HS5 scale which has worked fine for about 5 years.  If this doesn’t get fixed soon, you’ve lost a customer.  Not getting any other iHealth products.","updated":"2021-07-14T17:43:02-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5561176624","userName":"HWMichael","userUrl":"https://itunes.apple.com/us/reviews/id8426921","version":"3.10.7","score":2,"title":"App Keeps Crashing","text":"App use to be pretty reliable but recently it crashes most of the time when trying to check my blood pressure. Which ironically makes my blood pressure go up because it is frustrating!","updated":"2020-02-21T05:58:12-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2337835399","userName":"The odd man out","userUrl":"https://itunes.apple.com/us/reviews/id36654668","version":"3.6.1","score":5,"title":"Works great for me","text":"I charged it up overnight, created my account through this app and it worked great. No problems at all.","updated":"2018-03-23T08:50:21-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1851785422","userName":"Poaslava","userUrl":"https://itunes.apple.com/us/reviews/id227125791","version":"3.5.2","score":5,"title":"Terrific BP Cuff","text":"I have used and compared with my physician’s readings. Accuracy in remarkable. Wish this instrument was around when I worked in the medical field. Compact as well accurate.","updated":"2017-10-15T19:45:52-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1918506458","userName":"bbmountain","userUrl":"https://itunes.apple.com/us/reviews/id142326568","version":"3.6.0","score":3,"title":"Not syncing through Dropbox","text":"I have 3 IOS devices and they have not synced through Dropbox since September 24.\nUpdate: Maybe iHealth never synced through Dropbox? However it used to sync though...it no longer does.","updated":"2017-11-13T09:59:41-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5811694012","userName":"BradGess","userUrl":"https://itunes.apple.com/us/reviews/id38508696","version":"3.11.1","score":1,"title":"Little care for software","text":"iHealth creates great quality hardware, but their software (this app) shows very little care. The UI is full of lots of glitches like when I take a pulse oximeter reading, the bottom row of buttons gets pushed down below the screen so I can’t tap then.\n\nPlease invest more in your software. It’s pretty bad.","updated":"2020-04-14T12:59:56-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6528751105","userName":"IHateTheseAppleThings","userUrl":"https://itunes.apple.com/us/reviews/id554392178","version":"3.11.6","score":1,"title":"Requires a login","text":"As was also true for Omron, there is no acceptable reason for this app to require a login to a remote service.  The only reason to do so is to collect data from users, which then ties PII with PHI.  Will not be purchasing a product using this app until offline support is allowed.","updated":"2020-10-12T14:58:20-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6335351897","userName":"YouTubeCreator1995","userUrl":"https://itunes.apple.com/us/reviews/id241555150","version":"3.11.6","score":1,"title":"IHealth app is an embarrassment","text":"I have the blood sugar monitor and the blood pressure cuff. Both devices frequently fail to connect to this (cr)app. I’ve written Bluetooth apps before, it isn’t that difficult to connect to a device. They designed the Bluetooth hardware, how could they screw up something as insecure Bluetooth connecting?","updated":"2020-08-18T16:13:14-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6023338082","userName":"Speck70001","userUrl":"https://itunes.apple.com/us/reviews/id36110354","version":"3.11.3","score":1,"title":"Unable to log in","text":"I get that there have been some issues but you should put some other message besides “network error”. I am going to return my products because i can’t use them.  Very poor customer service.\n  I returned the scale and blood pressure cuff. My rating stands","updated":"2020-06-01T14:52:43-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"3250573635","userName":"Lorantd","userUrl":"https://itunes.apple.com/us/reviews/id385530767","version":"3.8.0","score":2,"title":"One measurement per 24h","text":"I payed a decent amount of money for my blood pressure sensor, why are you constraining me to one use per 24hours??? And on top of that it would seem that you can’t do basic math and ALWAYS detect that incorrectly in case of the tripple check. Get out of your own way and let me use my device!!!!","updated":"2018-09-30T23:24:36-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2617369880","userName":"Flatulent1","userUrl":"https://itunes.apple.com/us/reviews/id165363385","version":"3.7.0","score":1,"title":"Going in the garbage","text":"I have been using this just for my blood pressure as a guest. Don't want to set up an account and give my personal information plus email. Made the mistake of updating and now I can' use it at all without an account. I refuse to share any of my information. Guess I have to dump it and go back to a blood pressure cuff.","updated":"2018-05-30T07:44:28-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5170192951","userName":"byuxtian07","userUrl":"https://itunes.apple.com/us/reviews/id39638211","version":"3.10.5","score":3,"title":"App Crashes and Times Out Constantly","text":"After this last update I can no longer connect new devices","updated":"2019-11-19T15:37:43-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2029478640","userName":"assb10yr","userUrl":"https://itunes.apple.com/us/reviews/id42050412","version":"3.6.1","score":4,"title":"Wi-Fi password length inadequate","text":"I cannot connect the blood pressures monitor to the app because the app will not take more than 20 character password for the Wi-Fi connection. Please fix this ASAP.","updated":"2017-12-26T08:55:04-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5177813276","userName":"dice baller","userUrl":"https://itunes.apple.com/us/reviews/id135104810","version":"3.10.5","score":1,"title":"App crashes each time I try to set up new device","text":"I’ve installed, deleted, and reinstalled the app multiple times. My phone is updated and the Bluetooth is on and works with other devices just fine. This app doesn’t work at all. It’s disappointing.","updated":"2019-11-21T11:13:09-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2559702777","userName":"Lewkarenann","userUrl":"https://itunes.apple.com/us/reviews/id40035476","version":"3.6.2","score":1,"title":"Can’t create an account after downloading app","text":"Thought I would sync this app with my activity points on my insurance website but as much as I tried it would not allow me to create an account. The white box asking you to agree to terms would not go away after pressing OK 30 tines... annoying!!","updated":"2018-05-17T08:32:59-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"3488725713","userName":"JimHardy1234","userUrl":"https://itunes.apple.com/us/reviews/id26029491","version":"3.8.0","score":3,"title":"Insane music","text":"The whole building doesn’t need to know I’m checking my BP.  For heavens sake, give us the option of turning off that stupid and loud music!","updated":"2018-12-03T04:12:59-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"4418044267","userName":"Meaux991","userUrl":"https://itunes.apple.com/us/reviews/id203437248","version":"3.10.1","score":5,"title":"Unable to login getting network error 502","text":"Unable to login getting network error 502","updated":"2019-07-05T23:34:15-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5655940846","userName":"namekam","userUrl":"https://itunes.apple.com/us/reviews/id1144506497","version":"3.11.0","score":1,"title":"Not working on IPhone 8 Plus","text":"I would love for this app to talk and track my Apple Watch activity. It used to do just that but stopped working back in May 2019. My work pays us for activity and has this app as one of the ones that they will link too. Any help is greatly appreciated.","updated":"2020-03-13T11:01:15-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5175039617","userName":"bwentwor","userUrl":"https://itunes.apple.com/us/reviews/id101952662","version":"3.10.5","score":1,"title":"Just trash!","text":"It worked so well before the last update. Now, the Bluetooth just hangs and iOS doesn’t connect to the app. I deleted my device to set it up again and I cannot add it again. I might as well throw out the device if I cannot use the app!","updated":"2019-11-20T19:36:24-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2104813845","userName":"AstorgaNuñez","userUrl":"https://itunes.apple.com/us/reviews/id124005045","version":"3.6.1","score":2,"title":"Disappointment","text":"I have a BP3 device and with my old iPhone 4 it worked perfectly. With the iPhone 5S I have many problems to connect the device. I must turn off Bluetooth, connect and disconnect repeatedly until the blood pressure monitor works\niOS 11.2.2","updated":"2018-01-19T06:37:11-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"7185540448","userName":"D2dsmomma","userUrl":"https://itunes.apple.com/us/reviews/id29344591","version":"3.11.9","score":1,"title":"Blood pressure monitor with a stand","text":"Will not work with newer iPhones. iPhone X is the last it will connect to. Anything above - it will not connect and if it actually does once in a while, there is a “communication error” the moment you start the bp measurement. What a waste of money.","updated":"2021-04-05T00:15:34-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6817964587","userName":"Mark Miller iTunes","userUrl":"https://itunes.apple.com/us/reviews/id33294217","version":"3.11.7","score":4,"title":"Apple Watch","text":"I’d really like to see an Apple Watch version of this app that allows checking of blood pressure with the iHealth blood pressure cuff.","updated":"2021-01-01T05:57:38-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5297438257","userName":"Rttt33","userUrl":"https://itunes.apple.com/us/reviews/id32776005","version":"3.10.7","score":1,"title":"Mediocre at best","text":"Hard to stay connected , poor logging , poor menu mobility counter intuitive and circular. Decent when it works but erratic. No pulse monitoring function on wrist BP cuff\n\nEdit: add cryptic icons that may or maybe not be indicating that you have a problem.  Lame to annoying at best. Pretty f'ed up at worst.","updated":"2019-12-20T15:34:08-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"7466100183","userName":"3GS 2010","userUrl":"https://itunes.apple.com/us/reviews/id101843671","version":"3.11.10","score":4,"title":"Great App overall will there be watch support","text":"This app along with the ihealth, health devices are great for obtaining baseline health metrics. \n\nIt would be nice to have Apple Watch support as well.","updated":"2021-06-14T21:29:52-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2944935361","userName":"jacksocj","userUrl":"https://itunes.apple.com/us/reviews/id13969985","version":"3.7.2","score":2,"title":"Will not upload from HS3 scale since last update","text":"The last update has caused the app to not get uploaded with scale data.  Bluetooth looks solid and app indicates it is connected, but no data has been uploaded since this last app update.","updated":"2018-07-21T07:53:40-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2122742712","userName":"Cristoffer","userUrl":"https://itunes.apple.com/us/reviews/id19306250","version":"3.6.1","score":1,"title":"Login required","text":"Please don’t make users login to use hardware that they purchased. \nWhen you do this and make people login to an app to use your tech, I will not buy it. Best case: you have my personal health data. Worst case: your site disappears one day and I can no longer use the product.","updated":"2018-01-24T12:00:07-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1884364993","userName":"COLON TOWEL","userUrl":"https://itunes.apple.com/us/reviews/id41191560","version":"3.5.2","score":4,"title":"Needs landscape view for iPad","text":"Love the app, but REALLY needs landscape view for iPad! 5 stars when I am no longer required to view in portrait mode.","updated":"2017-10-29T18:18:04-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5983613903","userName":"Rick G","userUrl":"https://itunes.apple.com/us/reviews/id38515990","version":"3.11.3","score":1,"title":"New Bug Prevents it Running in latest version May 23, 2020","text":"IOS App (Apple) on iPhone (iHealth) has just been updated on App Store.\n\nWhen I attempt to run app I get a message that says “This App is no longer shared with you” please repurchase. But I purchased/downloaded it previously. \n\nThis is some kind of bug relating to family sharing settings? Please fix it.\n\nAnd please don’t ask me to delete app and download again because I do not want to delete all my previous health data.","updated":"2020-05-23T06:17:38-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6205802518","userName":"EricaMarieMusic","userUrl":"https://itunes.apple.com/us/reviews/id399018624","version":"3.11.4","score":1,"title":"App doesn’t stay open","text":"Every time I try to open the app it closes, it doesn’t stay open!!\nFix it! \nI didn’t get the scale and glucose meter for these issues \nI can enter them manually however that’s not the point!!","updated":"2020-07-16T11:13:24-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6182464128","userName":"CMCDaveCan","userUrl":"https://itunes.apple.com/us/reviews/id276651743","version":"3.11.4","score":2,"title":"When will you support the iHealth  PT3 thermometer?","text":"The PT3 is NOT listed under Set up my Devices===>Select new Device==>Thermometer.   Why not? Also, support for Fitbit watches would be great!!!   Hope the iHealth oxy meter being shipped to me will be supported ???","updated":"2020-07-10T13:17:55-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5945757947","userName":"LisaManTer","userUrl":"https://itunes.apple.com/us/reviews/id150531944","version":"3.11.1","score":1,"title":"It won’t stop crashing","text":"I downloaded onto my iPhone XR and I can’t even go all the way through the app. I get to the part where it asks for date of birth, weight, height and it just crashes after that. Can’t go any farther.","updated":"2020-05-14T14:50:02-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6949449255","userName":"KBBRN","userUrl":"https://itunes.apple.com/us/reviews/id163971580","version":"3.11.9","score":1,"title":"Hard to read because it is so lite and small. You can’t enlarge it. Nightmare to read grafts.","text":"Very hard to read very light writing and small to see. Unable to zoom in or out. Grafts very to see.  No settings in app to enlarge.  What a shame!","updated":"2021-02-03T09:19:52-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6689907314","userName":"Copperboom626","userUrl":"https://itunes.apple.com/us/reviews/id207136028","version":"3.11.7","score":1,"title":"App still crashing.","text":"I have an iHealth blood pressure monitor which can only be used through the app. Well now the app crashes as soon as it is opened. Good to know I’m not the only one. When will this be fixed?","updated":"2020-11-26T19:46:48-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6286275444","userName":"Coconuts1958xyz","userUrl":"https://itunes.apple.com/us/reviews/id350789082","version":"3.11.6","score":2,"title":"Not working app","text":"I dont like that i sign in and put all my personal health details etc. and then at the and it doesn't allow you to log in!!","updated":"2020-08-06T03:09:02-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"7834864524","userName":"aceaton12","userUrl":"https://itunes.apple.com/us/reviews/id48855184","version":"3.11.13","score":1,"title":"iHealth (H6) Scale no longer syncs to iHealth app.","text":"iHealth (H6) Scale no longer syncs to iHealth app.  Very frustrating since I purchased in order to track my weight, body fat, muscle mass, etc. I’ve tried resetting it and changing the batteries but it still isn’t working.","updated":"2021-09-22T18:03:30-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"3838066295","userName":"I hate LA","userUrl":"https://itunes.apple.com/us/reviews/id148411171","version":"3.8.0","score":2,"title":"Requires more gadgets I don’t have","text":"Requires a lot of gadgets I don’t have to work best.  Manual input is possible but Apples Health app has that.  Wish I hadn’t been forced to give all my personal data before I found out","updated":"2019-03-03T08:42:22-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5669283358","userName":"PhoneGui","userUrl":"https://itunes.apple.com/us/reviews/id35441140","version":"3.11.0","score":1,"title":"iHealth MyVitals and Pulse Oximeter PO3","text":"Why do I have to set up an account to use this app?\n\n I realize it's only PulsOx but my medical information only needs to be on the oximeter and in my phone, nowhere else. There should be no *need* to tie the PO3 device to an account to use the app. \n\nI should be able to at least record my information PulsOx in the app without creating an account.\n\nFortunately the PO3 is functional without the app, and that's how it'll go.","updated":"2020-03-16T10:39:30-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"4297603859","userName":"Miki Martini","userUrl":"https://itunes.apple.com/us/reviews/id206171183","version":"3.10.1","score":2,"title":"No customer service","text":"I loved the BP machine, and loved that I could email my results to me Dr.     then something happened and I could no longer email.  I tried numerous times to get help and no one called or emailed me. Absolute NO help.","updated":"2019-06-10T17:47:11-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"4934552390","userName":"Sencilla","userUrl":"https://itunes.apple.com/us/reviews/id39525112","version":"3.10.4","score":1,"title":"Privacy Fail","text":"This is my private personal health information. Why do I need to create an account tied to my email address? Why does iHealth want my data?? iOS has lots of ways to share app data without needing to have iHealth act as a man-in-the-middle.","updated":"2019-10-12T15:36:10-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6551631000","userName":"AmandaMeiklejohn","userUrl":"https://itunes.apple.com/us/reviews/id86596917","version":"3.11.6","score":1,"title":"Crashes every time I open","text":"Literally can’t get past the main page. I have an iPhone 10 that’s fully updated. This app is frustrating.","updated":"2020-10-19T07:12:28-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1631223942","userName":"J-L B","userUrl":"https://itunes.apple.com/us/reviews/id30328011","version":"3.5.2","score":3,"title":"Shopping Cart","text":"That silly app bar gets all in the way when trying to fill my info in.","updated":"2017-06-02T01:02:44-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1870460149","userName":"rabidracer","userUrl":"https://itunes.apple.com/us/reviews/id21598177","version":"3.5.2","score":1,"title":"Scale is ok, app is horrible","text":"Wish I could just sync the scale to the Apple health app directly\n\nPlus I paid actual money for the scale, yet it only works if I create an account on this app. Why?\nWould have been nice to know they cull user data prior to purchasing the hardware.","updated":"2017-10-23T18:33:38-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"7078582232","userName":"ZafNZ","userUrl":"https://itunes.apple.com/us/reviews/id118577622","version":"3.11.9","score":1,"title":"Definitely does collect data","text":"Despite the privacy policy statement, the app requires an account with all your vital stats (age, height, gender, etc), all linked to your email.  Pretty disgusting they collect this information.","updated":"2021-03-07T23:31:02-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"4795775262","userName":"PilotGeek","userUrl":"https://itunes.apple.com/us/reviews/id20534093","version":"3.10.1","score":2,"title":"Need Apple Watch app","text":"Why not allow us to operate our BP device from our Apple Watch? At least to turn it on! Should have access to records, too. Seems like a no-brainer.","updated":"2019-09-17T06:38:12-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2500930569","userName":"Satisfied Mom1984","userUrl":"https://itunes.apple.com/us/reviews/id333362497","version":"3.6.2","score":1,"title":"My Health data does not sync to the app.","text":"I tried following the instruction on the FAQ on syncing the data but i did not see any option called ‘sync data’ under the weight section. I only saw, Filter data and Manual input. Pls assist","updated":"2018-05-03T12:57:18-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6185878838","userName":"Password reset frustration","userUrl":"https://itunes.apple.com/us/reviews/id465776493","version":"3.11.4","score":3,"title":"Doesn’t recognize PT3 iHealth Thermometer","text":"I bought the iHealth PT3 Thermometer just so I can track everything in one place \nBP\nOxygen \nTemperature\n\nThe app will only work with older generation Thermometer. \nAnd I’m going to be forced to do it all manually.  Why buy the iHealth products if the organizer app doesn’t sync your records.","updated":"2020-07-11T09:36:25-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5978432345","userName":"Ckr1234","userUrl":"https://itunes.apple.com/us/reviews/id196213982","version":"3.11.3","score":1,"title":"Last update makes this useless","text":"I’ve been using this app for years with the BP cuff. Today after the latest update it tells me I must purchase the app in the App Store. What’s that about.","updated":"2020-05-22T02:52:45-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6934348064","userName":"GregMcHenry","userUrl":"https://itunes.apple.com/us/reviews/id43353087","version":"3.11.9","score":2,"title":"Repeatedly Crashing App","text":"When pairing the app repeatedly crashes without taking any readings. Useless if this is a persistent problem!","updated":"2021-01-30T17:10:38-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6861958343","userName":"$&:);$:&3&!4&2'","userUrl":"https://itunes.apple.com/us/reviews/id301928513","version":"3.11.8","score":3,"title":"iPhone 12","text":"Won’t connect via Bluetooth with IPhone 12","updated":"2021-01-12T10:41:30-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6108523547","userName":"McIFI","userUrl":"https://itunes.apple.com/us/reviews/id154867649","version":"3.11.3","score":1,"title":"Worst “update” ever.","text":"Do you have any quality control? This “update” rendered useless my app. It keeps asking for the same user data and “creates” user profiles every time I start the app 😑","updated":"2020-06-22T07:23:15-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5735659494","userName":"Psjoe123","userUrl":"https://itunes.apple.com/us/reviews/id222106756","version":"3.11.1","score":1,"title":"The App Does not Working Well","text":"When it works, it’s great. The problem is that the App is unreliable and frequently can’t connect to the monitor. I echo the thoughts of the other negative reviews — please fix the app. \n\nThx,\n\nPat","updated":"2020-03-30T06:05:17-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2653601849","userName":"Ahncbvf","userUrl":"https://itunes.apple.com/us/reviews/id49525228","version":"3.7.1","score":2,"title":"Will not work in airplane mode","text":"Went on a 7 day cruise and had to leave my cell in airplane mode with Bluetooth on and the app will not work make this app work when in airplane mode","updated":"2018-06-06T20:58:25-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1718986280","userName":"mm_17_88","userUrl":"https://itunes.apple.com/us/reviews/id128297917","version":"3.5.2","score":1,"title":"Confused on use","text":"I'm so confused on the use of this app. Apparently it doesn't work with an iwatch I'm gathering. Also it doesn't track steps unless you buy their product? Is this not an apple app? Can someone please tell me if I'm misunderstanding?","updated":"2017-08-08T12:18:59-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"7163709631","userName":"Foxtrot_Alpha","userUrl":"https://itunes.apple.com/us/reviews/id266073230","version":"3.11.9","score":1,"title":"This App is Data Thief","text":"This App requires registration and then ships your personal data off to it’s servers. You can not use ihealth  products without agreeing to give them your data.","updated":"2021-03-30T13:41:42-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6741539680","userName":"Bossbabe1987!","userUrl":"https://itunes.apple.com/us/reviews/id433031978","version":"3.11.7","score":1,"title":"Bugs","text":"I’ve been kicked out of the app all week it won’t update anything from my scale. Even after turning my phone on and off. Help.","updated":"2020-12-11T07:13:51-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2388651954","userName":"Smoothballs","userUrl":"https://itunes.apple.com/us/reviews/id4959237","version":"3.6.1","score":1,"title":"App does NOT integrate to Apple health at all.","text":"Got a blood pressure cuff. Syncs fine with the iHealth app. However, no data will sync to Apple health, despite the integration being listed. It’s fun to literally watch my blood pressure rise while simply trying to use a poorly implemented app.","updated":"2018-04-05T18:29:31-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6050910194","userName":"Simonebear","userUrl":"https://itunes.apple.com/us/reviews/id23127407","version":"3.11.3","score":1,"title":"Having trouble","text":"The time and dates are all wrong on the app. Sorry to put this here. I didn’t get a response from support. I weighed myself at 8am today and it says 12:49am I have the Vista scale.","updated":"2020-06-08T06:56:43-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6048374690","userName":"doug_1963","userUrl":"https://itunes.apple.com/us/reviews/id1077285042","version":"3.11.3","score":4,"title":"Report crashing","text":"Afternoon,\n\nWhen trying to import a medical record the app crashes every time I tap select medical record type. \nFeedback within app not letting me send.\n\nSuggestions?","updated":"2020-06-07T14:50:48-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5420510258","userName":"TexasEngineer","userUrl":"https://itunes.apple.com/us/reviews/id4028698","version":"3.10.7","score":1,"title":"The app hangs and just doesn’t work","text":"I installed  the app on my Apple 6s plus and it just hangs after I enter my data.\nThe Done button is not functioning.","updated":"2020-01-18T13:27:16-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5425405559","userName":"Tee46@1973","userUrl":"https://itunes.apple.com/us/reviews/id1009223254","version":"3.10.7","score":2,"title":"Other App Connection","text":"This is a very limited app and it does not support connecting to the other apps it states it does support.","updated":"2020-01-19T18:14:15-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5293417402","userName":"Buttercup101010","userUrl":"https://itunes.apple.com/us/reviews/id130594012","version":"3.10.7","score":1,"title":"iPhone upgrade.","text":"I upgraded from a 6 to a 11 iPhone and now I can’t sync  my steps on my Noom app.  I was told by Noom coach to get iHealth and doesn’t work at all!! Frustrated. IHealth does nothing. Frustrating","updated":"2019-12-19T17:40:26-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"3393843827","userName":"kendricha","userUrl":"https://itunes.apple.com/us/reviews/id255892618","version":"3.8.0","score":1,"title":"APP install fails","text":"I downloaded the app, installed it, set up an account, at the end of set up, you have to agree to their terms and conditions in touch OK be OK is always great out and won’t let me finish the account set up…","updated":"2018-11-08T00:25:17-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"4976387405","userName":"Booze Brothers","userUrl":"https://itunes.apple.com/us/reviews/id29614375","version":"3.10.4","score":1,"title":"Asks for my email password. No reason for this.","text":"Invasion of privacy. Imagine them reading every email you have. That’s what they’re doing if you supply your email password","updated":"2019-10-19T07:31:25-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"4894632953","userName":"Jon loves theater","userUrl":"https://itunes.apple.com/us/reviews/id296373453","version":"3.10.4","score":5,"title":"J","text":"I would love to see this when is popped up","updated":"2019-10-05T16:17:32-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"8143506710","userName":"thebayougirl","userUrl":"https://itunes.apple.com/us/reviews/id157622000","version":"3.11.16","score":1,"title":"Do not recommend","text":"Clunky interface, horrible settings","updated":"2021-12-18T07:30:02-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1068766908","userName":"inflatabill","userUrl":"https://itunes.apple.com/us/reviews/id35834645","version":"1.2.2","score":3,"title":"Entering data is annoying in manual mode","text":"I use this app to track my weight, fat, and blood pressure.  I don't have any of the iDevices, so I enter all the data manually.  What I find troubling about this app is that when entering the data, it doesn't use a numerical keypad, but uses these annoying numerical dials instead, making data entry take so much longer than it needs to.  I wouldn't be so bothered if the dials started each entry with their previous value, but they either reset to zero, or start with some random number.  Why must we be forced to dial in every number, when a keypad is so much quicker?\n\nOtherwise, everything else seems to work like it should.","updated":"2014-09-22T16:34:35-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5456462296","userName":"silkysmom","userUrl":"https://itunes.apple.com/us/reviews/id30236667","version":"3.10.7","score":2,"title":"Not sure why this is an app on iPhone","text":"This app does not sync with the iPhone or Apple Watch to track steps.","updated":"2020-01-27T15:39:35-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5162683209","userName":"philokoli","userUrl":"https://itunes.apple.com/us/reviews/id419267710","version":"3.10.5","score":1,"title":"Crashes when logging in","text":"Every time I try to sign in, it automatically crashes on me.","updated":"2019-11-17T21:24:07-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5170507779","userName":"Liz8100","userUrl":"https://itunes.apple.com/us/reviews/id339443983","version":"3.10.5","score":1,"title":"Really bad","text":"I try to connect my ihealth device via bluetooth to check my blood pressure and the app closes alone!  do something !!","updated":"2019-11-19T17:48:47-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"3101251908","userName":"Honopnco","userUrl":"https://itunes.apple.com/us/reviews/id138807388","version":"3.7.2","score":1,"title":"Won’t Connect","text":"Have tried a number of times to connect with Bluetooth, just won’t work despite following the troubleshooting procedures!","updated":"2018-08-22T18:23:45-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6847185423","userName":"Buckwinn","userUrl":"https://itunes.apple.com/us/reviews/id24100312","version":"3.11.7","score":1,"title":"Laughably bad","text":"Just read the reviews of their products and how they treat their customers and you won’t even need this app!","updated":"2021-01-08T17:03:50-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5898048097","userName":"GGT2970","userUrl":"https://itunes.apple.com/us/reviews/id106345021","version":"3.11.1","score":1,"title":"POOR response from App to device","text":"The App says the device is synced yet it fails to work 90% of the time. Feels like I waited my money and time. This is junk ! ! !","updated":"2020-05-03T09:02:58-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5175451207","userName":"bjjhjhjj","userUrl":"https://itunes.apple.com/us/reviews/id132700504","version":"3.10.5","score":1,"title":"Cannot connect device on IOS in latest version of software","text":"Health is important and to some critical and this is so fundamental.","updated":"2019-11-20T22:30:20-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6518607771","userName":"kcousins","userUrl":"https://itunes.apple.com/us/reviews/id40677017","version":"3.11.6","score":1,"title":"Crashes on login","text":"This app is utterly useless—it crashes every single time I try to log in.\n\nCompletely useless.","updated":"2020-10-09T17:23:48-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2639105728","userName":"Kyle8901","userUrl":"https://itunes.apple.com/us/reviews/id297663848","version":"3.7.0","score":1,"title":"Don’t bother","text":"With the time it takes to connect you could drive to the doctor and back 6 times to get checked.","updated":"2018-06-03T23:07:23-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6362799844","userName":"11111111dk","userUrl":"https://itunes.apple.com/us/reviews/id39313667","version":"3.11.6","score":1,"title":"App keeps crashing","text":"The monitor can’t be used as the app just closes every time I try to open. Terrible","updated":"2020-08-26T05:29:57-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"8037068912","userName":"veggiedude","userUrl":"https://itunes.apple.com/us/reviews/id24329855","version":"3.11.15","score":1,"title":"No Apple Watch support","text":"I tried to set this up with my watch but it lists various trackers, no Apple Watch. So I had to immediately delete the app.","updated":"2021-11-18T06:24:08-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5932252274","userName":"PinkRoses56","userUrl":"https://itunes.apple.com/us/reviews/id555857057","version":"3.11.1","score":2,"title":"Worthless","text":"Terrible app.  Cannot sync with Apple Health.  Cannot enter your daily meals.  Completely worthless app!!!","updated":"2020-05-11T09:32:37-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"3004033785","userName":"Big L Hou","userUrl":"https://itunes.apple.com/us/reviews/id681023111","version":"3.7.2","score":1,"title":"Very Disappointed","text":"I thought I could use the major brands of blood pressure monitors, scales, etc.\nNo! You have to start from scratch and buy theirs. Thanks anyway.","updated":"2018-08-01T21:40:37-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6601457776","userName":"JudeRanch","userUrl":"https://itunes.apple.com/us/reviews/id41277863","version":"3.11.6","score":1,"title":"iOS update 14 problem","text":"Since I updated my iPhone the BP7 no longer appears in my Bluetooth. Help!","updated":"2020-11-02T08:08:06-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6507295232","userName":"Cindysdj","userUrl":"https://itunes.apple.com/us/reviews/id350545114","version":"3.11.6","score":1,"title":"Can’t log in","text":"App keeps crashing every time I try to log in.","updated":"2020-10-06T10:15:52-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6157859281","userName":"Globalbrander","userUrl":"https://itunes.apple.com/us/reviews/id32549225","version":"3.11.4","score":1,"title":"Do not buy’","text":"Battery stopped charting. Complained to iHealth weeks ago. No reply. The do not support their products.","updated":"2020-07-04T14:26:51-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"3211997440","userName":"i dont understand why nickname","userUrl":"https://itunes.apple.com/us/reviews/id531509671","version":"3.7.2","score":1,"title":"Never connects","text":"This never connect to Bluetooth. I have to forget it each time to use the app. It’s very frustrating but the scale is top notch","updated":"2018-09-20T20:05:13-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5972467438","userName":"Kentanner11","userUrl":"https://itunes.apple.com/us/reviews/id34192134","version":"3.11.2","score":1,"title":"Bind Fail 500","text":"Tried to create an account and am getting an error “Bind Fail 500” can’t do anything else...","updated":"2020-05-20T18:17:42-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6834435942","userName":"Fred Basha","userUrl":"https://itunes.apple.com/us/reviews/id489096177","version":"3.11.7","score":1,"title":"Doesn’t work with Apple Watch","text":"Waste of time if you own an Apple Watch","updated":"2021-01-05T09:14:45-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6782489646","userName":"....Rob....","userUrl":"https://itunes.apple.com/us/reviews/id36984050","version":"3.11.7","score":1,"title":"Insists on location","text":"App won’t let me set up my scale unless I share my location. Useless.","updated":"2020-12-22T13:15:33-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5151785015","userName":"Cody Bartlett Heisinger","userUrl":"https://itunes.apple.com/us/reviews/id174575084","version":"3.10.4","score":1,"title":"Won’t setup","text":"Registration asks for email again. No input. Good luck setting up an account.\nThat’s all I have to say. \nBaaaaaaaadddddddd","updated":"2019-11-16T09:39:59-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6814772037","userName":"dhwuh","userUrl":"https://itunes.apple.com/us/reviews/id144220623","version":"3.11.7","score":1,"title":"Poor accuracy","text":"Weight, BMI are correct & operationally it works well with the IHealth Nexus scale. But, the body fat, bone mass, body water & VFR estimates are way off","updated":"2020-12-31T08:22:31-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6595914295","userName":"CalmovitaPhoto","userUrl":"https://itunes.apple.com/us/reviews/id447324490","version":"3.11.6","score":2,"title":"Unusable","text":"All ihealth apps crash in ios14 please fix it is unusable","updated":"2020-10-31T20:38:15-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"4534326740","userName":"Srkd","userUrl":"https://itunes.apple.com/us/reviews/id170985141","version":"3.10.1","score":1,"title":"Network error (999)","text":"Unable to create account because of this error.","updated":"2019-07-28T17:54:33-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2947427981","userName":"James Vader 74","userUrl":"https://itunes.apple.com/us/reviews/id325206807","version":"3.7.2","score":1,"title":"Doesn’t accept data from Apple Watch?","text":"Really?????? Stupid app doesn’t recognize an Apple Watch!","updated":"2018-07-21T22:05:45-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2030193990","userName":"Ramy C","userUrl":"https://itunes.apple.com/us/reviews/id248695302","version":"3.6.1","score":5,"title":"Great app. I love it it is a life saver for me","text":"Great app life saver good companion \n\nSava","updated":"2017-12-26T14:49:02-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2497181245","userName":"Totalscammers","userUrl":"https://itunes.apple.com/us/reviews/id517066083","version":"3.6.2","score":1,"title":"Doesn’t work with Apple Watch?","text":"Does not work with Apple Watch? Terrible","updated":"2018-05-02T13:59:44-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2949224914","userName":"Swblazer","userUrl":"https://itunes.apple.com/us/reviews/id216756063","version":"3.7.2","score":1,"title":"No sync","text":"Therefore no setting beyond download that allows you to sync. It became a useless app.","updated":"2018-07-22T05:57:48-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5173658961","userName":"M005370","userUrl":"https://itunes.apple.com/us/reviews/id596909355","version":"3.10.5","score":1,"title":"Can’t use","text":"Keeps force closing iPhone X","updated":"2019-11-20T10:48:53-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"4110969003","userName":"Yvesvilla","userUrl":"https://itunes.apple.com/us/reviews/id105871973","version":"3.10.1","score":1,"title":"Not comparable with Apple Watch","text":"On the activity tracker why is Apple Watch not a compatible???","updated":"2019-05-06T14:23:29-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"3713310926","userName":"Davhut64","userUrl":"https://itunes.apple.com/us/reviews/id47654332","version":"3.8.0","score":1,"title":"App needs help","text":"App keeps showing error... Good idea but needs help.","updated":"2019-01-30T09:32:21-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"3313824285","userName":"TKay740","userUrl":"https://itunes.apple.com/us/reviews/id586207979","version":"3.8.0","score":1,"title":"I health","text":"I purchased a iHealth Lina HS2. It will not pair to the app. That was the entire reason I purchased this scale and it will not work.","updated":"2018-10-17T17:22:05-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"7994909352","userName":"Trnyii","userUrl":"https://itunes.apple.com/us/reviews/id463322041","version":"3.11.15","score":1,"title":"Access and setup","text":"Definitely never trying again BLUETOOTH I WOULD NEVER USE AND EMAIL REQUIREMENT NOPE I WOULD STICK TO USING MY DEVICES name APPS.","updated":"2021-11-06T05:58:31-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2058425374","userName":"Vidkidd","userUrl":"https://itunes.apple.com/us/reviews/id42081885","version":"3.6.1","score":1,"title":"App is not ADA compliant","text":"Light grey fonts and charting elements used in the app violate ADA text readability requirements for visually disabled individuals.  \n\nIt makes reading the screen unnecessarily difficult with my glasses.  Y  \n\nMeeting FDA guidelines for the hardware is nice.  \n\nFailing to meet ADA guidelines is a joke.","updated":"2018-01-04T22:55:42-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1801344147","userName":"Milecomex","userUrl":"https://itunes.apple.com/us/reviews/id155715788","version":"3.5.2","score":1,"title":"Not 11.0 ready","text":"Does not sync with devices","updated":"2017-09-20T23:27:55-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2312814202","userName":"Xyzzyrcjl","userUrl":"https://itunes.apple.com/us/reviews/id269936956","version":"3.6.1","score":1,"title":"Bob","text":"Do not want to share data on cloud!!!","updated":"2018-03-16T10:05:09-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5914776369","userName":"Mezzz2908","userUrl":"https://itunes.apple.com/us/reviews/id187191801","version":"3.11.1","score":1,"title":"Iwatch","text":"When will iHealth sync with my iWatch?","updated":"2020-05-07T06:16:18-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"974023142","userName":"Chris123451","userUrl":"https://itunes.apple.com/us/reviews/id10761073","version":"V1.2.0","score":1,"title":"DO NOT BUY - GET A FITBIT INSTEAD","text":"I bought this since I decided to start getting back in shape and trying a pedometer to help.  With the fitbit becoming so popular I loved that the iHealth Activity Monitor also tracked sleeping as well and was at a price easy to afford.  I set up after charging pretty easy.  I downloaded the app and setup my account.  I attempted to sync after the first day and found that my data did not transfer and it cleared my monitor.  I gave it another day of using it and it synced fine at the end of the day with no errors.   I thought it was great!  I woke up and put it on for the day since I hadn't gotten it figured out for sleeping yet.  That morning I had a blast of junk mail in my email. When I came home to try to sync it to the app the app told me my account had been deleted.  I had to setup my account again.  I tried to sync and all of the sudden the monitor was not connecting via Bluetooth.  I reset the device and uninstalled and reinstalled the app with no luck.  Since I had this thing for not even a week I am taking it back to where I purchased and will invest in a fitbit.  Obviously they figured out how to make consistent products with trust worthy apps.  This iHealth monitor and app are garbage.  Don't waste your money!!!","updated":"2014-04-08T20:43:35-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"725249319","userName":"Jorist2","userUrl":"https://itunes.apple.com/us/reviews/id133995348","version":"1.1.1","score":1,"title":"This app misses the mark","text":"The previous IHealth App for Blood Pressure worked like a charm. It had: Nice colorful graphs, Large easily readable fonts and graphs, and  Intuitive navigation.\n\nThis App: appears to have removed most all of the graphs, removed almost all of the color (now almost completely blue and white making it hard to easilty identify \"good, at risk, and bad\" results), Decreased the size of the fonts so that the text is more difficult to read (especially on an IPhone), and the navigation is not quite as intuitive as the previous app.\n\nThis app has tranisitioned into what I feel is nothing more than a glorified number tracker. I could use a spreadsheet and do the same thing with better results. The previous App was informative. The graphs and charts were useful in understanding and monitoring my BP\n\nThe only positives that I have found with regard to this app is that it combines the Blood Pressure and Weight monitoring into a single location and allows access to the information through multiple devices (web, iphone, ipad, etc.) Additionally, it can be used without purchasing the IHealth scale or BP devices. Finally, there appears to be a section that allows for goal setting and calorie monitoring. I have not used these parts yet.\n\nIn general I have been disappointed with the state of the current app. If IHealth would address some of these issues I would gladly reconsider this review and rating. Until then I can only give this app one star.","updated":"2013-01-08T04:22:23-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"729166153","userName":"HeliGal","userUrl":"https://itunes.apple.com/us/reviews/id34358431","version":"1.1.1","score":2,"title":"Extremely disappointing","text":"I updated to this version of the iHealth app when I received a compatible scale for Christmas. I was immediately disappointed because I could not import my existing blood pressure data into the new app. Later, when I began using the scale, I was also disappointed to learn that I would have to manually connect (with Bluetooth) the scale to my phone every time I wanted to weigh myself. The app is buggy, it frequently crashes, and it is not intuitive. The calorie log portion of the app is nearly useless because it has no scanning feature and no easy way to enter foods that you eat often or foods that are packaged. It seems to me that this app was released before it was ready to go. It's a shame that the makers of the app didn't do a better job and get it right before releasing it to the public. One final word: if your purchase decision for the scale or the blood pressure monitor are based upon the usability of this app, don't buy.","updated":"2013-01-14T06:18:51-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1295749074","userName":"Transit Traveler","userUrl":"https://itunes.apple.com/us/reviews/id229810670","version":"3.1.7","score":5,"title":"First Class Medical, Again","text":"Most of the negative iHealth MyVitals app are inaccurate, these are people not willing or patient enough to understand the simple protocol of using the iHealth devices. 1) You open the iHealth MyVitals app first, do nothing more. 2) Then turn on your iHealth Bluetooth device, and, then, 3) select that device within the MyVitals app, the Bluetooth pairing is immediate and the vitals/data recording is accomplished, instantly. The “old” MyVitals app is the same as the “new”, unchanged except for format size. The “new” app displays better on larger format devices, i.e. Apple’s iPad Pro, the “old” is easier to read on a much smaller screen, granted. If you’re not monitoring your health with iHealth Labs provisions (app & devices) and going for a walk, you’re missing out in promoting your own good health!","updated":"2015-12-04T07:37:28-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1128001738","userName":"Ob72","userUrl":"https://itunes.apple.com/us/reviews/id133630489","version":"1.3.5","score":4,"title":"No Problem with my iPad 3","text":"I have been using the cuff with my iPad 3 with no problems whatsoever.  It has been 6 months now and the app has conveniently stored all of my data with no losses.  I do have to re-pair the two in occasion, but that happens with all of my Bluetooth devices and I can't say Apple updates aren't to blame.  I love that the cuff holds a charge forever.  I have only had to charge it 2 times in 6 mos.  The app is very user friendly.  You can even add notes on each test to really narrow down that event or meal which elevated your bp.  I am looking forward to connecting my activity tracker to it.  Common sense tells me that I would save myself a headache trying to use this app and equipment with a newly develop device like my iPhone 6+ until the bugs are worked out.","updated":"2015-01-10T23:02:38-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1328574106","userName":"DrDisneyFan","userUrl":"https://itunes.apple.com/us/reviews/id28387463","version":"3.2.2","score":5,"title":"Nice update!","text":"This app is wonderful. There are so many devices available, and it easily syncs with your other health apps including the native health app. You can even upload your data to get reward points a Walgreen's! I have recommended this app and the various devices to my patients as a Family Physician. They can upload their data into my medical records system so that we can keep track. This decreases the number of times a patient has to visit, and increases compliance with required home vitals checking. I can also trust the automated devices because they are all standardized, and it mostly eliminates human error. I highly recommend this system, you won't regret it!","updated":"2016-02-05T22:28:59-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"809688695","userName":"mZgaljic","userUrl":"https://itunes.apple.com/us/reviews/id106885376","version":"V1.1.6","score":4,"title":"Noticeable improvement/change!","text":"UPDATE-----------------------------------\nThe all was just updated to support the iPhone 5 and it is much more pleasing on the eyes. I can tell some work has been going into this App! This is very nice to see :)   Unfortunately the app still has a funky design layout, but the improvement is pretty big! So I'm increasing my rating to 4/5 stars. \n\nOld-----------------------------------------\nProduct works great, but the app looks atrocious. Okay not atrocious...but for a $70 BP monitor you'd think they could at least make an app that is iPhone 5 optimized. Unfortunately this is a review of the app, not the product. Regardless, the app is not exactly clean, and it has a lot of pointless buttons. The app needs a new cleaner interface, and it needs to be iPhone 5 optimized big time. The withings app is much nicer, and frankly if somebody is buying a BP monitor with the key feature being \"iPhone app sync\", they will be embarrassed once they see this app. Yes, the functionality is there but it's dreadful to use. Especially with every other app on my iPhone 5 looking much better than this one.\n\nIf this app is updated I'll update my review.","updated":"2013-05-24T08:05:49-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"980229914","userName":"usk420","userUrl":"https://itunes.apple.com/us/reviews/id390231571","version":"V1.2.0","score":4,"title":"Works, could be much better","text":"While it basically works OK, it has some shortcomings: 1) too easy to delete a new BP measurement by mistake, only 1 tap with no request to confirm. 2) only way to exit after adding a note to a measurement is to tap Cancel—which is misleading, as it doesn't in fact discard your note. 3) needs too many taps for the most common use-case of taking a new BP reading—having detected a connected BP device, it should default to taking a new reading. Also, a comment about the iHealth BP3 device's charge-indicator LED: 1) it looks too much like an ON/OFF switch and confuses some users. 2) it goes suddenly from green (charged) to not having enough juice to take a reading, instead of turning yellow to show low battery.","updated":"2014-04-20T10:10:40-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"987381784","userName":"Livlettte","userUrl":"https://itunes.apple.com/us/reviews/id28260785","version":"V1.2.1","score":2,"title":"Wheres the SpO2?","text":"I bought the bp cuff and SpO2 monitor for my mother… I am really, really disappointed to find that these two devices can’t be tracked in the same app!  How can an app titled “MyVitals” not include a vital sign such as SpO2?  It’s hard enough to ask my parents to track vital signs digitally at home, it’s that much worse to make them juggle so many different apps (they have a fitbit scale).  All these apps not talking to each other is horrible- it’s a repeat of the problems hospitals and doctor's offices with their technology not being compatible. Also,  I have I’ve looked online, and can’t find any reference to the SpO2 function being put into the app soon.  I’d at least like them to be honest about things, not just cover over the fact that they’re missing such a logical feature.","updated":"2014-05-03T21:47:01-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1542545266","userName":"deemurray","userUrl":"https://itunes.apple.com/us/reviews/id205779762","version":"3.4.2","score":4,"title":"Very good NSI","text":"Small attractive well packaged and well priced\n\nLinked flawlessly with my iPhone on many tries. At first the heart rate was substantially low. 10 points below my measured pulse rate. This has corrected now. My BP's are taken quickly with quick recycle time. Reading display is excellent. The major flaw is the trend display where there's no scale and limited duration. Program would be much better if it gave average pressures and gave a good long-term display. ( I'm a cardiologist and recommend many BP home monitors and programs like Omron cuffs and I-BP which are my favorites still. But with a little software improvement this could be the one !\nDR","updated":"2017-02-11T18:04:04-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"698289687","userName":"LokiHiFi","userUrl":"https://itunes.apple.com/us/reviews/id27714144","version":"1.1","score":2,"title":"ok but very buggy","text":"The scale worked ok when we first opened it, but only connected with one iOS device at a time. We have an iPhone and iPad 2 and want to use both but the scale only recognizes one at a time. This means you have to disconnect one device to connect the other, not a simple process.\n\nI emailed customer support who responded quickly but were not very helpful. I had to explain the problem multiple times, with each time them telling me I could use both devices at the same time. When clearly I couldn't. I eventually gave up as they had no suggestions or solutions other than repeating the instructions.\n\nSo we've been using the app on one device however it started recording my wife and my weights under the same account (it was tracking them separately previously) so I tried to change devices this evening and now it won't connect to any device. Very annoying.\n\nAs a scale its weight measurements has ben pretty accurate. BMI has been pretty consistent for me, but all over the place for my wife.\n\nGreat idea but for $120 it should perform a whole lot better.","updated":"2012-11-26T19:38:39-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1387585783","userName":"Desertbees","userUrl":"https://itunes.apple.com/us/reviews/id47670267","version":"3.3.5","score":1,"title":"Huge disappointment.","text":"Been using the previous version for over a year with a BP monitor and was very satisfied. Recommended the app and BP monitor to a lot of people as I sell medical equipment. \n\nJust upgraded and newest version crashes, locks up, and fails to record. Bluetooth has to be restarted constantly and have to restart the app. If I am lucky I can get one reading a day. I am supposed to record 4 times a day. Very, very buggy application. \n\nPeople will rely more and more on medical apps to help self monitor their own health. Releasing new versions of health care software that people count on, before it's ready, especially when a previous version worked just fine is a great way to put yourself out of business but more importantly, to put peoples' health at risk. Very disappointing.","updated":"2016-06-01T19:29:47-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1117703269","userName":"b62ad","userUrl":"https://itunes.apple.com/us/reviews/id28207363","version":"1.3.5","score":3,"title":"Works on iPhone 4S but not on the 5S","text":"I was starting to get annoyed with this app along with iHealth MyVitals 2.0 because both would freeze and become useless I also have the Wireless Blood Pressure Wrist Monitor which would stop working during the middle of testing and displayed the solid red square indicator on top meaning \"Abnormal state\" according to the manual.  Neither App works with my iPhone 5s I even did a complete restore on the 5s. Then I decided to try my old iPhone 4s and surprisingly it works just fine.","updated":"2014-12-22T17:32:18-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1323279604","userName":"Guy Guerra","userUrl":"https://itunes.apple.com/us/reviews/id33246523","version":"3.2.0","score":5,"title":"Excellent system!","text":"I have had this for a year and it is perfect. In the first year I used the wrist blood pressure cuff and the weight scale. Both worked great with my iPhone 6. I had a stroke in early December and my cardiologist wanted me to use an arm cuff so I ordered one. The blue tooth connection was simple. I've also changed along with their app updates and haven't had any problems. I love this setup and would never go back to a regular analog blood pressure or weight measurement device again. I have not used the exercise wrist device so I can't advise on that.","updated":"2016-01-27T06:37:55-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1445565987","userName":"Aston15","userUrl":"https://itunes.apple.com/us/reviews/id16123667","version":"3.3.8","score":2,"title":"User unfriendly and intermittent.","text":"Bought BP cuff, weight scale and oxipulse. Each device requires a different procedure to communicate with MyVitals. The weight scale requires two steps, the BP cuff requires four.   The awkwardness of the the interfaces, inconsistency between device procedures, and the sometimes iffy auto-pair Bluetooth technology are significant challenges to ease of use. The app's UI is rather complicated as well. After spending a half hour with a support tech, I ironed out some of these hurdles. The tech admitted that Bluetooth technology is by its nature imperfect and prone to hiccups, but I've had few problems with BT earphones, car interfaces, or keyboard/mice.  Admittedly, the iHealth devices are more complex, but ultimately usability depends on ease of use.  IHealth has a ways to go.","updated":"2016-09-06T11:53:40-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1267057215","userName":"Maxheadspace","userUrl":"https://itunes.apple.com/us/reviews/id176927899","version":"3.1.6","score":5,"title":"Set-up a Breeze","text":"First time user. Seeing all the negative feedback, I was a bit apprehensive. But the app on my iPhone 6 connected immediately to my HS5 iHealth body scale and all my readings went straight to the Health app, which is what I use for tracking. I created an iHealth account for my wife, and as soon as she stepped on the scale it registered her as \"user 2\" and logged her data separately to her iPhone 5. It's important to follow the details in the setup instructions, both for the peripheral device and for the app. Works great for me.","updated":"2015-10-04T15:25:31-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1040092042","userName":"Not healthy","userUrl":"https://itunes.apple.com/us/reviews/id123760090","version":"V1.2.1","score":1,"title":"Awful app","text":"This app is awful.  I would give it zero stars but that is not an option.  I have the BP monitor and the scale.  It rarely connects to the scale and when it does connect, it rarely saves the data.  It is not user friendly and is difficult to navigate.  Manual entry is slow and cumbersome.  You will need the manual entry since it is so poor at connecting and recording the data.  Manual entry uses scroll wheels, which are slow and tedious when compared to entering data with a pop up numerical keypad.  The old version of the BP app is much better since it uses the numerical keypad for entering data.  This app is a huge step backwards when compared to the previous iHealth BP app.  In conclusion, this app is awful!","updated":"2014-08-03T11:34:27-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1126299818","userName":"FilmMusicPro","userUrl":"https://itunes.apple.com/us/reviews/id147305434","version":"1.3.5","score":1,"title":"Congratulations, managed to break it","text":"This current version no longer works with my BP monitor under iPhone 6/iOS8.1.1. The developers managed to break the app as it did work with the previous iHealth version. In the Bluetooth setting, the BP monitor is listed at the bottom (in the not connected, no info \"i\" button present; no way to hit \" forget about this device\") and I can't get the device to be listed in the \"recognized list\", let alone have it connect to BT. No matter what, it keeps telling me \"the device needs to be within range...\" while I have the BP monitor within a few inches from the phone. Back to the drawing board to please figure out where you steered off.  Thanks.","updated":"2015-01-07T16:54:21-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1396408170","userName":"Cellyoulightus","userUrl":"https://itunes.apple.com/us/reviews/id201967287","version":"3.3.6","score":1,"title":"Useless as ever","text":"I have been using this application for a few years and have been \"working around\" it's bugs\" but to release a new version with \"increased health kit support\" ... if that means breaking the integration then you've accomplished that goal. NOTHING gets recorded to the HealthKit now. I relied on the various items I own such as the scale and blood pressure cuff to write to the HealthKit as I have automatically upload the info to my physician. now there's nothing. at least the glucometer still works, today. Guys, please get your act together. Withings is top notch and considered the gold standard. I will drop you off like a bad habit if you don't fix this once and for all.","updated":"2016-06-18T04:24:50-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"727292855","userName":"Mudlumps","userUrl":"https://itunes.apple.com/us/reviews/id32238153","version":"1.1.1","score":4,"title":"Innovative, convenient. Lots of potential.","text":"My need was simple; a convenient way to take and track my BP. It does a fine job of that. The BP screen uses a simple combination of data and graphics. The history and trends stored on my iPhone4 are super-convenient to identify patterns (e.g. times of day when it's higher) and have something to show the Dr during the annual physical exam.  I like it.  I'm sure the company will continue to evolve the UI as comments come in, but it easily hits my \"good enough to use\" bar as is.","updated":"2013-01-11T12:04:55-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"785509841","userName":"Joyful dancer","userUrl":"https://itunes.apple.com/us/reviews/id105580237","version":"V1.1.3","score":1,"title":"Doesn't keep it's sync","text":"I purchased the scale that is supposed to use this app and have only had problems.  The directions on how to sync the two are confusing. Also, once you get it figured out...it takes a few tries to get it to work even with the correct procedures...and finally things work nicely..Then...another all that trouble....they get disconnected and must be synced all over again. If you want to continually sync your scales with the app, then you'll love this.  But if you're like me and find it bothersome to manually enter the info or to manually sync the scale to the app...don't purchase either!","updated":"2013-04-10T08:07:07-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"736829926","userName":"Alaskacarp","userUrl":"https://itunes.apple.com/us/reviews/id104345748","version":"V1.1.2","score":1,"title":"Roller wheels","text":"It doesn't make much sense to be able to, with the roller wheels, change between kg(s), lb(s) and st in the body weight but not in food diary.  The food diary roller wheels only display the weight that you select for your body weight.  And I do know that you can go to settings and change settings.  I am always going to weigh myself in the same unit but when I am entering food sometimes it would be nice to be able to change the unit measurement without going to the settings.  For this reason I would hold off buying any of the accessories that can be used with this app until they fix this problem.","updated":"2013-01-25T17:03:44-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"694596188","userName":"App Reviewer 007","userUrl":"https://itunes.apple.com/us/reviews/id42401100","version":"1.1","score":1,"title":"I would not recommend this product!","text":"I found this this device is very inaccurate, I followed the directions and compared it with my doctors in-office device and the numbers signifiganly different. I attempted to contact iHealth 4 times during their regular busines hours to no avail, after hearing the lenghty recoreded message and pressing 1 to speak with support I was disconnected on each attempt. Lastly, no where in the directions or manual does it tell you to download a \"new\" app to sync the data and use the device I had to research it on my own. If you want to try this product this is the app you need to use: iHeath MyVitals","updated":"2012-11-20T10:31:59-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1058477720","userName":"Mrs.wynn","userUrl":"https://itunes.apple.com/us/reviews/id279556673","version":"1.2.2","score":3,"title":"It's ok!!!","text":"App would be even better if it linked up on its own and updated my activity and sleep that way. Bluetooth stays on yet I have to try over and over to sync my data. Not sure why it doesn't do it automatically. I also can not track anything I've eaten if it isn't given as an option to choose from. I'll stick with it for a little while to see how it goes. I hope they make improvements.","updated":"2014-09-03T10:57:11-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1068269583","userName":"MsMaxx","userUrl":"https://itunes.apple.com/us/reviews/id243697155","version":"1.2.2","score":4,"title":"A little effort and it works","text":"It takes a little work, but it works. Scale must be on solid floor, not carpet nor rug. It does connect to MyFitness Pal, however you must go online to completely set everything up for both. Haven't finish reading the manual, But figured most of this out by just reading the prompts as they popped up. I picked this over the Fitbit scale, and I'm happy with my selection. My scale/app are connected to my iPad mini.","updated":"2014-09-21T16:57:30-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"706692194","userName":"Scrappy4201","userUrl":"https://itunes.apple.com/us/reviews/id128152936","version":"1.1","score":5,"title":"Love it","text":"I've been using the original Health BPM app and just downloaded this. I only own the Blood Pressure Dock but now am considering purchasing one of their scales. This is a great tool for keeping track of all your Blood Pressure, Weight and Calorie intake all through one App. The App is also integrated with Evernote and sends over specialized notes of your results if you choose to.","updated":"2012-12-11T13:27:09-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"977622441","userName":"BevieAnnie","userUrl":"https://itunes.apple.com/us/reviews/id186306499","version":"V1.2.0","score":1,"title":"Can't use at all","text":"I bought this app after open heart surgery last year to keep track of my vitals to use with my iPhone 4. Could never get it to connect with the device. When I contacted customer support, I was told to \"clear my cache\" because of a \"network timeout\" message. Didn't help. I been bought a new iPhone 5 since I was due for a new phone anyway thinking that might help. Same problem. It's as if the monitor can't recognize my phone's Bluetooth signal. Complete waste of too many dollars and putting up with condescending emails from  useless customer support.","updated":"2014-04-15T16:14:08-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"920680425","userName":"Da kine fella","userUrl":"https://itunes.apple.com/us/reviews/id25979637","version":"V1.1.12","score":5,"title":"Worked great right out of the box","text":"I downloaded the app, turned it on, paired  it with Bluetooth and it's worked great every time. You don't even have to open up the app to use it. As soon as you turn on the device it pairs with Bluetooth and opens the app.  I've been keeping track of my BP for a number of years and this BP monitor seems accurate.","updated":"2014-01-05T09:17:32-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1614485237","userName":"merrellsj","userUrl":"https://itunes.apple.com/us/reviews/id37881534","version":"3.5.1","score":4,"title":"HS5 now showing incorrect body fat percentage","text":"After this update I've noticed that my body fat percentage is about 10% higher than before. I have another scale and it along with the Omron body fat analysis agree but the HS5 is off. Did this update change any firmware or functionality of the scale?\n\nEDIT: After the last update the body fat measurement returned to normal. Thanks for the quick fix.","updated":"2017-05-15T04:41:09-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1117737617","userName":"coach jw v","userUrl":"https://itunes.apple.com/us/reviews/id132389760","version":"1.3.5","score":1,"title":"Just inaccurate","text":"My wife is an RN and we checked my blood pressure with the iHealth wireless blood pressure wrist monitor versus her BP cuff and stethoscope.  The iHealth monitor was consistently off (anywhere from 20 - 30 points).  While waiting on device to charge I decided to enter my dietary diary and couldn't find any of the food I ate today.  It also didn't allow me to add food.  Well that's about worthless.  I really wanted this to work.  I wanted to take BP and have the record automatically entered into my iPad... Maybe the technology just isn't there yet.  I went back to my wife taking BP and entering it into a spreadsheet.","updated":"2014-12-22T18:56:59-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1368596242","userName":"Trudy's","userUrl":"https://itunes.apple.com/us/reviews/id148824386","version":"3.3.2","score":2,"title":"When it work It's great","text":"I've had the iHealth BP Cuff AND BPArm Band for at least 3 years. It's always been a hassle to get the Bluetooth to pair.  I LOVE it when it works because it gives you a full picture of your BP over time on its own APP. However, it's not sending data to the Apple Health APP. It seems that this company doesn't have enough engineers to keep up with updates from Apple. I wish I could give it 5 stars but after multiple contacts via eMail with the company, I'm still waiting for an improvement.","updated":"2016-04-25T05:56:11-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1090123567","userName":"B-natty","userUrl":"https://itunes.apple.com/us/reviews/id17617581","version":"1.3.2","score":3,"title":"Difficulty connecting to iPhone","text":"Multiple people are trying to use bp wrist monitor and in order for it to connect we have to 'forget this device' in Bluetooth settings and start all over when ever a different person wants to use it... It should just connect on one device after all the other devices 'Bluetooth' is turned off but it doesn't... What a pain","updated":"2014-11-01T17:38:39-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"796011185","userName":"BestOfBrooklyn.co","userUrl":"https://itunes.apple.com/us/reviews/id128984821","version":"V1.1.4","score":4,"title":"Great app","text":"This app is really amazing. Works really well with my BP-3 and also love being able to manually enter and track other things like weight. I would give 5 stars but the latest update has an annoying alert that says to turn on Bluetooth every time you open the app. I don't have any BT devices so very annoying. Otherwise really nice app even if you don't have the fancy gadgets.","updated":"2013-04-28T17:42:15-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1264759284","userName":"BillinPhoenix","userUrl":"https://itunes.apple.com/us/reviews/id28639209","version":"3.1.6","score":1,"title":"NEW VERSION A REAL STEP BACK!!!","text":"So sorry you changed the look. Might seem artistic to the designers but it is much more difficult to read. The very light colors make letters less distinct. \"List mode\" is much harder to view making it more difficult to share with a physician. You can no longer see notes on the same screen in list view. I use this every day and I'm so disappointed. Please consider a redesign that makes data easier to read (please include notes in list view). If you can't do a redesign, please allow us to download the old app.  Thanks!","updated":"2015-09-29T22:47:58-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"928339372","userName":"Maytag16","userUrl":"https://itunes.apple.com/us/reviews/id373111141","version":"V1.2.0","score":5,"title":"Great app to use with activity tracker","text":"I have no complaints after 1 month of use. The app works really well. I use it daily to sync my iHealth activity tracker with my iPhone and to enter my meals and weight. I love how you can set goals and track your progress. It has really helped me to put my health as a top priority. I recommend highly!","updated":"2014-01-20T07:56:59-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1260294188","userName":"JBHgt","userUrl":"https://itunes.apple.com/us/reviews/id13945193","version":"3.1.6","score":1,"title":"New version much worse","text":"The prior version of iHealth showed promise, was easy to customize, was easy to input data and sync sources of data. But the new version eliminates all those conveniences and is extremely difficult to use. Not at all user friendly. I cannot get it to read data from Motion 24/7, but not problem with the old version. I cannot get it to read data from my Garmin Vivofit or the related Garmin Connect app.  It no longer has food data from Myfitnesspal. The list goes on and on, but this app has become useless.","updated":"2015-09-20T08:36:01-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1245994482","userName":"TB24","userUrl":"https://itunes.apple.com/us/reviews/id18459281","version":"1.3.5","score":1,"title":"Scale ok, App - VERY POOR","text":"When it works, it's very simple to use... the problem is, that only for the first week of ownership.  EVERYDAY i send 15 mins or more trying to get the app to reconize the reading from the scale.  I called the customer suppert and they all kinds of reasons (too many apps open, peer memory on my phone, power down and reboot every morning, etc., etc.)  NOT very practical, nore was it taking any ownership that maybe they need to update thier app with a bug fix.  If have not buoght the hardware yet.. I would pass and get the FITBIT on.  Works everytime I step on the scale.","updated":"2015-08-20T08:28:11-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1608752665","userName":"guttentaga","userUrl":"https://itunes.apple.com/us/reviews/id24331358","version":"3.5.0","score":1,"title":"Useless out of the box","text":"My brand new iHealth BP5 never even attempted to inflate the cuff when I hit the Start button in this app. It just makes a single clicking noise and then reports a pneumatic system problem.\n---\nUpdate: I contacted the company's support, described the issue and made it clear it was brand new in a sealed shrink-wrapped box. They suggested either the internal engine or cuff are damaged, and said \"there is no cure beyond seeking out a local repair technician.\" In other words, if they sell you a defective product, you must find someone to repair it at your own expense. Caveat emptor.","updated":"2017-05-08T15:20:34-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1168017528","userName":"Celticblue","userUrl":"https://itunes.apple.com/us/reviews/id33469658","version":"1.3.5","score":5,"title":"Perfect","text":"Works perfectly on my iPhone six.  Linking is a cinch. Within a few points of the doctor's office stats for my blood pressure. The website where this item is sold gives the device a four and a half star rating. I'm not sure why so many users here are having issues.","updated":"2015-03-14T16:32:12-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1060049853","userName":"Frosty in Texas","userUrl":"https://itunes.apple.com/us/reviews/id40248316","version":"1.2.2","score":2,"title":"Frustrating /Brutal","text":"The app and web content are a huge waste of time (the app just has links for questions or support), there is zero content that is helpful for guidance on managing the recoded data.   I've invested in the BP monitor and the body analysis scale. I'm regretting my decision. If the scale/bp monitor/ and app should somehow not correctly all sync together on which individual is using a particular device, then nothing is transferred to the profile in the application. Great in concept, but lacking greatly in execution.","updated":"2014-09-06T12:47:10-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"718396159","userName":"blurkybro","userUrl":"https://itunes.apple.com/us/reviews/id106041787","version":"1.1.1","score":4,"title":"Great scale but app needs a little work","text":"I like the scale and the data presented in the app which is the main reason I bought this device. I was excited when I opened the app and saw a calorie tracker as well. Compared to other calorie trackers I was disappointed. It does not have a barcode scanner, restaurants are not listed and I couldn't find  some of my popular brands.","updated":"2012-12-29T05:55:15-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1078205827","userName":"LonelyStan","userUrl":"https://itunes.apple.com/us/reviews/id224228363","version":"1.3.0","score":1,"title":"Won't sync iOS 8.0.2","text":"Looks like I'm going to Walgreens to get a refund! This watch doesn't sync with any of it apps on iOS 8.0.2 this watch is between $59 and $79. I tried three different watches. It's either watch or the app. Since the app makes the watch function they both are useless at this point. This company has very poor customer service and when you call the support number they always say \"an error has occurred\" how could Apple allow an app like this in their App Store? This company is very misleading!","updated":"2014-10-10T09:52:12-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1617648806","userName":"very-upset","userUrl":"https://itunes.apple.com/us/reviews/id29869746","version":"3.5.1","score":3,"title":"What the heck happened to this app?!","text":"This app worked at one point, now it reads, network timed out every time I try and login. I have deleted and re-installed over and over. May I have a refund for the scale, and blood pressure cuff since I can no longer use them?\nThis would not allow me to post this review with less than three stars!!","updated":"2017-05-18T19:51:33-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"878970972","userName":"Rlmyl","userUrl":"https://itunes.apple.com/us/reviews/id278359194","version":"V1.1.9","score":1,"title":"Are you kidding?","text":"Device seems to work fine. However, the app need a little bit of work. They could start by taking the team that coded \"My Vitals\" out to a land fill somewhere. The app renders the BP device very close to useless as most users will likely take the blood pressure and pulse data to input into another application, which begs the question, \"What was the point?\" The app needs to be more than a not very well thought out after thought.\n\nDear iHealth Executives,\n\nDo your self a favor, kill the app and whoever coded it. Any (15) year old programmer you might hire off the street can certainly do better. Keep in mind, \"You can't fall off the floor.\"\n\nAgain, if you would please, please be so kind as to consider, without an appropriate application to store and analyze the BP device's data, your company has missed the point.","updated":"2013-10-04T23:27:05-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1199702101","userName":"pkusmdc","userUrl":"https://itunes.apple.com/us/reviews/id105296715","version":"1.3.5","score":1,"title":"Good Product, Bad Technology and Business","text":"I had tried to stick with the product, because it has good product specifications.  However, the rest of the company is not up to par.  \n\nThe manufacturing leave much to be desired.  I have had to return the body analyzer scales four times; and based on error messages and the company wanting the scale back, I point to technology.  There is no one weak point; WiFi, bluetooth, composition sensor and weight sensor have all gone bad.  I have also had issues with the Glucometer.\n\nTheir support also has issues.  They never pick up the phone.  When contacting them, they try to blame the issue on the customer.  Only after long issues and after you ask for specifications, they go to their engineers to find out there is an issue.\n\nI am going to use Withings.","updated":"2015-05-19T10:09:54-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1107097422","userName":"elMojoDog","userUrl":"https://itunes.apple.com/us/reviews/id43697655","version":"1.3.5","score":5,"title":"Love it","text":"After reading the reviews I was a little worried, but the app, the iHealth Blood Pressure monitor worked fantastically.  It took a little bit of time to charge the unit, but then it was just fine. I also liked how it showed the information online and how it feeds into to the Apple health App.","updated":"2014-12-02T19:58:53-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1388134300","userName":"Building Doc","userUrl":"https://itunes.apple.com/us/reviews/id122531853","version":"3.3.5","score":4,"title":"Works fine for me","text":"I don't know what all the one and two star reviews are all about. I installed the app, charged the blood pressure monitor and it worked fine just as advertised right out of the box. I've only had it a few days, so will check back if any problems develop. Using iPhone 6+ iOS 9.3.2","updated":"2016-06-02T22:26:10-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"827450325","userName":"Aniannie","userUrl":"https://itunes.apple.com/us/reviews/id33695751","version":"V1.1.6","score":2,"title":"Wrist monitor","text":"IHealth please fix your app. I have a pretty new wrist monitor for blood pressure. It worked at first. I can't get it to work anymore. It won't read that my arm is in the correct position so it won't measure. Or it starts to measure and then it aborts the measure. Please fix. It would be a wonderful app if it worked consistently. The device is too expensive and only works with iOS so it's useless if the app doesn't work.  It's raising my blood pressure by challenging me!","updated":"2013-06-27T09:23:45-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"930935527","userName":"Loon46","userUrl":"https://itunes.apple.com/us/reviews/id16313244","version":"V1.2.0","score":4,"title":"IHealth My Vitals","text":"This is a great app when it is working correctly. However, even with latest bug fixes, it takes at least two attempts to sync the tracker with the app; it crashes several times while syncing. It is definitely worth having. The developers WILL get it right!","updated":"2014-01-25T12:01:35-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"900084761","userName":"AMD!!!!","userUrl":"https://itunes.apple.com/us/reviews/id288587207","version":"V1.1.11","score":4,"title":"Good but deleting needs fixing","text":"The app does what it says but they need to fix delete.  It is directly next to the test button in the bottom so I keep accidentally deleting.  It needs to ask you to confirm the delete or something because it is too easy to accidentally delete.","updated":"2013-11-24T10:43:56-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1370107035","userName":"Tugb0at","userUrl":"https://itunes.apple.com/us/reviews/id25443595","version":"3.3.2","score":2,"title":"Crashes a lot","text":"Since the update this app freezes up every time I try to use it. iPhone 5 running iOS 9.3.1. Up until now I used this app every day to monitor blood pressure and weight.\n\nUpdate:\nI was told by iHealth that their developers have found some issues with the app, when using the latest build of iOS (9.3.1)... Especially, if the user has performed a Factory Reset of their device.\n\niHealth has a fix waiting for the next iOS 9.3.2 release. A refund was offered if my device was purchased within the 365 day limited warranty period. I've had this for over a year. I'm outta luck until the Apple update. \n\nOn a positive note... iHealth has responded within 24 hours to all my correspondence.","updated":"2016-04-28T04:59:00-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"845684978","userName":"1adam99","userUrl":"https://itunes.apple.com/us/reviews/id23788881","version":"V1.1.7","score":2,"title":"Like the blood pressure wrist monitor hardware.  App is poor.","text":"I like the blood pressure wrist monitor hardware.  Works great.  Five stars for that.  \n\nThe app is confusing.  User experience is poor and disorganized. \nNeeds to be rethought.\n\n---Update after a few weeks use: ---\nI have the wrist monitor. The readings seem to vary a lot, even when I take repeated readings one after another without removing the device. \n\niHealth needs to improve the blood pressure trend graphs. Terrible. Put a sensible scale and grid lines so you actually read the graph!  Graph should include ALL measurements, not just one per day. Should be able to see how BP varies over a day. Should be able to zoom in/out on the time axis. Don't need vertical lines connecting systolic and diastolic","updated":"2013-07-30T13:27:14-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"702946919","userName":"Dr BigJim","userUrl":"https://itunes.apple.com/us/reviews/id8752053","version":"1.1","score":1,"title":"Finally integration but forcing people to use iHealth Cloud","text":"Finally they integrated the the apps, but I did not want to use their iHealth cloud and now they are forcing people to use it rather than the correct option or either using it not. It should be fully functional without using their own web hosted service! I would rather see integration with iCloud and have the data synchronized to all my devices that way. They need to fix this immediately!","updated":"2012-12-05T04:31:14-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1325049643","userName":"Too hard in level 96& up","userUrl":"https://itunes.apple.com/us/reviews/id270308954","version":"3.2.0","score":3,"title":"The app needs improvement","text":"I like the app when I use my pulseoximeter but I wish it could also record the pulse wave not just show only the stats when your done. It doesn't give you the option to record the wave. Please add the capability to record in live time the pulse wave. Until then I only giving this app 3 stars.","updated":"2016-01-30T10:04:23-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1462998877","userName":"William Bruno","userUrl":"https://itunes.apple.com/us/reviews/id528755005","version":"3.4.1","score":5,"title":"Improvement","text":"After updating to the latest version of the app when synchronizes sleep data and the crash not happen.","updated":"2016-10-07T22:58:48-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1126683121","userName":"Banker52","userUrl":"https://itunes.apple.com/us/reviews/id30776287","version":"1.3.5","score":1,"title":"None responsive customer support","text":"I purchased a blood pressure wrist monitor which is used by this app.  The device consistently provides an inaccurate reading. I have exhausted efforts to resolve the problem my following the instructions provided with the device.  I have made several efforts to contact customer support.  Phone calls go to voice mail and emails are not answered.  Be aware that if you purchase any products from this company you are doing so at a risk.","updated":"2015-01-08T11:36:03-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1273685478","userName":"Giving_You_FLAC","userUrl":"https://itunes.apple.com/us/reviews/id48694226","version":"3.1.7","score":2,"title":"Rather than updating to support an unreleased product, how about you support existing users?","text":"The app worked pretty well on iOS 8, I like how connecting my cuff opened the app. I HATE the fact that you cannot do measurements without giving them your data, that is BS. The app crashes immediately on iOS 9- how about you fix this first before actually issuing support for a product I can't even buy yet?","updated":"2015-10-18T10:31:29-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"802321353","userName":"John the Cap","userUrl":"https://itunes.apple.com/us/reviews/id101954401","version":"V1.1.5","score":4,"title":"Excellent App when paired with the Tracker and/or Scale","text":"Thoroughly enjoying the daily data on my activity and sleep. Would love to see the Daily Diary \"beefed up\" a bit like adding a spot for mood, medication/supplement intake and a note section so I can write any pertinent information for that day.  \nGreat job folks, keep up the good work.","updated":"2013-05-10T11:02:06-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1080061012","userName":"gt5","userUrl":"https://itunes.apple.com/us/reviews/id33895273","version":"1.3.0","score":5,"title":"Works just fine","text":"Wow, the barrage 1- 2 star reviews make me wonder if all these people know each other! I have the Body Analysis scales and the blood pressure wrist monitor and they, and the app, work great. The app syncs fine with both the apple health app and the iHealth web portal.","updated":"2014-10-13T19:19:09-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1463601320","userName":"Jim Michigan","userUrl":"https://itunes.apple.com/us/reviews/id528925403","version":"3.4.1","score":5,"title":"Seems to become better than before","text":"The upgrade is successful,Compared to the previous version,it was easier to use.","updated":"2016-10-08T23:30:22-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1271218567","userName":"Elbows556","userUrl":"https://itunes.apple.com/us/reviews/id27105104","version":"3.1.7","score":1,"title":"Awful is all I can say.","text":"The previous app worked flawlessly. Now I get inconsistent connectivity to my BP monitor. The new GUI is also a step backwards and I agree with a previous reviewer point on why should I have to log in to take My BP. Bring back the old version for iOS. This new app makes me want to abandon this device and never look at another ihealth device again. Oh and while I'm on my pedestal the phone support needs some major help also.","updated":"2015-10-13T16:55:10-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1088850086","userName":"OcalaTom","userUrl":"https://itunes.apple.com/us/reviews/id183010318","version":"1.3.1","score":1,"title":"My Activities Appliance/App","text":"After fixing some previous problems, iHealth has stumbled badly with the release of the latest version of this app. After you open the home screen in landscape, the individual parts of the app only open in portrait mode. Once that happens, the home screen is obscured and can't be used and you can't close the portrait window rendering the app useless. There is no fix and all you can do is close the app.","updated":"2014-10-30T13:44:44-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1259371431","userName":"Zooroadie","userUrl":"https://itunes.apple.com/us/reviews/id24358266","version":"1.3.5","score":3,"title":"iHealth Issue","text":"I have been using this app almost since it came out with no difficulty and great results. After upgrading to IOS9 it quits when it tries to link to my scale. I’ve tried a few things to get it to keep running and record my weight but nothing I’ve done so far is working.","updated":"2015-09-18T13:53:45-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1558989946","userName":"Exsangus","userUrl":"https://itunes.apple.com/us/reviews/id397396612","version":"3.4.2","score":5,"title":"Wonderful","text":"I use this app for tracking my blood pressure. I didn't even have to pair anything, it paired automatically as soon as I opened the app.  Highly recommend (at least for the blood pressure part).","updated":"2017-03-06T17:15:42-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1271248431","userName":"AndyN12345","userUrl":"https://itunes.apple.com/us/reviews/id86998608","version":"3.1.7","score":1,"title":"Cloud Sharing Required!","text":"Want to check your blood pressure? First you have to create an account, provide them your full name, date of birth, height and weight to create a cloud account, then it will upload all your health data up there. How could that possibly go wrong?\n\nSeriously, can I please just check my blood pressure locally on my phone? I don't need/want yet another cloud account that can have my data hacked and/or abused by marketers.","updated":"2015-10-13T18:38:34-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1478812660","userName":"Starpow3r","userUrl":"https://itunes.apple.com/us/reviews/id37834401","version":"3.4.1","score":5,"title":"One of the better wellness apps out there","text":"Although it only works with the iHealth stuff, it works pretty good and has some cool features like the ability to email results from the App.","updated":"2016-11-04T22:01:02-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"760402875","userName":"JohnK1988","userUrl":"https://itunes.apple.com/us/reviews/id24754138","version":"V1.1.2.1","score":1,"title":"Data corrupted","text":"Don't trust the app. All my past entries shown on my iPhone were totally incorrect. Somehow they all got changed and all my data is totally corrupted. There are so many screw-ups that I can't even figure out why it may have changed. I do have a good download dated January 7, 2013. Obviously something happened after that. Probably some incompetent software coding. Stay away from this app. I would give it 0 stars if I could.","updated":"2013-02-27T19:06:38-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1014463918","userName":"robszab","userUrl":"https://itunes.apple.com/us/reviews/id29287554","version":"V1.2.1","score":2,"title":"App crashes repeatedly","text":"I love this app when it works. Mostly, it just crashes when you try to see your stats. It also has a hard time connecting to the scale. I've contacted the developers and they were slow to respond and couldn't replicate my problem. When my app works, my husband's won't. When his works, mine won't. Very very frustrating.","updated":"2014-06-21T10:53:41-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1329675742","userName":"Crumrine","userUrl":"https://itunes.apple.com/us/reviews/id28032985","version":"3.2.2","score":5,"title":"Good update.","text":"This is the first time in a long time the ihealth apps have worked properly for my iPhone 6 plus. Good job guys. Keep it up. It seems like there's added functionality too.","updated":"2016-02-07T22:22:42-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"830723190","userName":"rajahfl","userUrl":"https://itunes.apple.com/us/reviews/id41510369","version":"V1.1.6","score":1,"title":"Not ready for prime time","text":"I'm an iOS developer myself so I hate writing negative reviews so I'm going to be as specific as I can be.\n\nI give it a one-star rating because I have an iPhone 5 and I purchased the Bluetooth weight scale. In essence, I just bought a $100 weight scale. It doesn't connect to my phone and I'm not going to flip the scale everytime I want to connect and record my weight. \n\nThe app looks great and I'm sure it would be nice to use over time, but the app is useless without the body data.\n\nThe iPhone 5 has been out long enough that this issue should have been fixed already. Not fixing it indicates a lack of company leadership, I'm sure the developers can fix it easily.","updated":"2013-07-03T10:51:40-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1614421727","userName":"TiggeezZ","userUrl":"https://itunes.apple.com/us/reviews/id528999875","version":"3.5.1","score":4,"title":"Back to normal","text":"So far so good, the last update brought things back to normal. I like using the App, gives me a good overview for some of mine activities and connects well with the blood pressure monitor. Better graphs with buttons for recent, week, month, and year.","updated":"2017-05-15T03:02:41-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1263567434","userName":"Strombus Catcher","userUrl":"https://itunes.apple.com/us/reviews/id29548829","version":"3.1.6","score":5,"title":"Change of Heart","text":"The first time I opened the new version I was unhappy, after using it for a while I think it is much better then the previous version.","updated":"2015-09-27T07:27:00-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1377108411","userName":"Superjay89","userUrl":"https://itunes.apple.com/us/reviews/id217979351","version":"3.3.5","score":3,"title":"App freezes when taking blood pressure","text":"Having same experience as others for past 10 days. Reported to the support email and they told me to remove app and reinstall. I did. But same problem. I wish they would respond with a fix I can download ASAP.","updated":"2016-05-11T13:52:31-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1261052601","userName":"Magic_Steve","userUrl":"https://itunes.apple.com/us/reviews/id11362486","version":"3.1.6","score":3,"title":"New Version is Worse","text":"i liked the interface of old version better.  have some bugs in new version with multiple users.  need to be able to transfer readings from one user to another since it auto imported to the wrong user","updated":"2015-09-21T22:33:18-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1269092992","userName":"Tumacha","userUrl":"https://itunes.apple.com/us/reviews/id339193970","version":"3.1.7","score":2,"title":"Can't track my progress!!","text":"With the previous version, one could set a goal and track his/her progress. For example if your goal were to lose 10 lb in 4 weeks, it will draw a trend line and let you know if you were above or below the line as you progress. This new version does not have this feature.","updated":"2015-10-09T04:03:21-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1399312185","userName":"arimar1315","userUrl":"https://itunes.apple.com/us/reviews/id169755547","version":"3.3.8","score":1,"title":"Totally Disappointed","text":"I wanted an app that tracked vitals wirelessly and this app seemed like the perfect solution, as it was \"supposed\" to work with the iPad 2. However, I needed to purchase the wireless devices, BP, Glucose, etc.  The app constantly crashes when I try to research and review the devices needed to purchase for use with the app.  Requested support help and haven't received any response/help/answers.\n\nI will update this review as things develop or not......","updated":"2016-06-23T18:13:47-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1280447668","userName":"Ex-yahoo lover","userUrl":"https://itunes.apple.com/us/reviews/id40374449","version":"3.1.7","score":1,"title":"New iHealth app is terrible","text":"The new iHealth app is terrible. It forces you to create an online account and sign in. I have news for you Mr iHealth, I don't want an online account and do not want to share my private health information with you or Apple or anyone else. I just want to connect my iphone to my iHealth scale and other devices to privately track my weight and blood pressure etc. This forced update is absolutely terrible.","updated":"2015-11-01T06:06:59-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1275019289","userName":"Buttonem","userUrl":"https://itunes.apple.com/us/reviews/id12131165","version":"3.1.7","score":1,"title":"Why did u ruin this app?","text":"First, you have two of these apps- which has always been confusing. However, the blue one before u changed it, used to work. It knew my scale and it updated automatically all I would have to do is step on. Now nothing detects my scale- the apps are hard to read and don't work. Seriously go back to the previous versions- there is no improvement.","updated":"2015-10-21T09:01:18-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"909022696","userName":"ContentOwner","userUrl":"https://itunes.apple.com/us/reviews/id41542774","version":"V1.1.12","score":3,"title":"Very happy with it so far.  Needs privacy settings.","text":"I like that this is wireless and small.  Great when traveling.  It hooks up real fast with my phone as soon as I enable Bluetooth. \n\nIt seems pretty accurate.  I get similar readings on my other blood pressure cuff.\n\nI would like to see better privacy settings.  This data is for my consumption only to be shared with my doctor only.  A password to open the app is a must.  Also, specific settings as to how and where the data is stored and shared is a must.  \n\nAdd security and I will give it 5 stars.","updated":"2013-12-14T09:19:30-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1521672290","userName":"Manic Bobo","userUrl":"https://itunes.apple.com/us/reviews/id246483879","version":"3.4.2","score":5,"title":"Works fine","text":"Connects with all my IHealth tools without any issues.  I'm using the wifi scale, activity monitor, BP Cuff, and the 02 meter. I like how everything ties together in one app and Apple Health (and I use the glucose meter in the glucose app).","updated":"2017-01-13T21:06:28-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1077568403","userName":"Jetwetzel","userUrl":"https://itunes.apple.com/us/reviews/id134052200","version":"1.3.0","score":2,"title":"Misses the mark","text":"I've been using My Fitness Pal for years and love it.  The concept of an iHealth dashboard was good.  But for an app promoting healthy choices, there are an awful lot of processed foods listed!  I can't find most of the foods I use in My Fitness Pal.  I know you can sync them, but it seems to only go one way.  I'd like MFP to be able to send info TO iHealth, not just receive from.","updated":"2014-10-09T04:46:33-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1050137100","userName":"JohnMatthew","userUrl":"https://itunes.apple.com/us/reviews/id26830967","version":"V1.2.1","score":1,"title":"Bad product. Bad service.","text":"Wrist product worked for two days. Then ceased to register correct position, meaning it won't take my blood pressure. \n\nContacted iHealth and was refused a return option until my fourth request. They sent a return label and RMA, but after two days, eliminated them so they were no longer accessible at the links they provided. They then ignored my requests for further service. \n\nAvoid.","updated":"2014-08-20T09:49:15-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"725254252","userName":"JoshuMesse","userUrl":"https://itunes.apple.com/us/reviews/id110365079","version":"1.1.1","score":1,"title":"Great expectations","text":"So I bought a hundred dollar scale that has it's own app.  Apparently they spent more time on the hardware than the programming!  The app crashes after one input in the calorie counter.  And it has no ability to distinguish between my wife's iPhone and mine.  And then the calorie counter is by the ounce instead of a generic guess at what a typical example of food is.  Hope you already have a food scale as well!","updated":"2013-01-08T04:33:24-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1120579043","userName":"Tasha16!","userUrl":"https://itunes.apple.com/us/reviews/id39474479","version":"1.3.5","score":3,"title":"IPhone 6 Bluetooth issues","text":"So disappointing!  Bluetooth doesn't work with iPhone 6.  Bluetooth works great with my old iPad mini, no issues there.  Wish they would fix this because it's a great and convenient way to check your BP!","updated":"2014-12-28T04:50:37-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1615192281","userName":"MolesWale","userUrl":"https://itunes.apple.com/us/reviews/id524247969","version":"3.5.1","score":5,"title":"Yea! An activity tracker that works for me!","text":"I discovered the WAVE! It tracks walking, sure, but also lifting and, (here's the good part!) swimming! Just tried it in both pool and hot tub, kept track of distance. I'm super excited!","updated":"2017-05-16T01:09:50-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1056899769","userName":"Martyusmc","userUrl":"https://itunes.apple.com/us/reviews/id29115895","version":"1.2.2","score":1,"title":"Yes Keeps info","text":"keeps manual input info, but that is where it ends. I bought mine about 1 year ago for the first 4-5 times I used the unit with my iPhone or iPad worked fine, then the software refused to recognize the Blood Pressure unit or Weighting scale.  After a month or so I tried again, back in the junk box to recycle for parts.\nDo not waste your money or time with these products or software.","updated":"2014-08-31T10:05:54-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"737513222","userName":"NathanNookie","userUrl":"https://itunes.apple.com/us/reviews/id19008357","version":"V1.1.2","score":2,"title":"Great hardware but terrible software.","text":"The BP7 hardware is great but the app really needs to be redesigned. The UI isn't iOS like at all. Everything about it is simply unintuitive. Once you figure it out it all works but figuring in it out in the first place is a bit ridiculous. I really hope that iHealth spends some time and redesigns the application because it could be a great app.","updated":"2013-01-26T15:05:04-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1101471079","userName":"JDubDev","userUrl":"https://itunes.apple.com/us/reviews/id126772012","version":"1.3.4","score":1,"title":"3 days of perfect use. Then one big mess.","text":"App and device worked perfect for 3 days straight, multiple times a day. \n\nNow the app crashes non stop. It becomes completely unresponsive. Start button does nothing most of the time. The 1/10 times it starts the device the app freezes up and the cuff stops inflating and a red indicator light comes on. \n\nI have deleted and reinstalled the app several times now. Changes the HealthKit sync setting. I even tried running the app with Bluetooth off and it still locks up. \n\nI wanted to like. I wanted to USE it..... Unfortunate I will have to return it as defective unless the app gets fixed in the next week.","updated":"2014-11-22T18:22:04-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"730307191","userName":"Seanmh72","userUrl":"https://itunes.apple.com/us/reviews/id266624008","version":"1.1.1","score":1,"title":"Hirrible","text":"OMG!  This is a horrible piece of software. I have had this for a week now and have managed to get the scale to function twice with the phone.  Finally figured out how to input my data manually; not very intuitive.  Finally, good luck if you want to put your target weight in.  I need 190lbs and as soon as I hit the number 1, it disappears. So, looks like this scale wants me to GAIN weight, not lose it.","updated":"2013-01-16T05:00:22-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"993628756","userName":"Flo000","userUrl":"https://itunes.apple.com/us/reviews/id115202573","version":"V1.2.1","score":2,"title":"Nice App","text":"Is a nice app but the food database is limited and miss the sugar information, cholesterol, etc.\nAlso you need to use a different app for measure your sugar level, will be nice to have all devices in one app.\nPer general the app is not bad and it look very promising. \nGood job, I hope you will still develop the app.\n\nI need to update the review with some issue related with sleep track, sometimes when you sync, it created track for the same night in 3 or 4 copies, that is messing your entire track graphic and unfortunately it is no way that you can delete those duplicates.","updated":"2014-05-15T23:57:31-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1575857146","userName":"Uzis is a good girl","userUrl":"https://itunes.apple.com/us/reviews/id559614415","version":"3.4.2","score":4,"title":"Fabulous app but errors sometimes  happened","text":"Being able to track how long I swim with my friends makes it really interesting,I like it a whole lot!!","updated":"2017-03-29T19:45:58-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1354193344","userName":"Desertkatz","userUrl":"https://itunes.apple.com/us/reviews/id129606199","version":"3.2.2","score":5,"title":"Works as promised","text":"Purchased wrist BP device a few days ago and downloaded this software for use with iPhone 6s. Works flawlessly so far - no complaints.","updated":"2016-03-26T21:31:52-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1288913407","userName":"Mac even","userUrl":"https://itunes.apple.com/us/reviews/id305099630","version":"3.1.7","score":1,"title":"Bring back the Old","text":"I am really not fond of this version. I like many of the functions of the previous version. I really miss most the fact that the app no longer gives me an average of my blood pressure.  I hate that every time the app launches it tells me how to connect my Bluetooth device that I do have have.  I wish I could go back in time and NOT update.","updated":"2015-11-19T17:28:22-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1155685622","userName":"Baltimore Chris","userUrl":"https://itunes.apple.com/us/reviews/id39118080","version":"1.3.5","score":2,"title":"Key problems that need to be fixed","text":"I really wanted this app to work since I love the watch. Sadly it's got Bluetooth sync issues in that many times it crashes during a sync. I've had to restart multiple times to get the Bluetooth to sync with the app on an iPhone 6.\n\nPlease fix this app!","updated":"2015-02-21T16:09:59-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"724106543","userName":"Rchobby007","userUrl":"https://itunes.apple.com/us/reviews/id130537224","version":"1.1.1","score":2,"title":"OK, needs work","text":"Calorie Tracker NOT iCloud compatible, can't use data on multiple devices.  No ipad app, just iPhone, so interface is only portrait on ipad.  Has lots of potential, but needs tons of work to be very useful.\nIt does work with the iHealth scale, but really won't do much more than that until they add some key features.","updated":"2013-01-06T09:36:16-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"719583898","userName":"Jsey","userUrl":"https://itunes.apple.com/us/reviews/id42209005","version":"1.1.1","score":1,"title":"Update this App!!!","text":"When the only model number available is the last and not the current model you have not worked at both ends.  I have received a model being sold as new that was obviously used and your software doesn't recognize it.  Also format this software for the total iPad user, portrait is awkward for tablet users in general.","updated":"2012-12-30T20:13:29-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1134176915","userName":"Gator-1","userUrl":"https://itunes.apple.com/us/reviews/id30711514","version":"1.3.5","score":5,"title":"Very pleased","text":"I am very pleased. The app works great. It will not start unless the monitor is correctly positioned. And it is illustrated very well. \n\nThe readings are also consistent with those taken at the doc's office.","updated":"2015-01-22T04:27:58-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1114081616","userName":"Obsidian85","userUrl":"https://itunes.apple.com/us/reviews/id86486766","version":"1.3.5","score":1,"title":"The App is Really Bad...","text":"Its unbelievably bad: I can't register using facebook (\"network error\" - while I clearly have a good connection); I can't register using e-mail/password either (\"website error\"). Meanwhile, on mobile safari, I can login via facebook just fine. How a company can make such good looking and efficient products with such a worthless software is beyond me.","updated":"2014-12-16T00:26:18-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"917225937","userName":"Mr. K from NJ","userUrl":"https://itunes.apple.com/us/reviews/id10228638","version":"V1.1.12","score":4,"title":"Works great after troubleshooting!","text":"I also had issues with it connecting to my iPhone.  The setup was very easy but I figured out I had to cycle power on my wireless router for it to work.  This is an issue with DNS/DHCP and the routers buffers.","updated":"2013-12-30T08:19:16-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1267511080","userName":"kavurisr","userUrl":"https://itunes.apple.com/us/reviews/id104861503","version":"3.1.6","score":2,"title":"Good app, but needs improvement","text":"The app is great when it works. The new version constantly crashes, especially when I try to upload offline data. It gets really annoying when all you want to do is a simple task and he keeps shutting down on you.","updated":"2015-10-05T15:28:53-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"729374680","userName":"jerhej","userUrl":"https://itunes.apple.com/us/reviews/id29604068","version":"1.1.1","score":3,"title":"Missed it by *that* much!","text":"OK, neat concept but not ready for prime time. \n\n1. C'mon guys - not a universal app?  feels kind of silly balancing my ipad and keyboard on their side to use this!\n\n2. Feels like there should be \"under construction\" signs outside of HR, BP and weight. I would need to buy other apps and/or devices to accurately track calories in and out then manually add the data to this system. \n\nHaving said that, the BP monitor appears accurate ( I can check it against a manual BP cuff) and the BP cuff is quite simple to use.  Good luck with continuing development!","updated":"2013-01-14T14:14:29-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1397662757","userName":"CBH in Newbury","userUrl":"https://itunes.apple.com/us/reviews/id194123307","version":"3.3.6","score":1,"title":"Update ruined the app...","text":"Wasted the morning figuring out that the update last week was the problem.\n\nIt could have been worse: Data from HS5 (weight and derivatives) and BP5 (blood pressure) devices are still recorded but now do not appear in the dashboard.\n\niHealth was always a poor balky app but the last update has made it worse.  And Apple shares the blame for permitting this screwup...","updated":"2016-06-20T12:31:59-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1262537129","userName":"Too Much Scrolling","userUrl":"https://itunes.apple.com/us/reviews/id28028359","version":"3.1.6","score":1,"title":"I lost 170 pounds TODAY","text":"The latest software update forgets the basic principal that children will touch your stuff. My 9-year-old weighed himself last night, after I was asleep, and the results were posted to MyFitnessPal and Apple Health! Please replace the SMARTs that the old version had. It would look at the data collection and logically decide if it was my data or NOT MY DATA!","updated":"2015-09-25T05:13:53-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1124213677","userName":"CounterBlast","userUrl":"https://itunes.apple.com/us/reviews/id46203549","version":"1.3.5","score":1,"title":"Waste of time and money","text":"App has terrible UI that's a pain to use, Evernote integration constantly requires authorization when you try to log in. Can't even access the partner services on their web app to add other services anymore and customer service is the kind that just stops replying to your emails because they can't be bothered!","updated":"2015-01-03T16:53:54-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1424381065","userName":"Nan1209","userUrl":"https://itunes.apple.com/us/reviews/id271904153","version":"3.3.8","score":3,"title":"It's okay","text":"I would of given 5 stars if this app would let you print out results from month to month! Don't understand why they wouldn't  include where you can print out results.  It's rather stupid.","updated":"2016-08-01T08:00:42-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1465736113","userName":"Teresa legend","userUrl":"https://itunes.apple.com/us/reviews/id529546617","version":"3.4.1","score":4,"title":"Great app that needs major tweaks","text":"I like this app so far.I do wish that it had a place for devices simple to connect.I hope the designers are working on an update.","updated":"2016-10-12T19:15:32-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"818408100","userName":"PMKey","userUrl":"https://itunes.apple.com/us/reviews/id30895077","version":"V1.1.6","score":2,"title":"Quirky","text":"The app is very quirky.  It will work for long periods they just stop connecting to the arm cuff correctly.  It is particular annoying in that it always blames the user for \"arm/wrist\" movements even when sitting on a table top.  Once the software connection is ironed out this will be a great product.  Right now it is very frustrating.","updated":"2013-06-10T07:44:59-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1493024716","userName":"glibrodo","userUrl":"https://itunes.apple.com/us/reviews/id35615280","version":"3.4.2","score":1,"title":"Bluetooth connectivity problem","text":"I have a BP5 BP monitor that's supposed to connect to iPhone in order to check the blood pressure (the BP reading is displayed only in the app). \n\nIn 9 of 10 instances, BP5 shows connected in list of Bluetooth devices in iOS Settings but does not show up in the app. I have to reset the BP monitor, as FAQ instruction, by pressing physical Start/Stop button of the BP machine. \n\nI am trying to love this product/app because it's BP readings are automatically entered in iOS Health app unlike Philips  Healthcare Suite app. \n\nI hope this connectivity issue is resolved soon and will reconsider the low rating I am giving.","updated":"2016-11-29T10:50:55-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1609534876","userName":"SueGaz!","userUrl":"https://itunes.apple.com/us/reviews/id561236551","version":"3.5.1","score":4,"title":"Love it","text":"I am enjoying this app and my Wave very much. It has helped me a lot keeping track. I haven't tried the exercises or the swimming guide but I am looking forward to trying them.","updated":"2017-05-09T11:35:22-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"850290799","userName":"Melody Bliss","userUrl":"https://itunes.apple.com/us/reviews/id32079577","version":"V1.1.7","score":5,"title":"Works great but no SpO2","text":"The app works great. I've been using it with the wired BP cuff and now the wireless. I just wish the SpO2 worked with it and didn't have to have a separate app.","updated":"2013-08-07T17:33:22-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1118080007","userName":"jegomez","userUrl":"https://itunes.apple.com/us/reviews/id24857669","version":"1.3.5","score":2,"title":"really bad UI","text":"Useful for keeping track of measurements, but incredibly bad UI. Screen elements are removed for no reason. Information is presented but when you tap on it nothing happens. So many different ways to get to different screens it’s hard to know where you are.","updated":"2014-12-23T10:01:19-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1463329336","userName":"馒头乖牛","userUrl":"https://itunes.apple.com/us/reviews/id226805478","version":"3.4.1","score":5,"title":"Easy to use","text":"The process to use it is so smoothly. Will keep using it to record and monitor my health!","updated":"2016-10-08T10:11:53-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"848629566","userName":"MTV app","userUrl":"https://itunes.apple.com/us/reviews/id136537571","version":"V1.1.7","score":3,"title":"Good start!!!","text":"Very responsive, fast and easy connection every time.  Would be nice if you could have the new pulse oximeter graph and results in ihealth MyViyals app and able to take a reading from this app.","updated":"2013-08-04T17:59:02-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1347890296","userName":"Wolftag","userUrl":"https://itunes.apple.com/us/reviews/id28438147","version":"3.2.2","score":1,"title":"Lost data, forced to use Facebook","text":"After purchasing their blood pressure cuff and recording data for a year, the app suddenly stops working.  The only way I can use my cuff is to give them my Facebook friends list?  I wish this is illegal based HIPA compliance compliance.  I paid a lot for the blood pressure cuff and never wanted to let this company spy on me.","updated":"2016-03-14T12:30:04-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1330963638","userName":"Roll'em Robbie","userUrl":"https://itunes.apple.com/us/reviews/id416157223","version":"3.2.2","score":1,"title":"Failure after update","text":"So after the latest update the scale would weight only with no communication with scale. Attempting to reset wifi password results in time out. Tried replacing batteries but now have a Err 0 and unable to use scale at all.\n\nTech support says this is a unknown issue and have offered to replace the scale. I appreciate this very much, but I am afraid I will find myself with the same issue as this is obviously a screw up with the update and not the physical scale itself.\n\nMake sure to give your software engineers a raise for a job well done as I know have a scale that's worthless.\n\nGood Job!","updated":"2016-02-10T11:32:19-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"881110371","userName":"c4pet0wn","userUrl":"https://itunes.apple.com/us/reviews/id24935353","version":"V1.1.9","score":5,"title":"Works great","text":"Does it's job well and accurately. Connection with wrist BP monitor is always solid. Wish I could just monitor heart rate Bpm without doing a whole BP test. Great app still nonetheless.","updated":"2013-10-10T00:26:58-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1302684472","userName":"astro.dave","userUrl":"https://itunes.apple.com/us/reviews/id18178377","version":"3.2.0","score":1,"title":"Requires email cloud login, scale doesn't connect","text":"There is no valid reason for this, the old iHealth app that worked with my old scale didn't require a login.\n\nI also do not see the device appear in my Bluetooth settings, so it seems to be broken.\n\nI will be returning the scale and posting this information elsewhere.","updated":"2015-12-18T20:09:55-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1287281023","userName":"CorreAktor","userUrl":"https://itunes.apple.com/us/reviews/id32927178","version":"3.1.7","score":1,"title":"Disappointed","text":"I can't wait until my iHealth device fails so I can get someone else's version. These devices are real simple and the apps should be real simple. If it is more of a pain to automatically work with the app compared to just entering into HealthKit, then why spend the extra money for a device?","updated":"2015-11-15T21:10:35-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1248358584","userName":"Falcon06","userUrl":"https://itunes.apple.com/us/reviews/id39851610","version":"1.3.5","score":5,"title":"IHealth","text":"Needs to be redone with a stand alone Apple Watch app. Should be able to use with out iPhone connection!","updated":"2015-08-25T05:47:57-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1136199902","userName":"dcharleyultra","userUrl":"https://itunes.apple.com/us/reviews/id330978537","version":"1.3.5","score":5,"title":"Always works for me","text":"This app has always worked on my iPhone 6 Plus with my BP monitor. Version 2.0 has not.","updated":"2015-01-25T20:40:28-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"743752928","userName":"iu8ttdrtdxgch","userUrl":"https://itunes.apple.com/us/reviews/id204843778","version":"V1.1.2","score":1,"title":"Violates your privacy","text":"The body composition scale only works with an Internet connection that allows it to upload to the 'cloud.' You can give it a false name and birthdate, however. Probably all their devices work like that, I don't know. But now that I see how the scale works, it's the last time I'm buying from them.","updated":"2013-02-03T16:39:51-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"899119903","userName":"Mike Weasner","userUrl":"https://itunes.apple.com/us/reviews/id28475597","version":"V1.1.11","score":1,"title":"BP monitor gives bogus readings","text":"Purchased the iHealth blood pressure monitor at Apple Store on 13 Nov 2913. Installed this app. Readings were always high. Got \"stroke level\" readings today. Called doctor; said to get to emergency room right away. Readings made there using professional equipment were normal. Will be returning the iHealth monitor to Apple Store for a full refund. \n\nI can NOT recommend this device.","updated":"2013-11-22T13:03:28-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"849001099","userName":"Jessie WPL","userUrl":"https://itunes.apple.com/us/reviews/id34977930","version":"V1.1.7","score":5,"title":"Active","text":"Thanks for updating. Was having issue with Activity. Works well now.","updated":"2013-08-05T09:28:12-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1537414636","userName":"Jubnub","userUrl":"https://itunes.apple.com/us/reviews/id121540624","version":"3.4.2","score":4,"title":"Update UI for iPhone plus","text":"App works well enough, but I wish it would be updated to display better on an iPhone Plus.","updated":"2017-02-04T18:55:48-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1270255781","userName":"ttaylor91010","userUrl":"https://itunes.apple.com/us/reviews/id24299746","version":"3.1.7","score":2,"title":"Bring back the quality features of previous version","text":"New version looks pretty, but I will always take function over form (who cares whether it looks pretty, if it doesn't work, whose the jerk to approve the change)","updated":"2015-10-11T12:02:56-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1470190843","userName":"SmileyNutz","userUrl":"https://itunes.apple.com/us/reviews/id331691372","version":"3.4.1","score":4,"title":"Good BP Cuff","text":"This is a really good BP cuff that has a really easy to use app. Recently have had issues with connection errors that started after the new IOS update.","updated":"2016-10-20T17:29:00-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1261913904","userName":"RA_OH","userUrl":"https://itunes.apple.com/us/reviews/id121225087","version":"3.1.6","score":1,"title":"New Version does not work","text":"Previous version was adequate since data could only be saved in the dedicated App or shared with Apple Health.\nUpdated App crashes more than half of the time at launch.  If the program launches, it fails to work 75% of the time and frequently locks up the phone IOS.","updated":"2015-09-23T19:16:41-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1127445999","userName":"Rishi R.","userUrl":"https://itunes.apple.com/us/reviews/id100004976","version":"1.3.5","score":2,"title":"Didn't work","text":"Can't connect to my phone I got the watch tracker and the app doesn't even know the Bluetooth device is connected it tries to look for and it stops because it can't find it. Atleast the ui is designed nice and easy to learn.","updated":"2015-01-10T00:18:17-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1019941620","userName":"skys15","userUrl":"https://itunes.apple.com/us/reviews/id132789967","version":"V1.2.1","score":3,"title":"Not Bad","text":"It's not bad, but not incredible as far as the UI looks. Definitely, the users page should show first names instead of email addresses, just for looks and ease of use.","updated":"2014-06-30T15:42:20-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1607619554","userName":"crwesterfeld","userUrl":"https://itunes.apple.com/us/reviews/id87783284","version":"3.5.0","score":2,"title":"Too Many Taps to Measure","text":"Most of the time I open the app, it's to measure my blood pressure. The old version would recognize my device if near by and go directly to the measure screen. After the update, it takes 2-3 clicks to get to the measure screen--a downgrade.","updated":"2017-05-07T06:05:09-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1071740290","userName":"Jwajid","userUrl":"https://itunes.apple.com/us/reviews/id338085110","version":"1.3.0","score":1,"title":"Sync please","text":"I do not like that when. Use fitness pal, my steps are to synced automatically. Fit bit and other watches are able to sync but this one doesn't. I would like if I health and fitness pal can link together to make my day go smoothly . I will Change my review has soon as an update post.","updated":"2014-09-28T07:57:24-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1560197192","userName":"Bobby T.","userUrl":"https://itunes.apple.com/us/reviews/id31301421","version":"3.4.2","score":2,"title":"No Support","text":"If you think you might need technical support steer clear of iHealth.\n\nI've sent multiple support requests as well as general product questions over the course of a year but for some reason they never respond.","updated":"2017-03-08T09:33:42-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"974426850","userName":"Comparirocks","userUrl":"https://itunes.apple.com/us/reviews/id172227596","version":"V1.2.0","score":3,"title":"This app needs your help.. Fix it","text":"Great devices that monitor weight and blood pressure. However, this app is very inconsistent. It works intermittently. The blood pressure app and the scale app work better than this all in one app. Please fix it.","updated":"2014-04-09T15:50:47-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"765094911","userName":"Carol App fan","userUrl":"https://itunes.apple.com/us/reviews/id33566010","version":"V1.1.2.1","score":3,"title":"iPad Version?","text":"Wanted to use this on my iPad which is clearly shown in the app views.  However, the app will not download to my iPad, only the iPhone.  Love the concept of both weight tracking and BP tracking in one app.","updated":"2013-03-06T18:44:44-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"928478296","userName":"tgzavert","userUrl":"https://itunes.apple.com/us/reviews/id27788735","version":"V1.2.0","score":5,"title":"Latest release got things back to normal","text":"Very helpful tool for blood pressure and weight!","updated":"2014-01-20T14:55:43-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1614249669","userName":"Pepe,Hi","userUrl":"https://itunes.apple.com/us/reviews/id561238005","version":"3.5.1","score":4,"title":"Terrific!","text":"It's been my go to Health tracking app. Of course I'm biased since I have the core scale and blood pressure. The combination of the tools and the app are great for my wife and me to monitor our health.","updated":"2017-05-14T23:05:41-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1396715881","userName":"Man Status","userUrl":"https://itunes.apple.com/us/reviews/id23421009","version":"3.3.6","score":1,"title":"Update 3.3.6 breaks HealthKit integration","text":"I use HealthKit to record all of my weight and blood pressure readings from the iHealth app.  After updating to 3.3.6, the iHealth has lost all integration with HealthKit.  I can no longer access any readings from my wireless scale nor my wireless blood pressure cuff.  This is a very disappointing and bugged iHealth update--do NOT \"upgrade\" to 3.3.6.","updated":"2016-06-18T18:01:46-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1024754414","userName":"Olderthandirtgeek","userUrl":"https://itunes.apple.com/us/reviews/id134086214","version":"V1.2.1","score":1,"title":"Blair","text":"Bought it. Brought it home and charged it. Followed setup instructions. IPhone would show it as connected, but Bluetooth indicator on cuff kept flashing, and the app said that no device was connected. Retried several times with same result. Packed cuff back in box and returned to store. Don't waste your time fooling with this junk!","updated":"2014-07-08T19:27:30-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"720083529","userName":"clemway","userUrl":"https://itunes.apple.com/us/reviews/id147476622","version":"1.1.1","score":3,"title":"Incompatibility","text":"The iHealth ver 1.1.1 does not work with the Iphone 5 running ver 6.0.2. Although the release date for ver 1.1.1 was Dec 2012.  I think you need to address this as URGENT as this affects all iphone 5 users running 6.0.2. Please","updated":"2012-12-31T14:42:15-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1552802013","userName":"Dklacik","userUrl":"https://itunes.apple.com/us/reviews/id135748131","version":"3.4.2","score":1,"title":"Reset password in app throws an error saying page doesn't exist.","text":"Reset password in app throws an error saying page doesn't exist.    Total junk and they charge for this crap with no support other than m-f business hours.  I definitely am not impressed and do NOT recommend. Go with another company.","updated":"2017-02-25T22:32:16-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1355495055","userName":"PATRIKCZE","userUrl":"https://itunes.apple.com/us/reviews/id42079984","version":"3.2.2","score":3,"title":"Problem with my HS6 personal weight","text":"User # 1 is working fine, it is not possible to sync data for second user. Don't know what I'm doing wrong.","updated":"2016-03-29T11:00:23-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"816973618","userName":"Chytown79","userUrl":"https://itunes.apple.com/us/reviews/id158717436","version":"V1.1.6","score":2,"title":"Connecting","text":"I hate that you have to pull off the battery cover every time you wanna connect your iphone5 and hit the set button that annoying!!!! I should just open my app and step on the scale and go.....","updated":"2013-06-07T14:57:55-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1528242098","userName":"Mommie51","userUrl":"https://itunes.apple.com/us/reviews/id173013340","version":"3.4.2","score":1,"title":"Dont buy Connection problems","text":"Phone recognizes the device and Bluetooth as does the app. The app freezes after you hit the start button and nothing happens. This is been going on for two months and have not fixed the app!!","updated":"2017-01-22T11:13:58-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1270202606","userName":"Mollytheresa","userUrl":"https://itunes.apple.com/us/reviews/id220597622","version":"3.1.7","score":1,"title":"Watch is Resetting","text":"Every time I put the watch on the charger, it resets. When this happens I lose all my information. This is ridiculous, why are there so many issues with these device. How will you fix it? There needs to be a fix immediately!","updated":"2015-10-11T09:32:48-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1381061415","userName":"CyberBob859","userUrl":"https://itunes.apple.com/us/reviews/id37844733","version":"3.3.5","score":1,"title":"App constantly freezes - doesn't work.","text":"Trying to get this to work after the upgrade to iOS 9.3.2. The app constantly freezes and does not respond to any touch. Uninstalling and reinstalling doesn't help. Worthless app and company - look elsewhere.","updated":"2016-05-19T11:06:03-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1550854688","userName":"DowntownTimWPB","userUrl":"https://itunes.apple.com/us/reviews/id42341905","version":"3.4.2","score":1,"title":"iHealth website doesn't even list  iPhone 7+","text":"I was using this with my iPhone 6+ and it worked Great! but just pulled it out again and the cuff (does show as connected to my iPhone) doesn't seem to recognize the positon of my wrist and won't start the device to measure the BP... NEED UPDATE ASAP~!!!","updated":"2017-02-23T07:06:02-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"893988762","userName":"Lawrenmel","userUrl":"https://itunes.apple.com/us/reviews/id158389168","version":"V1.1.11","score":5,"title":"Great all around app","text":"Great app. Customer service (Vincent) VERY helpful AND quick. Nice to have all health tracking components in one place.","updated":"2013-11-10T11:08:04-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"934237283","userName":"Alabaster poonanny","userUrl":"https://itunes.apple.com/us/reviews/id346465143","version":"V1.2.0","score":3,"title":"Needs glucose integration","text":"Needs the option to integrate blood glucose with device or manually other than that seems to be a great app","updated":"2014-01-31T07:46:45-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1105290048","userName":"Solarken","userUrl":"https://itunes.apple.com/us/reviews/id35644883","version":"1.3.5","score":2,"title":"Still a miss","text":"Ok,  still a good idea but not ready for users\n\nI tossed the Fitbit due to them not talking to apple... \n\nI bought all this iHealth equipment and it works though it's tough to use or get any help.  \n\nThe scale is by far the best out there if you figure out how to make it work. \n\nBut!!!!! The app now burns battery so fast I can watch the % go down. Closing the app does not stop it. You could cook an egg in the iPhone. \nOnly a hard boot stops it. Swiping the app to close is no help!","updated":"2014-11-29T08:49:41-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1267254669","userName":"warhead21078","userUrl":"https://itunes.apple.com/us/reviews/id132465425","version":"3.1.6","score":1,"title":"Why!!!","text":"As soon as this new version hit i can no longer connect to my ihealth scale what so ever I have refreshed, deleted the app and restarted my router everything, and it no longer connects I had everything perfectly tied with my fitness pal and now nothing, chance it back","updated":"2015-10-05T02:09:45-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1155242858","userName":"NiboTro","userUrl":"https://itunes.apple.com/us/reviews/id144432568","version":"1.3.5","score":2,"title":"iHealth","text":"\"No device found\" is a recurring problem.  Crashes during initial synching.  Has some serious issues that must be fixed.  Needs lots of  work to make it reliable.","updated":"2015-02-21T03:27:14-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1530720368","userName":"Stepan Dousek","userUrl":"https://itunes.apple.com/us/reviews/id102794583","version":"3.4.2","score":1,"title":"Unproffesional, indication of bad development","text":"The app is scaled up on iphone plus size indication developer does not put efford into app maintenance.\n\nWas unable to set the app to read data from Health App, just to write in.\n\nTherefore app completely unusable, even though seemed promising due to hardware available for it.","updated":"2017-01-25T23:14:11-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1095937038","userName":"Jimbo40","userUrl":"https://itunes.apple.com/us/reviews/id24288484","version":"1.3.4","score":5,"title":"Great App","text":"So easy to use. I can easily take my blood pressure and have it stored via Bluetooth.","updated":"2014-11-12T10:26:20-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1411902842","userName":"upet[]{}##","userUrl":"https://itunes.apple.com/us/reviews/id223521646","version":"3.3.8","score":1,"title":"Zero stars!!","text":"Why do I have to create an account to use this app? I want to check my blood pressure. I do not want to share anything with social media or any other web site. AlI I want to do is check my blood pressure, which is going up I might add. Zero stars for a worthless app!!","updated":"2016-07-14T11:21:49-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1502346957","userName":"The Elven Minstril","userUrl":"https://itunes.apple.com/us/reviews/id8264962","version":"3.4.2","score":1,"title":"Unreliable","text":"I got this for one purpose, to track BMI.  It fails to communicate properly with iPhone health app. It often reverts to old data, like an erroneous height.  It doesn't send the data often.  It's just a constant chore to get it to function.  I do not recommend it.","updated":"2016-12-15T07:26:20-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1489643487","userName":"Lynel's ipod","userUrl":"https://itunes.apple.com/us/reviews/id150011168","version":"3.4.2","score":1,"title":"Was good","text":"No longer works, getting \"error - unable to take measurements due to arm/wrist movements\".  Most disappointing is that when searching online 3 people posted the same issue on their forum, over a year and a half old with no response.","updated":"2016-11-23T07:39:09-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1102745654","userName":".Thomas.","userUrl":"https://itunes.apple.com/us/reviews/id101336873","version":"1.3.5","score":3,"title":"Bluetooth warning","text":"Please don't make the app complain about my Bluetooth being off when I'm only using a WiFi scale.","updated":"2014-11-24T21:32:51-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"797848392","userName":"PrncesMely","userUrl":"https://itunes.apple.com/us/reviews/id12123511","version":"V1.1.4","score":1,"title":"Crashes with BP Monitor","text":"It either freezes when you open the app, the app crashes when it begins taking your BP, or the BP cuff suddenly stops in the middle of your measurement.  None of this happens with the iHealth BP cuff specific app... Ill use that till they get this one figured out!","updated":"2013-05-02T04:40:40-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1443333851","userName":"Amm1234512345","userUrl":"https://itunes.apple.com/us/reviews/id154877429","version":"3.3.8","score":1,"title":"Very Frustrating","text":"The digital scale is helpful...when it works. Unfortunately the connectivity is TERRIBLE!  It rarely connects automatically, and trying to force it to reconnect is only occasionally successful. \n\nI moved the scale next to my router and even upgraded to the latest AirPort Extreme to try to fix it. Nothing. \n\nI can't imagine they did any real user experience testing on this device/app. \n\nThe app and web offer zero support for connection issues. \n\nVery poor design.","updated":"2016-09-02T06:39:31-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"731336056","userName":"Emm Aye","userUrl":"https://itunes.apple.com/us/reviews/id35876637","version":"V1.1.2","score":5,"title":"Nice product","text":"Gave the wrist monitor to my mom as a gift. Works great and it's easy for her to use.","updated":"2013-01-17T21:42:42-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1091011396","userName":"Camilla Fernandes","userUrl":"https://itunes.apple.com/us/reviews/id149353347","version":"1.3.2","score":1,"title":"Does not work","text":"App does not open after the first time. Now my watch is linked to this app and will not sync to ihealth myvitals 2.0 app and therefore the watch doesn't do all it could do such as set up alarms, track my sleep, etc. I'm disappointed.","updated":"2014-11-03T05:49:03-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1281936398","userName":"BillDal","userUrl":"https://itunes.apple.com/us/reviews/id36323135","version":"3.1.7","score":1,"title":"No longer accepts input","text":"This app will no longer allow me to input weight manually – it will allow you to put the data in but it will not save it and Trends shows that no data was entered for that period. Totally useless app now.","updated":"2015-11-04T10:37:15-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"807914468","userName":"WPA3","userUrl":"https://itunes.apple.com/us/reviews/id145335637","version":"V1.1.5","score":3,"title":"Weak sharing BP data","text":"Would be nice and a lot more useful if BP data interfaced with Numbers. Current display and sharing of data is very weak.","updated":"2013-05-20T17:58:56-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1119060378","userName":"Lumpy222","userUrl":"https://itunes.apple.com/us/reviews/id85221141","version":"1.3.5","score":2,"title":"Very Unstable","text":"When it works, it works fine, but it usually crashes. I have an iPhone 6+. I downloaded version 2.0 of the app as well. It crashes 100% of the time. I am using it with the wireless BP cuff (upper arm).","updated":"2014-12-25T09:24:39-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1161725905","userName":"neptune2000","userUrl":"https://itunes.apple.com/us/reviews/id24908548","version":"1.3.5","score":4,"title":"Missing data for Health App","text":"When used with the blood pressure monitor, this app properly exchanges the systolic and diastolic values, but fails to exchange the heart rate.","updated":"2015-03-02T01:43:08-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1258718720","userName":"Jenw34","userUrl":"https://itunes.apple.com/us/reviews/id33879135","version":"1.3.5","score":1,"title":"Worst fitness tracker watch!","text":"I bought the ihealth watch and after four days of use. It has stopped being detected by my ihealth app. I am now unable to view my sleep records and my steps. I won't recommend this to anyone else!!!!!","updated":"2015-09-17T06:18:45-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"714530671","userName":"gtg529s","userUrl":"https://itunes.apple.com/us/reviews/id27184721","version":"1.1.1","score":1,"title":"BP Wrong!","text":"Wow, the BP readings are ridiculously inaccurate. Guys, that is supposed to be your core competency. If you can't get that right then just hang up your hat and walk away. The app design is nothing to rave about either. Which would be totally fine if the hardware actually worked!","updated":"2012-12-23T18:18:21-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1330693365","userName":"SluggoBear","userUrl":"https://itunes.apple.com/us/reviews/id37334564","version":"3.2.2","score":2,"title":"Lost my data with this upgrade","text":"Really bummed. Looks like my last two years of weight and blood pressure history are gone with this update.","updated":"2016-02-09T23:10:33-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1145137741","userName":"Proatscrum","userUrl":"https://itunes.apple.com/us/reviews/id275072819","version":"1.3.5","score":2,"title":"Atrocious UX","text":"This app is bad and you should feel bad. I am returning this scale on principle. The only thing I care more about than the look and feel of my abs are the look and feel of the apps I use.","updated":"2015-02-10T23:28:09-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1073646153","userName":"FischTech","userUrl":"https://itunes.apple.com/us/reviews/id6698263","version":"1.3.0","score":1,"title":"Landscope mode is broken","text":"The most recent app update has broken landscape mode, the app will only render in portrait mode on the ipad.  It will not render in landscape at all, a feature which was offered in previous versions.","updated":"2014-10-01T23:22:13-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1283797457","userName":"Eric 1234566890","userUrl":"https://itunes.apple.com/us/reviews/id123099085","version":"3.1.7","score":1,"title":"Needs Work","text":"I used this several times over the year very successfully. But now I cannot get it to discover devices or sync information. Quite a disappointment for the money spent!","updated":"2015-11-08T06:57:53-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"984633396","userName":"Ketty S","userUrl":"https://itunes.apple.com/us/reviews/id122163492","version":"V1.2.1","score":1,"title":"Absolute Junk!","text":"Absolute JUNK! Don't buy. Could never get it to work with either an iPhone or iPad. Followed all the directions to fix the problem (FAQ). Still wouldn't work. It's a very expensive scale! Don't buy this rip-off piece of junk!","updated":"2014-04-28T22:39:44-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1573480045","userName":"Good News Guy","userUrl":"https://itunes.apple.com/us/reviews/id17117154","version":"3.4.2","score":3,"title":"When it connects it is great","text":"Connection issues need to be fixed so it can be used reliably 😖🙁","updated":"2017-03-26T18:57:58-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1058472112","userName":"WORDUP80S","userUrl":"https://itunes.apple.com/us/reviews/id37970348","version":"1.2.2","score":3,"title":"Works ok","text":"Got in touch with customer service they called me back. It was apron with website. If it synced with my fitness pal this would be great.","updated":"2014-09-03T10:40:40-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1375049873","userName":"Austin_booth","userUrl":"https://itunes.apple.com/us/reviews/id41157896","version":"3.3.5","score":3,"title":"Not working with health on iOS","text":"This is the second time I used this app. It’s not working with the health app on iOS","updated":"2016-05-07T12:22:28-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"835775770","userName":"SolarWind","userUrl":"https://itunes.apple.com/us/reviews/id38273732","version":"V1.1.6","score":1,"title":"The people are correct: devices don't work!","text":"Bought the iHealth scale and it worked the first day... and again the next time I tried it... and not since!  Communication error. Expensive scale. Please fix the app.","updated":"2013-07-12T22:59:33-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"804933442","userName":"EasyD","userUrl":"https://itunes.apple.com/us/reviews/id30976170","version":"V1.1.5","score":2,"title":"Latest update broke my BP cuff","text":"The latest update still doesn't support iPhone 5 screen size, and now my BP cuff won't take a reading when connected to my iPhone… NOT helpful!!!","updated":"2013-05-15T02:58:31-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1516634173","userName":"BrianGGG","userUrl":"https://itunes.apple.com/us/reviews/id35393331","version":"3.4.2","score":3,"title":"Just ok for manual input","text":"Way too many key clicks for manual input. Gets 5 stars as one stop shop for entering data into Health though.","updated":"2017-01-06T09:59:21-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1077848867","userName":"Flopez2267","userUrl":"https://itunes.apple.com/us/reviews/id113225800","version":"1.3.0","score":1,"title":"Doesn't open","text":"I installed it on my Iphone, and it works. I tried the Glucose Smart app, and it I keep getting a network timeout. The same goes for both apps on my Ipad. I was about to buy the Glucose Meter, and Activity Band, but glad I didn't.","updated":"2014-10-09T17:36:43-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1519940569","userName":"b_crafty","userUrl":"https://itunes.apple.com/us/reviews/id49813197","version":"3.4.2","score":1,"title":"Bluetooth connection issues","text":"Every time I go to use it I must disconnect and reconnect the Bluetooth numerous times before the app recognizes the device. It continues to get worse. Today it won't connect at all.","updated":"2017-01-11T07:50:39-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1279439699","userName":"pat valora","userUrl":"https://itunes.apple.com/us/reviews/id133023264","version":"3.1.7","score":1,"title":"DONT DO IT!!!!","text":"Don't buy any products that go with this app. The company will NOT back up their product with repair or replacement. Had a BP cuff given as a gift. It malfunctioned after only 4 or 5 uses. Company wouldn't even look at it. Refused to fix or repair!!","updated":"2015-10-30T06:12:02-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1467280585","userName":"Wafa2","userUrl":"https://itunes.apple.com/us/reviews/id42304689","version":"3.4.1","score":3,"title":"Needs urgent fix","text":"Problems with Bluetooth connection still persist in October 3 update please fix.","updated":"2016-10-15T09:13:12-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1292538371","userName":"MarkDNguyen","userUrl":"https://itunes.apple.com/us/reviews/id24466835","version":"3.1.7","score":1,"title":"Very confusing","text":"One would think that 2.0 is the app to download. It was updated as recently as September. Why is development still going on for both apps?  Which one should I use?","updated":"2015-11-27T14:29:11-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1260393552","userName":"Tlove482","userUrl":"https://itunes.apple.com/us/reviews/id312772391","version":"3.1.6","score":1,"title":"Buggy","text":"Worked fine before the last update. Now it has horrible lag and takes forever to sync. It's almost unusable now.","updated":"2015-09-20T12:45:10-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"748048189","userName":"Vu Miller","userUrl":"https://itunes.apple.com/us/reviews/id269319456","version":"V1.1.2.1","score":5,"title":"Wrist BP excellent","text":"The wrist BP works great. The auto sensor is a great help. I was worried at first about accuracy but matches my arm BP. The app is easy to use.","updated":"2013-02-09T18:53:34-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"725335578","userName":"Megalothymia","userUrl":"https://itunes.apple.com/us/reviews/id219587409","version":"1.1.1","score":2,"title":"Needs work","text":"Just downloaded the app today and each time I try to put in my goal weight it forces the app back to 211 lbs. Please fix this bug.","updated":"2013-01-08T07:11:25-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1564488438","userName":"Dale Brann","userUrl":"https://itunes.apple.com/us/reviews/id452766267","version":"3.4.2","score":4,"title":"So far so good","text":"This works well on my iPhone 7+ so far. I'd like to see iWatch support!","updated":"2017-03-14T13:06:43-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1460913885","userName":"iTech 4ever","userUrl":"https://itunes.apple.com/us/reviews/id22446860","version":"3.4.1","score":1,"title":"Crashes immediately!","text":"Now I can no longer use any iHealth devices, because the app won't work for longer than 1 second. Please fix the bug!","updated":"2016-10-04T07:25:20-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1280761142","userName":"Shamu124","userUrl":"https://itunes.apple.com/us/reviews/id28554152","version":"3.1.7","score":1,"title":"Update is bad","text":"The new update is not good. Doesn't connect as good now and the user interface is not nearly as easy to use. Please bring back the previous user interface.","updated":"2015-11-01T21:09:53-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1268696873","userName":"Swissarmymom","userUrl":"https://itunes.apple.com/us/reviews/id131775932","version":"3.1.7","score":1,"title":"Previous version was better","text":"Not sure why they removed the ability to switch from portrait to landscape. The red/yellow/green indicators were much clearer as well. Not a fan of the new version...","updated":"2015-10-08T06:11:23-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"785236509","userName":"imlanman","userUrl":"https://itunes.apple.com/us/reviews/id16457484","version":"V1.1.3","score":5,"title":"Works great","text":"Works perfectly well with wireless Bluetooth blood pressure cuff.","updated":"2013-04-09T21:25:35-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1330711613","userName":"luddz","userUrl":"https://itunes.apple.com/us/reviews/id12340516","version":"3.2.2","score":2,"title":"Everything a fail","text":"New update causes timeout with login via Evernote. \n\nWhole system is complicated and overkill.\n\nScales require Wifi and Bluetooth. Why?!","updated":"2016-02-10T00:09:16-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1460982634","userName":"Mjg60","userUrl":"https://itunes.apple.com/us/reviews/id100837535","version":"3.4.1","score":1,"title":"Crashes","text":"I would give the app 4 stars, but the new release causes the apps to crash on start up.   Don't upgrade until the 10/3 release is fixed.","updated":"2016-10-04T09:39:22-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1373404263","userName":"Kouhro","userUrl":"https://itunes.apple.com/us/reviews/id154131917","version":"3.3.5","score":1,"title":"App is not work and suddenly closed","text":"This app is not nice but from 10 days before suddenly closed \nSolve a problem immediately please\nI have both app but i hate this app","updated":"2016-05-04T07:06:35-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"758153497","userName":"jmlara06","userUrl":"https://itunes.apple.com/us/reviews/id48777182","version":"V1.1.2.1","score":2,"title":"It freezes","text":"When uploading it freezes please fix!","updated":"2013-02-24T10:10:28-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1577523842","userName":"I'm Mr. Lau","userUrl":"https://itunes.apple.com/us/reviews/id559877194","version":"3.4.2","score":5,"title":"Pretty good","text":"urs scale looks so cute wish losing weight effect.","updated":"2017-03-31T18:59:17-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1173149076","userName":"marianoz","userUrl":"https://itunes.apple.com/us/reviews/id26269769","version":"1.3.5","score":1,"title":"Laat update killed this app for me","text":"The app stopped working right after the last update.  My monitor gives me an error and the red light stays on. At least I can still use the old iHealth app.  Please fix this app.","updated":"2015-03-25T09:14:49-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1133070803","userName":"MissRSA","userUrl":"https://itunes.apple.com/us/reviews/id117947138","version":"1.3.5","score":1,"title":"Also never works","text":"I have just purchased iHealth wireless body analysis scale and this app and the newer app never detected the device and the device itself never measured anything except the weight. I'm really bummed.","updated":"2015-01-20T03:08:52-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1374392160","userName":"BeetleBug62","userUrl":"https://itunes.apple.com/us/reviews/id37586702","version":"3.3.5","score":2,"title":"Locks up all the time...","text":"The latest version, 3.3.5, locks up two iPhones that I use with the blood pressure monitor. I have to reboot constantly to get a result.","updated":"2016-05-06T07:24:47-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1386440449","userName":"Scrappyjenni :)","userUrl":"https://itunes.apple.com/us/reviews/id101041215","version":"3.3.5","score":1,"title":"Freezes since iOS 9.3.2","text":"Freezes when trying to take blood pressure or when app first opens for upwards of 5 min! Support has reinstall & that does no good! This used to be an awesome app!!!","updated":"2016-05-30T09:12:36-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1551682638","userName":"Oops3","userUrl":"https://itunes.apple.com/us/reviews/id25054632","version":"3.4.2","score":1,"title":"Height issues","text":"I have 5 broken vertebra and shrank 3\". When the last one went I had myself measured. No more shrinking thankfully. So why does the app say I did, and where did it get its figure from?","updated":"2017-02-24T09:22:05-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1262709201","userName":"BillyKB","userUrl":"https://itunes.apple.com/us/reviews/id152187263","version":"3.1.6","score":2,"title":"Why change it?","text":"The old app worded better, was clear and easy to use.  Bring it back or fix this one.\nBillKB","updated":"2015-09-25T13:33:38-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1264192157","userName":"ailaro","userUrl":"https://itunes.apple.com/us/reviews/id17307605","version":"3.1.6","score":1,"title":"Don't buy iHealth BP, software is a joke!","text":"Let us use the previous version. There was nothing wrong with that. I just want to measure my BP, we don't need your updates!!! At least let us choose!!!","updated":"2015-09-28T15:58:50-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1393894541","userName":"KaterynaKostiuk","userUrl":"https://itunes.apple.com/us/reviews/id366817334","version":"3.3.5","score":2,"title":"I didn't get it","text":"How do you actually change the language in this app? I thought it mint depend on the region but it doesn't.","updated":"2016-06-13T12:35:41-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1080292957","userName":"Themanchild12","userUrl":"https://itunes.apple.com/us/reviews/id119320449","version":"1.3.0","score":1,"title":"Health integration terrible","text":"The health app integration is terrible...my body lean mass on this app says 127ish but when it transfers to health it is 220ish. Also body fat % on scale is off says I am 5%_6% when other scales all say about 9%. Please fix all this","updated":"2014-10-14T07:10:32-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1253471001","userName":"EB506","userUrl":"https://itunes.apple.com/us/reviews/id26174969","version":"1.3.5","score":1,"title":"Aweful App","text":"Barely works on an iPhone 4s. Crashes, freezes, and frequent data loss. Get a different weight scale because the app for this device is very disappointing.","updated":"2015-09-05T06:59:11-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1273710086","userName":"Sylvester4","userUrl":"https://itunes.apple.com/us/reviews/id21842034","version":"3.1.7","score":1,"title":"Clunky Update","text":"Bluetooth connection slower and often drops. Battery life indicator now buried in menus - an important indication that used to appear on startup. \n\nRepost the old App - it worked just fine!","updated":"2015-10-18T11:42:37-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1080366386","userName":"tkukoc","userUrl":"https://itunes.apple.com/us/reviews/id36180684","version":"1.3.0","score":1,"title":"8.0.2","text":"Cannot sync since latest iOS update. Not to mention the 2.0 app doesn't recognize the watch as being connected at all. Please fix this!","updated":"2014-10-14T10:05:28-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1216771353","userName":"almhuss","userUrl":"https://itunes.apple.com/us/reviews/id34428424","version":"1.3.5","score":1,"title":"Unacceptable","text":"Trying to sync wireless blood pressure cuff to iPad.  App crashes to desktop when selecting device.  App also doesn't sync between version 1.3.5 on iPad and version 2.0 on iPhone.","updated":"2015-06-23T12:34:09-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1268945582","userName":"Isaacc7","userUrl":"https://itunes.apple.com/us/reviews/id39099864","version":"3.1.7","score":1,"title":"Sign in? Why?","text":"I just want to take my blood pressure. I should not need to sign in to anything. I also have zero interest in sharing my health info. Now looking for another app to use for BP.","updated":"2015-10-08T19:39:21-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1078056623","userName":"Will I am Ricardo","userUrl":"https://itunes.apple.com/us/reviews/id39431943","version":"1.3.0","score":1,"title":"Don't waste your time or money","text":"Activity tracker does not sync regardless of how many times I restart my phone after closing the app and disabling bluetooth","updated":"2014-10-10T04:19:30-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"929876536","userName":"itsjustmy2cents","userUrl":"https://itunes.apple.com/us/reviews/id27558261","version":"V1.2.0","score":1,"title":"Was Good","text":"Worked great for week w/iphone 5.  Now app Crashes all the time & only sometimes recognizes my device model # AM3. Good idea but Poorly executed. No in app support?  & Support from site-No answers. Wishing I'd bought Fitbit :'(","updated":"2014-01-23T11:20:46-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1609498648","userName":"sdtaheri","userUrl":"https://itunes.apple.com/us/reviews/id136274554","version":"3.5.1","score":3,"title":"Resolution","text":"Will you ever support iPhone 6 and iPhone 6s Plus native resolution?! It's been nearly 4 years!","updated":"2017-05-09T10:07:46-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"877101457","userName":"The Lady J","userUrl":"https://itunes.apple.com/us/reviews/id20142705","version":"V1.1.9","score":1,"title":"Worked for one day...","text":"I am uninstalling and reinstalling....but pretty disappointed so far. I've reset the watch trying to get it to sync...and no luck yet. May return this....\n\nReturning...","updated":"2013-09-30T03:24:40-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1264161233","userName":"Jim Tunick","userUrl":"https://itunes.apple.com/us/reviews/id31739374","version":"3.1.6","score":1,"title":"iHealth new version","text":"Please bring back the old version!  This new one is confusing and much more difficult to use.  Thumbs down","updated":"2015-09-28T13:55:23-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1266926688","userName":"HenryGoldberg","userUrl":"https://itunes.apple.com/us/reviews/id324560355","version":"3.1.6","score":4,"title":"Blue tooth Bon","text":"This app works with the Bluetooth arm cuff monitor BP5 41D394. Why did they make this app so difficult to find??","updated":"2015-10-04T09:03:49-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1460781375","userName":"Not working - October 3 update","userUrl":"https://itunes.apple.com/us/reviews/id32876661","version":"3.4.1","score":1,"title":"Crashes repeatedly on startup","text":"Previous version of app worked nicely. Unable to use the scale because the app crashes at startup.....","updated":"2016-10-04T03:09:22-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1426035904","userName":"frankiehl28","userUrl":"https://itunes.apple.com/us/reviews/id23555764","version":"3.3.8","score":1,"title":"deosn't sync, No support","text":"Got the app because i bought the wireless BP Moniter.  I synched with apple health for a while, then stooped.  Sent an e-mail to support, to which they NEVER responded.  recent update doesn't help either.","updated":"2016-08-03T16:02:12-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1311818471","userName":"Sailshark","userUrl":"https://itunes.apple.com/us/reviews/id427813948","version":"3.2.0","score":1,"title":"Why?","text":"Why can't I just log the info myself?  I don't have an unlimited amount of money to buy all the gadgets to make this work.  What a scam.","updated":"2016-01-05T13:00:03-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1277419617","userName":"SlushdogRYEF","userUrl":"https://itunes.apple.com/us/reviews/id262903898","version":"3.1.7","score":1,"title":"Outrageous Developer","text":"Ditto to all of the other one star reviews. The older version worked fine.  Using my iHealth cuff blood pressure is now a big pain in the b***.  Now what?  I want a refund!","updated":"2015-10-26T07:13:51-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"979065445","userName":"Descoto_0820","userUrl":"https://itunes.apple.com/us/reviews/id28694462","version":"V1.2.0","score":3,"title":"Fix it!","text":"Fix you dam app! The list does not work!","updated":"2014-04-18T09:50:15-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1460787613","userName":"MR.GSE","userUrl":"https://itunes.apple.com/us/reviews/id42890526","version":"3.4.1","score":1,"title":"Was 5 stars.....","text":"App will not stay open on my iPhone 7 Plus.........still works on my iPhone 6s......there was just an update to fix crashing.","updated":"2016-10-04T03:24:33-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1104788538","userName":"Abu hat tan","userUrl":"https://itunes.apple.com/us/reviews/id370833702","version":"1.3.5","score":1,"title":"Bluetooth error","text":"After this update it does not recognize the watch via Bluetooth","updated":"2014-11-28T12:43:27-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"894539255","userName":"Quant gal","userUrl":"https://itunes.apple.com/us/reviews/id153743556","version":"V1.1.11","score":1,"title":"Crashes","text":"The wireless scale I bought is useless because the app crashes upon set up. I have an iPhone 5 and the latest iOS.  Please fix your app.","updated":"2013-11-11T19:24:23-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"852864067","userName":"Millvalleysfinest","userUrl":"https://itunes.apple.com/us/reviews/id100957988","version":"V1.1.7","score":1,"title":"Scale stopped working after 2 months","text":"The scale simply stopped working after two months. No resolution from the manufacturer – yet.","updated":"2013-08-12T08:58:06-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1460845491","userName":"Tgggfg443","userUrl":"https://itunes.apple.com/us/reviews/id138370616","version":"3.4.1","score":2,"title":"Update bug","text":"Ever since the recent update the app crashes","updated":"2016-10-04T05:24:09-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1397699714","userName":"Rhb0731","userUrl":"https://itunes.apple.com/us/reviews/id105067251","version":"3.3.6","score":1,"title":"Stopped working with new update","text":"I use this app daily to track all my vital signs into HealthKit but it stopped working with this latest update.","updated":"2016-06-20T14:44:25-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1328263462","userName":"Pedroadrian","userUrl":"https://itunes.apple.com/us/reviews/id121762513","version":"3.2.2","score":1,"title":"Terrible upgrade","text":"Don't upgrade, after latest update can't login and all my data is lost","updated":"2016-02-05T07:49:03-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1568525789","userName":"D000O","userUrl":"https://itunes.apple.com/us/reviews/id390240225","version":"3.4.2","score":1,"title":"Crashhh","text":"I downloaded the app two days ago. At first it was ok but it crashes every time I open the app and I can't sync my device.","updated":"2017-03-20T03:02:08-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1460793456","userName":"Gump987","userUrl":"https://itunes.apple.com/us/reviews/id31439776","version":"3.4.1","score":1,"title":"Crashes all the time","text":"The latest update has the app crashing as soon as it opens...","updated":"2016-10-04T03:38:37-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"916314439","userName":"Deekidney","userUrl":"https://itunes.apple.com/us/reviews/id368522174","version":"V1.1.12","score":1,"title":"Wireless tracker","text":"This ihealth wireless activity tracker is the most frustrating device to set up!!!! Would not recommend this to anyone!","updated":"2013-12-28T17:08:16-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1405182574","userName":"Nature-Africa","userUrl":"https://itunes.apple.com/us/reviews/id262746010","version":"3.3.8","score":1,"title":"Out dated","text":"There are so many health tech device now. I never used this cause newer logs are available. Plus this is more related to ppl with hypertension.","updated":"2016-07-04T03:05:44-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1590536141","userName":"Tammytata","userUrl":"https://itunes.apple.com/us/reviews/id270330581","version":"3.4.2","score":1,"title":"Returning this tomorrow","text":"Worked the first time I used it then it wouldn't connect again.  Don't bother with this product.","updated":"2017-04-16T16:11:23-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1260546936","userName":"veryken","userUrl":"https://itunes.apple.com/us/reviews/id26210301","version":"3.1.6","score":1,"title":"TEXT TOO SMALL","text":"You kids think I have the eyes of a 20 year old?! What ignorance in design. Companies that make magnifying glass must be paying you for your rubbish.","updated":"2015-09-20T20:17:01-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1057932871","userName":"Badger79","userUrl":"https://itunes.apple.com/us/reviews/id36182381","version":"1.2.2","score":1,"title":"Cannot connect","text":"Unable to connect so all I can use is Guest Mode. Get msg Warning - Network Timeout when trying to create user profile or signon.","updated":"2014-09-02T08:54:16-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1018175748","userName":"courtneyfolsom","userUrl":"https://itunes.apple.com/us/reviews/id221969163","version":"V1.2.1","score":1,"title":"Not easy to use","text":"The app isn't user friendly and you have to input tons of your own info.","updated":"2014-06-27T17:29:22-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"894387771","userName":"Kristin Cooper","userUrl":"https://itunes.apple.com/us/reviews/id360343162","version":"V1.1.11","score":1,"title":"iPad air not compatible","text":"iPad Air is not compatible with their wifi scales. Crashes every time trying to connect.","updated":"2013-11-11T10:19:02-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1461078782","userName":"cutdownatreewithahearing","userUrl":"https://itunes.apple.com/us/reviews/id47666105","version":"3.4.1","score":1,"title":"Crashes on open","text":"Newest update makes this unusable.","updated":"2016-10-04T14:32:07-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1411369673","userName":"DaveJeffery","userUrl":"https://itunes.apple.com/us/reviews/id29778922","version":"3.3.8","score":2,"title":"Retired","text":"Application needs to be able to record continuous readings of SpO2 and heart rate. Then output graph by date and time. Output of all readings to excel spreadsheet would be great.","updated":"2016-07-13T19:38:11-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1460934170","userName":"MiGuMa","userUrl":"https://itunes.apple.com/us/reviews/id22353631","version":"3.4.1","score":3,"title":"New update crashes!","text":"Beware!!","updated":"2016-10-04T08:02:24-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1264536082","userName":"mwruble","userUrl":"https://itunes.apple.com/us/reviews/id31393861","version":"3.1.6","score":1,"title":"Broken","text":"This version will not connect to my BP monitor. I have \"forgotten\" and reconnected the device but app will not see it so Both are now useless. Thanks.","updated":"2015-09-29T10:02:08-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1605202082","userName":"ihamad16","userUrl":"https://itunes.apple.com/us/reviews/id272898535","version":"3.5.0","score":1,"title":"problem","text":"All numbers of measurements have changed","updated":"2017-05-04T15:32:28-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1260303926","userName":"GwynAM","userUrl":"https://itunes.apple.com/us/reviews/id414943774","version":"3.1.6","score":1,"title":"Mr","text":"Recent app update was a backward step where they have put aesthetics over usability.  \n\nSo poor that I'm thinking of dumping the scales and BP monitor I bought and getting their FitBit equivalents.","updated":"2015-09-20T08:56:34-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1461154901","userName":"Diederik I J","userUrl":"https://itunes.apple.com/us/reviews/id137994964","version":"3.4.1","score":1,"title":"Crashes on start up since latest update :(","text":"Quality Assurance?","updated":"2016-10-04T18:37:22-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1178753265","userName":"Mac Attack 2012","userUrl":"https://itunes.apple.com/us/reviews/id20505884","version":"1.3.5","score":1,"title":"Won't work with latest OS","text":"The app freezes every time I try to measure. Wait until it's fixed.","updated":"2015-04-06T05:41:53-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1098985530","userName":"AkaneKokawa","userUrl":"https://itunes.apple.com/us/reviews/id116006071","version":"1.3.4","score":1,"title":"Doesn't even connect","text":"It doesn't sync or connect with the walking device >:/","updated":"2014-11-18T03:50:38-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"915474953","userName":"Mundins","userUrl":"https://itunes.apple.com/us/reviews/id276088851","version":"V1.1.12","score":1,"title":"Not good","text":"Tough to sync.  Crashes all the time. Very frustrating after buying their monitor.","updated":"2013-12-27T04:25:43-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"827833127","userName":"mp ID for Apple","userUrl":"https://itunes.apple.com/us/reviews/id15520489","version":"V1.1.6","score":1,"title":"Consistently shows higher numbers","text":"Compared Omron which is validated by my Dr. iHealth shows higher number than what it is. \nApp is lame too. \nReturning the unit.","updated":"2013-06-28T04:16:39-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1408446591","userName":"Philrn","userUrl":"https://itunes.apple.com/us/reviews/id111309432","version":"3.3.8","score":2,"title":"Bummer","text":"I purchased this as it would import info into apple health kit but it does not.","updated":"2016-07-09T08:29:54-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1397724556","userName":"uselesseater","userUrl":"https://itunes.apple.com/us/reviews/id146421063","version":"3.3.6","score":1,"title":"iHealth disappoints again","text":"Healthkit was working fine. I am so disappointed with iHealth products and software. Always halfway there.","updated":"2016-06-20T16:13:18-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"944685139","userName":"abalexab","userUrl":"https://itunes.apple.com/us/reviews/id46187666","version":"V1.2.0","score":1,"title":"Bad communication with scale after last update.","text":"Bad communication with scale after last update.","updated":"2014-02-16T07:56:53-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"872652788","userName":"Randy Kozen","userUrl":"https://itunes.apple.com/us/reviews/id265645642","version":"V1.1.9","score":1,"title":"App keeps crashing!!!","text":"Crash after connecting to Bluetooth. Useless update.","updated":"2013-09-19T16:29:53-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"906400161","userName":"skyforever1000","userUrl":"https://itunes.apple.com/us/reviews/id261764434","version":"V1.1.12","score":1,"title":"Bug, bug and bug, don't buy any of their product","text":"Bug, bug and bug, don't buy any of their products","updated":"2013-12-08T18:14:34-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"866478350","userName":"Marc Pick,DC","userUrl":"https://itunes.apple.com/us/reviews/id153016468","version":"V1.1.7","score":1,"title":"Beverly Hills Chiropractic Center","text":"The new updated arm cuff is none functional since the Velcro was removed around the up and down labels. The cuff unravels during inflation.","updated":"2013-09-06T16:13:34-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1608833320","userName":"Lee @ Brooklyn","userUrl":"https://itunes.apple.com/us/reviews/id28153866","version":"3.5.0","score":1,"title":"Body Fat is inaccurate after last update","text":"Body Fat appeares iaccuarate after 5/2 update.  And the scale became useless now.\nPlease fix it ASAP.","updated":"2017-05-08T18:21:18-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1521514449","userName":"Jack52406","userUrl":"https://itunes.apple.com/us/reviews/id28170180","version":"3.4.2","score":4,"title":"Really no temp?","text":"How could you not include temp?","updated":"2017-01-13T15:33:07-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1568944250","userName":"schulzpm","userUrl":"https://itunes.apple.com/us/reviews/id101417110","version":"3.4.2","score":5,"title":"Great!!","text":"I have the Core scale and love it and this app.","updated":"2017-03-20T18:38:19-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1394000752","userName":"R.Snook","userUrl":"https://itunes.apple.com/us/reviews/id168591479","version":"3.3.5","score":1,"title":"9:30 pm","text":"New update times out and won't let you login bugs in the update.","updated":"2016-06-13T18:36:04-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1384711382","userName":"CLOUD-STRIFE","userUrl":"https://itunes.apple.com/us/reviews/id42013950","version":"3.3.5","score":1,"title":"Bad!","text":"Won't work! \n\nI have a blood pressure tester, that I can't use because of this app won't load!\n\nUpdate the app!!","updated":"2016-05-26T23:45:39-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1131095317","userName":"Keasmom","userUrl":"https://itunes.apple.com/us/reviews/id28044301","version":"1.3.5","score":1,"title":"Does not work with iPhone 6.","text":"Bluetooth does not pair with iHealth on iPhone 6.  It worked fine with iPhone 4S.","updated":"2015-01-16T16:25:56-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1460690189","userName":"Jeremyalb4","userUrl":"https://itunes.apple.com/us/reviews/id297357205","version":"3.4.0","score":1,"title":"Worst","text":"I have the BP5 and after they updated the app my cuff will no longer inflate now","updated":"2016-10-03T23:18:31-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"912866134","userName":"Loower80","userUrl":"https://itunes.apple.com/us/reviews/id367001809","version":"V1.1.12","score":1,"title":"I can not connect","text":"I can not connect ihealth am3 with ipad4 constantly flashes on the clock and the connection plate but is not synchronized and is not connected!","updated":"2013-12-21T22:30:44-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6021351506","userName":"Harry smooth","userUrl":"https://itunes.apple.com/us/reviews/id177749896","version":"3.11.3","score":3,"title":"Cuff works Great! Connection to app, not so much","text":"Well the cuff works great, but I would LOVE it to connect with the iHealth app! The WiFi connects perfectly, but when I go to “Set the User” BAM.... error 999 EVERYTIME! \nI have the WAVE fitness tracker and it connected right up and syncs beautifully with the App! But this BP unit! Grrrrrr I have some scales coming too! If they don’t connect they’re goin BACK JACK!\n06/01/2020 Update: \nI wrote to tech support, a month ago and the only response I received was an email that said” Some Devices work on Wi-Fi and others on Bluetooth” LOL.... that was the extent of my tech-support LOL\nI’m somewhat of a “Techy” myself, and of course I know some devices work on Bluetooth and others on Wi-Fi… Duh,\nAnd I did receive the scales and they Bluetooth perfectly with my app, but the blood pressure cuff works over Wi-Fi and the unit itself connects to my Wi-Fi but does not transfer the data to the iHealth app… I finally got it to connect, but it’s random at best! Sometimes it connects, sometimes it doesn’t… Most of the time I have to manually input the data… So don’t count too much on tech-support if you purchase an ihealth item because they assume that you’re an idiot!... I guess… No other reason for a stupid reply like that! Lol....","updated":"2020-06-01T03:53:06-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"975971731","userName":"St1410","userUrl":"https://itunes.apple.com/us/reviews/id107850669","version":"V1.2.0","score":1,"title":"Only new app","text":"Will change something\nmake 2.0","updated":"2014-04-12T11:23:13-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"954337445","userName":"dpny306","userUrl":"https://itunes.apple.com/us/reviews/id39425482","version":"V1.2.0","score":1,"title":"The Worst App","text":"The app is as bad as the scale that we bought to go with it, it never works!","updated":"2014-03-04T20:43:44-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1199344297","userName":"Ezekielswheels","userUrl":"https://itunes.apple.com/us/reviews/id114808188","version":"1.3.5","score":1,"title":"DO NOT USE WITH MY FITNESS PAL","text":"It erased a year and a half's worth of weight loss data when syncing with MFP. In addition to multiple crashes. DO NOT US THIS APP WITH MFP IF YOU CARE ABOUT YOUR INFO","updated":"2015-05-18T15:24:00-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1084498044","userName":"Mkrupnic","userUrl":"https://itunes.apple.com/us/reviews/id218753547","version":"1.3.1","score":1,"title":"Total crap","text":"Seriously? Come on. This app is the lowest piece of dog crap I've ever seen. It stinks. It's clear you have no design and no qa!","updated":"2014-10-22T08:43:34-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"968480609","userName":"Gdoble11","userUrl":"https://itunes.apple.com/us/reviews/id121263649","version":"V1.2.0","score":1,"title":"Can't connect","text":"The app does not connect to my device","updated":"2014-03-30T18:09:02-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1461203930","userName":"RainWarriorStar","userUrl":"https://itunes.apple.com/us/reviews/id211040452","version":"3.4.1","score":1,"title":"App Crashing","text":"Ever since the new update the iHealth app shuts down on startup.","updated":"2016-10-04T20:28:09-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1461453111","userName":"DPDave9","userUrl":"https://itunes.apple.com/us/reviews/id14859424","version":"3.4.1","score":1,"title":"Crashes on startup 10.0.2","text":"Need a fix now for iPhone 6s IOS 10.0.2","updated":"2016-10-05T05:48:23-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1268917303","userName":"Eislingen","userUrl":"https://itunes.apple.com/us/reviews/id312782536","version":"3.1.7","score":1,"title":"Oximeter not working","text":"I'm so fed up with the updates.... For all the apps.... Now my oxy. Isn't working...","updated":"2015-10-08T18:05:02-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1532953434","userName":"ITOLEFT","userUrl":"https://itunes.apple.com/us/reviews/id400335973","version":"3.4.2","score":1,"title":"Connection Problema","text":"Completely aleatory connection. Unreliable. Is a real disappointment because the HS5 scale and BP5 are really good. 😔","updated":"2017-01-29T06:32:35-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"966436894","userName":"Sleepysb","userUrl":"https://itunes.apple.com/us/reviews/id108325483","version":"V1.2.0","score":4,"title":"Wow, I was so wrong, disappointed (at first) but now...","text":"This is a follow up review - After using the iHealth device for the past 3+ weeks and comparing alongside 2 other similar devices at the same time, the iHealth is the only one that we are still using, the other 2 didn't make it past the first 2 weeks. \n Hands down this one is the best of the 3 units we evaluated and the amount of data it has collected (using the iHealth wifi scale and blood pressure monitor) is impressive. The scale is definitely worth an extra $99 because it measures not only weight, but BMI, BF% (Body Fat percentage), Lean Mass lbs, Muscle Mass lbs, Bone Mass, Body Water % and most importantly can calculate VFR (Visceral Fat Rating) which is calculated and as important as your BMI and is valuable from a medical standpoint when you are monitoring weight changes, lipid profiles, and trying to decrease your risk for coronary heart disease. Visceral fat, (gut fat), is the worst kind of fat and if your BMI is high due to high visceral fat, (VFR > 12), you are in a higher risk category for coronary artery disease (CAD) than someone with same BMI and and a VFR of 7. So monitoring you VFR as well as BMI and Body fat % is as (or more) important and lowering your VFR rating directly correlates with lower associated risk of CAD. \n Overall, the device is a valuable tool which empowers patients and gives them the ability to monitor their own health and wellness and make necessary changes on a daily basis and will also allow for better communication with their physicians and provide them with objective data and instead of treating you when you get sick, focussing on wellness will have much better outcomes.\n My biggest problem and why I am giving it 4 stars instead of 5 was the difficulty I had setting it up and lack of in-app support or on website but once I figured it out, the next one was a breeze.\n(First review)\nI consider myself to be somewhat tech savvy and after spending an hour trying to set it up and synced, I was unable to get it to recognize the device. I went to the website for instruction on a manual setup and found no help there. The reason I bought this device was to evaluate it and its accuracy for use with my patients in my sleep medicine practice. It seems like a very good alternative and cost effective way to monitor and evaluate patients sleep perception vs. sending them home with an actigraphy watch, which typically cost several thousand dollars for a single watch and health insurance rarely pays for it, (plus they would own it forever). But considering I can't set the device up myself and no way to communicate with customer service or support within the app, I can't recommend this particular product to my patients, many who can barely figure out how to send a text message on their smartphone. I can not understand why the device won't connect via Bluetooth to my IPad or even show up as a discoverable device.","updated":"2014-03-27T08:34:25-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1260228860","userName":"AZYUMA","userUrl":"https://itunes.apple.com/us/reviews/id37202589","version":"3.1.6","score":1,"title":"What have they done?","text":"A giant leap....backward! Need a magnifying glass to read results. How useful is that. Worthless now.","updated":"2015-09-20T06:23:39-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1129415053","userName":"FriedaM","userUrl":"https://itunes.apple.com/us/reviews/id182988088","version":"1.3.5","score":1,"title":"Waste of money","text":"Bought the Edge fitness and sleep tracker.  WON'T SYNC AT ALL.  Will be returning device.","updated":"2015-01-13T13:04:53-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1398108441","userName":"VDI666","userUrl":"https://itunes.apple.com/us/reviews/id107716623","version":"3.3.8","score":2,"title":"Ihealth Bp5","text":"ver. 3.3.8\nSorry guys still has same problem. \nUpdated app\nEnabled apple health\nOpened ihealth\nApp froze \nRebooted iphone\nTurned off switches in Apple health\nBp5 came back to life \n\nVincente D'Ingianni","updated":"2016-06-21T09:23:44-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"742069864","userName":"Nutella Bear","userUrl":"https://itunes.apple.com/us/reviews/id101155264","version":"V1.1.2","score":4,"title":"Great Product, Strange Reviews...","text":"I have the wrist BP monitor which I got because my BP needs to be regularly checked due to a medication I take potentially causing a hypertensive crisis. The cuff works great and is far less a chore than the machine that they use at my Doctor's office. The next time I go in I am going to have the staff check to make sure the cuff is accurate. The first few readings I did seemed in the right range. \n\nThe software. It works and it looks fine to me. I read some comments that it is clunky and uses odd input methods. I am really wondering what kind of people are buying this (grey hairs????) but the software is pretty standard iOS stuff. Uses some spinners to enter parameters for example, but that is run-of-the-mill iOS style apps. Thankfully iHealth did not use any \"shake\" selections (at least that I've seen) because some of these users would smack themselves in the face...\n\nIntegration between the software and cuff is pretty fool proof. It can tell if you have the cuff on the left or right hand (needs to be left hand). And it tells you at what angle your arm is resting (needs to be relatively horizontal). No crashes or operational problems so far. \n\nI work with computers and it seems to me like some of the user's submitting reviews so far don't really understand how the technology works together. Or how their iOS devices work -- for example, pairing BlueTooth devices and whatnot.\n\nI am pleased with everything so far! Good purchase for me because I can carry the cuff around with me everywhere. Four stars, because there are perhaps more features that can be added and it looks like they are working on expanding the environment with updates.","updated":"2013-02-01T17:45:45-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1079508955","userName":"Gaz Whalen","userUrl":"https://itunes.apple.com/us/reviews/id395323334","version":"1.3.0","score":1,"title":"Ihealth app for wrist wireless","text":"Doesn't work - absolute waste of time and money.","updated":"2014-10-12T17:53:23-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1100489327","userName":"Innovate_H","userUrl":"https://itunes.apple.com/us/reviews/id116434261","version":"1.3.4","score":2,"title":"Bugs!","text":"So many bugs!!! Fix it man!!","updated":"2014-11-21T03:16:34-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1072784723","userName":"dlarsonmobile","userUrl":"https://itunes.apple.com/us/reviews/id112181146","version":"1.3.0","score":1,"title":"Activity Tracker","text":"Activity tracked does not work. It will not sync iphone with 8.02","updated":"2014-09-30T08:02:47-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1330048930","userName":"Grandee4","userUrl":"https://itunes.apple.com/us/reviews/id305688030","version":"3.2.2","score":1,"title":"Bad Update!","text":"Lost all my BP readings after this latest update!  Boo!","updated":"2016-02-08T16:13:49-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1172785680","userName":"Mcwolf2000","userUrl":"https://itunes.apple.com/us/reviews/id110343112","version":"1.3.5","score":2,"title":"Old fashion","text":"Please update the app","updated":"2015-03-24T12:26:35-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1422361914","userName":"Chasingkans1","userUrl":"https://itunes.apple.com/us/reviews/id126283343","version":"3.3.8","score":1,"title":"Bummer","text":"Won't let me sign in so goodbye app","updated":"2016-07-29T15:46:37-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1127709255","userName":"ScarletProfessor","userUrl":"https://itunes.apple.com/us/reviews/id28503635","version":"1.3.5","score":1,"title":"Useless!","text":"What a waste of time and money!","updated":"2015-01-10T10:21:45-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"797597887","userName":"IcemanMc","userUrl":"https://itunes.apple.com/us/reviews/id192729405","version":"V1.1.4","score":1,"title":"Poor app!","text":"The app crashes everytime it syncs with the scale! Not happy!","updated":"2013-05-01T16:11:06-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"793165146","userName":"la_voz","userUrl":"https://itunes.apple.com/us/reviews/id28602465","version":"V1.1.4","score":1,"title":"Wireless Wrist Blood Pressure Monitor","text":"The wireless WBPM stopped working after the last update 20APR13....\n\nNooooo Buenoooo\n\nNow I've got a paperweight!!!!!","updated":"2013-04-23T14:29:09-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1102325053","userName":"cuteasabutton13","userUrl":"https://itunes.apple.com/us/reviews/id22683165","version":"1.3.4","score":1,"title":"Terrible hardware & app","text":"Don't buy them!!","updated":"2014-11-24T04:34:59-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"916779900","userName":"Tim Tam Slam","userUrl":"https://itunes.apple.com/us/reviews/id36755982","version":"V1.1.12","score":1,"title":"Max weight is 352.7","text":"Disappointed. Please update.","updated":"2013-12-29T12:34:39-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"770045896","userName":"JHeff9582","userUrl":"https://itunes.apple.com/us/reviews/id196907743","version":"V1.1.3","score":2,"title":"UPDATE APP","text":"Great product but NEED TO UPDATE APP. Please optimize for iPhone 5. The Withings app is much nicer.","updated":"2013-03-15T12:43:08-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1081062735","userName":"Jentle4Christ","userUrl":"https://itunes.apple.com/us/reviews/id43241004","version":"1.3.0","score":1,"title":"Sync issue","text":"Nothing synchronizes!!!!","updated":"2014-10-15T21:34:09-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1068236048","userName":"Freerk1231","userUrl":"https://itunes.apple.com/us/reviews/id28136997","version":"1.2.2","score":1,"title":"F'd up, not compatible with iOS8","text":"To the contrary of what the description says, this app is all f'ed up in iOS8.","updated":"2014-09-21T15:18:04-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1397768834","userName":"filmless","userUrl":"https://itunes.apple.com/us/reviews/id43976984","version":"3.3.6","score":2,"title":"HealthKit integration","text":"Please fix the integration.","updated":"2016-06-20T18:41:23-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1314076044","userName":"Joelleible","userUrl":"https://itunes.apple.com/us/reviews/id277160764","version":"3.2.0","score":2,"title":"No HealthKit Support","text":"Does NOT sync with HealthKit.","updated":"2016-01-09T19:53:54-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1222375595","userName":"Joshuarivera","userUrl":"https://itunes.apple.com/us/reviews/id86207510","version":"1.3.5","score":1,"title":"Fix it!!!","text":"Fix it fix it fix it!!!!","updated":"2015-07-04T21:50:56-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1287058718","userName":"Other nicknames are taken2012","userUrl":"https://itunes.apple.com/us/reviews/id104749947","version":"3.1.7","score":1,"title":"What a piece of junk","text":"Geeeze","updated":"2015-11-15T08:55:39-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1022358714","userName":"Erixbp","userUrl":"https://itunes.apple.com/us/reviews/id102521295","version":"V1.2.1","score":1,"title":"Wrist bp monitor","text":"Waste of money","updated":"2014-07-04T17:29:18-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"1408740964","userName":"Noooniiii","userUrl":"https://itunes.apple.com/us/reviews/id513471163","version":"3.3.8","score":5,"title":"Love it","text":"Good❤️","updated":"2016-07-09T20:56:24-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"2528989517","userName":"uooppopppp","userUrl":"https://itunes.apple.com/us/reviews/id266642977","version":"V1.1.6","score":4,"title":"Yta","text":"Al","updated":"2018-05-10T10:14:46-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"7665851699","userName":"Lstairs","userUrl":"https://itunes.apple.com/us/reviews/id112310312","version":"3.11.10","score":1,"title":"Blood pressure monitor blue tooth","text":"I bought the BP cuff in September 2019  the reading became increasingly inaccurate. By July 2021. It is not reading 169/86. My real reading is 120/70. I have tried to contact IHealth but their “Contact Us” page is not working. What a coincidence. Do not buy this product or App. The quality and accuracy is terrible.","updated":"2021-08-07T08:31:04-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"7624390786","userName":"BobSz","userUrl":"https://itunes.apple.com/us/reviews/id42089067","version":"3.11.10","score":1,"title":"HS5 Scale support still broken…","text":"From iHealth on June 25th: “we received your ticket about your HS5 Scale not connecting to your iPhones.  We have forwarded this issue to our Engineering team and they are looking on how to resolve the issue.  Preliminary findings indicate that the update to the latest iOS version 14.6 is the problem.  This is the issue so we are looking at and how to adapt our app to that latest version.”\n\niOS 14.6 came out May 26, 2021. As of July 27th, Two months later, I still can’t connect to my HS5 scale with any device iPhone or iPad that has the latest Apple iOS including the current iOS 14.71. I’m lucky enough to have an old iPad with iOS 12 on it. I can download my HS5 scale data with it which then syncs back to my iPhone X through the iHealth cloud. \n\niHeath has consistently lagged on software development and updates. Their other new app still doesn’t support most of their previous devices. This older app is rarely updated and is terribly dated. This especially frustrating since their physical devices tend to be excellent. I have had a whole range of their devices, BP, O2, Scales and even their activity tracker in the past. I still keep hoping for a BT thermometer. I have to say, generally, I love their devices and hate their software. With a better app iHealth could be soaring but instead is hobbled by a poor and getting worse app. Hopefully this will change, but don’t hold your breath.","updated":"2021-07-27T09:26:57-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6544741691","userName":"Beautifly Diva","userUrl":"https://itunes.apple.com/us/reviews/id1087567870","version":"3.11.6","score":1,"title":"Glitchy","text":"Trying to set up my tracking device but app keeps glitching out I have to keep going back in and it keeps glitching out going out can’t set up my tracking device with this app.At this moment it’s not user-friendly because I can’t use it they need to find out what’s the glitch","updated":"2020-10-17T06:39:59-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6413196758","userName":"Balticblond","userUrl":"https://itunes.apple.com/us/reviews/id639254095","version":"3.11.6","score":2,"title":"When the App works, GREAT but .?","text":"Following 5-bypasses June 2019, I got serious about my health, buying the suite of iHealth products (scale, BP, Blood Ox, Thermometer, Blood Sugar). It cost me around $300-400, but after a $250k surgery it was an important expense.\n\nTook a while to dial in all the products - They aren't all perfect but when they work it is an \"elegant\" system.\n\nThe iHealth app worked well for about 6-8 months on my iPhone 8 always with latest IOS.\n\nBUT THEN, the app mostly quit working. That is, it would try to open but would not.\n\n I would have to delete the app, redownload and reinstall. It would work about a week before I had to do it all over again.\n\nIt is getting worse. I need to Uninstall and reinstall every 12-48 hours now. I've been doing that since February 2020.\n\nIf this had started immediately I probably would have purchased a different system.\n\n Now my investment makes me hang in there HOPING  iHealth will fix this problem.\n\nUntil then I'd stay away if you hope to use their products with the iHealth app.","updated":"2020-09-09T19:20:58-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6257340584","userName":"Gibbr78","userUrl":"https://itunes.apple.com/us/reviews/id524058090","version":"3.11.5","score":2,"title":"Code 999","text":"I went to open the app to take my blood pressure and this code came. I tried to put a new email address and create a new account.  Still can’t sign in.","updated":"2020-07-29T17:44:30-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6207608356","userName":"freesia-","userUrl":"https://itunes.apple.com/us/reviews/id28850150","version":"3.11.5","score":1,"title":"Just Don’t. Avoid if you can.","text":"I got locked out automatically and keeps telling me user doesn’t exist.  This app and blood pressure monitor are getting worse and worse as time passes by.  I have called customer support in the past but they are no help.  I can’t wait until the new blood pressure monitor by another brand comes back in stock on Amazon so that I can ditch this thing.","updated":"2020-07-16T22:58:55-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5855661825","userName":"skooby13","userUrl":"https://itunes.apple.com/us/reviews/id41824459","version":"3.11.1","score":3,"title":"Questionable ranges for BP's and temps","text":"I am generally pleased with the iHealth products and app. They seem fairly accurate. I do, however, have some concerns about what they consider a \"good\" blood pressure and what isn't. I have hypertension - my goal pressure is generally anything below 130/85. If I have a diastolic bp in the 80's, the app reads that as a concerning range, yet raises no alarm when my BP reads 67/45. I am a medical professional. 67/45 is not \"good\" anywhere I know; it's actually quite \"very not good\". No alarm either for bradycardia. I was very ill and had a pulse of 38; The app gave that a green light, too. The same can be said for the temperature ranges. 99.9 is green \"good\", but 100.0 is red \"bad\". No yellow range? What about adjusting for personal baselines? Mine is about 97.5. When I'm at 99.5, I have a fever. (2 degrees above baseline is a fever.) Why not save red \"bad\" for higher fevers and give a yellow \"caution\" range for low grade temps of 99.0 - 100.4 perhaps? When I scroll through my numbers for my doctor, it would certainly be helpful to have the correct ranges indicated so as to find them easier.","updated":"2020-04-23T20:54:10-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"6008997255","userName":"Lauren0922","userUrl":"https://itunes.apple.com/us/reviews/id105511475","version":"3.11.3","score":1,"title":"Not syncing","text":"Just like other reviews, I’m getting the same network error message. It’s frustrating when I can’t track my pressure and send it to my dr.","updated":"2020-05-29T05:09:00-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5972148734","userName":"00PT","userUrl":"https://itunes.apple.com/us/reviews/id743320963","version":"3.11.2","score":1,"title":"Can't create account without an error","text":"Every time I try to create an account it gives me \"binding error (500)\". The account creation also fails on Android. This makes the app absolutely useless.","updated":"2020-05-20T16:25:53-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"3718152659","userName":"Nahemer","userUrl":"https://itunes.apple.com/us/reviews/id117389485","version":"3.8.0","score":3,"title":"So-so App","text":"This review is mostly directed towards the Blood Presses monitor but I can’t tell were which one is at fault. I own the O2 and Blood Pressure monitors. Has far as I can, the O2 monitor works fine and the app reflects that. The blood pressure monitor is another story. I was suspected the blood pressure monitor from the 1st time I used it. I changed my diet 6 months ago. Im a vegan for breakfast and lunch. For dinner, I eat a healthy meal. I’ve only gotten 2 sets of normal readings the entire time I’ve use the monitor. All other reading are stage 1 high and stage 2 high blood pressure readings. I knew that couldn’t be right, I would’ve had a heart attack by now. So today I go to the Naval Clinic and they take my blood pressure. Surprise it’s 77/125. That morning, before the appointment, my monitor showed 100/145. I think they need to work on this product a bit more. Someone who might be too trusting of these products could come to the conclusion that they’re dying young.","updated":"2019-01-31T15:39:50-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5458087010","userName":"Lady Jane 76","userUrl":"https://itunes.apple.com/us/reviews/id138103652","version":"3.10.7","score":5,"title":"Works Great","text":"I bought the blood pressure machine from Amazon for $45. Best money I’ve ever spent. App works seamlessly with bp machine. It is very accurate. I am happy I have good data to give to my doctor. Also it’s easy to track my BP through this app and the Apple health app.","updated":"2020-01-28T02:50:38-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5408987439","userName":"angeliciousme","userUrl":"https://itunes.apple.com/us/reviews/id17671644","version":"3.10.7","score":1,"title":"Pay attention!!","text":"Long story short is do some legwork before you buy on amazon. The amazon reviews looked good but when you look at app reviews (recent ones) they are horrible. Out of the box the app tells you to turn on your Bluetooth (um, it is on by default). So I turned it off and then back on. Still won’t connect. Very glad for amazon returns. I sometimes wish there were zero stars.","updated":"2020-01-15T19:22:38-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"5174151957","userName":"me87653","userUrl":"https://itunes.apple.com/us/reviews/id44010303","version":"3.10.5","score":1,"title":"How do you rate 0 stars","text":"What a piece of junk application the developer should be embarrassed. Crashes constantly lite gray text on white is unreadable. Inverse colors of times does it work not sure why it’s in the app. Make me return the device.And why in the world do they need to Log my information on their severs.I’d like to see the HIPAA regulations and certifications for this company.","updated":"2019-11-20T13:46:46-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"},{"id":"3241528058","userName":"lindstar","userUrl":"https://itunes.apple.com/us/reviews/id25844204","version":"3.8.0","score":1,"title":"I can’t use triple check","text":"I sleep between 5am and 10am. My usual wake up time is 11-11:30 am. I work until 4 am 4 nights a week. The app won’t let me use triple check at all. It gives me an error message stating I’ve already done it for the day when I have never been able to use that feature. Also, why is the “start” button inside a side menu? That is the most ridiculous place for the MAIN button in an app. This app is specifically for the iHealth monitor. But the button is hidden? That makes no sense. I would probably take my blood pressure more if the app worked like expected. Try doing a UX study. I guarantee you’ll need to change a LOT! \n\nAlso your BMI is wrong. My BMI when accounting for body frame is 33, your app has me at 36. Also, Jsyk, BMI is a piss poor way of measuring obesity. You should probably remove it from the app. The more important measurement is hip to waist ratio with wrist circumference accounted for. Simply because belly fat is a bigger indicator of health issues than actually being obese by BMI standards. Dwayne Johnson is obese according to BMI. Seriously think about that.","updated":"2018-09-28T17:22:03-07:00","url":"https://itunes.apple.com/us/review?id=566815525&type=Purple%20Software"}]