[{"id":"3294273535","userName":"nrnkilt","userUrl":"https://itunes.apple.com/us/reviews/id85046010","version":"5.2","score":5,"title":"Secure. Reliable. Perfect.","text":"We wanted a solution for managing our home radiators - and - wanted something where our data was going to be secure. All other solutions on the market are selling/using your data for something other than the core service ( eg Google’s Nest). \n\nTado is exceeds them all. Not only is the interface totally slick and the components reliable, but it’s a German company that is governed by German data protection laws (the strictest in the world) - which means all they are doing is building and delivering the best possible product. No sketchy data collection here. \n\nWe love Tado and highly recommend it!","updated":"2018-10-12T13:15:35-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"3582091487","userName":"anthonyz_Z","userUrl":"https://itunes.apple.com/us/reviews/id131901028","version":"5.3.7","score":4,"title":"Works well, most of the time.","text":"Scheduling function works perfectly.\n\nHome/away mode. Away mode works fine. Home mode hit and miss. Sometime it doesn't register I am home and doesn't start home mode automatically, but only after launching app which was in background. Otherwise it will start home mode only after I have walk through the door which is also when I connect to my home wifi and tado knows I am home positively. Seldom I will come home with the Aircon temp already set nicely. For the above I have set my home geo fence to the smallest radius which they did warned will not be reliable. I have increased the radius and will update back here again.\n\nCould give better control over the function that automatically turns off the Aircon when a set temperature is hit. Currently I can only set a single range +/- same temp ie 2deg lower it will cut off, 2 deg warmer it will turn back on. Unable to control individual colder or warmer timer preference too for this case it's same.","updated":"2018-12-27T19:31:19-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"3548411821","userName":"Nai-De","userUrl":"https://itunes.apple.com/us/reviews/id39059509","version":"5.3.5","score":4,"title":"Charging for a product support app?","text":"Subscription apps are unacceptable, particularly in the case of hardware support apps that switch to subscription pricing after a substantial hardware investment was made.\n\nObviously the developer had a change of heart to switch from subscription pricing to one-time upgrade fee (at least for legacy customers, don’t know how it is for new customers)\n\nThat makes a huge difference. Updating my rating from one to four stars correspondingly.\nI’m glad this was changed!\n\n=================\nOriginal Review\n=================\n\nThe whole point of buying their devices was maximal energy savings, of which the software is an integral part.\n\nThat now, after people have spent lots of money to buy into their system, they start to charge monthly fees to use something we already bought, is outrageous.\n\nImagine this sets an example: you convert your home to hue lighting, then Philips starts to charge a subscription fee for the app.\nApple sells you an iPhone, then starts charging a monthly fee for using iOS.\nYou buy a sofa, a year later the carpenter stops by and installs a meter that charges you a cent each time you sit down.\n\nIf you add some serious functionality, charge for the upgrade, letting me choose if I need the features or not. But stop beings leeches who think they deserve an income stream for perpetuity for work done and paid to employees one time only.","updated":"2018-12-19T05:16:02-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"3542294352","userName":"Sir Bigglesworth","userUrl":"https://itunes.apple.com/us/reviews/id100523653","version":"5.3.5","score":2,"title":"Can’t Add/Assign Rooms","text":"This product has a lot of potential and I’d like to increase my rating later but right now I’m too frustrated.  \n\nHad to wait for custom instructions for installation because my existing thermostat and heating configuration wasn’t pre-loaded into Tado’s automated installation instructions program.  When I did finally get the instructions via email it caused my separately-controlled in-floor heating in my kitchen (operating off the same boiler and boiler controller as all the room thermostats) to stop working - at least the radiators kept working. \n\nTo top it all off, I also cannot create and assign individual room names to each of my radiator thermostats which prevents me from controlling them individually from my phone.  This was a big reason why I wanted this product!!\n Instead, I keep getting an annoying message that says \n\n “Assignment to new room by user not possible yet.  To reassign the device to a new room please contact our Technical Support.  You can find the number for your country in our Help Center.”\n\nThis seems to be such a simple but critical update and easy problem to solve - why the heck hasn’t Tado fixed this yet!?!\n\nI want to like this product and to increase my rating of it.  It has potential.  But I’m too frustrated right now.","updated":"2018-12-17T12:37:05-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"5181769855","userName":"ifeignit","userUrl":"https://itunes.apple.com/us/reviews/id107439759","version":"5.8.4","score":1,"title":"Used to work but then they removed its best feature","text":"The Tado Smart AC Controller used to be a great piece of hardware, giving the ability to manually program your air conditioner’s commands if you didn’t like the presets or your brand wasn’t available. Now you can no longer do that. Even though the device itself supports swinging, the lousy preset Tado made doesn’t, so I used to program it in myself. I had to factory reset due to getting a different model AC and now this feature is gone. \n\nThis is what their support team had to say\n\n “We are sorry to inform you that it is not possibile to register single commands (like swings). Unfortunately, with the new software release, this possibility is no more supported because it was too time consuming.  We apologize for the inconvenience.”\n\nBasically, even though I was willing to go through the trouble, they decided for the consumer that it wasn’t necessary. Competing IR blasters let you do manual inputs, yes it takes time.\n\nThe worst part is the “Teach Tado” option is in the app and on the website still, it simply doesn’t work. Essentially this is false advertising.\n\nVery, very disappointed.","updated":"2019-11-22T07:25:17-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"1810982890","userName":"shimoorek","userUrl":"https://itunes.apple.com/us/reviews/id31927226","version":"4.3.1","score":5,"title":"Apple Watch integration","text":"I’m enjoying the convenient UI of the Applications. It’s needing a refresh that includes the Apple Watch capability where if I go for a jog and leave my iPhone at home, the geo-location from the Apple Watch could be added as a second device. \n\nThe ability to teach the tadö AC Control to perform settings that the remote allows will also benefit this app. My Fujitsu AC unit has a humility control, fan, and stage change options for the vent that the app does not offer for my AC unit. Fixes for that and this app will be receiving a change in rating.","updated":"2017-09-26T06:18:53-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"3096139245","userName":"Rob (AUA-BOS)","userUrl":"https://itunes.apple.com/us/reviews/id6762803","version":"4.13","score":5,"title":"Awesome Little Device","text":"Initial set up didn’t work, but Support took care of everything for me. This device works! After power outages it works! After internet outages it works! Not like finicky Wemo products that disconnect for unknown reasons and never reconnect. I use this for the main airco unit in a second home thousands of kilometers away and it’s always there for me. It runs the ac four times a day like clock work, plus allows me to override as needed if additional cooling or dehumidification is required. Love it!!","updated":"2018-08-21T11:11:45-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"4267689595","userName":"AT_AU","userUrl":"https://itunes.apple.com/us/reviews/id117321153","version":"5.6.1","score":5,"title":"Very bad UI, inflexible automation","text":"It takes way too many taps to turn the AC on and off and to change temperature. Have a look at Apple’s HomeKit interface for ACs to see this done well. \n\nAlso, very annoying that there is no option for a scheduled automation to override manual control function. \n\nBad, bad app.","updated":"2019-06-05T06:42:56-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"3452775947","userName":"mroach","userUrl":"https://itunes.apple.com/us/reviews/id35367157","version":"5.2.4","score":1,"title":"I’m returning the whole kit","text":"After hours of research and days of thinking it over, I settled on the tado smart thermostats. Two features that appealed to me most were open window detection and geofencing to automatically control the temperature. There is NO mention anywhere on tado’s website that you have to pay a monthly subscription fee for these features. What’s the point in getting smart thermostats to save money if I’m pouring the savings into subscription?\n\nIt wouldn’t have been so bad if they actually mentioned this anywhere on their site. Not even the box says you need a subscription for this.\n\nI’m packing these back up and returning them. I’ll probably get a Netatmo or Elgato Eve instead.","updated":"2018-11-23T16:54:27-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"6610414480","userName":"Skildpadden Pede","userUrl":"https://itunes.apple.com/us/reviews/id242158143","version":"6.0.2","score":3,"title":"Great app but greedy subscription model","text":"Charging people 3$ monthly for the implementation of geo fencing and window detection is too much and should be stated much clearer on the product when purchasing. The detection algorithm is running on the phone resulting in push messages, so why not bring the final functionality to the user? \n\nOtherwise the system works reliable. Some of the basic functionality takes too many interactions/steps.","updated":"2020-11-04T22:22:05-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"3490124248","userName":"ptrvh","userUrl":"https://itunes.apple.com/us/reviews/id915613497","version":"5.3","score":1,"title":"Pay for an app update","text":"Since 8 months I have Tado iny home. I start using it 2.5 months ago (before the heating was off). It work very well until there was a server breakdown at Tado. Then I realised that most of its features did not work anymore. Then you start thinking, wat if Tado stops? Then I have a very expensive system which does nothing more than my old system.\n\nToday I opened the app and it showede there was an update! Nice. But Then I saw I need to pay for the new version. Serious Tado? Have a look at Sonos or Apple. They provide New features Too existing customers instead of scare them.","updated":"2018-12-03T12:57:34-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"5277253954","userName":"Parky1101","userUrl":"https://itunes.apple.com/us/reviews/id43468551","version":"5.8.6","score":1,"title":"Spams you to buy a useless feature","text":"This app just sent me a notification to advertise their 30% off promotion for their \"upgrade\". This is against App Store rules (rule 4.5.4) and extremely annoying. Especially because the \"upgrade\" is a bunch of hot air, what they're selling is not a new feature (they claim the \"Air comfort skill\" is a feature but it just looks like 3rd party easily available data that's not very accurate) but just a new design. \nI really regret buying these thermostats, this company's behavior is terrible","updated":"2019-12-15T13:57:14-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"7521986406","userName":"julian_ro","userUrl":"https://itunes.apple.com/us/reviews/id100829025","version":"6.8.1","score":4,"title":"Easy to use, works great","text":"I have 3 Smart AC thermostats, setup was very easy (had a little bug the first day but that got fixed with an update literally over night.)\nScheduling is great and the thermostat’s infrared is much more powerful than the remote that came with my AC. \nYou do need an in-App purchase to use the fully automatic mode but I do not need it.","updated":"2021-06-29T23:51:24-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"5552081146","userName":"glenn1121","userUrl":"https://itunes.apple.com/us/reviews/id21984331","version":"5.9.4","score":3,"title":"Some broken features","text":"A nice looking app with a clean and relatively intuitive UI. Unfortunately some key features are broken, rendering the app large useless. For example, the app allows you to switch to away mode when you are remote, but you can't switch back to normal mode unless you are in the house. That means coming to back to a cold house.","updated":"2020-02-19T04:13:58-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"4134727455","userName":"Thereisnonick","userUrl":"https://itunes.apple.com/us/reviews/id356074683","version":"5.4.4","score":5,"title":"Love it!","text":"Very nice UI and animations. Also I couldn’t expect so many smart features for an app for the thermostat. Things like open window detection or smart schedule are very nice to have. Also it’s good to see how much do you save monthly. Very nice!","updated":"2019-05-11T10:11:29-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"3612245468","userName":"sslnn","userUrl":"https://itunes.apple.com/us/reviews/id109136504","version":"5.3.7","score":1,"title":"Misleading development process","text":"The tado system, hardware part, works largely as advertised. Sure it eats batteries kind of fast but I can live with that. \n\nOn the app and software side:\n\n- where is the child lock function? Promised in development for years\n- where is the multiple-homes integration? I have to keep seperate accounts for each and log in-out. \n- where is the EMS integration? No news for years\n- you asked for customer feedback a while ago to basically develop a NEW & PAID upgrade!?\n- how exactly do you plan to offer “new features” to the legacy app? By splitting and doubling development team& costs?\n\nIf this is the beggining of some new “shaddy” strategy I will stop making long term investments in your products. \nMy advice: stick to roots, good engineering, light and practical software as an unseen accessory.","updated":"2019-01-04T11:31:40-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"3682522800","userName":"MikeCooperAVL","userUrl":"https://itunes.apple.com/us/reviews/id427269290","version":"5.3.8","score":3,"title":"Good, but…","text":"I have one Tado in my office, and another in our home gym. They’re great for letting me turn on the heating or AC remotely. And the geofencing is great, because it stops those rooms from heating or cooling when I’m not there. \n\nBut please can we have some Siri shortcuts? I’d love to be able to tell Siri to “set the gym temperature to 65 degrees”. And I’d also love to do away with separate heating and cooling options: I just want to set a temperature and then have my Tado work it out from there. \n\nAnd I’d love to have notifications, so I can see when the Tado I question is nearing the setting I’ve asked for.\n\nIs any of this in the pipeline?\n\n(Oh, and for my own sanity, how do you pronounce “Tado” in the first place? “Tadoo”? “Tah-Doe”? :-)","updated":"2019-01-22T11:35:57-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"3709533303","userName":"Doug Balruddery","userUrl":"https://itunes.apple.com/us/reviews/id275553599","version":"5.3.8","score":3,"title":"Several simple issues to improve","text":"The app seems to have gone down in past few days with some strange imagery on the usage profile. There are several improvements that could be added quite simply. For example giving total hours of use of boiler, timeline along home plan etc.","updated":"2019-01-29T10:41:16-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"1809798826","userName":"Uncle2Tom","userUrl":"https://itunes.apple.com/us/reviews/id322613633","version":"4.3.1","score":4,"title":"It available after 3 days away","text":"We have no connection anymore after 3 days in vacation.\nAfter I’ve had internet after another 4 days again, it worked. Since then I let the app be open all the time, no list of connection.","updated":"2017-09-25T14:56:09-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"5046234351","userName":"MaestroKt","userUrl":"https://itunes.apple.com/us/reviews/id116993861","version":"5.8.2","score":5,"title":"The best smart thermostat by far","text":"I found it by mistake. Because google only shows US products. But this is far better than any competition... Love it!!! 🔝🔝🔝","updated":"2019-10-29T08:39:35-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"3115630510","userName":"Life is good 101","userUrl":"https://itunes.apple.com/us/reviews/id16366894","version":"4.13","score":5,"title":"Don’t leave home with out one!","text":"Love being able to turn on heat and AC from anywhere at anytime. Keep in the my living environment cool or warm all year long.","updated":"2018-08-26T01:14:02-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"3447006445","userName":"Rtwgeek","userUrl":"https://itunes.apple.com/us/reviews/id103028430","version":"5.2.4","score":1,"title":"Really wanted to like it","text":"Crashes constantly. Not sure why there are so many good reviews. When it loads it looks nice but it’s just really unstable. It’s also not super intuitive. Took me a while just to add a device. App needs to be rebuilt! Hope they do - spent a lot on the hardware and don’t want to have to return it. Just bought the Sensibo product and it’s working great right now. App is simple but at least it works well.","updated":"2018-11-22T04:44:29-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"7365330352","userName":"♞MsDurex","userUrl":"https://itunes.apple.com/us/reviews/id165364833","version":"6.6.3","score":5,"title":"I wish multi-houses support.","text":"I really like Tado products. I want to use them in all of my house.","updated":"2021-05-20T05:14:17-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"3963955280","userName":"DLiauw","userUrl":"https://itunes.apple.com/us/reviews/id150296141","version":"5.4.4","score":3,"title":"Does not work with Google Home (recently)","text":"Used to work quite well. The last update has bugs and it appears that Tado is offline whenever attempts to work with Google Home.","updated":"2019-04-03T04:59:37-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"4588097273","userName":"Gary/Mark","userUrl":"https://itunes.apple.com/us/reviews/id169094045","version":"5.7.2","score":5,"title":"Fantastic app","text":"I travel all over the world and can control my boiler with ease.","updated":"2019-08-08T15:23:01-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"3929413248","userName":"777jgv","userUrl":"https://itunes.apple.com/us/reviews/id22905508","version":"5.4.3","score":1,"title":"Tado not reliable.","text":"The unit is extremely hit or miss. It does not control my air conditioners in the garage properly. I have found them running all night several times unnecessarily. Other times the air conditioners weren’t turned on to cool the garage. Unit works about 50% of the time. \n\nCustomer service is non existent as the unit is made in Europe.","updated":"2019-03-26T07:35:34-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"5140326113","userName":"SkiRider","userUrl":"https://itunes.apple.com/us/reviews/id20175823","version":"5.8.4","score":1,"title":"Major bug in Settings","text":"If I pay $18 dollars for an app I expect it to be well-tested! As you click through many of the Skills under settings there’s no way back to the main Settings menu. I have to close the app and return.","updated":"2019-11-14T22:51:59-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"3720019382","userName":"m1h4","userUrl":"https://itunes.apple.com/us/reviews/id163890034","version":"5.3.8","score":1,"title":"HomeKit integration does not work correctly","text":"I set the temperature using Apple's Home app to 21,0°C but it gets set to 20,8°C in the tado app and on the thermostat. Set it to 22,0°C, it gets set to 21,9°C??? Tado support guy keeps telling me that \"synchronisation can take a while\" what?? I'm not talking about the delay but the incorrect temperature being set. First clasa support… Shuld have bought a Netatmo or Ecobee","updated":"2019-02-01T03:25:17-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"1792781842","userName":"UDONTKNOMEE","userUrl":"https://itunes.apple.com/us/reviews/id38256949","version":"4.3","score":4,"title":"New Update Wiped out Everything","text":"incredibly frustrating. this shouldn't be happening.","updated":"2017-09-16T05:56:52-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"3075296223","userName":"ricardosol","userUrl":"https://itunes.apple.com/us/reviews/id4009184","version":"4.13","score":5,"title":"Great App!","text":"Use it every day.  There's nothing like coming home to a nice cool room.  Can't live without it.","updated":"2018-08-16T20:31:20-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"1348716062","userName":"Dasha Samkova","userUrl":"https://itunes.apple.com/us/reviews/id137623748","version":"2.9","score":5,"title":"All I need","text":"Awesome\nTurns my heating off when I leave home which has already saved me a lot of money","updated":"2016-03-16T06:45:12-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"1986618776","userName":"mhmdacyl","userUrl":"https://itunes.apple.com/us/reviews/id136163517","version":"4.5.2","score":4,"title":"Awsome but...","text":"The apps awsome so far! But i just wish this app had a widget for easy access...wish to see it in the future","updated":"2017-12-10T15:10:01-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"6825366287","userName":"olifromwhere","userUrl":"https://itunes.apple.com/us/reviews/id775287317","version":"6.3.1","score":4,"title":"Good system","text":"Happy with rado system, the app is good and responsive, it works with alexa and it s easy to handle for non tech. Good jib Rado!","updated":"2021-01-03T01:43:23-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"5418206699","userName":"aalex1980","userUrl":"https://itunes.apple.com/us/reviews/id38737929","version":"5.9","score":2,"title":"missing manual home/away mode","text":"manual away is only possible via the notification in geofencing, please allow manual home/away without geofencing notifications","updated":"2020-01-18T01:34:41-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"6997955894","userName":"Sonic Login","userUrl":"https://itunes.apple.com/us/reviews/id536889465","version":"6.4","score":1,"title":"Immediate crash","text":"After launch on ios 14.4 on iPad Air","updated":"2021-02-15T09:18:49-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"1507027728","userName":"sltong68","userUrl":"https://itunes.apple.com/us/reviews/id155753672","version":"3.5","score":3,"title":"Good. Not great yet.","text":"I have several split a/c units and tado seemed the ideal solution to control the units. It's a bit tedious to set up as my particular brand was not supported. But once that was done it works very well. The location sensing is a great feature and apart from a weird glitch once in a while it's pretty reliable. My only complaint is that the time setting do not seem to work. It's off by exactly 6 hours and so my set on/off times are off by the same 6 hours. Strangely enough that's the time difference between my location and Munich where I see the HQ is located. \n\nOverall a great product and easy to use app but a few bugs to work out. Looking forward to the Siri integration.","updated":"2016-12-22T16:24:56-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"1213909028","userName":"gonliao","userUrl":"https://itunes.apple.com/us/reviews/id334730284","version":"2.3.1","score":1,"title":"Unable to control my HITACHI AC","text":"I was trying to relocate the ac control to my office, because it doesn't work with my AC at home!\nand I couldn't find any instruction reseting the smartAC control, but eventually I figured it out. but now I am stuck with the app not being able to remove the control, so I can re-register the control with the app and with the new AC unit and address.\nI couldn’t logout in the app, only way I found is to uninstall and reinstall the app, but eventually my login still has loaded with the previous setting of the control, which render me unable to setup the device I have reseted. \nI even tried to login on Tado's web service, I was able to change the pin on the map, but the address above the map cannot be changed!","updated":"2015-06-17T18:07:09-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"1241209247","userName":"thedotmack","userUrl":"https://itunes.apple.com/us/reviews/id43087758","version":"2.4","score":1,"title":"Inaccurate temperature setting","text":"The device does not set the temperature properly on my AC unit, it counts up 22 degrees (I hear 22 beeps) and then it counts down 18 beeps when I set it to 60 degrees. My AC unit goes between 60 and 90 degrees Fahrenheit. It's in direct line of sight to the unit. \n\nPlease, please, PLEEEEASE just give us an up and down control button! I don't need all the fancy energy saving options, I just want simple manual control. Is your API ready? I'll program it myself ;)\n\nAlso, does the device have an audio sensor? Maybe it could recognize device beeps? Not sure if you guys included that in the device. \n\nI waited over a year for the kickstarter, the device is great but your app is extremely limited.","updated":"2015-08-10T20:25:49-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"1672719363","userName":"Fadhil9@9","userUrl":"https://itunes.apple.com/us/reviews/id261038721","version":"4.0.1","score":5,"title":"Swing","text":"I wish we could the swing leveling on remote so we can control the level or air blow thats my consider","updated":"2017-07-07T06:38:55-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"1653158195","userName":"Cottoneaster","userUrl":"https://itunes.apple.com/us/reviews/id42153602","version":"3.12","score":5,"title":"great app","text":"I just never know which is the outside temp, what is the measured and which is the desired. Would be nice to make it a bit clearer.","updated":"2017-06-22T00:59:15-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"1455246902","userName":"Laidbacka","userUrl":"https://itunes.apple.com/us/reviews/id25240735","version":"3.0.1","score":5,"title":"Great!!!","text":"Tado and related app are great. The remote to my Sanyo split-system AC died, and this was a great replacement and upgrade to include scheduling and geo-presence to manage utility consumption. Easy to use and configure.","updated":"2016-09-24T12:52:38-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"1215770214","userName":"Smiley76.11","userUrl":"https://itunes.apple.com/us/reviews/id113372062","version":"2.3.1","score":5,"title":"Works great with Mr Slim","text":"Using this with a Mitsubishi unit and loving it. I like how easy it is to set programs up, as well as geofencing. Setup was also simple.","updated":"2015-06-21T11:00:56-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"1503689510","userName":"Jaghond","userUrl":"https://itunes.apple.com/us/reviews/id43162052","version":"3.4.1","score":5,"title":"Great app","text":"Well designed, makes managing my cooling very convenient.","updated":"2016-12-17T10:02:25-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"1404158261","userName":"RevFlip","userUrl":"https://itunes.apple.com/us/reviews/id25551257","version":"2.12.3","score":2,"title":"Lost at least one star in the latest update","text":"The newest version logs me out frequently.  It's pretty annoying to have to enter my login credentials each time I want to use the app.","updated":"2016-07-02T07:34:25-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"1488464306","userName":"Harmles14","userUrl":"https://itunes.apple.com/us/reviews/id192635509","version":"3.4","score":5,"title":"Tado","text":"Perfect working app. and saves energy and money.","updated":"2016-11-21T05:36:51-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"1693208590","userName":"Kram42","userUrl":"https://itunes.apple.com/us/reviews/id132375269","version":"4.0.1","score":2,"title":"Homelink support abandoned","text":"Tado announced and promised Homelink support for Smart AC Control, saying the Apple identification chip was built-in. Now they have abandoned that and say they won't be supporting Homelink.\n\nThe touch interface to the Tado Smart AC Control is unreliable and too hard to operate.\n\nOverall, this system had fantastic promise, but failed to deliver. It seems Tado have abandoned their leadership position.\n\nVery disappointed.","updated":"2017-07-22T02:07:58-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"1218896429","userName":"Mike7755","userUrl":"https://itunes.apple.com/us/reviews/id224409428","version":"2.3.1","score":5,"title":"Awesome for split unit","text":"Works great with Fujitsu! Finally someone came out with this.","updated":"2015-06-27T20:16:20-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"1403976482","userName":"maxxoverclocker","userUrl":"https://itunes.apple.com/us/reviews/id469585623","version":"2.12.3","score":1,"title":"Won't stay logged in","text":"Latest update won't allow me to save my login information, keeps logging out every time the app is closed.","updated":"2016-07-02T01:07:34-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"1404252803","userName":"BB_MountainLion","userUrl":"https://itunes.apple.com/us/reviews/id21643868","version":"2.12.3","score":1,"title":"Horrible User Interface","text":"No range information, what does 0..0 mean, also weird splitting of time ranges that start before midnight and finish after midnight: why 2 blocks?","updated":"2016-07-02T10:56:44-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"1393451342","userName":"Speedracer732","userUrl":"https://itunes.apple.com/us/reviews/id85320843","version":"2.12","score":1,"title":"Good idea but does not work well at all.","text":"Very disappointing but perhaps a future version will be better.","updated":"2016-06-12T16:45:15-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"1713199531","userName":"Liquidzone","userUrl":"https://itunes.apple.com/us/reviews/id112962548","version":"4.1","score":5,"title":"Great app","text":"Thsnkd","updated":"2017-08-04T14:43:37-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"1601733103","userName":"Jgridin","userUrl":"https://itunes.apple.com/us/reviews/id39126602","version":"3.10.1","score":4,"title":"Great System","text":"Fantastic system and app for controlling heating!","updated":"2017-04-30T13:54:35-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"1222850771","userName":"r_x_b","userUrl":"https://itunes.apple.com/us/reviews/id20333539","version":"2.3.1","score":1,"title":"Can't open the app","text":"Just keeps popping an alert that says error.","updated":"2015-07-05T20:38:36-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"1275140623","userName":"Bad offline maps","userUrl":"https://itunes.apple.com/us/reviews/id340716439","version":"2.4.5","score":1,"title":"Poor performance","text":"Would not reccomend purchasing the controller and installing the app. Will turn into frustation.","updated":"2015-10-21T15:16:06-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"6723589099","userName":"gfghbhkk","userUrl":"https://itunes.apple.com/us/reviews/id426599189","version":"6.2","score":5,"title":"Hi hon","text":"Vvcv cvcvhh","updated":"2020-12-06T05:15:23-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"5125180307","userName":"juancho7","userUrl":"https://itunes.apple.com/us/reviews/id41242281","version":"5.8.3","score":5,"title":"Excelente app, muy malo que quieran cobrar algo que otros dan gratis","text":"El termostato es un producto excelente. La app está muy bien hecha, pero que quieran cobrar tanto por las automatizaciones no está nada bueno. Si cobraran menos lo pagaría con gusto","updated":"2019-11-11T16:36:55-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"1497405711","userName":"ChefkochZ","userUrl":"https://itunes.apple.com/us/reviews/id9906872","version":"3.4.1","score":5,"title":"Echt genial!","text":"App ist einfach zu bedienen und genauso super durchdacht wie die Hardware. Konnte es innerhalb von 10 Minuten in der ganzen Wohnung installieren. Wer einmal seine Heizkörper umgestellt hat auf Tado will nie mehr auf das altmodische Zeug zurück.","updated":"2016-12-06T23:14:02-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"},{"id":"1213632691","userName":"aniceberg","userUrl":"https://itunes.apple.com/us/reviews/id3443694","version":"2.3","score":3,"title":"Needs much work","text":"*The login fields are very small and should be made bigger. \n\n*There must be a method to cancel an AC code testing process - if you run the general test it has 614 codes that it tests and each test requires user input approximately every 5 seconds and you can't exit this process without going through every single test. Please add a simple \"Cancel\" button!","updated":"2015-06-17T04:50:23-07:00","url":"https://itunes.apple.com/us/review?id=574418486&type=Purple%20Software"}]