[{"id":"6930574604","userName":"cj7sins","userUrl":"https://itunes.apple.com/us/reviews/id949750544","version":"5.5.6","score":4,"title":"I highly recommend","text":"For 60 dollars this is incredible, so happy with it, only thing is, when you put the laser pointer on pet mode and get out of the app to do something else on your phone, the laser stops but the camera still moves in pet mode, also the audio isn’t amazing, but still with those odds I would still highly recommend. My cats are in love and so am I with this product so far.","updated":"2021-01-29T19:09:10-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"5626370186","userName":"SouthofBoston","userUrl":"https://itunes.apple.com/us/reviews/id86597890","version":"5.3.9","score":5,"title":"App and camera have worked great until leap year","text":"Both the app and the camera have worked great for a few years now with minimal problems.\nMy C34S-X4 camera either stopped writing to my TF card (when. motion detected) or the App doesn’t recognize anything since February 29th (which happened to be a leap year day).  I’ve rebooted and tried deleting some of the previously recorded files to free up space- but still can’t get it to start recording again.\nThe App “calendar” does not show any dates after February 29, 2020 as being accessible.\nSeems to be an App problem/bug as the camera continues to work great and I can take snapshots and record video to the system album etc without a problem.\nWould love a solution to be able to continue to give good reviews for the products.","updated":"2020-03-06T19:41:57-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"4722507035","userName":"PayasoXIII","userUrl":"https://itunes.apple.com/us/reviews/id412956716","version":"5.3.3","score":2,"title":"Notification stopped working in last update","text":"I confirmed all the notification settings are set correctly. All other apps provide notifications as expected. Tested Eye4 app on another iPhone with same result. All iPhones at most recent version of iOS. Updated all camera firmware. Removed Eye4 app and reinstalled. Reset all settings in iPhone>settings>general>reset. Issue persists.\n\nNotifications feature is the most important to me as I use it for deliveries etc. The app is now almost useless to me. It does have the ability to email motion capture notification and that seems to be working ok. So for now I have set up a mail rule on my computer to alert me instead of using the Eye4 app for notifications. This is a poor work around and inconvenient enough for me to consider replacing the cameras with another brand. I’ll reconsider the rating after issue is resolved and an update is released in a timely manner.","updated":"2019-09-03T14:42:05-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"7153297326","userName":"cwoods1997","userUrl":"https://itunes.apple.com/us/reviews/id177128842","version":"5.5.9","score":3,"title":"Require Location permission msg each cam. No thanks.","text":"The last two releases they are trying to make you accept your location so they know where you’re at each time you view your cam on your phone. What is the purpose of a cam if you know where people are? They need to please remove that message once a person clicks cancel until a reboot or never again. I started purchasing other cams for this reason. If I select cancel, do not show that message again until I reboot or never again until I upgrade. Thank you.","updated":"2021-03-27T21:39:42-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"4351607255","userName":"Netizen671","userUrl":"https://itunes.apple.com/us/reviews/id572159598","version":"5.2.7","score":1,"title":"Unacceptable","text":"If I had known how poorly made the software for my “VStarcam” was, I never would have bought it. One of the only reasons I did buy it was for the ability to pan vertically and horizontally, however, it only lets you do so in “cruise” modes that are impractical and cause the app to crash. On top of this, the bitrates are so poor that my video feed lags by about a minute, rendering the camera pretty useless for home security. Please don’t give me some generic advice because I’ve already updated to the latest firmware at the time of writing, and there is ample bandwidth on my network. Just have your developers fix the ongoing software issues, because right now this product just feels like a scam.","updated":"2019-06-22T00:49:57-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"7683031009","userName":"eye4/v-cam","userUrl":"https://itunes.apple.com/us/reviews/id666114160","version":"5.6.4","score":2,"title":"Zoom bar","text":"The new update applies a (zoom status bar) on my screen in the right side. When holding my phone in the horizontal position it’s in the way of my view and why do you need this on this view anyway, you can just use your fingers to zoom in and out. \nIn the vertical position I thought it was just fine. Due to being not being in the cameras view at all, it’s next to the control pad joystick for moving the camera completely off the view screen. But when moving the phone horizontally that zoom bar, shouldn’t be there at all. Thanks","updated":"2021-08-11T21:42:51-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3785024052","userName":"PeRDlTloN","userUrl":"https://itunes.apple.com/us/reviews/id101335476","version":"5.2.3","score":1,"title":"Building an Encrypted Connection","text":"I’ve had a few of these cameras for a few years and until recently they have worked great.  But since the last software upgrade, all I get now is a message on all my cameras that it is Building an Encrypted Connection.  Maybe once out of 50 attempts of opening and closing the software will it finally connect after a few minutes of waiting.  \n\nIt’s unfortunate as the cameras performed well for the price but the technical and customer support is not existent so I can not get anyone to help resolve this.  After a few hundred dollars towards cameras it disappointing.\n\nI would not recommend these cameras unless they fix this issue.","updated":"2019-02-18T06:07:27-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"7659349128","userName":"Ray's Pod & iPhone","userUrl":"https://itunes.apple.com/us/reviews/id39113953","version":"5.6.3","score":4,"title":"Love the App …. BUT!","text":"Please remove the “Zoom Slide Bar” on the screen! I hate that thing. It’s easy enough to just pinch and zoom. I liked the screen view just the way it was. Thanks!","updated":"2021-08-05T15:02:47-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"2637914205","userName":"Naughtyaudie","userUrl":"https://itunes.apple.com/us/reviews/id257294815","version":"5.1.3","score":3,"title":"Needs some work","text":"It works ok most of the time but alert function only works while you are on live cam, cameras go offline once in awhile and you have to unplug them and plug them back in sometimes you have to delete them and add them back on.  If wasn’t for these issues I would give them a 5 star, but if you are out of town no way to reset them. I have 6 of these around my house so it is not just a isolated issue cause I have them all at sometime go off line","updated":"2018-06-03T16:17:29-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"4976450633","userName":"MonicaBlaah","userUrl":"https://itunes.apple.com/us/reviews/id174461435","version":"5.3.5","score":2,"title":"App closes out","text":"The app works great for the first camera I bought, bought a second smaller one and the app closes out every time I try to connect it to new vstar camera. I made sure my phone and app were up to date and made sure I’m on the correct WiFi, still nothing, I tried to connect wirelessly both ways and still nothing. This camera has no LAN port and must be connected wirelessly, which would be easy if the app didn’t close out every time! 2 stars only bc it was working before,","updated":"2019-10-19T07:40:54-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"2073276551","userName":"Roo7752","userUrl":"https://itunes.apple.com/us/reviews/id341715446","version":"5.0.5","score":2,"title":"Needs work","text":"The motion alerts in the app do not work. When you pull up an alert it just shows the camera in real time, no recordings. You would need to be watching your phone and see something in real time for the alert function to work. Without this, you would have to wait until you are home to pull SD card to see what triggered an alert, and by that time it could be too late if something was happening. Hoping it gets fixed, would be 4-5 stars if did.","updated":"2018-01-09T13:29:57-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"2425712264","userName":"jk4zr","userUrl":"https://itunes.apple.com/us/reviews/id195329271","version":"5.1.0","score":5,"title":"Cloud storage!","text":"Cloud storage stoped working after I updated the application. It used to play past videosand give me notifications if the alarm was triggered but now it’s completely useless on that part. The live feed still works but it doesn’t serve the purpose. Please do something about this issue and make it quick.","updated":"2018-04-15T05:59:46-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3530438399","userName":"Escco","userUrl":"https://itunes.apple.com/us/reviews/id569044643","version":"5.2.2","score":1,"title":"Good camera bad app.","text":"I have 2 cameras. I have to constantly restart one of them. This process cannot be done remotely. You have to physically unplug and Re plug or hit the reset button which is high up and out of reach. The cameras have a good picture. I was planning to expand to 4 cameras but decided to put on hold due this very annoying issue with unending initializing and reboots.\nUpdate: Lesson learned. If you decide to buy security cameras, check and see what the APP \nRatings are. If I’d would’ve done that a would not be stuck with 2 cameras that are virtually \nUseless.","updated":"2018-12-14T09:49:16-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"2953343783","userName":"theequeencee","userUrl":"https://itunes.apple.com/us/reviews/id193881834","version":"5.1.5","score":1,"title":"Bad iCloud service","text":"The cloud service sometimes records and sometimes it doesn't. I did not set an alarm schedule so it should work all the time. When i go to replay the video there is at least 12 hours of time that is not recorded. I have tried contacting customer service and nobody responds. They give one solution that does not work. \n\nAlso, one of my cameras does not send me notifications anymore. Not sure why. Very frustrating when you can never chat with customer service because of time zone difference.","updated":"2018-07-23T02:46:39-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"8041690589","userName":"phil617","userUrl":"https://itunes.apple.com/us/reviews/id442821391","version":"5.6.7","score":1,"title":"Why is everything this product does so LOUD","text":"Quick setup while finding a device has this awful, piercing sound, and the app resets the volume high whenever it plays it.  Why?  Why ever do that?\n\nThe camera itself plays a voice track every 5 seconds when it’s not connected to Wi-Fi, or during initial setup.  Why?  Why so frequently?  Why not an indicator light like every other product in existence?\n\nIncredibly low quality software and UX.","updated":"2021-11-19T14:19:36-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"5671319317","userName":"Lilbuukagordy","userUrl":"https://itunes.apple.com/us/reviews/id150380352","version":"5.4.0","score":1,"title":"Great then not so great","text":"I never had a problem until the most recent firmware update. The camera was by far my favorite out of several different ones I own. However, now after I close the app, the speaker no longer works making talking into the app useless. Unless this gets fixed, I’ll likely replace the camera with a different brand as this feature was one of the main reasons I purchased this camera. Bummer.","updated":"2020-03-16T22:57:16-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"4318274522","userName":"jydeeibgerdiin","userUrl":"https://itunes.apple.com/us/reviews/id429635717","version":"5.2.7","score":1,"title":"Nonfuncting device","text":"I agree with the previous review. It worked excellent for the first few months. Then kept going offline, said someone else is logged on to my camera (which is frightening) and saying it is “building an encrypted...”.  So I just turned it off. I hope I didn’t waste hundreds of dollars for nothing.  Customer service doesn’t work on the system\n\nI sent them a screen shot saying someone else was logged into my device yet they say it cannot happen.","updated":"2019-06-15T00:34:10-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"7561667271","userName":"Shayberz","userUrl":"https://itunes.apple.com/us/reviews/id153567288","version":"5.6.2","score":1,"title":"Great at first, then came disappointment.","text":"It was a struggle to get the camera set up and working, but once it did I loved the camera and it made me feel safe and at ease knowing I can check in on my cats when I’m away doing errands. \n\nAfter a week the iCloud stopped recording my videos, and I emailed for support and no luck. I decided to reboot it all myself and now I cannot get it hooked up to my WiFi and working again. \n\nIt has became very frustrating especially when you google and barely any help or suggestions come up as well. \n\nWas thinking to get a second camera when I was loving it and now I think otherwise, which makes me sad since I also found it to be a great secuirty camera as well.","updated":"2021-07-10T12:01:11-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"4027841623","userName":"Buddyrock098","userUrl":"https://itunes.apple.com/us/reviews/id149658067","version":"5.2.6","score":1,"title":"Review update","text":"All of a sudden I can no longer view my camera unless I’m home. I’ve tried updated the software but won’t let me. I’ve tried deleting and reading but it won’t  even let me add. Just keeps saying recognition failed.  \nUpdate. Clearly you never took the time to read my review cause if you did you can see that it says that the firmware won’t update. I have tried numerous times. I even deleted and tried to read add but you didn’t read that either.","updated":"2019-04-18T04:03:52-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3380304304","userName":"Christie<3","userUrl":"https://itunes.apple.com/us/reviews/id41929070","version":"5.2.0","score":2,"title":"Overall glitchy","text":"An okay app for being free but it has lots of glitches. Ever since the latest update, it asks to bind email every time I open the app. I can enter my email address a million times but it never emails me or makes the notification stop appearing. Daylight savings time ended today (November 4) and there is no way to turn the time back on the cameras and it hasn’t updated automatically.","updated":"2018-11-04T07:05:25-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"6494759566","userName":"bandit345 really","userUrl":"https://itunes.apple.com/us/reviews/id484122361","version":"5.5.0","score":1,"title":"Junk","text":"They have to be taken back down about ever 3 months it looses WiFi and with no way to get back into the WiFi section you have to take down and reprogram they need to put a place to reconnect to WiFi this is a big problem for me it takes a whole day to do this I’ve done it three times since I have had them and you have a hard time sending a review all names are taken","updated":"2020-10-02T23:12:20-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"4091918023","userName":"Greyhound momma","userUrl":"https://itunes.apple.com/us/reviews/id150437987","version":"5.2.6","score":1,"title":"Building an encrypted channel...non-stop","text":"The software for this app is awful. I have the most up to date version of the software (5.2.6). This problem won’t go away. I’ve tried updating the firmware on the camera and still this won’t work. I used to love this camera but now I want to throw it away. I’ve told many people about it which has led to the purchase of 5 cameras between my friends and family. I’m starting to regret that recommendation. \n\nPLEASE FIX YOUR SOFTWARE!!!","updated":"2019-05-02T17:02:34-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3394381191","userName":"kokoloks","userUrl":"https://itunes.apple.com/us/reviews/id143476294","version":"5.2.1","score":1,"title":"Keeps on crashing!!!!!!!!!!!!!","text":"The latest 2 updates, keeps on crashing on my 2 iPads. Pls fix!\n\nThanks for the reply. Said to uninstall and reinstall since there’s a new update. Did that. But then again, still the same. Tried on both iPads, failed! Can we choose the previous versions instead coz the the more you guys update it, the more it’s getting worse. \nWell, i still hope you guys can still FIX it!","updated":"2018-11-08T03:56:36-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"6736224029","userName":"jonv32","userUrl":"https://itunes.apple.com/us/reviews/id735252734","version":"5.5.4","score":5,"title":"Peace of Mind","text":"This wireless video camera is definitely an awesome investment. Now I can monitor my Mother and pets when they r home alone. I don’t have to worry and I can talk to her and hear her responses.  So very Happy with this product.","updated":"2020-12-09T19:38:07-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"2418370852","userName":"lissieaane","userUrl":"https://itunes.apple.com/us/reviews/id673312885","version":"5.1.0","score":3,"title":"Unable to access my cloud","text":"I was able to access my cloud until yesterday I did get a message saying my freezer I was going to expire on April 16 and now I can’t even get any of my videos that are on the cloud and I need one of them to be able to get in order to give to police for reason and nothing.","updated":"2018-04-13T10:13:36-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"7096104431","userName":"i dont gave ine","userUrl":"https://itunes.apple.com/us/reviews/id1268973316","version":"5.5.8","score":5,"title":"RrDc","text":"I like this device so far so good it stays monitoring for me that’s the option I choose because I like 24 hour servalance but there are other options","updated":"2021-03-12T16:19:20-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"4161402974","userName":"Keysgent","userUrl":"https://itunes.apple.com/us/reviews/id11223247","version":"5.2.6","score":5,"title":"Not reliable","text":"everytime there is an update to IOS, these folks are the last to upgrade their app, so your camera goes offline for weeks.  Steer clear of these cams.","updated":"2019-05-16T14:55:26-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"5795242028","userName":"liviafscarvalho","userUrl":"https://itunes.apple.com/us/reviews/id101269086","version":"5.4.1","score":5,"title":"Excellent","text":"It’s just excellent. You can use to watch the kids, to keep an eye on the house when you are away and other things.","updated":"2020-04-11T02:23:34-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"6916618759","userName":"zednep","userUrl":"https://itunes.apple.com/us/reviews/id18886476","version":"5.5.6","score":5,"title":"Very easy to set you works flawlessly","text":"I have been using this product for a while and I am very satisfied","updated":"2021-01-26T10:45:23-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"6182179329","userName":"webe716","userUrl":"https://itunes.apple.com/us/reviews/id653370143","version":"5.4.4","score":5,"title":"Great Camera","text":"Easy setup works great keeps me safe and let’s me watch my pets when I go out to the store \nAnd I can put it to my window to see when mail or package is delivered \nLove your camera and software \nOnly problem can not get it to work with my windows 10 \nTried BlueStacks and it is the only program for Eye4 does not work \nOther than that Love your cameras and software","updated":"2020-07-10T11:28:40-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"2403147565","userName":"Vic122982","userUrl":"https://itunes.apple.com/us/reviews/id165366133","version":"5.0.9","score":3,"title":"Not great...","text":"When it works, which is quite rare is fine. It freezes a lot, goes offline like every day and it has to be unplugged and plugged back in to make it work. Used to work a lot better but it seems to get worse with every update.","updated":"2018-04-09T12:24:30-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"5761285990","userName":"the alpha of the pack","userUrl":"https://itunes.apple.com/us/reviews/id240800036","version":"5.4.1","score":5,"title":"How it work","text":"At the beginning was hash to set it up, but after I saw the video in you tube, it work very fine I am happy","updated":"2020-04-04T06:23:47-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"2238591352","userName":"Johnnyrust","userUrl":"https://itunes.apple.com/us/reviews/id104770565","version":"5.0.8","score":4,"title":"one little bug","text":"Keep getting a “log in again” pop up telling me I can’t be logged in with two different devices.  I only have app on one device. Please fix this","updated":"2018-02-23T04:32:10-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"6190227076","userName":"rf2019","userUrl":"https://itunes.apple.com/us/reviews/id168298440","version":"5.4.4","score":5,"title":"Simple!","text":"Hooked up easily and simple to operate!  Considering cost... worth it even if it fails in a year!","updated":"2020-07-12T12:08:32-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3710475245","userName":"tedz 1965","userUrl":"https://itunes.apple.com/us/reviews/id273070158","version":"5.2.3","score":1,"title":"Terrible customer service","text":"Have been begging for help online and they simply won’t respond. They could care less. Issues with cameras due to an update bug and they’re doing nothing about it. Cameras are frozen for weeks now. Terrible, terrible customer service!!!!!!  Chinese thieves make Chinese crap!!! Never again!!! Last of anything I buy that’s made in China!!!","updated":"2019-01-29T17:17:00-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"7644315905","userName":"JcLynne","userUrl":"https://itunes.apple.com/us/reviews/id164147846","version":"5.6.3","score":5,"title":"Works great!!!","text":"Im very satisfied with this product! When I'm away from home I can interact with my cat so he's not soo lonely.","updated":"2021-08-01T16:02:30-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"2926048147","userName":"Itsmekatiejo","userUrl":"https://itunes.apple.com/us/reviews/id254295683","version":"5.1.5","score":2,"title":"Picture is great and clear WHEN IT WORKS!","text":"I’ve attempted to contact customer support multiple times with no response and everything is in a different language. Getting very frustrated! Don’t buy this product if you ever think you’ll need customer service.","updated":"2018-07-17T17:05:44-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"4924277876","userName":"Mikemonza","userUrl":"https://itunes.apple.com/us/reviews/id125593155","version":"5.3.5","score":5,"title":"Best Camera system","text":"I have tried many cameras and by far this is the best, i get instant alert and it is a very stable system.","updated":"2019-10-11T09:25:10-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3653399933","userName":"70 tigerman","userUrl":"https://itunes.apple.com/us/reviews/id422269189","version":"5.2.3","score":5,"title":"Very easy","text":"This is a wonderful device. Definitely worth the money.","updated":"2019-01-15T07:51:18-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"2305120832","userName":"Connieleeeeee","userUrl":"https://itunes.apple.com/us/reviews/id31356198","version":"5.0.9","score":3,"title":"App keeps freezing and dying without open since my last update","text":"Keeps freezing and dying and will not open\n\nUpdate: app now open without freezing.","updated":"2018-03-14T05:46:06-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"7606804212","userName":"Lark Spencer","userUrl":"https://itunes.apple.com/us/reviews/id35476660","version":"5.6.3","score":2,"title":"Constantly losing connection or won’t connect","text":"It will load for a few seconds then it disconnects and i have to exit the app/reload a lot.   Otherwise the features are good and great visibility","updated":"2021-07-22T15:59:57-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3430693031","userName":"MercyAngy","userUrl":"https://itunes.apple.com/us/reviews/id184487350","version":"5.2.1","score":1,"title":"Works but always crash","text":"Like the quality of the video but it always logs off or just stops working.... Like right now it doesn't even want to open on my iPad and I have to delete the app and download it again. I'm hoping it works after I verified some dump email confirmation.... Wasted of money!","updated":"2018-11-17T20:09:44-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3024866060","userName":"Kowshik C Mondal","userUrl":"https://itunes.apple.com/us/reviews/id353289032","version":"5.1.7","score":5,"title":"Can't open app after update","text":"Hello,\nApp crashing when trying to open it. It was working fine before the 27 July update. After updating the app.... I can't open it anymore. It's closing automatically.\n\nI'm using iPhone 5\niOS 10.3.3\n\nPlease fix ASAP. Thanks.\n\nDeveloper fixed the problem. It's working fine now.","updated":"2018-08-06T02:42:32-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"6110268411","userName":"sissybug74","userUrl":"https://itunes.apple.com/us/reviews/id16215236","version":"5.4.3","score":5,"title":"Security cam","text":"Awesome camera, easy to operate and does everything I wanted","updated":"2020-06-22T18:03:58-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"5474310946","userName":"a5342b","userUrl":"https://itunes.apple.com/us/reviews/id107163019","version":"5.3.9","score":1,"title":"Ckoud storage","text":"I was never offered the free trial for cloud storage.  I’ve purchased cloud storage and it doesn’t work. Multiple attempts made within the app and via email to get support. No response. The phone numbers are not working numbers. Disappointed.","updated":"2020-02-01T04:45:12-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"7774310065","userName":"napleskid","userUrl":"https://itunes.apple.com/us/reviews/id131215391","version":"5.6.5","score":3,"title":"Zoom Bar","text":"Please remove the zoom bar which was recently added.","updated":"2021-09-05T08:00:06-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"6402022131","userName":"FJBPanama","userUrl":"https://itunes.apple.com/us/reviews/id165721019","version":"5.4.8","score":5,"title":"Best camera system","text":"Eye 4 is the best, easy to set up and use.  Highly recomended👍🏻","updated":"2020-09-06T10:47:46-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3878647016","userName":"ChicagoLMA","userUrl":"https://itunes.apple.com/us/reviews/id260924926","version":"5.2.5","score":1,"title":"Terrible App and support","text":"I downloaded this app to use with my IP camera as a nanny cam and it won’t work after moving to a new home with new internet. The camera refused to connect to the new WiF, wouldn’t reset, and their online support was useless. Terrible app and terrible customer support. Don’t bother with this company.","updated":"2019-03-13T18:55:50-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3400044833","userName":"NorCal Explorer","userUrl":"https://itunes.apple.com/us/reviews/id36997515","version":"5.2.1","score":2,"title":"Need work lots of it","text":"Work great for the first few weeks then It buggy as the updates came.  With this latest update it no longer works and only crashes continuously.","updated":"2018-11-09T17:01:56-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"2317403331","userName":"K Manno","userUrl":"https://itunes.apple.com/us/reviews/id215456859","version":"5.0.9","score":3,"title":"Not sure how I feel about it right now....","text":"Been having to unplug and blue back in my camera and it keeps telling me I’m not online... not cool at all.... need to check on my dog.... 😡🤬😡🤬 please fix the bugs....","updated":"2018-03-17T15:57:53-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"5742570284","userName":"Dub above all","userUrl":"https://itunes.apple.com/us/reviews/id348727397","version":"5.4.0","score":4,"title":"Crash and burn","text":"This update causes my phone to lock up.","updated":"2020-03-31T13:43:53-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"6129409869","userName":"luisxxxxx","userUrl":"https://itunes.apple.com/us/reviews/id1091777201","version":"5.4.4","score":1,"title":"Updated version and disconnected all my devices","text":"I put these cameras in a house that’s hours from where I am now. When the app automatically updated, my account was gone. I lost all the system. Worse outcome imaginable.","updated":"2020-06-27T14:00:02-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1935895921","userName":"LittleSnacker","userUrl":"https://itunes.apple.com/us/reviews/id627206606","version":"5.0.4","score":4,"title":"Works well, but...","text":"The app is nice, and functions well, but the graphics are slightly blocky.","updated":"2017-11-20T15:56:22-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"7010814390","userName":"very happen","userUrl":"https://itunes.apple.com/us/reviews/id329777981","version":"5.5.7","score":2,"title":"No 5G","text":"I got this camera online and it specifically said 5G network capability and now I get the camera here and it will not connect to my 5G because it says it’s not 5G related it’s only 2.4 GB very disappointed.","updated":"2021-02-18T13:19:28-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"2320623812","userName":"Bug05","userUrl":"https://itunes.apple.com/us/reviews/id43350751","version":"5.0.9","score":2,"title":"Works on WiFi","text":"The app works great when connected to any WiFi source. But I can’t get the app to show the video stream when connected to cellular. I’ve tried all kinds of things but nothing works.","updated":"2018-03-18T12:29:55-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"6710648940","userName":"Amanda Monahan","userUrl":"https://itunes.apple.com/us/reviews/id323224719","version":"5.5.4","score":1,"title":"Device won’t turn on and no one answers the phone","text":"Two months after buying, the key camera won’t turn on or reset and no one at this company responds.","updated":"2020-12-02T13:01:23-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3773262243","userName":"Hadiarshia","userUrl":"https://itunes.apple.com/us/reviews/id391429521","version":"5.2.3","score":5,"title":"Thanks","text":"Thank you for perfect device by right price.","updated":"2019-02-15T08:57:21-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3210593305","userName":"topmack","userUrl":"https://itunes.apple.com/us/reviews/id138752907","version":"5.1.8","score":1,"title":"Support","text":"I hate to be a jerk but where is the support? Go to the web site that is designed for mice type readers, finally find the language flags, the go to the support page and it is in Chinese; where is the support! I got six cameras and none of them work!","updated":"2018-09-20T09:12:26-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"4110183003","userName":"joejoejoe1413","userUrl":"https://itunes.apple.com/us/reviews/id698392890","version":"5.2.6","score":5,"title":"Starcam","text":"Love ‘‘tis software it helps me to watch over my home and family","updated":"2019-05-06T09:55:46-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3312706287","userName":"TiTi-na","userUrl":"https://itunes.apple.com/us/reviews/id226148219","version":"5.1.8","score":1,"title":"ZERO STARS","text":"Worst camera and company EVER! They seemed to have dropped off the face of the earth because there’s absolutely no support.  I guess that’s the issue with buying these cameras. they get your money and after awhile, they can just move on to another product. Effing Chinese thieves!","updated":"2018-10-17T09:00:00-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"2326866655","userName":"Tootsiekoo928","userUrl":"https://itunes.apple.com/us/reviews/id37046788","version":"5.0.9","score":1,"title":"Register fail","text":"This app is terrible! My husband and I both have our MBAs and can’t figure out how to register so we can set up the camera. We’ve scoured the internet and many other users have the same problem with no solution. FIX THE APP!","updated":"2018-03-20T07:34:12-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"4978104137","userName":"KirsyA","userUrl":"https://itunes.apple.com/us/reviews/id30449651","version":"5.3.5","score":1,"title":"Worthless product/customer service","text":"Our Eye 4 stopped working after about six months. Will not pick up our network. Tried reaching customer service for some help and never heard from anyone.","updated":"2019-10-19T11:26:26-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"6426997181","userName":"sunshine0099","userUrl":"https://itunes.apple.com/us/reviews/id652944980","version":"5.4.8","score":1,"title":"Help me out","text":"Video stuck and video also up and down. 3 hours later color changed to dark video which is poor quality","updated":"2020-09-13T20:34:42-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"6607018078","userName":"*reviews*","userUrl":"https://itunes.apple.com/us/reviews/id87334185","version":"5.5.1","score":1,"title":"App crashing in full screen","text":"I liked this app until I did the most recent update (Nov. 2020). Now, the view crashes if I go into full screen. Please fix, thank you","updated":"2020-11-03T22:22:29-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"5784288188","userName":"New Makara","userUrl":"https://itunes.apple.com/us/reviews/id225416360","version":"5.4.1","score":5,"title":"my safety depend on it. Pls FIX IT.","text":"It kept crashing every 1-2 mins or disconnected. \nI checked the camera and it plugged in and the light turned on. \n\nNothing wrong with the hardware, so it must be from the app. \n \nPls fix it cus my safety depend on it.","updated":"2020-04-08T21:55:46-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"7628184228","userName":"thincoder","userUrl":"https://itunes.apple.com/us/reviews/id143861225","version":"5.6.3","score":2,"title":"What’s the problem?","text":"The app tells me I’m offline as soon as I leave the house. It used to work with no problems.","updated":"2021-07-28T09:34:19-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"7016282286","userName":"NiiD's","userUrl":"https://itunes.apple.com/us/reviews/id131506297","version":"5.5.7","score":2,"title":"App not working","text":"I can’t use app for 1 week\n\nI don’t know what. I try use it always in a day but it not working. Please fix it as soon as.","updated":"2021-02-19T23:18:49-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"5389189067","userName":"amir rostami","userUrl":"https://itunes.apple.com/us/reviews/id515406304","version":"5.3.8","score":5,"title":"vstar c29s","text":"i have c29s. sometime my camera disconnect from wifi modem and then dont reconnect to wifi automatically\ni most reset the camera to fix this problem\nhelp me. thanks","updated":"2020-01-11T02:54:29-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"4683805499","userName":"Newfy1of2","userUrl":"https://itunes.apple.com/us/reviews/id666404388","version":"5.3.3","score":1,"title":"Goes Offline at Dusk","text":"When it starts to get dusk it goes offline and it won’t work at night. I have brought the camera in hooked it up to the router to get it online and as soon as I take it outside in the dark it disconnects!","updated":"2019-08-27T19:44:13-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"4508365700","userName":"Dyyzie","userUrl":"https://itunes.apple.com/us/reviews/id619141285","version":"5.3.0","score":2,"title":"Dont trust","text":"I had it installed in a Home and let it connected as the only device with my wlan. After I come back I saw a 20GB volume transfered. That cant be me watching 3 Times a week 3 Seconds of footage!","updated":"2019-07-23T18:17:25-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3931006894","userName":"jer833","userUrl":"https://itunes.apple.com/us/reviews/id49234639","version":"5.2.5","score":1,"title":"Useless","text":"All I get is an error stating “Building an encrypted channel...”. I never get past this screen. Spent 2 hours IMing customer support who didn't seem able to help me nor too willing. Camera is useless unless they fix the app.","updated":"2019-03-26T17:41:39-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3028864111","userName":"Ozba1","userUrl":"https://itunes.apple.com/us/reviews/id208455315","version":"5.1.7","score":1,"title":"Suddenly I was logged out and can’t log back in","text":"I entered my mail and password, it says password is wrong.\nI selected “Forgot Password”, entered my mail, it says it’s not a designated recovery mail.\nI tried to register with that mail, it says email already registered.\n See the loop?\n\nAnd let’s not talk about how difficult it is to connect to the camera for the first time, or the really bad English used all over the app.\n\nTry another cam, I beg you.","updated":"2018-08-06T22:53:33-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"7865859762","userName":"Snakebeater","userUrl":"https://itunes.apple.com/us/reviews/id240540180","version":"5.6.5","score":1,"title":"Latest version not working on iOS 15 iPhone 13","text":"It just shows a welcome screen to log in but you can’t tap on anything to actually login.","updated":"2021-10-01T08:17:19-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3935086268","userName":"Guinessbabe","userUrl":"https://itunes.apple.com/us/reviews/id19865817","version":"5.2.5","score":1,"title":"Please update the app!!","text":"We use as a baby monitor, please fix ASAP! It will just say building an encrypted channel and won’t connect!! We have 2 of them we use both as baby monitors and they are completely unreliable!!","updated":"2019-03-27T19:07:03-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3734139458","userName":"shamalaama","userUrl":"https://itunes.apple.com/us/reviews/id712844013","version":"5.2.3","score":1,"title":"😩","text":"I love the camera but the app is crap! I tried to log onto the app while trying to catch someone sprinting past my house! Couldn’t do that because the app takes to long to load.","updated":"2019-02-04T16:49:42-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3693700794","userName":"ashtaters","userUrl":"https://itunes.apple.com/us/reviews/id43126961","version":"5.2.3","score":1,"title":"Doesn’t work","text":"I can’t get my cloud storage to work. I thought it was bc I needed to buy more storage do I did but that didn’t fix the issue. It also takes so long to load the live stream.","updated":"2019-01-25T10:49:19-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"7090715840","userName":"45 the f","userUrl":"https://itunes.apple.com/us/reviews/id360495488","version":"5.5.8","score":4,"title":"Windows","text":"Does not support Windows remembering placement on screen.","updated":"2021-03-11T05:15:44-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3394800346","userName":"Garyhnjulie","userUrl":"https://itunes.apple.com/us/reviews/id111499991","version":"5.2.1","score":1,"title":"App stopped working with latest update","text":"Was liking this app till it quit working after update reinstalled several times app flashes and exits when trying to start. iPhone 5c iOS 10.3.3 and ipad 4","updated":"2018-11-08T06:11:45-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3057157594","userName":"zero1niner","userUrl":"https://itunes.apple.com/us/reviews/id128204473","version":"5.1.7","score":2,"title":"Super sllloowwww startup","text":"The more recent releases have made this apps painfully slow startup almost unusable. Every update they do causes slower and slower startup. \n\nMake it start faster!!!!!!","updated":"2018-08-12T23:29:20-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"7306171930","userName":"JOE GAMBONE","userUrl":"https://itunes.apple.com/us/reviews/id340717009","version":"5.6.1","score":1,"title":"Terrible app","text":"Application is not user friendly.  Took an hour to connect.  Camera doesn’t actually have laser pointer.  False advertising","updated":"2021-05-06T14:43:57-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"6214520929","userName":"Gabe2261","userUrl":"https://itunes.apple.com/us/reviews/id477076147","version":"5.4.4","score":4,"title":"Good Camera","text":"It's not perfect but works pretty consistently...","updated":"2020-07-18T18:01:16-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"6549913460","userName":"Vendealoos","userUrl":"https://itunes.apple.com/us/reviews/id445029774","version":"5.5.0","score":5,"title":"Sprite Cam","text":"Infrared motion sensor caught a sprite flying through my house.","updated":"2020-10-18T18:11:38-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3849570560","userName":"mrdtexas","userUrl":"https://itunes.apple.com/us/reviews/id555876191","version":"5.2.4","score":3,"title":"Sd card playback","text":"After update sd card playback will only play last 24hrs. Please fix","updated":"2019-03-06T06:44:28-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"2628546390","userName":"5Cartoon","userUrl":"https://itunes.apple.com/us/reviews/id811262723","version":"5.1.3","score":1,"title":"Junk   Customer service customer support never gets back to me","text":"Customer support never gets back and it’s a possible to add the phone feature","updated":"2018-06-01T15:44:31-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"2495407638","userName":"Demonel","userUrl":"https://itunes.apple.com/us/reviews/id117349015","version":"5.1.1","score":1,"title":"camera movement control","text":"you cannot 100% control the up/down/left/right movement from this app. app only provide horizontal or vertical button and it will automatically keep moving until u press again to stop.  if you press again it will rotate back again and start again, you cannot continue where you stop. silly app i ever seen. stupid app","updated":"2018-05-02T04:15:50-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"7256071554","userName":"ReiTremor","userUrl":"https://itunes.apple.com/us/reviews/id115206669","version":"5.6.1","score":1,"title":"It keeps connecting to wifi","text":"I set it to connect to wired but keeps connecting to wifi. And photo doesn’t stay.","updated":"2021-04-23T14:18:28-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"5376473941","userName":"hawtboi","userUrl":"https://itunes.apple.com/us/reviews/id239843757","version":"5.3.7","score":2,"title":"Looks like","text":"They tried to add dark mode but wasn’t successful. Dark strips with no visible text in settings.","updated":"2020-01-08T06:15:20-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"6117471979","userName":"Andrnk","userUrl":"https://itunes.apple.com/us/reviews/id47706621","version":"5.4.4","score":1,"title":"Last update","text":"Camera doesn’t work anymore","updated":"2020-06-24T13:05:03-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3975154707","userName":"vsele","userUrl":"https://itunes.apple.com/us/reviews/id740831616","version":"5.2.6","score":1,"title":"Can’t reset no button","text":"I had this for 3 weeks the sound keeps echoing all of a sudden the camera don’t work I trie to reset but no button","updated":"2019-04-05T19:10:11-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"2642906096","userName":"The Macf","userUrl":"https://itunes.apple.com/us/reviews/id37462306","version":"5.1.3","score":2,"title":"New Version","text":"Newest version is a down grade. No motion alerts. No wide screen anymore. Everything is compressed to 4:3 ratio.","updated":"2018-06-04T18:04:21-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3843773092","userName":"jobos99","userUrl":"https://itunes.apple.com/us/reviews/id40548380","version":"5.2.4","score":1,"title":"This is garbage","text":"Do not buy this product it crashes constantly not worth the money or frustration","updated":"2019-03-04T18:54:41-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3929764023","userName":"acykdcpk","userUrl":"https://itunes.apple.com/us/reviews/id181223120","version":"5.2.5","score":1,"title":"Offline everyday after this app updated a month ago","text":"Please update this app have scheduled reboot that can help me to reduce the turn of offline!","updated":"2019-03-26T09:28:16-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"5509872162","userName":"Sell it good","userUrl":"https://itunes.apple.com/us/reviews/id209721551","version":"5.3.9","score":1,"title":"5g???","text":"I have several of your cameras at $80 each.  I just upgraded to 5g.  When will you ?   Your cameras don’t work.","updated":"2020-02-09T13:39:14-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"4394584500","userName":"evilchandler","userUrl":"https://itunes.apple.com/us/reviews/id394438507","version":"5.2.7","score":1,"title":"What happened?","text":"Normally, this is a 5 star product. Now all I am getting is a blurry picture. What happened?","updated":"2019-06-30T20:26:35-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3377625555","userName":"Nela86","userUrl":"https://itunes.apple.com/us/reviews/id158148977","version":"5.2.0","score":1,"title":"After last update app crashes","text":"Now the app cannot start with the last update","updated":"2018-11-03T15:04:50-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"2396440775","userName":"FanOmuisc","userUrl":"https://itunes.apple.com/us/reviews/id34189863","version":"5.0.9","score":1,"title":"App is TOTAL JUNK!","text":"Wow! This app and camera is the true definition of \"Made in China\". Lol It's a whole new level of crap. I'm exstremsly well versed of all things technical with masters degree in engineering and I can't get it to bind.","updated":"2018-04-07T19:10:22-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1957249290","userName":"N. Hammonds","userUrl":"https://itunes.apple.com/us/reviews/id16330877","version":"5.0.4","score":1,"title":"App doesn’t work on Apple products","text":"I can open the app on my iPad and Apple 7 Plus phone, but the app closes immediately. How can I fix this?","updated":"2017-11-29T04:01:48-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"8038276423","userName":"Blah765454355","userUrl":"https://itunes.apple.com/us/reviews/id150043377","version":"5.6.7","score":1,"title":"Garbage","text":"I have 2 of these they both won’t work or connect pure junk","updated":"2021-11-18T14:33:11-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3842006774","userName":"eye4people!","userUrl":"https://itunes.apple.com/us/reviews/id329789245","version":"5.2.4","score":1,"title":"Returned it","text":"I returned this LAST year because would not work! I got 44 emails last night and this morning of motion detection.  Please fix this ASAP!","updated":"2019-03-04T07:14:39-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"6632869297","userName":"johnnytsw","userUrl":"https://itunes.apple.com/us/reviews/id234174920","version":"5.5.1","score":1,"title":"Poor","text":"Very difficult to use","updated":"2020-11-11T03:58:01-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1461144327","userName":"Stonewall Jackson!!","userUrl":"https://itunes.apple.com/us/reviews/id21721385","version":"3.1.3","score":4,"title":"Works now after finding the password","text":"Directions should be better.","updated":"2016-10-04T18:11:53-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3019387152","userName":"DelliNguy3t","userUrl":"https://itunes.apple.com/us/reviews/id750903143","version":"5.1.6","score":3,"title":"Doesn't work on ver. 10.3.3","text":"Pls check and fix. Thanks.","updated":"2018-08-04T22:31:51-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"2852428755","userName":"notHAPPY419","userUrl":"https://itunes.apple.com/us/reviews/id491222013","version":"5.1.4","score":1,"title":"iPhone user..","text":"If I’m not at home near my camera, I can not view the camera on the app using my iPhone 8. Please fix this!","updated":"2018-07-06T15:31:13-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3825782870","userName":"Rblcf","userUrl":"https://itunes.apple.com/us/reviews/id111239828","version":"5.2.3","score":1,"title":"App freezes","text":"The Eye4 app freezes and only shows “building an encrypted channel...” on the screen. Please fix.","updated":"2019-02-28T14:24:57-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3025911979","userName":"Rarnold1313","userUrl":"https://itunes.apple.com/us/reviews/id85595398","version":"5.1.7","score":2,"title":"Works great","text":"Until it doesn’t","updated":"2018-08-06T06:41:06-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"4727329622","userName":"ncgirlie","userUrl":"https://itunes.apple.com/us/reviews/id592114980","version":"5.3.3","score":1,"title":"Unreliable","text":"Won’t connect half the time. No easy problem solving.","updated":"2019-09-04T13:40:15-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"2983663618","userName":"anonymous_0192834098","userUrl":"https://itunes.apple.com/us/reviews/id205415744","version":"5.1.6","score":1,"title":"Doesn’t work","text":"Notifications do not work","updated":"2018-07-28T11:05:49-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"7393092153","userName":"johnson 2112","userUrl":"https://itunes.apple.com/us/reviews/id981034075","version":"5.6.1","score":1,"title":"It says my account was canceled an I want to k why","text":"Can’t get mine to work","updated":"2021-05-26T21:48:50-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"2624199626","userName":"fjnjkkl","userUrl":"https://itunes.apple.com/us/reviews/id567923047","version":"5.1.3","score":1,"title":"Horrible","text":"Camera does not work","updated":"2018-05-31T18:39:49-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"2442709718","userName":"StormChaser1211","userUrl":"https://itunes.apple.com/us/reviews/id293882960","version":"5.1.1","score":1,"title":"5.1.1 update shows all cameras “offline”","text":"Fix this ASAP!!!","updated":"2018-04-19T15:52:33-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"4086037358","userName":"KJR 1","userUrl":"https://itunes.apple.com/us/reviews/id374439135","version":"5.2.6","score":1,"title":"Worked great for awhile","text":"Worked great for awhile then caput. Won’t reconnect.","updated":"2019-05-01T09:45:10-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3031553898","userName":"Gayboy1978","userUrl":"https://itunes.apple.com/us/reviews/id149278539","version":"5.1.7","score":3,"title":"Motion detector","text":"motion detector does not work.","updated":"2018-08-07T09:54:06-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1629329087","userName":"Loverly_db","userUrl":"https://itunes.apple.com/us/reviews/id104458037","version":"4.0.4","score":3,"title":"Used to work till I upgraded to U-verse AT&T internet","text":"I own 4 of these cameras that use this app and loved them. The XuCoo kind. My mother has full blown ALS and is on a ventilator, feeding tube, the works. I got these cameras because I could check them from work and make sure she was doing well. After an issue with a fall that caused a broken femur and shoulder they were a must have. However, last month, I upgraded my internet from Time Warner/Spectrum to AT&T u-verse. When I tried to put the cameras on the new wifi network, it told me they weren't capable of using 5G. So now they are utterly useless. Make sure you do not get cameras that use this app if your internet is too fast. I didn't even realize you could have too fast of an internet for something.","updated":"2017-05-31T01:38:09-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1515391963","userName":"convictedfelon","userUrl":"https://itunes.apple.com/us/reviews/id16138337","version":"4.0.0","score":1,"title":"Let's see how many times EyeCloud/Eye4 can screw up","text":"Once upon a time, there was EyeCloud.  I ran my home cameras through that app, it worked ok.  EyeCloud came out with an update that, basically, made everything not work.  No more EyeCloud.  \n\nSwitched over to using the Eye4 app.  I ran my home cameras through that app, it worked ok.  Eye4 came out with an update, that, basically, has made several things not work.  \n\nAre these developers TRYING to make people get new systems...?  Because I can't fathom how they release updates with such massive bugs/problems in them.","updated":"2017-01-04T12:17:10-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1137408688","userName":"u010603","userUrl":"https://itunes.apple.com/us/reviews/id200038467","version":"2.7.6","score":3,"title":"Usable but not great","text":"Since you ship worldwide you should translate the app at least to English. Now most items not readable.\nAlso this app has a problem with tilt and shift support, camera goes not where you tell it, usually it goes ceiling if you just touch the screen.\nAlso position presets does nothing at all.\nVscam is much better.\nAlso this app hangs on iOS 6 when you try to add camera.","updated":"2015-01-28T02:18:33-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1568136643","userName":"karmaboi79","userUrl":"https://itunes.apple.com/us/reviews/id32454619","version":"4.0.3","score":1,"title":"Motion detection doesn't work","text":"The whole point of a security system is to know if there is any unusual movements and to be notified if there is, with this feature not working the whole system is useless!  Also you don't have an option to fast forward the video play... so you literally have to sit there and watch the playback in real time.  I tried importing the video from the SD card to my computer but the files are encrypted...again making the system useless.","updated":"2017-03-19T14:37:32-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1650597901","userName":"JK0cr","userUrl":"https://itunes.apple.com/us/reviews/id580980296","version":"4.0.5","score":5,"title":"Have issues ?","text":"If your app is crashing after update , just delete the app and install it again; it seems like this version crashes if it is present data from an old version.","updated":"2017-06-19T21:39:38-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"903603555","userName":"Kimballwiggins","userUrl":"https://itunes.apple.com/us/reviews/id251409394","version":"1.4","score":5,"title":"Easy 2 setup","text":"Fastest setup ever.  I forgot to setup the wifi but that was a matter if just punching in the password and a fast automatic reboot. The app interface always lag on all p2p devices but it's better then most. On a tablet, rather then a smartfone, I would think it's easier to navigate the pan/tilt.","updated":"2013-12-02T10:17:46-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1480361994","userName":"Lnehr","userUrl":"https://itunes.apple.com/us/reviews/id272102637","version":"3.1.4","score":1,"title":"Mostly worthless","text":"Half of the time the app either won't load the camera view. I updated the app yesterday, and I still have to shut down the app and open it back up several times before I can view anything. As far as features of the app, all the settings are written in broken English, so I can't understand anything to modify my settings. I could go on and on but this app has already wasted enough of my time. I have had nothing but trouble.","updated":"2016-11-07T06:36:31-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1508588143","userName":"Velvetylace","userUrl":"https://itunes.apple.com/us/reviews/id483604509","version":"4.0.0","score":2,"title":"The alarm doesn't work, please fix!","text":"The alarm worked on the previous version, but since the update this week, it doesn't work at all. I tried to activate every single option and it seems to be an issue with the update because it worked fine before that. I hope this is fixed asap because that is an important function of the app that I need back.","updated":"2016-12-25T00:15:34-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1142997352","userName":"Not interested anymore","userUrl":"https://itunes.apple.com/us/reviews/id198293567","version":"2.7.6","score":1,"title":"Horrible after update","text":"This update is STILL awful! I wish I never updated this app 2-3 versions ago. Worse now that the language has no options. The cameras saved deletes itself again and again. Every time I use it the cameras are gone. Cameras tilt don't stay tilt. Once I awhile the cameras show up by itself. If I can rate it -5 stars I would!!!  If you are going to fix something, make it better or leave it as is. Don't update an app pretend you improved something.","updated":"2015-02-07T01:15:48-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"914022873","userName":"Robbie girl","userUrl":"https://itunes.apple.com/us/reviews/id21813083","version":"1.5","score":3,"title":"Getting better","text":"This interface for vstarcam is getting better with its latest revision. A very convenient way to keep track of up to four of your ipcams. Presets and icon approach have potential to make this app very simple for the average user. However IR control seems to have disappeared from earlier version.","updated":"2013-12-24T05:31:17-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1650266325","userName":"Rollerbolder","userUrl":"https://itunes.apple.com/us/reviews/id219789553","version":"4.0.3","score":5,"title":"Update Fails","text":"As others are saying this update does not work. Updated and app closes when attempting to open. Same on both iPad and iPhone. Please fix!","updated":"2017-06-19T14:29:41-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1392578724","userName":"henryee18","userUrl":"https://itunes.apple.com/us/reviews/id186458033","version":"3.0.9","score":1,"title":"Bad app, and bad recording, stuttering video","text":"Hi developer, please could you make it as smooth as possible for the motion records, as well as enable it to record the sound once motion is detected? \nWhy is it so stuttery and no sound enable in after motion was detected? \nCompared with Xiaoyi IP camera and the app, your app is really not user-friendly.\nDon't tell me is your hardware issue by not enable to auto record with sound after motion is detected,and please smoother video please.!!!","updated":"2016-06-11T03:45:44-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1454661598","userName":"Blush70","userUrl":"https://itunes.apple.com/us/reviews/id243894105","version":"3.1.2","score":2,"title":"Only works if my phone is on Wifi","text":"This was good until I updated my phone! Now if I am using cellular data it crashes! Kinda the point in having it so I can us while I am gone. Very unhappy! I have these great cameras that I can only use when connected to wifi! but who gets wifi all the time??? Fix this please","updated":"2016-09-23T13:00:49-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1387999653","userName":"Quangv7","userUrl":"https://itunes.apple.com/us/reviews/id140356659","version":"3.0.9","score":3,"title":"Decent Works Good","text":"New update: figured out the intercom, works well, upgraded to 3 stars. \n\nWould be 4 stars with easier IR button. \n\n---------\nUpdate:\n\nI like the old version better. Before was able to Talk then quickly hit Listen. \n\nNow, I'm not sure what to do. Intercom, Talk, then Cancel then Listen??\n\nSo what took one click to do before now takes 3, and it makes having a convo with my Toddler impossible cause I can't do all 3 clicks fast enough before he starts talking.... :/\n\n----\n\nDecent,\n\nHas some weird language wordings, but works and feature rich. \n\nThanks.\n\n----","updated":"2016-06-02T15:29:08-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1508415915","userName":"DrewPski","userUrl":"https://itunes.apple.com/us/reviews/id41438098","version":"4.0.0","score":2,"title":"Bad Update for 4.0","text":"My wife and I use this as a monitor for watching our kids. With the new update, if one of us opens the app to look at the monitor, then the other cannot log in without kicking off the other. Please fix so we can open it simultaneously on our devices without being kicked off!","updated":"2016-12-24T18:43:05-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1224163887","userName":"superwestbrook36","userUrl":"https://itunes.apple.com/us/reviews/id117480048","version":"2.8.5","score":2,"title":"Needs improvement","text":"The app concept is good, but has several problems: crashes all the time, the speaker doesn't work you have to restart the app every time you want to use it, the firmware upgrade of the cameras always has a problem. The app has many bugs that need to be fix ASAP","updated":"2015-07-08T11:40:35-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1641215846","userName":"lkn23","userUrl":"https://itunes.apple.com/us/reviews/id578216172","version":"4.0.4","score":1,"title":"Won't connect","text":"It was working fine for idk 4-5 months now it just won't connect to any of he camera in the house... it keeps saying connection failed or wifi configuration.. blah blah anyways waste of money now my return warranty was only for 30 days I'm stuck with a camera that doesn't work and have to buy a new one emailed them so many times never got responses","updated":"2017-06-11T13:39:25-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1474503891","userName":"Jacksmobile","userUrl":"https://itunes.apple.com/us/reviews/id149257346","version":"3.1.3","score":1,"title":"Did everything still doesn't work","text":"Did every which way to bind keeps kicking back that wrong password issue rechecked changed my password takes the change even got a bind successful and still no video support is worthless no return of dozens of emails asking for support I'll be sending back camera and app will be thrashed.","updated":"2016-10-28T06:37:27-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1141196528","userName":"Sophie26773389:","userUrl":"https://itunes.apple.com/us/reviews/id107470854","version":"2.7.6","score":2,"title":"Great cameras, horrible software","text":"When I go to add a camera it comes up with a page in some Asian language, there's no English so I can't understand what it says.  When the cameras work it's fantastic, the video quality is great even in very low light, but the software is simply terrible, I don't know why it's not all in English","updated":"2015-02-03T15:47:04-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1456229895","userName":"Nargg","userUrl":"https://itunes.apple.com/us/reviews/id46104671","version":"3.1.2","score":1,"title":"iOS 10 fail","text":"I tied this app because the eye cloud app stopped working with iOS 10.  Seems this one suffers the same issues if not worse because it doesn't launch at all after setup. Too bad because the cameras are pretty good. Would also be nice if the apps would allow camera with cell data but they don't.","updated":"2016-09-26T07:15:39-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1470204105","userName":"Sereyvuthy","userUrl":"https://itunes.apple.com/us/reviews/id221123800","version":"3.1.3","score":2,"title":"Need new feature","text":"- Need an option to change date and time (for some user the date and time is not display correctly)\n- Need an option to set start up preset (this camera will go to its default location once restarted)","updated":"2016-10-20T18:10:38-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1421094426","userName":"Szamrdygryd","userUrl":"https://itunes.apple.com/us/reviews/id299989946","version":"3.1.1","score":4,"title":"Previous bug is fixed!:)","text":"So far this update is working good. No crashes, stable, seems to be faster. Thanks.","updated":"2016-07-27T12:58:48-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1441552685","userName":"Dkmdjdbdjeh","userUrl":"https://itunes.apple.com/us/reviews/id287085652","version":"3.1.2","score":1,"title":"THIS APP IS HORRIBLE","text":"The app its self has a good concept but.. The app doesn't even work I was setting up a account and the system failed regardless of the changes I made. If I could chose I would put 0 stars on it it's annoying and pesky to set up because it just simply DOESN'T  WORK so over all this app is a good concept but It doesn't work it's a waste","updated":"2016-08-29T23:36:44-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1254900880","userName":"Pitch-Bend","userUrl":"https://itunes.apple.com/us/reviews/id33390745","version":"3.0","score":1,"title":"No live video, crashes, “Account does not exist\"","text":"After the update the app crashes 100% every time when clicking on the thumbnail to see live video. \n\nAlso after logging out and logging in the server refuses to log me in with an “ Account does not exist” error message. (Of course my account exists and I remember my credentials).","updated":"2015-09-08T11:17:24-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1457888600","userName":"Don't care aaaaaaaa","userUrl":"https://itunes.apple.com/us/reviews/id387140967","version":"3.1.3","score":4,"title":"Love my camera!","text":"Thank you for updating!! Having this camera gives me the peace of mind to know my house is safe when I'm away.","updated":"2016-09-29T07:21:51-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1650184391","userName":"HuntersPad","userUrl":"https://itunes.apple.com/us/reviews/id116632262","version":"4.0.5","score":5,"title":"New update works great!","text":"For those complaining it's not working... did you actually REMOVE the app and REDOWNLOAD it??","updated":"2017-06-19T12:27:49-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1308178480","userName":"Talkguy","userUrl":"https://itunes.apple.com/us/reviews/id195767715","version":"3.0.5","score":1,"title":"Please Fix this App","text":"Disappointed but hopeful. I encourage the creator to fix the bugs others have mentioned. On top of those I can't get my app to find the light bulb. I type in my wifi password and it's as if it loses it immediately. I think the concept of these light bulbs are great but the App needs tons of work.","updated":"2015-12-29T11:57:44-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1508250338","userName":"cadegorawrz","userUrl":"https://itunes.apple.com/us/reviews/id164840290","version":"4.0.0","score":2,"title":"Can't log on to multiple devices after update!!!","text":"Ever since the most recent update I haven't been able to use multiple devices at once!","updated":"2016-12-24T10:51:10-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1302059777","userName":"Shaicho","userUrl":"https://itunes.apple.com/us/reviews/id201862946","version":"3.0.5","score":1,"title":"Can't connect C95 door cam to wifi","text":"Doing everything by the book , I boot the camera iPhone 6 with iOS 9.2 connected to wifi, app will not crush, I'm logged in, trying to add the camera, got all those beeps and nothing, trying to contact support will update if I get any help","updated":"2015-12-17T12:34:43-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1008098053","userName":"SgtDesertDawg","userUrl":"https://itunes.apple.com/us/reviews/id115285308","version":"2.2","score":1,"title":"Has potential","text":"Nice features, BUT it loses cameras every time it crashes. Also if you kill the app where running in background then it loses cameras too. Does the app creator have any comments about fixing this? If not then direct us to an alternative app that will work for the intended cameras!","updated":"2014-06-10T13:11:45-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1682346513","userName":"Ladywolf779","userUrl":"https://itunes.apple.com/us/reviews/id19835112","version":"4.0.6","score":1,"title":"Zero stars if possible","text":"Cannot get camera to connect to network in any way with this app. Can't use customer support. It's not in English. Recommended fixes too simplified, don't address my issue and don't work. Brand new camera. Will be returning for a refund.","updated":"2017-07-14T10:59:08-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1185839773","userName":"User123455754336","userUrl":"https://itunes.apple.com/us/reviews/id286891394","version":"2.8.5","score":1,"title":"WORSE APP EVER! Still same problems!","text":"Deletes the camera every time. It also still crashes. Logs me out and deleted all my cameras. When I try to put the cameras back in, it says it's already there which it isn't! You guys are the worse! What a waste of money for this dumb company.","updated":"2015-04-20T19:25:39-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1295425945","userName":"At lob","userUrl":"https://itunes.apple.com/us/reviews/id470038884","version":"3.0.5","score":2,"title":"Terrible app","text":"This app only worked for initial sign on. Since then l have not been able to get into the camera that is on line. I have the laptop app also that is working fine. Please FIX","updated":"2015-12-03T16:13:46-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1649867930","userName":"vander95","userUrl":"https://itunes.apple.com/us/reviews/id267005761","version":"4.0.5","score":1,"title":"After the update, the app will not open for me. Please fix!!!!!","text":"After the update, the app will not open for me. Iphone 7 ios 10.3.2. Previously app worked awesome. I use this app to watch my infant in the other room with my ip cam and no cannot. Please fix!!!!!","updated":"2017-06-19T05:30:34-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1067224589","userName":"JOEKNEE JOHNSON","userUrl":"https://itunes.apple.com/us/reviews/id137858763","version":"2.6","score":1,"title":"Good for maybe 100 miles, then caput","text":"Very disappointed in the software and support.\nWhen it stopped they were extremely hard to contact and get any help from. Would not recommend at all.","updated":"2014-09-20T00:40:36-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1651174796","userName":"EyeFourUser4901","userUrl":"https://itunes.apple.com/us/reviews/id200745755","version":"4.0.5","score":1,"title":"Crashes on launch.","text":"Fix this app please. Latest update does not work.  Removing app before update does not work. Crashes to background, crashes after relaunch after a few seconds. iPad and iPhone 6s.\n\nThanks.","updated":"2017-06-20T08:23:00-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1650024047","userName":"Zackdc","userUrl":"https://itunes.apple.com/us/reviews/id40676347","version":"4.0.5","score":1,"title":"Crashes immediately.","text":"Just installed latest update and now app doesn't even work.  Crashes immediately.  Previously before app the application has been working great.","updated":"2017-06-19T08:33:44-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1517472609","userName":"Bibbajibba","userUrl":"https://itunes.apple.com/us/reviews/id523130968","version":"4.0.0","score":1,"title":"Class action lawsuit","text":"On behalf of all the children injured by your unreliable software...my daughter could flip herself out of her crib because your software update is so problematic and you have turned a blind eye to these reviews warning you off this...","updated":"2017-01-07T17:03:01-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1652193382","userName":"Dhjennings","userUrl":"https://itunes.apple.com/us/reviews/id286351796","version":"4.0.6","score":4,"title":"APP v4.0.6 fixes V4.0.5 startup problem!","text":"This App works again with new version 4.0.6 !","updated":"2017-06-21T04:42:23-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1348396102","userName":"David1li661236","userUrl":"https://itunes.apple.com/us/reviews/id380485839","version":"3.0.6","score":3,"title":"It work ok","text":"It is working good but it make phone very hot now . I hope it do support sad card overwrite and picture can rotate to upside down .so we can in stall cam any angle.","updated":"2016-03-15T14:17:32-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1650250598","userName":"Tna","userUrl":"https://itunes.apple.com/us/reviews/id42478579","version":"4.0.5","score":1,"title":"Latest updates fails to open ***delete it and reinstalling fixes it","text":"Latest update fails to open app!!! I deleted the app and reinstalled and it fixed it for now. Had to re-sign in.","updated":"2017-06-19T14:04:01-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1509462778","userName":"gilsonmelo","userUrl":"https://itunes.apple.com/us/reviews/id127872493","version":"4.0.0","score":1,"title":"Can't login on multiple devices and it goes to sleeping mode after a minute !","text":"last update broke the app. \n\nCan't login on multiple devices and it goes to sleeping mode after a minute. \n\nPlease, fix it !","updated":"2016-12-26T07:01:42-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1650088756","userName":"ADNY20","userUrl":"https://itunes.apple.com/us/reviews/id33780098","version":"4.0.5","score":2,"title":"Performed update, now doesn't work","text":"This was good, and worked well, until the last update. Now it doesn't even open.","updated":"2017-06-19T10:05:32-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1452555075","userName":"Futballzz","userUrl":"https://itunes.apple.com/us/reviews/id284820739","version":"3.1.2","score":1,"title":"Ios10=failure","text":"Ios10 didn't come out by surprise so why were you guys surprised and could not keep up and update your app so it works. This is a waste. The whole purpose is to view cameras remotely and I can't even do that bc the app crashes.","updated":"2016-09-19T15:00:55-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1692083857","userName":"Elilec21","userUrl":"https://itunes.apple.com/us/reviews/id34117343","version":"4.0.7","score":1,"title":"Keeps going offline","text":"Camera keeps going offline, I have deleted app and reinstalled and still showing offline, has been happening all week","updated":"2017-07-21T07:14:34-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1184473487","userName":"VJ7878","userUrl":"https://itunes.apple.com/us/reviews/id214752638","version":"2.8.4","score":5,"title":"Good","text":"Had a good experience with it. \nPerforms as expected. No issues.","updated":"2015-04-18T03:41:40-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1290016385","userName":"Radiomir Ray","userUrl":"https://itunes.apple.com/us/reviews/id139918022","version":"3.0.5","score":1,"title":"Eye4 app crashes at opening","text":"Please update the app to be compatible with IOS 9.1.\nIt crashes at opening.\nThe 2 cams i bought are now virtually useless. \nYour old app were doing nicely but the update is lousy. \nPlease fix ...","updated":"2015-11-22T00:46:18-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1133382256","userName":"Dunk BN","userUrl":"https://itunes.apple.com/us/reviews/id212201206","version":"2.7.4","score":3,"title":"Can't Remember a camera","text":"Many times I add a camera on the program but it wasn't remember ID. I must add it every time at my home.","updated":"2015-01-20T16:58:25-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1454793931","userName":"Cristian Aymay","userUrl":"https://itunes.apple.com/us/reviews/id48920282","version":"3.1.2","score":1,"title":"After IOS 10 I can see my camera just via wifi. With 4G App crash","text":"Please fix this app urgently. After IOS 10 your app crash in 4G network. Just in wifi I can see my camera.","updated":"2016-09-23T19:48:10-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1297985050","userName":"denversj","userUrl":"https://itunes.apple.com/us/reviews/id139798012","version":"3.0.5","score":1,"title":"Smart Light Bulb ACTUALLY VERY STUPID","text":"No idea where to start, went to website. Downloaded app.  Followed manual directions. Light turns on and goes through the colors then to blue, app never locates.  This app doesn't need an update, it needs to be fully re-coded!","updated":"2015-12-08T20:07:25-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1544034828","userName":"Neo5505","userUrl":"https://itunes.apple.com/us/reviews/id133213758","version":"4.0.2","score":2,"title":"Gesture password","text":"Was working fine until this latest update. Now the gesture password doesn't work.","updated":"2017-02-13T20:03:34-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1649862983","userName":"Zara Zachary","userUrl":"https://itunes.apple.com/us/reviews/id463361586","version":"4.0.5","score":1,"title":"New update","text":"I just updated my app on my iPhone 7us and now it just closes as soon as I try to open it up, before the app was working fine, now it won't even open.","updated":"2017-06-19T05:24:17-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1603165454","userName":"Dissapointed adn Bored","userUrl":"https://itunes.apple.com/us/reviews/id30218734","version":"4.0.3","score":1,"title":"Cannot log in or register","text":"Can't get past the log in or registration screens, option to skip is missing. Hardware is useless without functional software.","updated":"2017-05-02T06:38:29-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1037900561","userName":"Edwin.h","userUrl":"https://itunes.apple.com/us/reviews/id183587422","version":"2.6","score":5,"title":"Great app with device","text":"It's a great app with camera device.","updated":"2014-07-30T20:09:47-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1650531989","userName":"lounli","userUrl":"https://itunes.apple.com/us/reviews/id22612686","version":"4.0.5","score":1,"title":"Not working","text":"Do not update. The app does not load anymore after updating it. I tried deleting it and download it again. Still does not work","updated":"2017-06-19T20:24:23-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1650553186","userName":"mychristopher","userUrl":"https://itunes.apple.com/us/reviews/id109864125","version":"4.0.5","score":1,"title":"Don't install this version!!!","text":"If you have this broken version, download EyeCloud 2.0. It works!\n\nLike everyone else, iPhone 6s, iOS 10. App splash screen shows and app closes. No more monitoring my security cameras!!","updated":"2017-06-19T20:47:15-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1566481649","userName":"Terri-leecvvv tech","userUrl":"https://itunes.apple.com/us/reviews/id300440620","version":"4.0.3","score":1,"title":"Cannot start application","text":"I tried and tried to start this app, but screen just goes blank or returns to Home. Giving up and trying other apps.","updated":"2017-03-17T09:33:56-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1253580806","userName":"Phil253","userUrl":"https://itunes.apple.com/us/reviews/id7642946","version":"3.0","score":1,"title":"Update","text":"Video quality after update is very bad. Constant pixelation. Had to reinstall app to solve the crashing problem, but video quality is terrible.","updated":"2015-09-05T11:32:42-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1118493205","userName":"Bounty hunter53","userUrl":"https://itunes.apple.com/us/reviews/id302076246","version":"2.7.2","score":1,"title":"Eye4","text":"Was a good camera until update it will no longer work can't get logged in to it .well live and learn update destroyed a good thing  one star because that is low as can go","updated":"2014-12-24T06:09:03-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1689190778","userName":"MaorS","userUrl":"https://itunes.apple.com/us/reviews/id105349082","version":"4.0.7","score":4,"title":"Great app","text":"Export videos is missing","updated":"2017-07-19T10:06:39-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1472491543","userName":"SnyCz","userUrl":"https://itunes.apple.com/us/reviews/id216826172","version":"3.1.3","score":1,"title":"Application CRASHING","text":"I just bought my IP camera for a waist of money that it doesn't work at all right from registering. APPLICATION KEEP's CRUSHING..!\nDeveloper should update with IOS 10 or it will never work once you update IOS...","updated":"2016-10-24T18:41:43-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1367257634","userName":"RichardGieser","userUrl":"https://itunes.apple.com/us/reviews/id340933400","version":"3.0.7","score":2,"title":"Eye4 software","text":"I'm trying to add a second Eye4 camera on my iPad and my desktop and can't get it set up. \nThese cameras seem to work ok, but the software setup is a nightmare","updated":"2016-04-22T14:52:47-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1131444136","userName":"Nick123938762861","userUrl":"https://itunes.apple.com/us/reviews/id28699242","version":"2.7.4","score":1,"title":"Not working any more","text":"Was working great for years.  Recent update caused my cameras to disappear and crashes the app every time I try to re install the cameras.  I hope the company fixes this!","updated":"2015-01-17T06:36:44-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1655456198","userName":"KIYAH2010","userUrl":"https://itunes.apple.com/us/reviews/id120712899","version":"4.0.6","score":1,"title":"Start up issue","text":"I never had a issue in all the months I had this camera now it's having start up issues I'm passed irritated.😡","updated":"2017-06-23T21:44:30-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1255121854","userName":"Bennychli","userUrl":"https://itunes.apple.com/us/reviews/id85743757","version":"3.0","score":1,"title":"Update if you want crash version","text":"Can't view my camera after updating. Just get crashed after tapping it.","updated":"2015-09-09T00:48:39-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1775495650","userName":"Boblitz","userUrl":"https://itunes.apple.com/us/reviews/id43362717","version":"4.0.9","score":2,"title":"Storage issues","text":"The update does not allow me to view what's been recorded on the SD card. Please fix!","updated":"2017-09-05T11:34:58-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1307749340","userName":"Osberk","userUrl":"https://itunes.apple.com/us/reviews/id479226722","version":"3.0.5","score":1,"title":"Awful","text":"Impossible to connect although i did everything right. Shouldn't be that tough!","updated":"2015-12-28T16:26:41-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1253326151","userName":"Mustafa.85h","userUrl":"https://itunes.apple.com/us/reviews/id318908793","version":"3.0","score":1,"title":"App Keep crash!!!","text":"I can't view my camera! \nthe app after the update keep crash and won't open, I can't access my camera\nplease fix it!!!","updated":"2015-09-05T00:03:42-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1650337618","userName":"RealWillyMack","userUrl":"https://itunes.apple.com/us/reviews/id20158629","version":"4.0.5","score":1,"title":"Latest update broke it","text":"Won't launch after latest update. Shame on you Apple for not allowing us to downgrade app.","updated":"2017-06-19T16:27:32-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1535549741","userName":"GirlNinja","userUrl":"https://itunes.apple.com/us/reviews/id36439889","version":"4.0.1","score":1,"title":"Motion push notifications broken","text":"I'm not getting notifications when motion is detected. Please fix - I need this feature","updated":"2017-02-02T05:43:22-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1442920170","userName":"wrisg","userUrl":"https://itunes.apple.com/us/reviews/id17429878","version":"3.1.2","score":1,"title":"Crashes","text":"Haven't even been able to get through setup, without the app crashing.","updated":"2016-09-01T10:53:59-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1479961288","userName":"Needingsecuritytowork","userUrl":"https://itunes.apple.com/us/reviews/id208322532","version":"3.1.3","score":1,"title":"Securityneeded","text":"App doesn't work when i leave my home network. Completely useless security camera and app","updated":"2016-11-06T15:50:23-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1650124352","userName":"Jg3787","userUrl":"https://itunes.apple.com/us/reviews/id122553780","version":"4.0.5","score":1,"title":"Version 4.0.5","text":"I just downloaded updated version 4.0.5 for iPhone.  Now the app. crashes immediately.  Doesn't work at all.","updated":"2017-06-19T10:56:50-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1650491250","userName":"DScrunchy","userUrl":"https://itunes.apple.com/us/reviews/id20170274","version":"4.0.5","score":1,"title":"Latest update crashes","text":"This update crashes on my iPhone. The app will not open. Unusable. Please fix it!","updated":"2017-06-19T19:42:04-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1649991597","userName":"Mkendall69","userUrl":"https://itunes.apple.com/us/reviews/id396466743","version":"4.0.5","score":1,"title":"Update","text":"Since the most current update for the iPhone the app will not open at all \nPlease fix","updated":"2017-06-19T07:52:14-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1447884341","userName":"Eye4 worked","userUrl":"https://itunes.apple.com/us/reviews/id523649240","version":"3.1.2","score":5,"title":"Happy It works","text":"Eyecloud isnt working this app does","updated":"2016-09-10T23:49:54-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1298378429","userName":"Perezalvarezhi","userUrl":"https://itunes.apple.com/us/reviews/id26914905","version":"3.0.5","score":1,"title":"Crashes the moment i open the app","text":"Doesnt work, i just got 3 cameras and they dont work because the app closes right away.","updated":"2015-12-09T18:14:28-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1651300772","userName":"shauheen","userUrl":"https://itunes.apple.com/us/reviews/id17304153","version":"4.0.5","score":1,"title":"Crashes on openning","text":"Don't update this to 4.0.5\n\nThis app has been really underperforming and now it is completely broken.","updated":"2017-06-20T10:55:19-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1344666663","userName":"navigator666","userUrl":"https://itunes.apple.com/us/reviews/id110883955","version":"3.0.6","score":1,"title":"No other language except for Chinese","text":"The update removed English from the app. Unable to use it now.","updated":"2016-03-08T02:24:29-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1650426167","userName":"BingoSmith","userUrl":"https://itunes.apple.com/us/reviews/id86213058","version":"4.0.5","score":1,"title":"Don't Update!","text":"App crashes immediately when opened after the update.","updated":"2017-06-19T18:31:50-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1252818433","userName":"A.Alashrouby","userUrl":"https://itunes.apple.com/us/reviews/id413086107","version":"3.0","score":1,"title":"It crashes all the time!!!","text":"The new update makes it crash all the time and I can't access my camera !!","updated":"2015-09-03T21:49:44-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1449786515","userName":"Aqueeeeeeelooo","userUrl":"https://itunes.apple.com/us/reviews/id496751005","version":"3.1.2","score":3,"title":"IOS 10","text":"Need update to work with IOS 10","updated":"2016-09-14T16:31:56-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1365354643","userName":"Zeveli","userUrl":"https://itunes.apple.com/us/reviews/id120669826","version":"3.0.7","score":1,"title":"Not working","text":"Getting a message that can not connect to server or server connection is lost - can't use it!!!","updated":"2016-04-18T09:50:24-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1295230160","userName":"Mehisuppose","userUrl":"https://itunes.apple.com/us/reviews/id28141667","version":"3.0.5","score":1,"title":"Please fix","text":"I worked great until iOS 9.1; now the app won't even open. Please fix so I can use my cameras again.","updated":"2015-12-03T05:36:26-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1572795964","userName":"BreckSav","userUrl":"https://itunes.apple.com/us/reviews/id42688882","version":"4.0.3","score":1,"title":"Eye4 IOS app","text":"Tried and tried to open but just closes and returns to home page. Worthless.","updated":"2017-03-25T21:01:01-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1545150712","userName":"Jer679E","userUrl":"https://itunes.apple.com/us/reviews/id326291648","version":"4.0.2","score":1,"title":"Eye4","text":"App worked fine for 12 hrs. Now it won't work at all. Without app can not monitor camera. They need to do a lot of work.","updated":"2017-02-15T10:05:54-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1544619556","userName":"Walter8vio","userUrl":"https://itunes.apple.com/us/reviews/id320823759","version":"4.0.2","score":1,"title":"Problem to unlock with gesture","text":"Problem to unlock with gesture in the last update","updated":"2017-02-14T17:53:33-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1279777372","userName":"Raynaldo05","userUrl":"https://itunes.apple.com/us/reviews/id26032635","version":"3.0.5","score":1,"title":"Not working anymore! Crashing","text":"Crashes at opening!!! Please fix","updated":"2015-10-30T22:50:49-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1653108129","userName":"Arsaha","userUrl":"https://itunes.apple.com/us/reviews/id239081933","version":"4.0.6","score":4,"title":"How to reorder camera","text":"Anyone know?","updated":"2017-06-22T00:08:38-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1515396887","userName":"DJ Voxx","userUrl":"https://itunes.apple.com/us/reviews/id42342870","version":"4.0.0","score":3,"title":"Needs work","text":"Hello, motion alarms no longer working, please fix :(","updated":"2017-01-04T12:33:41-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1651674417","userName":"Creeman80","userUrl":"https://itunes.apple.com/us/reviews/id346111313","version":"4.0.5","score":1,"title":"Garbage-","text":"Don't waste your money- wont connect, won't reset, reinstalling app don't help, No customer service, should I go on?","updated":"2017-06-20T19:40:48-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1450015587","userName":"icehitter","userUrl":"https://itunes.apple.com/us/reviews/id380759392","version":"3.1.2","score":1,"title":"Crash after updating to ios10","text":"After latest update to ios10, this app keeps crashing. Plssssss urgently fix it","updated":"2016-09-15T02:15:50-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1498374951","userName":"crs1227","userUrl":"https://itunes.apple.com/us/reviews/id308155470","version":"3.1.5","score":1,"title":"Owner","text":"Horrible. App will not open. Immediately crashes. Send camera back for a refund.","updated":"2016-12-08T14:43:31-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"972820492","userName":"Sparadonja","userUrl":"https://itunes.apple.com/us/reviews/id49661871","version":"1.7","score":1,"title":"Bugs","text":"A lot of bugs, app is losing login data, sometimes registration is not working.","updated":"2014-04-06T13:52:55-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1651422423","userName":"MehradHM","userUrl":"https://itunes.apple.com/us/reviews/id116117792","version":"4.0.5","score":1,"title":"After update not working","text":"Not working","updated":"2017-06-20T14:07:30-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1535142732","userName":"Don@03743","userUrl":"https://itunes.apple.com/us/reviews/id40030250","version":"4.0.1","score":1,"title":"Garbage","text":"App will not register. Tried about 67 times to register a new camera...same result every time-failed.","updated":"2017-02-01T16:27:16-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1279051601","userName":"Sling Man","userUrl":"https://itunes.apple.com/us/reviews/id38499852","version":"3.0.5","score":1,"title":"Crashes instantly after last update","text":"Please fix ASAP","updated":"2015-10-29T10:07:57-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1650723851","userName":"Jhaysin","userUrl":"https://itunes.apple.com/us/reviews/id412886485","version":"4.0.5","score":1,"title":"App crashes after update","text":"Was working until new update 😡😡😡😡😡😡","updated":"2017-06-19T23:59:23-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1475568291","userName":"naderh86","userUrl":"https://itunes.apple.com/us/reviews/id342354784","version":"3.1.3","score":1,"title":"Crashing in iOS10","text":"Application doesn't run. Just crashes and goes to homescreen. Appreciate fixing it soon.","updated":"2016-10-30T00:38:48-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1062214212","userName":"bindigok","userUrl":"https://itunes.apple.com/us/reviews/id37557035","version":"2.6","score":1,"title":"Server does not work on iPhone","text":"Do NOT buy this camera or use this app. Does not work on iPhone and does not work on Mac.","updated":"2014-09-10T15:59:55-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"7073791098","userName":"el chino4","userUrl":"https://itunes.apple.com/us/reviews/id1195700030","version":"5.5.8","score":4,"title":"Es una muy buena aplicación","text":"Me esta funcionando muy bien","updated":"2021-03-06T16:36:34-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1418483978","userName":"Ctechera","userUrl":"https://itunes.apple.com/us/reviews/id359286627","version":"3.0.10","score":1,"title":"App crashes","text":"I downloaded the app but can't use it. It crashes as it opens. Please fix it","updated":"2016-07-23T10:12:43-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1407154528","userName":"Puchunga9511","userUrl":"https://itunes.apple.com/us/reviews/id232438650","version":"3.0.10","score":1,"title":"Never used b4.","text":"I just got this and can not even use it!!!!! Please fix app just keeps crashing!!!","updated":"2016-07-07T09:02:00-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1649777268","userName":"Red_Rooster","userUrl":"https://itunes.apple.com/us/reviews/id21014829","version":"4.0.5","score":1,"title":"App Failure","text":"The latest upgrade fails to run under the latest Apple operating system for iPad and iPhone.","updated":"2017-06-19T03:24:50-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1450815182","userName":"Germzxc","userUrl":"https://itunes.apple.com/us/reviews/id490125534","version":"3.1.2","score":1,"title":"Clashes with iOS 10 update....","text":"Used to be working well before the iOS 10 update, pls resolve it!!!","updated":"2016-09-16T12:41:46-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1277010087","userName":"boulnguyen","userUrl":"https://itunes.apple.com/us/reviews/id476041652","version":"3.0.5","score":1,"title":"Crashes at opening!!! Please fix","text":"Crashes at opening!!! Please fix","updated":"2015-10-25T10:17:48-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1595268131","userName":"hoangpx","userUrl":"https://itunes.apple.com/us/reviews/id174549486","version":"4.0.3","score":1,"title":"stupid app","text":"crash and hang and slow and dumb UI. Very hard to use","updated":"2017-04-22T16:42:45-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1649781866","userName":"Mdavidi","userUrl":"https://itunes.apple.com/us/reviews/id86485127","version":"4.0.5","score":1,"title":"Moti","text":"Hello, I already update to new release on my iPhone and when I open the app  is automatic close","updated":"2017-06-19T03:31:10-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1650210131","userName":"Go hard zombie killa","userUrl":"https://itunes.apple.com/us/reviews/id109657073","version":"4.0.5","score":1,"title":"App Crash","text":"The app crashes on launch and never opens, do not update!!","updated":"2017-06-19T13:07:53-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1253382384","userName":"Pietpip","userUrl":"https://itunes.apple.com/us/reviews/id210033849","version":"3.0","score":1,"title":"Crashing!!!!!!!!","text":"Please fix this, my camera is now an ornament thank you!","updated":"2015-09-05T02:56:36-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1360828791","userName":"mitsosss","userUrl":"https://itunes.apple.com/us/reviews/id169658340","version":"3.0.7","score":1,"title":"Total crap!!","text":"The new version does not even Open it is a crap!!","updated":"2016-04-09T04:49:06-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1650299128","userName":"Bric237","userUrl":"https://itunes.apple.com/us/reviews/id34210765","version":"4.0.5","score":1,"title":"Crashes","text":"Crashed as soon as I open app.","updated":"2017-06-19T15:22:51-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1650139928","userName":"Dmadams1964","userUrl":"https://itunes.apple.com/us/reviews/id219168667","version":"4.0.5","score":1,"title":"Crashes on IOS 10 (Fixed)","text":"Software needs to be updated to be compatible with IOS 10.\n\nUpdate:\nIt now works with IOS 10.\n\nUpdate: 16-Jun-2017. \nEvery time they update the software, it crashes.","updated":"2017-06-19T11:19:10-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1531707348","userName":"Concern Users","userUrl":"https://itunes.apple.com/us/reviews/id152799899","version":"4.0.1","score":3,"title":"Need new update","text":"Can't format micro sd","updated":"2017-01-27T07:54:59-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1295047629","userName":"PhilippZ","userUrl":"https://itunes.apple.com/us/reviews/id41575888","version":"3.0.5","score":1,"title":"Crashes at opening","text":"iPhone 6 iOS 9.2 (beta)","updated":"2015-12-02T20:07:08-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1598647137","userName":"xRobert","userUrl":"https://itunes.apple.com/us/reviews/id178024446","version":"4.0.3","score":1,"title":"Camera does not cruise","text":"The camera does not cruise at all. It's a piece of junk","updated":"2017-04-26T22:19:34-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1449324210","userName":"torothaaaa","userUrl":"https://itunes.apple.com/us/reviews/id208130713","version":"3.1.2","score":1,"title":"Not work on ios 10","text":"Not work on ios 10","updated":"2016-09-13T19:44:33-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1464098139","userName":"Meb7772111","userUrl":"https://itunes.apple.com/us/reviews/id263933096","version":"3.1.3","score":1,"title":"App not working","text":"App need to updait to work with ios 10","updated":"2016-10-09T19:19:37-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1254268742","userName":"Cattykathy","userUrl":"https://itunes.apple.com/us/reviews/id123212565","version":"3.0","score":1,"title":"Crash!","text":"Hurry up and fix it, thanks","updated":"2015-09-07T00:24:41-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1454735522","userName":"Checakeese25","userUrl":"https://itunes.apple.com/us/reviews/id167717971","version":"3.1.2","score":1,"title":"CRASHING","text":"Won't stop crashing. Please fix!!!!","updated":"2016-09-23T17:13:35-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1650471610","userName":"Now What!?!?!!?","userUrl":"https://itunes.apple.com/us/reviews/id204634659","version":"4.0.5","score":1,"title":"Fix!","text":"Fix the crash!","updated":"2017-06-19T19:21:13-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1453138220","userName":"Bernharp","userUrl":"https://itunes.apple.com/us/reviews/id6043885","version":"3.1.2","score":1,"title":"Triple Crap","text":"How was this not tested on iOS 10?","updated":"2016-09-20T17:51:19-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1568930382","userName":"Mart-0","userUrl":"https://itunes.apple.com/us/reviews/id557684464","version":"4.0.3","score":1,"title":"Junk","text":"This app is junk","updated":"2017-03-20T18:10:07-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1458677240","userName":"Tiagomr","userUrl":"https://itunes.apple.com/us/reviews/id173094630","version":"3.1.3","score":1,"title":"can't use with ios 9.3.3","text":"the app is not working with ios 9.3.3","updated":"2016-09-30T16:34:37-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1442237977","userName":"Oemory","userUrl":"https://itunes.apple.com/us/reviews/id522500002","version":"3.1.2","score":1,"title":"Bad","text":"Vera bad app! Don't work","updated":"2016-08-31T04:29:38-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1253749141","userName":"قناص حائل","userUrl":"https://itunes.apple.com/us/reviews/id258341675","version":"3.0","score":1,"title":"Very very bad","text":"Very bad","updated":"2015-09-05T21:02:16-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1483055165","userName":"mazaltof","userUrl":"https://itunes.apple.com/us/reviews/id42179119","version":"3.1.4","score":1,"title":"YOUR APP IS USELESS I HATE IT!!!","text":"AS OF TODAY THE APP TAKES 12 SEC TO OPEN AND CONNECT TO CAMERAS. PRESETS DOESN'T WORK. EVERY DAY ALL CAMERA GPS TO DEFAULT POSITION AUTOMATICALLY VERY BAD APPLICATION PLEASE DO SOMETHING TO MAKE IT WORK!!!","updated":"2016-11-12T02:24:29-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"7247831362","userName":"BMW97","userUrl":"https://itunes.apple.com/us/reviews/id249803904","version":"5.6.1","score":5,"title":"Muy buen producto y fácil de uso","text":"Excelente !!!","updated":"2021-04-21T09:42:01-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"7115167290","userName":"怒火中烧的归零","userUrl":"https://itunes.apple.com/us/reviews/id995238856","version":"5.5.8","score":1,"title":"捣腾几个小时，我睡了它也睡了没有录像！","text":"捣腾几个小时，我睡了它也睡了，只有监控没有录像！","updated":"2021-03-17T19:32:12-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"4585528887","userName":"JoBoobb","userUrl":"https://itunes.apple.com/us/reviews/id262889000","version":"5.3.1","score":4,"title":"Preview picture disappeared","text":"After updating to this version (5.3.0) @July 9, 2019, the preview picture of each camera disappeared. Pls do the correction ASAP....\nUpdate today version 5.3.1@August 8, 2019, that problems was solved. We have to reinstall the app to make it works. Thanks","updated":"2019-08-08T02:50:54-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"5414017600","userName":"VRZRÑ","userUrl":"https://itunes.apple.com/us/reviews/id715062986","version":"5.3.8","score":5,"title":"Muy bueno","text":"Lo mejor de lo mejor...","updated":"2020-01-17T00:40:04-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"5234505633","userName":"刘山序","userUrl":"https://itunes.apple.com/us/reviews/id170403454","version":"5.3.5","score":5,"title":"手机密码","text":"忘记密码怎么办？","updated":"2019-12-04T19:13:31-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"6823572481","userName":"the_mass_reviewer","userUrl":"https://itunes.apple.com/us/reviews/id519901867","version":"5.5.5","score":1,"title":"Do not buy the camera or the app, unless you don’t mind the camera not connecting wirelessly","text":"I wasted 60$ on the camera, because I was hoping to play with my dogs. Not only was the camera unable to attach to walls like the post on Amazon said, but the camera was not able to connect wirelessly to the WiFi. The setup was awful, trying to connect it with sound waves. The voice the camera uses is hard to tell what it’s saying. I tried connecting the camera via Ethernet chord (which wouldn’t work because the only one is in my office) and the camera finnaly connected to my phone. The app was slow to connect the the camera, and the inputs were slow. Awful experience, and I hope Amazon will let me return it.","updated":"2021-01-02T13:52:24-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"5407869783","userName":"RB-MB-PB","userUrl":"https://itunes.apple.com/us/reviews/id426547630","version":"5.3.8","score":3,"title":"See if it works on apple device, android it works great","text":"Since i was directed to this app since black label app went down for android it works great on my phone. See how it delivers on an apple device.","updated":"2020-01-15T12:00:18-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3332150162","userName":"kebrahim72","userUrl":"https://itunes.apple.com/us/reviews/id100966999","version":"5.1.8","score":3,"title":"Notifications of motion","text":"Additional to the below review, I am still facing the same problem with motion detector alarm! It some time works and some time not! \ntried to upgrade the cameras from upgrade 48.53.203.115 to upgrade 48.53.203.116 but did not upgraded!! And some functions has been disabled ( alarm and motion notification)","updated":"2018-10-22T14:13:08-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"3771011619","userName":"Macau SAR customers","userUrl":"https://itunes.apple.com/us/reviews/id171161881","version":"5.2.3","score":1,"title":"connect fail","text":"Already can not connect the cam.please fix!","updated":"2019-02-14T20:08:52-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"2405631664","userName":"Th8545","userUrl":"https://itunes.apple.com/us/reviews/id259286353","version":"5.1.0","score":1,"title":"Connection failed after update April.2018","text":"Why did the failure occur? How can your customer fix this?","updated":"2018-04-10T04:57:31-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"2274407295","userName":"Ibl81","userUrl":"https://itunes.apple.com/us/reviews/id114904196","version":"5.0.8","score":1,"title":"upgrade does not work","text":"I have tried upgrading from my iphone where the program is installed and from the website via my iphone and both ways it does not work!!!  forget about “live chat” or customer service.  No one answers! Piece of crap!  If I could I would return them to Amazon where I purchased my two cameras.","updated":"2018-03-05T10:31:33-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1651007663","userName":"Davidf72401","userUrl":"https://itunes.apple.com/us/reviews/id121259294","version":"4.0.5","score":4,"title":"Please fix app SEE UPDATE","text":"Was working fine.  Updated app today 6-19-16 and it crashes every time I try to open it. I'm running iOS 10.3.2. I have rebooted iPhone 6 and still crashes. Will up rating when you fix it.\n\nUPDATE: 24 hours later the company contacted me with instructions on how to fix the problem.  Great customer support.  The app is getting better.  Apparently you have to uninstall the old version and get the new version from iTunes.  Just updating will not work.","updated":"2017-06-20T05:14:43-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1455557769","userName":"allan y lorena","userUrl":"https://itunes.apple.com/us/reviews/id44028944","version":"3.1.2","score":1,"title":"Fcm","text":"Need to update to os10","updated":"2016-09-25T02:39:49-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1428165746","userName":"Jerimam","userUrl":"https://itunes.apple.com/us/reviews/id486691479","version":"3.1.1","score":1,"title":"Access","text":"No me permite acceder a mi cuenta.","updated":"2016-08-06T14:13:36-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1253601389","userName":"Jdaklis","userUrl":"https://itunes.apple.com/us/reviews/id218602831","version":"3.0","score":1,"title":"App dañada","text":"La actualización daño la aplicación.  Favor corregir","updated":"2015-09-05T12:44:20-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1651123120","userName":"UPNGO","userUrl":"https://itunes.apple.com/us/reviews/id42512235","version":"4.0.5","score":1,"title":"CAUTION: App Does not work","text":"Fails With install of new app - occurs  constantly with release of updates. Just stop with updates your app team needs IT specialist that can write code. Constantly disappointed. By the way, did uninstall then install. \n\nWith new update- unable to even log in to se my cameras. This problem is typical with their updates. Once they fix it ( could be a couple of weeks) and if it works fine for you, do not update to any of their newer versions.\n\nUpdate: app doesn't let me log in and password retrieval does not work- also states their server has issues. * the older app on my other devices which I did not update work fine.\n\nNew update: app doesn't work with iOS 10. Developer needs to stay on top of things. This happens too often.\n\nTo the developers, without iOS 10 compatibility all of your products are utterly useless. It should be noted that a quality company that has multiple products that require an app for its functionality should put its resources into app development. This situation of nonfunctional system compatibility should not be tolerated- it says a lot about your company.","updated":"2017-06-20T07:25:48-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1570200056","userName":"castilloi","userUrl":"https://itunes.apple.com/us/reviews/id124450629","version":"4.0.3","score":3,"title":"A good camera for monitoring but...","text":"Please add a feature To download recorded videos from sd card (without remove it) using iOS, android and Windows app.","updated":"2017-03-22T09:02:49-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1458155162","userName":"glc3","userUrl":"https://itunes.apple.com/us/reviews/id100882477","version":"3.1.3","score":2,"title":"Subpar at Best","text":"The wifi setup where it plays tones to camera doesn't work.  No place to enter the code to confirm email address.  Some instructions don't make sense (language barrier?).","updated":"2016-09-29T19:33:30-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1486794742","userName":"Prof et al.","userUrl":"https://itunes.apple.com/us/reviews/id30418457","version":"3.1.5","score":1,"title":"No longer works","text":"The cameras no longer sync up with app and the wifi configuration. Please advise\n\nUpdate 11/10/16 STILL NOT SYNCING. PLEASE FIX.\n\nUPDATE 11/18/2016. THE CAMERAS WILL NOT SYNC OVER WIFI. I WILL BE SEEKING A REFUND NOW.","updated":"2016-11-18T09:22:40-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1391797598","userName":"Johnny Arcade","userUrl":"https://itunes.apple.com/us/reviews/id38230302","version":"3.0.9","score":1,"title":"Terrible software for bad hardware.","text":"I bought an IP Camera from Amazon and this is the companion app. Both are awful. This app lacks basic functionality, is very, very poorly translated from Chinese, crashes from specific button presses *and* crashes randomly. The wifi setup process simply didn't work as the app or the camera seemed about 10 seconds out of sync with each other. This happens often enough to time out processes that require device check in. I could go on. Don't buy a camera from this manufacturer and don't use this software.","updated":"2016-06-09T18:28:34-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"},{"id":"1114911208","userName":"Apollo123","userUrl":"https://itunes.apple.com/us/reviews/id17265283","version":"2.7.2","score":1,"title":"Reall awful software","text":"Bought the camera and software.  Full of mis-translations, broken code, and crashes.  Returned the camera after I realized how bad the software was.","updated":"2014-12-17T12:58:16-07:00","url":"https://itunes.apple.com/us/review?id=642266858&type=Purple%20Software"}]