[{"id":"7949096747","userName":"Shoogini","userUrl":"https://itunes.apple.com/us/reviews/id33545549","version":"5.7.1","score":5,"title":"Great app, great info, very reliable","text":"I have used Polar Flow with my Vantage M for the last two and a half years.  I really enjoy seeing the heart rate graphs for each workout and how they compare to previous workouts.  Polar Flow also shows you a graph of how much “strain” you can take based off your last seven days and your average strain over the last month.  With Polar Flow I can easily see if I have been consistent or falling off in intensity and duration.  It’s detailed enough that I can nerd out, or just feel guilty for too many “recovery” days.  I do a wide variety of workouts as well but the Polar program really shines when it comes to running.  Great in app maps, pace counts, and detailed analysis on the supporting website.  Very accurate prediction for future running performance. The Vantage M paired with Polar Flow has been a worthy investment that I have enjoyed for several years.","updated":"2021-10-24T07:06:37-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7922844111","userName":"devuker","userUrl":"https://itunes.apple.com/us/reviews/id611689574","version":"5.7.1","score":4,"title":"Death by comparison","text":"I enjoy flexibility. I enjoy compatibility. \nMy vantage m and the polar app have some great features. I like seeing my progress and the ability to gauge overreaching mixed with poor sleep. I enjoy the sport profiles and being able to set heart rate monitored activities and non heart rate activities. But over the last two years I have a small wish list. 1) I have to restart the polar app every time i want to sync with my watch. 2)There is no find your phone option.  3) Cant charge the watch in the middle of an activity. This is nice for long days bike-packing. Garmin allows overnight charging without stopping the activity. This way the entire route is one post.  4) I am in the medical field and frequently need to count respirations or heart rate using a second hand. The second hand on my polar only displays for about six seconds when i raise my wrist so its not helpful. 5) Zwift: Polar does not link with zwift so I cant see my heart rate data from my watch on the zwift platform. This is a dilemma when I want to track strain and progress with polar. I have to start my watch as well as wear a heart rate strap compatible with zwift. I then have to delete the strava activity (i use both fitness platforms to track progress) Compatibility with other apps and platforms would be great!\nI have really enjoyed the watch however couple things that I would like to improve. Thanks Polar!","updated":"2021-10-16T18:35:41-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4461693816","userName":"ahdkkdiqgauie","userUrl":"https://itunes.apple.com/us/reviews/id415160005","version":"4.2.1","score":4,"title":"Slow Heart Rate display and inaccurate sleep tracking.","text":"I like most things about the App and my Polar Vantage M. However there are two areas needing significant improvement. These are:\n- The delay in displaying heart rate. Because of this delay it is easy to overshoot my maximum heart rate while exercising. I have verified this delay by comparing the M’s reading to that of various pieces of exercise equipment. However, when hiking, or doing other activities, without another piece of equipment to track the actual heart rate it is easy to overrun, or underachieve. \n- Like many people over the age of 60, I have to get up during the night to relieve myself. Unfortunately the Polar Vantage M and or the Polar app think that I rwmain awake from that point forward, even though I do go back to sleep. Again, I see a very substantial difference between what Polar believes is my sleep time and that shown by my CPAP machine...\nPS: Every NickName I tried to use to submit this review was reported as taken, including “AllNickNamesTaken”, so I am about to resort to a random collection of characters to see if that will work.........!!!!!!!!","updated":"2019-07-14T12:54:28-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7587773124","userName":"JackPansegrau","userUrl":"https://itunes.apple.com/us/reviews/id86353010","version":"5.4.1","score":5,"title":"Polar Is the Best - 30+ Years w/ Polar","text":"I had a pair of Polar AXN700 for over a decade and had one I finally had to strap together with duct tape. I finally purchased a Vantage V and absolutely love it. Everything about the hardware and software is outstanding. \n\nI considered an Apple but Polar holds a charge so much longer it just works better for my needs. The Pilar Flow program is great. If I had a “magic wand” I would like to see a couple fields added where I can add information - such as the name of my trail route, etc. But this is a small detail. The other thing I’d really like is an automatic link to my Dark Sky weather app so it would be visible on my watch as well as embedded in my data. \n\nSo I love my Polar and recommend it highly.","updated":"2021-07-17T11:32:20-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3514209488","userName":"Honestly 101","userUrl":"https://itunes.apple.com/us/reviews/id231157193","version":"4.0.0","score":2,"title":"Syncing is a mission","text":"Im a fairly new user - only got my device a month. Although I like the look and feel, syncing is not a simple task. I’ll sink and expect it to be working only to find that it hasn’t or hasn’t uploaded a full days results. I’ve resorted to taking the device off and placing it on my cellular screen to sync as alternatively suggested and although that appears to work better, at times it throws the time off. Last Friday was such an example and got me into some trouble for thinking I had to leave a meeting already only to find out I had the wrong time. Embarrassing and frustrating! I had a much cheaper device and experienced none of these challenges in the past. If this experience continues, I’ll have no choice but to revert back to the old device. Pity is I bought an extra four devices to give as Christmas gifts and at the moment, I’m regretting have done so as I expect they’re going to be frustrated too.","updated":"2018-12-09T20:48:06-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2133994112","userName":"E618Triathlete","userUrl":"https://itunes.apple.com/us/reviews/id32547655","version":"3.6.6","score":2,"title":"Questionable Data, Uncalibrateable","text":"I bought the 430 for the wrist based heartrate monitoring and im extremely satisfied with that. \n\nWith that said when i run on the treadmill the data collected is extremely questionable. It has never given me an accurate distance. Today’s run it captured 3.5miles of 5. Unfortunately the flow app doesn’t allow me to calibrate for my stride/Light footstrike and correct the inaccurate distance. This means you’re left with a completely worthless run data history. Worse is the questions it raises about the other data captured. If it missed 1.5miles making it completely off on your pace, how accurate is the cadence data. Also best of luck if you forget to stop your workout because there is no way to correct the inaccurate data. I find myself depending on a lot of other apps just like when i had my polar FT1. The polar flow app needs a lot of enhancements and leaves much to be desired from this runner.","updated":"2018-01-27T13:22:27-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7222292415","userName":"can'tcarryatune","userUrl":"https://itunes.apple.com/us/reviews/id159290293","version":"5.1.0","score":5,"title":"Best Exercise and Training Partner!!","text":"I can’t rave enough about my Polar Grit Training Watch.  It is amazingly rugged & durable.  It has all the functions I need except for logging interval runs, but that is a minor  take-away from an outstanding watch.  The only problem I have with it is that I run with a focus on my heart rate and zones.  I am also slightly color blind so when it move from the 4th into the 5th zone I have trouble reading the heart rate number.  Wish there was a way to change the color scheme to suit my vision issues...Don’t get me wrong, if mine should ever fail/break, which seems highly unlikely considering the beating I have already given it, I will definitely get another one!!","updated":"2021-04-14T12:00:12-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3679733139","userName":"MKKreuger","userUrl":"https://itunes.apple.com/us/reviews/id142008498","version":"4.0.2","score":5,"title":"Very solid app","text":"Firstly, i have the Polar m400 which is an awesome watch. I'm impressed with this app too. I prefer this to the desktop, which isn't as flawless when syncing (download a new version and lose my data? Nope) and so far this works fine mechanically. Feed Interface is a little cluttered and seems harder than it should be to navigate back through the calendar and see timings. Pretty good graphs, trying to see if there's a way to compare timings but that is my only nitpick. Might have to import into Excel. As mentioned, the watch itself, an m400, is Rock solid after busting a few Garmins that are irreparable. Very simple easy to use menu. It just works.","updated":"2019-01-21T18:36:05-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3179566979","userName":"Me1199","userUrl":"https://itunes.apple.com/us/reviews/id116414763","version":"3.7.7","score":4,"title":"Couple of issues, otherwise great","text":"1. When I wear the V800 watch to sleep, it doesn’t always track my sleep correctly. For example, I fell asleep on the couch pretty early then woke up and got in bed late. It only counted the time after I went to bed as sleep. \n2. Elevation isn’t shown on the workout in the app, I have to go to the full website to see it.\n3. The HR monitor strap isn’t the best - it misses measurements; I actually need to test it with the phone as well as the watch to try and isolate the issue. \n\nI’ve mostly worn the watch as a daily tracker and used it with HR monitor for running, bike rides, hiking, etc. and overall, it’s pretty good, no major issues. My first V800 melted when I tried to recharge it and they replaced it. The second one seems to be holding up really well.","updated":"2018-09-11T17:48:50-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4206255263","userName":"These nicknames are bad too","userUrl":"https://itunes.apple.com/us/reviews/id125607629","version":"4.1.3","score":5,"title":"Sleep tracker inadequate","text":"Since this last update (which by the way doesn’t mention having fixed anything on sleep tracker) sleep track is down to random performance. Contacting support is an exercise in frustration in that that regurgitate to me the same things on the support page that got me to them and then tell me how I need to sleep in order for their application to work. People serving software? I thought it was supposed to be the other way around. I like the other features (other than synch, which is ridiculously slow) but my frustration with sleep tracker leaves me open to other, better solutions (i.e. non-polar).","updated":"2019-05-25T03:03:38-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3597208368","userName":"hed2084","userUrl":"https://itunes.apple.com/us/reviews/id802902010","version":"4.0.1","score":5,"title":"More loyal to polar with each device they release","text":"I see nothing that would make me want to change to some other brand of devices. They clearly follow their own vision and reach to accomplish achievements that are beyond simply filling a marketing opportunity. Polar continues to set a standard that many people are not even able to recognize... my advice is. Take a good look and really think about what they are doing. A simple example: think for a second why Polar is the only device with a 40 hour workout time at the quality level they provide. They are ahead of the trend because they are the source of it","updated":"2018-12-31T15:20:58-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6598196750","userName":"GRhaines","userUrl":"https://itunes.apple.com/us/reviews/id29534841","version":"4.8.0","score":5,"title":"Excellent Exercise Log","text":"I’ve been using Polar Heart Rate Monitors for over 10 years as I had rate induced A-fib and really needed to keep a check on my heart rate.  I have used Polar Flo and their software before to download my activity and analyze various things.  Can’t tell you how easy this app is to use and seamless it is to download from my monitor.  With GPS I am able to tack all of my routes, compare rides from previous ones, etc.   Use mainly for cycling but when I ran, also used to track my running, cadence, etc. Great product and great software.","updated":"2020-11-01T09:58:30-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5283542282","userName":"RaviRamineni","userUrl":"https://itunes.apple.com/us/reviews/id247070756","version":"4.3.3","score":3,"title":"Needs better support for interval training","text":"I like the vantage V for HR and power but very disappointed that it does support interval training very well.\nThe Phased Target is a good construct but usually each phase is a lap but Flow doesn’t seem to tag them that way. When I import data into Strava or even the flow app, still don’t know straight away my average speed in each of the phases (FYI the automatic lap is turned off )\n\nThe corresponding issue on the watch is that there is no way to know what avg speed I’m going at in each phase cos the phases aren’t treated as laps. \n\nFor example I need to be able to create the phased target (see below), start the run, should never need to touch the watch until the work out ends and be able to see avg pace + avg HR in each phase and this contextual information needs to be tagged and saved so I can import and see it.\n\nExample : \n10m warmup\n4 X 1k @ 3:40 with 60 sec rest\n5 min easy jog\n4 x 1k @ 3:40 with 60 sec rest\n10 min cool down\n\nI recently switched from Garmin and super disappointed I can’t do this over in polar. I hope this gets addressed soon.\n\nThanks\nRavi","updated":"2019-12-17T06:26:07-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4377286434","userName":"Credig","userUrl":"https://itunes.apple.com/us/reviews/id162151974","version":"4.2.0","score":4,"title":"Almost Perfect","text":"This app is very good. For my polar vantage v, it provides easy syncing and update transfer, while for workout analysis it provides a wide range of helpful analyses. I only wish this app had two additional features that seem to be awkwardly missing considering everything related to them has been included. First, for running workout analysis I wish the app would have similar splits functionality to what they provide on the flow website, allowing users to auto split workouts into .5, 1, and 2 mile splits. Second, I wish that, for the apple health syncing, flow provided distance data like it provides workout and other health data.","updated":"2019-06-27T07:56:45-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7587030741","userName":"Thomas, New York","userUrl":"https://itunes.apple.com/us/reviews/id202455403","version":"5.4.1","score":4,"title":"I like the idea of heart monitoring, but it appears to be a well kept secret.","text":"So far, I believe I am tracking everything…\nBeen wearing it for two weeks now.\n\nStill don’t know where to find statistical data.\nThis should be easier to get, without using a fourth party, since I have me, my polar watch, iPhone app.\nIf I wanted to export the data, so I can see it on another device…\nThat, to me, should be here too.\n\nIf it’s there… and I just don’t see it, then that’s why I am willing to concede a d give a fourth star…\n\nYou know, because it could be that I’m just an idiot who could afford a watch to monitor my heart, but only minute by minute.\n(Grin)\n\nMy goal was to\nMonitor my heart during all my activities, and look at the data later.\n\nI’m hoping my synching will pay off soon.\n\nLove the physical characteristics of the phone.\nLove the swipe functionality of the screen face.\nI’m sure I will love the data it’s collecting.\nHappy to receive a call from polar on howI can get the data.","updated":"2021-07-17T07:17:06-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7225206764","userName":"Yvette007!","userUrl":"https://itunes.apple.com/us/reviews/id36905398","version":"5.1.0","score":5,"title":"Accuracy","text":"Polar flow is the premier fitness device.  It’s been around since the 1980’s.  I’ve tried other devices, but none of them compare in accuracy, some devices I’ve researched don’t even show margin of error.  Polar has been, and still is, used in research and in hospitals.  I’m sticking with Polar because of accuracy and the best function.  Makes sense, because they’ve been around long before fitness devices were trendy and after decades of experience with this technology they still have the BEST products for these markets ❤️","updated":"2021-04-15T07:52:28-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7330315607","userName":"JmarioCV","userUrl":"https://itunes.apple.com/us/reviews/id147348798","version":"5.2.1","score":1,"title":"Forced to upgrade","text":"The customer who paid for their device should determine if/when to upgrade. I was greeted with a \"...your version is outdated...please upgrade...\" message. In fact there is no please about it. The app suddenly will not work with Polar Balance (scale) since the update message is sitting on top of the scale button. Why don't I want to upgrade? Because everytime I've upgraded in the past Polar has lost or deleted several months of weight data. Unlike the Polar Beat app which has never lost any old data the Polar Flow app seems to periodically lose old data.\nMay 12,2021 update:  Now this poor excuse for a program has decided to switch my weight to kg - it ignores my setting it to imperial (pounds) and reverts to metric (kilograms) after I set it to imperial!","updated":"2021-05-12T09:57:42-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7211647017","userName":"somebodyinparticular","userUrl":"https://itunes.apple.com/us/reviews/id248472002","version":"5.1.0","score":5,"title":"Great with Polar Unite","text":"My goal is optimum fitness & health. My Polar Unite and this app tell me what works and what doesn’t. I’ve learned that alcohol — even 2 drinks — always has a negative effect on my sleep metrics, specifically relating to my heart. Eye-opening. On the other hand, whenever I do even the mildest exercise — a daily brisk walk and/or yoga, my sleep improves and my resting heart rate goes down. Sure, these findings may be “from the journal of ‘duh’,” but there’s something about seeing the impact firsthand that motivates me to make better health choices. Recommended.","updated":"2021-04-11T14:08:39-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4998739146","userName":"NickBel0326","userUrl":"https://itunes.apple.com/us/reviews/id502983415","version":"4.2.8","score":4,"title":"Gets the job done","text":"Polar flow gets the job done. It provides a good break down of what I did. Though I never seem to have the same distance and elevation between my device and how Strava analyzes the information I don’t know if it’s accuracy is off, but when using downloaded maps it shows turns within feet of where they are. The particular product I use V650 seems to be lacking in some modern features. I do not know if this is limited to this product or others. But for the price compared to a Garmin, it is completely worth. Any additional features would cost hundreds more with a Garmin.","updated":"2019-10-22T14:10:39-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6458014977","userName":"diadesol1","userUrl":"https://itunes.apple.com/us/reviews/id102427330","version":"4.5.0","score":5,"title":"Great system and professionally focused.","text":"Great features, accuracy, many ways for workout and training analysis. At times,  devices don’t sync when opening the app and you have to close the app and restart  Flow to sync with Grit X or Ignite watches. The Beat app is good too and I wish I could sync my prepared training into Polar Beat app. Prepared training only shows on Flow app and it could allow such feature to be used on Polar Beat app too. Overall great features, great company, and keep adding more and making improving.","updated":"2020-09-22T17:19:00-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1932610082","userName":"Kerby Skurat","userUrl":"https://itunes.apple.com/us/reviews/id149486288","version":"3.6.4","score":5,"title":"You track your business but not your body?","text":"I’m a business guy and I love the tracking that we do to ensure that our business is running as smoothly as it should be. I had never really compared my body to my business, but in reality my body needs to be tracked just like my business does. The profit is in the numbers. And in this case weight loss is by way of tracking your food and your numbers. If you couple this app with my fitness pal for food tracking, it’s nearly impossible not to go in the direction that you want to.","updated":"2017-11-19T06:23:44-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7232312228","userName":"jgoh07","userUrl":"https://itunes.apple.com/us/reviews/id10835956","version":"5.1.0","score":5,"title":"Great app - fast and reliable!","text":"Love the Polar Flow app! It syncs quickly with my Polar Vantage M2 and the UI is pretty fast. I’ve never had any issues updating my sleep data or workouts. What I appreciate is the highly-detailed info of my sleep, letting me know my REM cycles, interruptions, deep sleep, etc... It also gauges my workouts to let me know how I’m doing during the week. It’ll alert me if I’m maintaining or overreaching in my training. Data is abundant, layout is clear and user-friendly, and the app is reliable. I’m pretty pleased!","updated":"2021-04-17T06:11:42-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7185416002","userName":"RChurch1","userUrl":"https://itunes.apple.com/us/reviews/id15596726","version":"5.1.0","score":5,"title":"Updates: AFTER 4.9 NOT APPLICABLE FOR IOS","text":"I have an iPhone 6, which cannot use iOS version 13 and above. The polar flow app versions beyond, I think it’s 4.9, require iOS version 13. Yet, I still get banner alerts within the Polar Flow app saying “your app is outdated, please upload the newest version.“\n\n Polar either needs to make the newer apps work with pre-iOS 13 versions, or stop the banner alerts to update to a version that you cannot download!\n\n Aside from this, the app is great, in particular the sleep plus.","updated":"2021-04-04T23:19:21-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7866715900","userName":"Yeti_575","userUrl":"https://itunes.apple.com/us/reviews/id41800441","version":"5.7.0","score":5,"title":"Best fitness app and support system","text":"Been a Polar Grit X user for nearly a year. This app is great for all workouts and setting up a training calendar with training targets. All customizable.\nApple Watch series 3. Had that watch for three years and I don’t miss it. Don’t miss the Apple workouts or any of that.\nApple Watch wasn’t rugged enough. Polar Grit X, Polar Flow and the polar tools both online and on my Mac computer are great. Everything syncs and stays updated.\nLook forward to a long relationship with Polar and polar fitness for life.","updated":"2021-10-01T13:49:20-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6279488964","userName":"Hrrascal1","userUrl":"https://itunes.apple.com/us/reviews/id40978515","version":"4.4.8","score":5,"title":"Still not syncing to mobile devices","text":"The whole system was great until about the end of June.  Since then I have been unable to sync the A370 to either my iPhone 8 or my iPad.  It still will since with my PC and I’m living with tha.  I have rest the A370 2 times (or has it been 3) and downloaded the new apps but still can only sync to the PC.  And I can’t find the alarm setting on the PC.  Maybe my next is a Apple Waztch if I can’t get this to work.","updated":"2020-08-04T08:58:27-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1840560125","userName":"Freckle fart 90","userUrl":"https://itunes.apple.com/us/reviews/id33930099","version":"3.6.2","score":1,"title":"Keeps crashing my phone","text":"So this is probably my first negative review ever. It has to do with my experience dealing with this app. I’ve been using it for over a year and it has been absolutely solid. Recently there was an update and the app won’t stay open longer than 8 seconds. At first I thought it was my phone but everything works perfectly. Brand new iPhone, latest IOS, latest version of flow app etc. This app continues to crash. It seems to pick several times of day where it won’t crash and those time are random. \n\nCustomer service is useless, doesn’t listen and suggest things I already reiterated to them that I tried. I’m just frustrated. It WAS the most used app on my Phone second to iMessage. Now it’s useless. Thanks Polar","updated":"2017-10-10T19:20:09-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1956207821","userName":"SassyOnefromAR","userUrl":"https://itunes.apple.com/us/reviews/id151654483","version":"3.6.5","score":4,"title":"A370 crashes","text":"I’ve always loved Polar and the A370 is no exception. The only problem I’m having with it is it will lose connection and shut down after about an hour and a half of exercise. Sometimes I️ do two workouts back to back (such as weights then Zumba) and it will lose my data and reboot. I’ve tried stopping and starting the second exercise but it still shuts down and I️ lose my second workout.  I️ really love the ease, reliability and heart monitoring along with the enhanced sleep tracking. Just wish it wouldn’t reboot in the middle of my workout.","updated":"2017-11-28T17:14:21-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6408706062","userName":"jenx926","userUrl":"https://itunes.apple.com/us/reviews/id342203098","version":"4.5.0","score":3,"title":"Limited info","text":"I wish that this app had as much information available as the Garmin smart watches/HRM’s. So much more data and options to be able to view and track, I am a long time Polar HRM user and have been happy with the accuracy and precision, I had a Garmin Vicioactive 3 for about a week before it got returned and bought a Polar Ignite. The Garmin app was better in my opinion but I like the Polar watch best especially since Garmin uses RMR/Harris-Benedict to estimate caloric burn and not base it off HR. Polar is by far the standard, just wish the app had more options for data collection and storage for training.","updated":"2020-09-08T11:29:28-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5444221075","userName":"Jim Jong the 3rd","userUrl":"https://itunes.apple.com/us/reviews/id214904119","version":"4.3.4","score":5,"title":"Polar m430","text":"Awesome watch if you want to take your workouts more serious and start tracking accurately. Works great for swimming, running, weight lifting. I’ve had mine for about 9 months and I love it, better than an Apple Watch because I don’t have to worry about cracking the screen if it drops. Also battery life for me usually last anywhere from 3-5 days depending how active I am. Also takes about 30 mins to charge for a full battery.","updated":"2020-01-24T13:43:02-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3295624741","userName":"harr21","userUrl":"https://itunes.apple.com/us/reviews/id276448570","version":"3.8.0","score":3,"title":"Love the watch, but a few glitches","text":"I have trouble syncing my watch with the app about a couple times a week.  I’ve looked at the troubleshooting page and tried the few different ways to get it to work, but unfortunately it doesn’t.  It eventually catches up a few days later when it “decides” to sync.  Also noticed a few times the heart rate monitor is turned on and mid activity, it starts to beep non stop and quits working.  I have to stop my activity and re-set the heart rate on my watch, and again a bit annoying.  Over all,  it a bad watch but the glitches need to be fixed.","updated":"2018-10-12T22:38:09-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6583034610","userName":"StephanATL","userUrl":"https://itunes.apple.com/us/reviews/id808337827","version":"4.8.0","score":1,"title":"Very disappointed","text":"GPS takes for ever to initialize, even in completely unobstructed areas. Generally between 5 to 15 minutes, making this watch totally useless especially during a competitive run.  My kids have $2 toys that work better. Also watch will seldom automatically synch to app. Customer service always tells me to plug the watch to a PC and use their desktop version. Really?! Never admitted there might be a problem or offer a replacement which means it is working as intended, i.e poorly. I know the M200 is an entry level for Polar but limited functions shouldn’t mean limited quality. Why should I trust Polar with their more advance and pricey products? I won’t.","updated":"2020-10-28T06:47:14-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2573811133","userName":"Tan ONati","userUrl":"https://itunes.apple.com/us/reviews/id155385219","version":"3.7.2","score":5,"title":"Great hub for multiple Polar devices","text":"I have the M400 GPS sports watch and the M450 bike computer, along with a couple accessories, and I love the app as a hub to track my activity in a multiple-device Environment. It might not be for you if you are looking to mix and match brands, but if you buy consistently this app will take care of you. I love that you can customize your sport profiles to show you the live stats you want to see using the app. This will keep me in the Polar for the foreseeable future.","updated":"2018-05-20T11:12:21-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7887888995","userName":"neiron21","userUrl":"https://itunes.apple.com/us/reviews/id339598597","version":"5.7.1","score":3,"title":"I think it needs several improvements.","text":"It works well with the clock in terms of synchronizing and pulling data from my clock. I also really like the GPS feature when I cycle.\n\nHaving said that, the design feels like a spreadsheet. It give me the information I want without allowing me to expand and understand better. Also, I cannot zoom in my heart rate data to see the values in better detail. The same is true with my sleep data. Finally, I do not have access to my historic heart rate data apart from the work out sessions.\n\nThank you!","updated":"2021-10-07T05:40:53-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2123357797","userName":"fireball7733","userUrl":"https://itunes.apple.com/us/reviews/id478157739","version":"3.6.7","score":5,"title":"Best polar watch ever","text":"Seems really fast how fast it sinks it tells you the day and what time and you could set a timer for how long you don’t want to disturb you I like does your heart rate and you could Choose a sport for it and And it sets a Timer and how it showed your heart rate and tells how much steps how much calories you burn for a sport and you could and that you could play it again and you could do many different things with the polar watch I just very love the polar watch","updated":"2018-01-24T16:57:49-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7040673240","userName":"Cantwriteanickname","userUrl":"https://itunes.apple.com/us/reviews/id657717351","version":"5.0.0","score":2,"title":"Refuses to syn","text":"I wanted the most accurate heart rate monitor on the market, not sure this is it. I have had this app (Polar Flow), Polar Beat, Polar M600 watch, and Polar H10 chest strap for five months now. When they syn and record data it is great! However, now they rarely sync at all!!\nFor two weeks no problems,  now going into 3rd week of NO SYNCING and NO CONNECTION!! Watch does not sync to chest strap, watch does not sync to Polar Flow and chest strap does not sync to Polar Beat! \nMy Fitbit  syncs and connects automatically, never a problem. \nThese Polar devices I try every day for 30 minutes to attempt connection. Very  very frustrating.\nPolar email support is non existent.","updated":"2021-02-26T04:36:24-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5746496972","userName":"MWilsone","userUrl":"https://itunes.apple.com/us/reviews/id144892100","version":"4.4.0","score":5,"title":"Getting better and better","text":"I was pretty skeptical about keeping track of so much at first. I’ve grown used to what I find helpful and learned to ignore what might be “too much information” for my sometimes obsessive mind frame. I love the programming capabilities, but wish it were easier to form your own (like when I’m not training for the next marathon). I still haven’t quite figured that out yet.","updated":"2020-04-01T08:21:01-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6768630012","userName":"andiwm","userUrl":"https://itunes.apple.com/us/reviews/id24380008","version":"4.10.0","score":1,"title":"New Version is Bad","text":"Very convoluted confusing app. Takes a lot of searching to find your workouts. This is not for people who do actual sports activities and want to track them. This is for daily activity monitoring and making you feel good that you moved. The real training sessions are buried in a mess of useless information. If you sit on the couch all day and need an app to tell you that you should move more and if you wear the watch 24/7 then this might be for you. If you do real sport (running, hiking, biking or whatever) and wear the watch only during exercise then this is a useless mess. I wish there were separate apps for sport and for lifestyle.","updated":"2020-12-18T18:02:50-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2054880242","userName":"MikeCoolCat2","userUrl":"https://itunes.apple.com/us/reviews/id535197470","version":"3.6.6","score":3,"title":"Michael hassenmiller","text":"Well I like it but I had to buy the V800 because the back where the plug goes in came off and I can’t put it back on broken so I just use it for walkin it’s disappointing because I have like $800 or more in watches I almost bought an I watch from Apple because of your service what saved you was I like the documentation by the day by the week by the month I just hope the V800 last longer than 3 months like my polar A360 if you send me a new cover for the back where the charging cord goes it would go a long way towards what I think of polar many thanks michael","updated":"2018-01-03T19:29:56-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2852243321","userName":"dowd.88","userUrl":"https://itunes.apple.com/us/reviews/id85592340","version":"3.7.5","score":4,"title":"Pretty pleased","text":"I appreciate a lot about this app. It shows me all the metrics for biking and running I want. Although the connectivity is pretty sketchy with my iPhone. Sometimes takes 3-4 tries and even restarts to get everything to connect. I’ve even had to un-install the app on my phone twice to make it work. \nMi would also like the app to include the same things the website does, especially the recovery calendar, I find that function very handy. \n\nOtherwise, good app, better than most others out there","updated":"2018-07-06T14:45:52-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4792837150","userName":"(VIC_66)","userUrl":"https://itunes.apple.com/us/reviews/id163622917","version":"4.2.5","score":5,"title":"Love my Polar M430, H10 sensor, and App!!","text":"Nothing fancy about the M430, HR sensor, or the app, but I can't live without these simple tools! They are accurate and provide the necessary exercise feedback I need. I exercise 5-6 days per week, and the durability is exceptional. I wear my M430 daily and has replaced my regular watch. I have had it for 2 years. I had other Polar activity trackers, and in my opinion, Polar beats all others just in simplicity and name alone. I trust the brand and reliability Polar is well known for.","updated":"2019-09-16T14:15:11-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4657438203","userName":"k8anderson1!","userUrl":"https://itunes.apple.com/us/reviews/id40203785","version":"4.2.3","score":5,"title":"I’m addicted!","text":"The A370 isn’t my first Polar HR monitor, but it’s my favorite, and it’s most likely because of the app that goes with it. I love being able to select precise workouts when I exercise and to track my progress. I know I will be a loyal customer for life. I recently had to undergo surgery to remove a benign tumor and was told I had the vitals of a teenager. I’m 51yo and have exercised consistently for the past 30 years. I love challenging myself. Being fit is a choice!","updated":"2019-08-22T19:02:42-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6240298112","userName":"AKShamu","userUrl":"https://itunes.apple.com/us/reviews/id140320641","version":"4.4.8","score":1,"title":"Issues with Balance.","text":"I normally love the app, but it’s been giving me issues for a while now. I use a Vantage V and have a Balance scale. The Balance tab of the app resets to January 30th every time I close the app for some reason. When I weigh myself in the morning, it will still show me my current weight and recent trend, but as soon as I close the app, it goes back to January 30th if I open the app again, so I can’t actually check any status or progress later in the day, and things like activity and food goal features are completely lost. Hopefully this can be fixed in a future update and I can give the app five stars again.","updated":"2020-07-25T06:36:07-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3167805302","userName":"__arn__","userUrl":"https://itunes.apple.com/us/reviews/id656754542","version":"3.7.7","score":1,"title":"Does not sync","text":"The Polar Flow App really need a lot of fixing.  I am not able to sync my device (M440) with the phone.  The syncing works from my PC.  When trying to sync either phone the message is “Syncing failed”.  Polar is not giving any further instructions on how to fix this.\n\nI like the Polar hart rate monitors because I think polar is still the leading brand when it comes to analysis of hr data.  However, the same cannot be said about polars software, polar flow.  Polar flow is not able to present the data in a structured way that would be easy to understand.\n\nIn sum: I am buying the polar device because I like the Technoloqy.  I wish they could make better software to support the devices.","updated":"2018-09-08T07:34:16-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3645952426","userName":"Bobby N Corona","userUrl":"https://itunes.apple.com/us/reviews/id284787207","version":"4.0.2","score":5,"title":"Easy to use and accurate","text":"I had reservations about buying this or any other device with pulse rate technology. My wife had nothing but disappointing results with at least three other different brand devices. \n\nThe Polar, unlike the previous three devices that failed to measure on results, was user friendly and accurate. Scrolling through the menu on the watch is self explanatory and before long you become an expert with all the interesting function that the Polar has to offer. \n\nMy only criticism is having to re-sync the Polar to the Polar weight scale device, sold separately, on morning weigh-in. I’m still tweaking with it, not really concern about it for now. \n\nOverall, I’m pleased I purchased the Polar and would recommend it to my friends.","updated":"2019-01-13T08:04:32-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7029061256","userName":"dd011723","userUrl":"https://itunes.apple.com/us/reviews/id406943262","version":"5.0.0","score":3,"title":"I Love The Watch, The APP is so/so","text":"After wearing Polar watches about 7 years, I can say the Watches function very well. I’ve have had a lot of connectivity issues with the app. Sometimes my watches won’t connect, the ability for the app to connect and information to flow between non Polar products is cumbersome at best, and non existent for some products. I have not been able to find guidance in user manuals or online help. We’ll continue to see how things go, but other brands are growing expediently in these areas.","updated":"2021-02-23T05:34:44-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7326492908","userName":"clewis1!","userUrl":"https://itunes.apple.com/us/reviews/id620653500","version":"5.2.1","score":5,"title":"Limited.","text":"It’s a great app except...\nMy current app is outdated but my phone doesn’t have iOS 13 so it keeps asking me to update to something I can’t get. It also doesn’t track all the sleep functions of my new polar watch. (Maybe that’s it the unavailable update) either way, the app should be updated to work without the constant update notifications.","updated":"2021-05-11T11:40:23-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3193941258","userName":"Mr.Wideman","userUrl":"https://itunes.apple.com/us/reviews/id160446293","version":"3.7.7","score":2,"title":"Just Okay","text":"Polar A360 was highly recommended to me by my spin instructor.  I don’t see what she sees and I’m really envious of my friends with fitbits. Polar doesn’t sync with any of the fitness or meal plan apps I use and that was disappointing but not a big deal.  What really bothers me is my device doesn’t sync automatically for some reason so every night I have to remember to do it so I can view my results in the app.  If it isn’t synced on a regular basis it doesn’t count steps correctly and resets itself which messes up the counts - that’s happened to me several times.  Also I don’t think the app is user friendly at all.","updated":"2018-09-15T18:12:16-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2838027192","userName":"INFtampa","userUrl":"https://itunes.apple.com/us/reviews/id41152138","version":"3.7.5","score":5,"title":"POLAR IS THE MOST ACCURATE TRAINER!","text":"I‘m buying POLAR HR watches since 1994. Before buying my newest one, the V800, I carefully studied reviews in Germany, UK and the US. It‘s true, Polar is the most accurate training computer. As a reserve I tried to buy the watch strap in red or any color - all there is is Chinese junk, I bought but it isn‘t the proper size / product. Better than nothing.  My old POLAR watches still work, itms the strap which is fixed with the watch and isn‘t replaceable. POLAR, do better!","updated":"2018-07-04T15:31:12-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1848202202","userName":"Lic3974","userUrl":"https://itunes.apple.com/us/reviews/id15627785","version":"3.6.2","score":4,"title":"A370","text":"Reason I gave 4 stars is the gps on my a370 can’t locate me at the beginning of my run, after about 5 minuets waiting i decided to run without gps which is annoying because I like to have an actual record of my run, pace etc.\n\nAlso can you add Warm up, HIIT class, jump rope and HIIT runs to the sports profile. Those are the 4 things I would like to see in the sports profile. I believe those are common exercises and i would choose them.\nThank you","updated":"2017-10-14T05:18:51-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6298636101","userName":"Levi Entwhistle","userUrl":"https://itunes.apple.com/us/reviews/id563400601","version":"4.4.8","score":1,"title":"Useless and non-functional","text":"I’ve used the Polar HR10 for about 2 years now.  With the Polar Beats app, it works just fine.\n\nWith Flow app, nothing works.  Well, almost.\n\nThe Flow web PAGE is semi functional.  Every few weeks it seems to do a bulk update.  So it’s always out of date, but usually not more than a month.  The usefulness of the page is questionable.  Especially compared to the Beats web page.  I don’t see anything better or more useful about Flows web page.\n\nThe Flow phone app, it NEVER syncs.  I did get it to do it once, many months ago.  It was painfully hard.  Since then, nothing.  Comically, there are pieces in the app that list pieces of my activities from weeks/months ago.  The app also constantly loses track of who I am, insisting my id and or password are wrong.\n\nI suppose the app has potential, were it to actually function.  But I suspect it’s really about as useless as the cumbersome flow web page is.","updated":"2020-08-09T06:14:14-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4183490317","userName":"AmFam21","userUrl":"https://itunes.apple.com/us/reviews/id87054736","version":"4.1.3","score":5,"title":"Excellent product. Minor edit needed.","text":"To the developer. In the activity page, select month and go to the bottom. There is a chart for weight that shows lbs for unit but the y axis unit is actually shown in kg. \nTo people looking for review of this app. It is a 5 star app. I hardly have issues with syncing and allow you to see your exercise results better than just looking them on the phone.","updated":"2019-05-20T18:34:25-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5425273117","userName":"Ji197383","userUrl":"https://itunes.apple.com/us/reviews/id491768638","version":"4.3.4","score":1,"title":"Used to be fine .. now Lost my HR graphic data !","text":"This is what I hate about updates .. they fix something and at the same time they break other things that used to work fine ..I’m Using the M430 and Vantage M mostly for running and since the last update, after my workout,I can’t see in the app the time I spend on each HR zone anymore... the color graphic shows nothing .. dead ! I tried everything .. resetting both  watches  .. uninstalling the app .. taking one watch out of the account and using the other  .. etc etc  and nothing works !! \nPolar fix this please !!!","updated":"2020-01-19T17:28:24-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6237647749","userName":"LuisaLagudo","userUrl":"https://itunes.apple.com/us/reviews/id206881046","version":"4.4.8","score":5,"title":"What's happening lately with the app???","text":"From a week from now, the app is not working correctly; it says,” we are loading data from your polar account,” but it never stops loading, and I can't see my account, and I can't sync my watch. I have tried to uninstall and reinstall twice, but the problem remains.","updated":"2020-07-24T14:12:12-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5382564253","userName":"dmbaker","userUrl":"https://itunes.apple.com/us/reviews/id125274825","version":"4.3.4","score":3,"title":"Beware, NO V800 On iPhone 11","text":"I have been a loyal Polar user for many many years, but now have to write a poor review because Polar will not be updating the V800 to communicate with the IPhone 11. This is unacceptable! Why would Polar not continue to support the V800, the long tome top of the line  and most expensive Polar product?  I did not receive any discount offer to trade in my V800 for a comparable product. I guess I must fork over another $600 to keep the same performance I am used to. This is really bad.","updated":"2020-01-09T15:22:40-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2949966221","userName":"766544","userUrl":"https://itunes.apple.com/us/reviews/id178465874","version":"3.7.5","score":1,"title":"Works but difficult to interpret","text":"The app functions just fine but reading the information is not intuitive or practical. I use this app to see how efficient my workouts were, and there’s no way to title the workouts, search for them, or  see what each workout was at a glance. There’s not even a function that analyzes your workout or tracks progress over time.\n\nNo idea what Id use the  “feed” tab for, and the activity tab is only useful for someone who wears the watch 24-7. \n\nI wish it was more intuitive for someone who wanted to see how efficient each workout was in order to improve over time.","updated":"2018-07-22T09:24:19-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3221687670","userName":"TRY163","userUrl":"https://itunes.apple.com/us/reviews/id582539115","version":"3.7.8","score":5,"title":"Unknown what it can do","text":"So I just downloaded the latest app version put out on 9/20. Now, I can’t get the app to open.  I get the home screen with the man running, but then it crashes.  I also can no longer open the flow sync app on my iMac. I have tried restarting my phone, and that will not work.  I don’t want to delete the app because I’m afraid all my data will be deleted too","updated":"2018-09-23T08:02:56-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5197660132","userName":"reddevilaction","userUrl":"https://itunes.apple.com/us/reviews/id639709560","version":"4.3.2","score":5,"title":"Too Long to Upload","text":"I enjoy using the Polar A300 with heart rate monitor BUT it takes way to long to upload the data from my A300 to the Polar app. Sometimes it takes 4-5 minutes or will go 4-5 minutes then give an error message. If this could be worked out it’d be virtually flawless and extremely user friendly.","updated":"2019-11-25T18:19:22-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4186448311","userName":"lindsr2019","userUrl":"https://itunes.apple.com/us/reviews/id238318563","version":"4.1.3","score":5,"title":"Love the watch! ...struggling with the band.","text":"This is a great watch! My second device from Polar and they’ve both been great. My only complaint with this particular watch is that the wrist bands wear out quickly. I’ve owned my watch just a few months and the wrist band has already loosened so much that the watch pops out of the band very easily. I’m afraid I’ll loose the watch because it pops out so easily 😐","updated":"2019-05-21T07:33:58-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3045973283","userName":"Mharken","userUrl":"https://itunes.apple.com/us/reviews/id31387885","version":"3.7.5","score":5,"title":"The Polar is helpful but there are many kinks that need to be addressed","text":"While the Polar is a great tool, many kinks need to be addressed!  I have had to repair the Bluetooth connection daily (for the past two days; previously I did not have to do so as it remained connected).  In the past, one’s weight could be viewed on the app and this feature no longer exists.  I do like the new sleep rating.","updated":"2018-08-10T10:31:57-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"8109333123","userName":"dcutl002","userUrl":"https://itunes.apple.com/us/reviews/id330925123","version":"5.8.0","score":5,"title":"Has all of the info that I need","text":"I really enjoy this app. It is simple to use, has an intuitive layout, and does everything I need. I have improved my 10 mile race time by 5 minutes utilizing heart rate training. I really like the cardio load feature of the app and the ability to program my workouts.","updated":"2021-12-08T13:36:31-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2235121237","userName":"Navitor","userUrl":"https://itunes.apple.com/us/reviews/id27980736","version":"3.6.9","score":4,"title":"So far, so good","text":"I use Polar Flow with my new m430 watch. The app itself seems to work very well and I like the overall functionality. My only complaint so far about the watch/app system is that my sleep is sometimes not detected which is frustrating. Another issue is that for certain types of exercise, it only shows a graph of heart rate compared to the fat burning or fitness zone and not the five heart rate training zones. Overall, a good app.","updated":"2018-02-22T04:38:10-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4697998686","userName":"Eviltwin@53","userUrl":"https://itunes.apple.com/us/reviews/id196707084","version":"4.2.3","score":5,"title":"Polar watch and Polar Flow App","text":"I can not tell you how much I am enjoying my Polar Watch and the Polar Flow App. The watch records actions a heart rate for and exercise or activity you could think of. And the gives you incredible data which is charted over time. It’s very very easy to use and best training tool ever. It would take a whole book about how great this tool is for me.\nI can not say enough.\nRegards,\nJeff","updated":"2019-08-30T14:01:35-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3733334039","userName":"kaley_joe6","userUrl":"https://itunes.apple.com/us/reviews/id969025785","version":"4.0.4","score":5,"title":"Phenomenal!!","text":"Polar has given me the ability to see how active (and inactive) I am during my day! This results in me being proud of myself finding a large mount of productivity at the end of the day or a motivation to push more the next day if I find a low productivity rate at the end of my day. I’d recommend and I do in fact recommend this brand and app to everyone!","updated":"2019-02-04T10:37:27-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"8123213929","userName":"Ramblur","userUrl":"https://itunes.apple.com/us/reviews/id86552055","version":"6.0.0","score":3,"title":"Sync inconsistent","text":"I’ve had the vantage m since it first came out. The syncing has been inconsistent at best. I can have the phone and watch in the same room and connected but have to try syncing several times before it takes. The gps works well enough and I have to clean the sensors or the HR monitor won’t work correctly. Those are the main features that I use. The call/text notifications are limited.","updated":"2021-12-12T10:32:49-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4779608205","userName":"Jan in strrretchy pants","userUrl":"https://itunes.apple.com/us/reviews/id26944714","version":"4.2.5","score":5,"title":"The truth hurts :)","text":"The Polar Flow app definitely doesn’t pull any punches. It shows you exactly what you did or didn’t do? Eeek! The app is intuitive, has a great user interface, has great charts (that appeal to the geeky like me), links to maps with satellite views...and Polar updates it regularly! It’s a great tool to help you achieve your fitness goals. Now...if they could just get rid of that “undertrained” warning...haha","updated":"2019-09-14T15:39:59-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2934555175","userName":"Nevena P","userUrl":"https://itunes.apple.com/us/reviews/id201453279","version":"3.7.5","score":5,"title":"Excellent products from Polar","text":"I have been using Polar products for 10+ years and they’ve been my first choice due to the precision and complexity of the gathered and processed data. The synchronization between the app and the web site is impeccable. I have only one comment, rather a suggestion — the Polar Balance scale should be more sensitive to goals depending the age of the person.","updated":"2018-07-19T06:02:47-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7624147304","userName":"Organizing Jo","userUrl":"https://itunes.apple.com/us/reviews/id246821459","version":"5.4.1","score":5,"title":"The Best!","text":"I looked at many many fitness bands but the reason I picked a polar was strictly because of the app!  I love seeing my day at a glance, look back at weeks/months to see if I am improving. I love that my scale syncs here as well. Everything I need to see is right here. The ability to sync with my fitness pal app is over the top perfection!","updated":"2021-07-27T08:05:15-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5165406788","userName":"Pens944","userUrl":"https://itunes.apple.com/us/reviews/id153521616","version":"4.3.0","score":5,"title":"Exercising More.","text":"In the three and a half months since owning a Polar Vantage M, I have seen an increase in the number of workouts per week. I look forward to hiking, cycling or just a simple walk and the progress that comes with each session. The Polar Vantage M has spurred a resurgence in taking care of my body and my overall health.","updated":"2019-11-18T10:09:13-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3188836956","userName":"Jkutch","userUrl":"https://itunes.apple.com/us/reviews/id586988868","version":"3.7.7","score":5,"title":"Polar HR monitor","text":"I’ve been a Polar customer since 1996.  I believe my latest purchase is very accurate regarding caloric expenditure and reading and recording my heart rate. I am a firm believer that most of us overestimate what we are burning via exercise and underestimate the number of calories we eat, which explains why many people have difficulty losing weight.  This is a great tool for a reality check!","updated":"2018-09-14T08:50:10-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3728512444","userName":"jakarwaski","userUrl":"https://itunes.apple.com/us/reviews/id40350112","version":"4.0.4","score":4,"title":"Could use some modifications","text":"Overall not bad but the design/layout should get some changes. The feed tab should show things in order by date. And the only thing that is kind of inconvenient is having to manually sync your watch to the app. It would be nice if every time you opened the app it synced automatically... or if you could set up times that the watch syncs.","updated":"2019-02-03T05:26:07-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3003880745","userName":"water boy tc","userUrl":"https://itunes.apple.com/us/reviews/id120376937","version":"3.7.5","score":5,"title":"Polar","text":"A300 I purchased a new heart rate monitor for my a300 I read several reviews on the monitor stating that the monitor worked for swimming and because there was a swimming mode on the watch I purchased the new monitor can someone tell what I am doing wrong because the monitor won’t work for swimming the new monitor works fine in all other modes that’s why I gave it only three stars","updated":"2018-08-01T20:54:36-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6760245262","userName":"Nik333","userUrl":"https://itunes.apple.com/us/reviews/id37825601","version":"4.10.0","score":3,"title":"Polar Flow","text":"One of the things I have noticed about the app is it sometimes but not always, allows me to move sessions around. It's nice function to have when you just didn't have time or don't like how the program is set up to move them around. Except it's completely hit or miss when it allows that to work.\nWhy do I have dumb blog notifications?! We should be able to turn this off.","updated":"2020-12-16T10:34:43-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1952525337","userName":"Ydl1106","userUrl":"https://itunes.apple.com/us/reviews/id112339705","version":"3.6.5","score":5,"title":"Will not sync with M400","text":"I am not sure why I have started to have issues completing a back-up via Bluetooth but there could possibly be a glitch. I haven’t had any issues with Bluetooth sync with any other device connecting to my iPhone, it’s only with the M400.  Please see is there are any bugs for iPhone 6 and m400 pairing issues. Thank you","updated":"2017-11-27T04:07:51-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7792386673","userName":"DeaconNate","userUrl":"https://itunes.apple.com/us/reviews/id103497078","version":"5.6.0","score":5,"title":"Great fitness tracker","text":"I was a long time Fitbit user till google bought them. Lowered quality in devices and impending fees for data frustrated me enough to change. \n\nI used Polar heart rate monitors before (great quality) and checked their watches. More comfortable fit, great quality, all the features I needed in well priced device.","updated":"2021-09-10T14:23:39-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2979452767","userName":"Very Old Swimmer","userUrl":"https://itunes.apple.com/us/reviews/id328087293","version":"3.7.5","score":5,"title":"Polar, my usage and experiences","text":"I have been using the polar wrist band for somewhat more than two years. My experiences have been mostly positive, but there have been times when it does not want to communicate with my iPhone. Frequent recharging is a bit of an inconvenience. Generally, I am pleased with the product, and I haven’t found one I like as well.","updated":"2018-07-27T15:11:47-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5231367998","userName":"Helle Reed","userUrl":"https://itunes.apple.com/us/reviews/id417661988","version":"4.3.2","score":3,"title":"Big sigh","text":"Been using this app with big satisfaction for about a month. Now all of a sudden I'm having problems to sync. Tried step by step after your support site to unpair, and pair it up again several if times, and that made me be able to sync the same day I did it.  But next morning it's the same problem for some reason. Really. Shouldn't be necessary to unpair and pair it up each day! 😳","updated":"2019-12-03T23:26:20-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3629440554","userName":"Brandonbabayans","userUrl":"https://itunes.apple.com/us/reviews/id279086275","version":"4.0.2","score":2,"title":"Fine app","text":"The app is fine to use for Vantage V model but still missing a lot of items that can be found in Garmin connect. A certain simplicity is missing, also finding users is not simple, having a graph of elevation on a run not available. But I can see other positive elements. Overall I wish and hope that Polar knows that this app is not the best platform and can be improved. Why not create a platform for users to brainstorm ideas or designs and polar takes best ideas for possible design and implementation.","updated":"2019-01-09T01:32:24-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2989947398","userName":"HPX_OCR","userUrl":"https://itunes.apple.com/us/reviews/id322126290","version":"3.7.5","score":4,"title":"Listen to your body","text":"I love this app!!! Anyone trying to get in shape or serious about fitness should get this it daily!! All the tools you get on this app is awesome!! It helps me to stay active, the active tracker really pushes me on these lazy days. I have been using a M400 for 3 years now and averaging 100%+ on my tracker every month, my Polar is the motivation l needed. One of my 2018 year resolutions was to get to at least 120% every month 💪🤪 \nThank you Polar!!","updated":"2018-07-29T21:37:17-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2667868934","userName":"MoneyBagsx2","userUrl":"https://itunes.apple.com/us/reviews/id223080583","version":"3.7.3","score":5,"title":"Making me want to work harder","text":"I have been working out for a while now but afraid to get one of these devices for fear that I would not look good. Now I cannot help but check my heart rate, my calorie count and more. The flexibility of this device is great, the battery life is very good, and I actually feel healthier using it. No, I actually am healthier using it.","updated":"2018-06-09T13:17:26-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5645327384","userName":"Daddygreens","userUrl":"https://itunes.apple.com/us/reviews/id238659763","version":"4.3.8","score":2,"title":"Started off on fire...","text":"This app and polar H10 monitor started off on fire, then after 6 months it took a crap.  Nothing changed in how it was used or worn, yet the monitor stopped communicating with the app.  I followed EVERY SINGLE STEP, God knows how many times, and it still won’t work like it did the first 6 month.   It’s really frustration for someone like me with a technology background and still can’t get it to work. Way too expense for a piece of equipment that just turns into a chunk of crap.","updated":"2020-03-11T03:41:50-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6383637963","userName":"Pacer5619","userUrl":"https://itunes.apple.com/us/reviews/id615471831","version":"4.4.8","score":5,"title":"Polar Flow Review","text":"I have used Garmin app and fitness watches for about 10 years. \nThe Polar app and vantage M were easy to sync with my IPhone. Easy to read charts and easier to use. Highly recommend the product.\nBoth products worked, the Polar with its easy to use and understand charts are better for me.","updated":"2020-09-01T04:32:58-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2607713774","userName":"TaraMacLaren","userUrl":"https://itunes.apple.com/us/reviews/id475674382","version":"3.7.3","score":1,"title":"Worthless App, Nice Watch","text":"Loved my Polar M400 so much I upgraded to the M430.  That being said, this app is total garbage.  I wish Polar would invest in their app platform to bring it up to par with their competition - Polar Flow is clunky and relatively unintuitive.  My data never syncs automatically from my watch to my phone via Bluetooth, and the success rate is only about 25% when I manually initiate the process.  I use the watch as a stand alone device, but it would be much enhanced if I could actually log this data somewhere without whipping out the cord and plugging into my laptop like some caveman.","updated":"2018-05-28T05:40:32-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7815710312","userName":"Fitsheree","userUrl":"https://itunes.apple.com/us/reviews/id125760169","version":"5.6.0","score":5,"title":"Great Watch for Active Senior","text":"I used Polar products when I taught fitness classes, biked centuries and ran a few marathons. I really enjoy this fitness watch for what I am able to do as an active senior. Track my cardio load and sleep recharge. Try out exercise programs beyond tracking my steps. Keeps me moving! Affordable.","updated":"2021-09-17T07:25:07-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4731859061","userName":"Glaedr the dragon","userUrl":"https://itunes.apple.com/us/reviews/id24141390","version":"4.2.4","score":5,"title":"M400","text":"My M400, while now no longer available, has been faithfully counting my mileage through 8 half marathons and over a thousand training runs. It has stayed more accurate than several other brands that my running buddies use and I love the ability to track dreadmill runs as easily as trail and road runs.","updated":"2019-09-05T12:51:51-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6542824620","userName":"Tunghoy","userUrl":"https://itunes.apple.com/us/reviews/id203306324","version":"4.7.1","score":3,"title":"Great when it works","text":"Terrific stats and charts, I depend on it daily for a lot of activities. It also sends data to other apps like Strava. But two issues:\n1. Although it has a lot of activity profiles to choose from, it doesn’t have everything and you can’t define your own.\n2. Syncing takes a long time and sometimes I have to reboot the phone to make syncing work.","updated":"2020-10-16T17:16:15-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4261452477","userName":"lexie.abigail","userUrl":"https://itunes.apple.com/us/reviews/id103159321","version":"4.1.5","score":5,"title":"Love my Polar products","text":"I have been using a Polar bike computer for longer than I can remember. Probably on our fourth generation at this point. There was a time when syncing was problematic, but those days are long gone. In our family right now are two bike computers, three watches and a Balance scale. They synch seamlessly and we love them!","updated":"2019-06-04T01:05:11-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"8122195978","userName":"NJ250","userUrl":"https://itunes.apple.com/us/reviews/id403060994","version":"6.0.0","score":2,"title":"Not very intuitive","text":"The app is not intuitively laid out and takes a while to sync. For example, once you open the Nightly Recharge, the data should show up right away but it takes hours into the next day before it does. Shouldn’t your sleep automatically transfer to the app? I used a much less robust tracking system which did. Also, you can’t edit the sport profiles to add things that are not included.","updated":"2021-12-12T04:54:51-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3629026228","userName":"JGMIII+","userUrl":"https://itunes.apple.com/us/reviews/id152980755","version":"4.0.2","score":5,"title":"Going strong 3yrs+","text":"I’ve been using this app since I purchased a Polar A300 in December of 2015, updated phones, no issues with app. Only had to re-pair watch with iPhone/app. Great so far. Hope the app continues supporting the A300 and their loyal customers. In addition, my wife has not had any issues with her M400 nor the app. Very pleased with Polar products so far!","updated":"2019-01-08T22:44:10-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4156885858","userName":"staceyt43","userUrl":"https://itunes.apple.com/us/reviews/id155700420","version":"4.1.3","score":5,"title":"Quality","text":"Very easy to use. Data is so interesting and useful. Only thing I would change is the round clock/data wheel. I struggle with when the day ends and when it starts. The 12 am doesnt show your sleep the day before. So if u go to sleep at 9p you don’t see the 3 hours. Just a little confusing.","updated":"2019-05-15T19:43:59-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2969354449","userName":"MarleyKing16","userUrl":"https://itunes.apple.com/us/reviews/id278021058","version":"3.7.5","score":5,"title":"Great product, bad customer service","text":"App has an amazing interface and the watch is the best GPS watch I’ve had. Unfortunately PolarFlow doesn’t let you use the app without agreeing to share all personal data, which is in violation of the EUs data protection policy. I requested information on this and received no response from Polar.","updated":"2018-07-25T18:00:07-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7798427095","userName":"Amontilla2008","userUrl":"https://itunes.apple.com/us/reviews/id273316862","version":"5.6.0","score":5,"title":"Great for Athletes","text":"I use the polar flow app together with my Polar Vantage M watch and Polar Verity Sense heart rate monitor. I do sports at a high level and it has been an incredible asset to measure my performance on the field with their cardio load status, and off the field with their sleep monitoring. Greatly recommend their ecosystem for anything sports related.","updated":"2021-09-12T05:59:02-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6662682403","userName":"SWalker44","userUrl":"https://itunes.apple.com/us/reviews/id49200557","version":"4.9.0","score":5,"title":"By far the best","text":"I am a 20+ year old user of this product this is by far the most user-friendly non-complicated product I have ever used, if you’re looking for a no nonsense easy fix to your ultimate training log this is by far the best you’ll ever find.","updated":"2020-11-19T05:46:59-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3526616096","userName":"JPayne0120","userUrl":"https://itunes.apple.com/us/reviews/id209650568","version":"4.0.1","score":5,"title":"Necessary Equipment","text":"Lifting weights, going for a run, or even just taking a hike, I rely upon my Polar M400 to track my activities. The best part is the web page that allows me to see my workouts organized in one place and laid out in a way that helps me to track my progress but also to keep me motivated to stay disciplined.","updated":"2018-12-13T08:19:05-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6700570061","userName":"dangdigity","userUrl":"https://itunes.apple.com/us/reviews/id573213583","version":"4.9.0","score":5,"title":"Way better than an Apple Watch","text":"I’ve had an Apple Watch and I can say without a doubt this watch (polar unite) and this app gives me so much more information than I could ask for. It has definitely thrusted my training forward by a lot! Thanks polar!","updated":"2020-11-29T15:59:50-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3137138302","userName":"JRxxxPolar","userUrl":"https://itunes.apple.com/us/reviews/id175002357","version":"3.7.6","score":4,"title":"Covers Many Things I Need","text":"I have been using the Polar app for about three years now. It works pretty well and gives me most of the info that I want including interacting with Lose It fir food info. Setup and learning how some things worked was quirky. There is a work around for most issues. Since it comes with my polar device it makes sense to keep using it.","updated":"2018-08-31T06:05:29-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1899129699","userName":"Lynn--no sound","userUrl":"https://itunes.apple.com/us/reviews/id28909985","version":"3.6.3","score":2,"title":"Sync hasn't worked properly since update","text":"For the last year, every three months or so, it stops syncing. In the last two days, the app says it synced, but the screens don't update. I've had to uninstall/reinstall multiple times, and only partial data shows up.   Have to sync with my computer to see the data in the diary. All of my other polar products have lasted forever--the Loop2 started failing in year 2 of ownership. The Flow App is unreliable and worthless--probably why it's free.","updated":"2017-11-05T04:35:40-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3752799996","userName":"Xaviot","userUrl":"https://itunes.apple.com/us/reviews/id107371671","version":"4.0.4","score":1,"title":"No more notifications?","text":"Not only did I lose my sport profiles and data from before November with this last update, I also no longer get smart notifications. I’ve deleted the pairing and redone-which is no longer an easy process as others have mentioned, now a long and buggy process-as well as signed out and deleted the app plus deleted the pairing and started over with a new app install. Nothing seems to be bringing them back. Pretty aggravating that Polar has apparently begun pushing such poorly tested updates.","updated":"2019-02-09T21:17:04-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2263518034","userName":"MN MBA","userUrl":"https://itunes.apple.com/us/reviews/id33808540","version":"3.6.9","score":4,"title":"Need Activity Levels >3","text":"This is the highest level and still too easy to hit. A couple miles walking to and from bus stops, some household work or trips up and down stairs at work and home and then all that’s needed, if anything, is a very light workout like 10 minutes of Kettle Bell and you’re at 100% for the day. Give us another couple levels to shoot for!","updated":"2018-03-02T09:53:42-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7749115466","userName":"Korbs827","userUrl":"https://itunes.apple.com/us/reviews/id1081471480","version":"5.5.0","score":5,"title":"Using Polar for over 20 years!","text":"Solid interface. Very few if any issues connecting via Bluetooth and PC USB. POLAR SUPPORT: Please bring back the ability to modify the Hr file to smooth the occasional BPM anomalies especially when the hr error is prolonged. A must have for serious athletes like myself. -V800 User.","updated":"2021-08-29T13:00:48-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5342844275","userName":"Jimmy Who?","userUrl":"https://itunes.apple.com/us/reviews/id554944090","version":"4.3.3","score":4,"title":"JUST ONE GLITCH","text":"Ok this app is great in everything it does, especially in displaying data collected from my watch. BUT every once in a while, the start-up screen displays a loading bar and says “Downloading the necessary bits and pieces” and the bar doesn’t load. I have to delete the app and redownload every time. PLEASE FIX THIS.","updated":"2019-12-31T06:09:23-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2333645580","userName":"Dredged buggy","userUrl":"https://itunes.apple.com/us/reviews/id278651437","version":"3.7.0","score":5,"title":"Great Product","text":"This app has awesome features and great support for your device. I’ve used many of the sports profiles with my A370 and it’s great to be able to see my activity level and heart rate throughout the whole activity. \n\nSince having mine, both of my brothers have purchased polar products.  I love it!","updated":"2018-03-22T05:55:36-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3697081259","userName":"littlechilean","userUrl":"https://itunes.apple.com/us/reviews/id336183778","version":"4.0.3","score":3,"title":"Step counter not accurate","text":"I have noticed that the step counter is not quite accurate since I purchased the M430. I had another device and then, I could barely meet my daily goal of 10,000 steps a day. With the M430 I am showing over 20,000 steps almost each day. How can there be such a difference? I have not changed much my exercise routine. Does the device need to be calibrated or something?","updated":"2019-01-26T07:20:02-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1809661190","userName":"Bygollymolly12","userUrl":"https://itunes.apple.com/us/reviews/id40761062","version":"3.6.1","score":5,"title":"Pro Athletes prefer Polar!","text":"As a full disclosure I am a professional athlete sponsored by Polar. However, in my unbiased opinion as a garmin user for years the polar 430 watch and flow app are vastly superior to anything garmin offers. It's so much easier to get indepth HR and GPS data, and then the connection time is literally half of what it was with my garmin 235 watch. Love this thing!","updated":"2017-09-25T12:53:59-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1980585981","userName":"KeyofgDH","userUrl":"https://itunes.apple.com/us/reviews/id102758583","version":"3.6.5","score":4,"title":"With polar m400 & H10 strap Better than Apple Watch Series 3","text":"Yes polar could make syncing automatic. But I like the intentionality of separately syncing to my 6-plus and MacBook. Other reviewers have underrated the sleep monitoring but it is competitive with Beddit 3 and my cPap machine. If you run or ride at night I’d get the v800. With the m400 you have to press a button to light the screen, however in daylight or low light the readability is excellent.","updated":"2017-12-08T09:49:04-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2926970471","userName":"66525626","userUrl":"https://itunes.apple.com/us/reviews/id370899295","version":"3.7.5","score":5,"title":"Great company!!!","text":"My polar watch is a bit dated but it still works great with the apps it allows me to say how long my stride is as well as my normal activity level in a day!\n\nThis app and watch help me to stay motivated to reach my fitness goals all in all I highly advise you to get a polar watch or you can always use there app polar beat!","updated":"2018-07-17T21:24:44-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6534422758","userName":"Fitnessequalslife","userUrl":"https://itunes.apple.com/us/reviews/id366034939","version":"4.7.1","score":5,"title":"Best workout app","text":"I’ve been using the Polar watch for over 10 years. I’ve tried others but always come back to Polar. I find that it is the most accurate one when it comes to heart rate, calories and GPS tracking. Love it!","updated":"2020-10-14T07:33:50-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2438759685","userName":"F.E.L.I.X","userUrl":"https://itunes.apple.com/us/reviews/id14104773","version":"3.7.0","score":3,"title":"Only OK","text":"This app works, but its synchronization with with Polar Beat is not the best.  When I finish a workout Strava syncs and notifies right away and this app just seems to get hung up and the workout doesn’t flow into it.  The website for this app works well, better than the app.  The social aspects of the app are also questionable, friends are not able to see anything that’s supposed to be public.  The hardware (A360 and H7) work really well.","updated":"2018-04-18T17:19:22-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5016455241","userName":"AirDavid","userUrl":"https://itunes.apple.com/us/reviews/id34264719","version":"4.2.8","score":5,"title":"Don’t need the sync cord","text":"Great app. Just as informative as the desktop version. Syncing with my phone to the Polar web service is easier than doing so with the sync cable. I use the app mostly for analysis, review and recap but not while training.","updated":"2019-10-25T18:30:34-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3624735854","userName":"teelerforlife","userUrl":"https://itunes.apple.com/us/reviews/id381986590","version":"4.0.1","score":4,"title":"Heart rate graph","text":"I like this app and it’s many features, although difficult to manage at first, however I feel like it is missing a heart rate graph feature. With training it shows a heart rate graph, however it does not show one all throughout the day. The addition of this would greatly aid in recovery as well as planning difficult workouts.","updated":"2019-01-07T18:31:11-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6059843412","userName":"DionPavid","userUrl":"https://itunes.apple.com/us/reviews/id556505623","version":"4.4.6","score":3,"title":"STILL LOVE IT","text":"polar app is great except for a few reasons and it’s possible I just haven’t learn to navigate the app properly\nIt constantly requires syncing to the watch instead of it automatically Like the activity app for Apple\nIt has so much information and adjustments for you activity that it sometimes feels over whelming\nGreat app and watch other than that","updated":"2020-06-10T10:46:02-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4400903464","userName":"Hot Foot 1","userUrl":"https://itunes.apple.com/us/reviews/id15767577","version":"4.2.0","score":5,"title":"Great product","text":"Have used Polar products since about 1988. Tried Garman twice,Fitbit twice, and have always returned to Polar. Currently using A360 and love it. Polar Flow has been a reliable partner and I have enjoyed no longer having to keep a separate spreadsheet to plot activity and intensity. It also syncs with My Fitness Pal.","updated":"2019-07-02T05:55:10-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2998871212","userName":"Serpesan","userUrl":"https://itunes.apple.com/us/reviews/id580615419","version":"3.7.5","score":5,"title":"Great resource","text":"I have been using the app for five years to track my exercising calories for 3 different sports with great results. It helps me to keep motivation high with my sport activities and eating habits. Combined with the computer to export my numbers gives a good view of the critical moments and how to be better.","updated":"2018-07-31T19:41:17-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2881348116","userName":"mary is my fav flower","userUrl":"https://itunes.apple.com/us/reviews/id586414396","version":"3.7.5","score":5,"title":"All of it","text":"Love this product. I owned polar products before but this one stands out . Tuff , easy to use , feature rich( covers so many sports ) . Reliable. Love gps. Smart watch features and app . Cost was in my budget. The data stored is much needed for training and it links to all my apple products .","updated":"2018-07-10T18:46:46-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6597824058","userName":"kk47mom","userUrl":"https://itunes.apple.com/us/reviews/id185819387","version":"4.8.0","score":5,"title":"Awesome watch","text":"I love my polar watch!!  I have had 3 of them and all work great!!  I like the charger on the new one better as well.  It has all the options for working out and let’s me know when I have messages.  So happy with this product!!","updated":"2020-11-01T08:00:55-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"8026789305","userName":"stich1011","userUrl":"https://itunes.apple.com/us/reviews/id24690108","version":"5.8.0","score":2,"title":"So-so","text":"I purchased the Polar specifically for its heart rate monitor and sleep data recording. The former has not proven very reliable. And the sleep data is not useful if you do not sleep at least four hours in a row. It seems to be for sound sleepers only.\n\nThe watch is basically just useful for the traditional timing and distance of a run. \n\nFor these results I could have bought a high end Garmin for half the price of the Polar.","updated":"2021-11-15T06:08:30-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6759531637","userName":"MaximusTheTrainer","userUrl":"https://itunes.apple.com/us/reviews/id495672529","version":"4.10.0","score":3,"title":"App is inconsistent","text":"I bought the polar Vantage when it initially came out and it took a while for the app to sync with the watch. It also did not keep training sessions in the app unless resynced. The app seems to be working a little better now, but the app has issues with consistently providing the feedback needed to perform at a high level.","updated":"2020-12-16T06:26:51-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"8021411220","userName":"hardmtnbiker","userUrl":"https://itunes.apple.com/us/reviews/id26397725","version":"5.8.0","score":5,"title":"Heart Rate tracking exercise data","text":"Polar has been the pioneer of HRM watches and sensors. I’m a Registered Nurse and Clinical Programs Development Advisor that has been using HRM watches and devices as a Spin instructor and avid mountain biker and gravel cyclists. Polar has advanced monitoring and coaching supportable data that combined with over tech is amazing.","updated":"2021-11-13T17:29:39-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6277517215","userName":"okokclau","userUrl":"https://itunes.apple.com/us/reviews/id900353203","version":"4.4.8","score":1,"title":"This app is not user friendly. Need major updates","text":"First of all the Feed is in no order at all and the options to sort do help. My workout and activity feed has July 29, followed by 28th, then August 1st, then August 3. I’ve worked out everyday since July 28th. It’s weird. \n\nThen it’s a little annoying that you can’t swipe left or right to view the next day you have to go back scroll up and down to select the day. \n\nDefinitely can be better.","updated":"2020-08-03T21:52:13-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2663227391","userName":"photobug70","userUrl":"https://itunes.apple.com/us/reviews/id592096013","version":"3.7.3","score":3,"title":"Love it but syncing is spotty","text":"I have been using Polar products for a long time and usually have no complaints but the A370 seems to daily lose the Bluetooth connection and it sometimes takes multiple attempts before I can get it reconnected. Not sure if the problem is with the watch, the phone or the app. Very frustrating. Please someone come up with a solution.","updated":"2018-06-08T16:37:56-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4913175937","userName":"Vport","userUrl":"https://itunes.apple.com/us/reviews/id174006245","version":"4.2.7","score":5,"title":"Amateur Tri athlete","text":"I have had Polar for many years.  I have always enjoyed the features offered from polar.  Always a good tool to review performances from my workouts.  From swimming to Triathlons and everything in between.  I plan to keep my polar as part of my regime for years to come.","updated":"2019-10-09T04:42:33-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1874333206","userName":"emills10","userUrl":"https://itunes.apple.com/us/reviews/id21454658","version":"3.6.3","score":5,"title":"Great app","text":"I really enjoy the features it provides. The only thing I wish it had was capability to show battery life percentage. Just a little difficult to gauge when my watch is running low and it doesn’t provide a percentage when I sync it","updated":"2017-10-25T08:58:14-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7482037719","userName":"EVTFred","userUrl":"https://itunes.apple.com/us/reviews/id120592832","version":"5.4.1","score":5,"title":"Polar Flow App","text":"Polar Flow is excellent! Data downloads from my M450 flawlessly. Highlights are: seeing heart rate zones on the map of a workout, highlighting a custom segment of ride and viewing its stats, the chart of recommended recovery time and the transfer of the workout to Strava. Again, Excellent!","updated":"2021-06-19T05:17:50-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4646182307","userName":"mmayberry","userUrl":"https://itunes.apple.com/us/reviews/id25429669","version":"4.2.2","score":5,"title":"Easy and comprehensive","text":"Polar Flow just works! It collects data from my Loop 2 and my H10 monitor and it shows me info I can use in one place. Whether I’m looking at trends over a period of time or just a single workout, I get all the data I need in an easy to use format. Well done Polar!","updated":"2019-08-20T08:50:44-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6697268146","userName":"waiting for godoy","userUrl":"https://itunes.apple.com/us/reviews/id16958023","version":"4.9.0","score":3,"title":"Not updated","text":"Not able to update to recent version on current Mac operating system. So map and other features are 2018 versions and not optimized.  Waiting for Godoy Not able to update to recent version on current Mac operating system. So map and other features are 2018 versions and not optimized.","updated":"2020-11-28T18:31:22-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6213644044","userName":"kevino Merlot","userUrl":"https://itunes.apple.com/us/reviews/id287809594","version":"4.4.8","score":1,"title":"Bluetooth updated","text":"Why can’t updates be completed via Bluetooth?  Have a V650 for my wife and one for me.  They don’t interface well with Windows laptop and this haven’t been able to update for months.  Plus, when traveling and riding in other areas don’t always have a laptop to interface and upload maps.  Very expensive to send in for repairs so will likely find a new model which is mondernized.","updated":"2020-07-18T11:35:04-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5415870512","userName":"Yojka","userUrl":"https://itunes.apple.com/us/reviews/id492214266","version":"4.3.4","score":2,"title":"Sync takes ages","text":"I try to sync my M430 with the app — added one more sport profile before the training. So I am on the bench for 20 minutes now NOT training, because my M430 is still syncing with a slow progress. Frustrating. It wasn’t like that, when I purchased my tracker. \nAlso, the app tends to “loose” data from time to time (I have “keep data forever” in preferences).","updated":"2020-01-17T10:43:21-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4439664680","userName":"cantab 76","userUrl":"https://itunes.apple.com/us/reviews/id627540510","version":"4.2.1","score":5,"title":"Changed my exercise life!","text":"I had been feeling tired after exercise sessions, but thought that my exertion was what I should be doing.  Bought an M600 eight months ago, and realized within a week that I had been overtraining thanks to Polar Flow.  Cannot exercise now without my M600","updated":"2019-07-10T12:54:07-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2422580096","userName":"chelseadreyer92","userUrl":"https://itunes.apple.com/us/reviews/id139283654","version":"3.7.0","score":2,"title":"Never syncs","text":"I used to be able to sync my A300 watch with the app via Bluetooth. It started working off and on and for the last few months it doesn’t work at all. It will only work if I connect my watch directly to my computer which is rare unless I need to charge it. It’s pretty annoying since I can no longer get my step and workout info to sync with the polar app and then get the stats in My Fitness Pal.","updated":"2018-04-14T10:24:56-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7434965746","userName":"Shamatar","userUrl":"https://itunes.apple.com/us/reviews/id17233385","version":"5.3.0","score":1,"title":"Very hard to understand how to use Polar Flow","text":"I am having a hard time using the Polar Unite watch. For example I am on a screen which on the top has three options: strength, cardio, strength and supportive. Can’t figure out how to switch from cardio to the other two. \n\nMaybe I don’t understand the basic concept of Polar Flow and Polar Unite. But what I was hoping for are some exercise routines in the strength and supportive categories. \n\nI happened on a screen that said other outdoor and while cycling, it measured the time and “steps” (which didn’t make sense) and some other parameters. But I don’t think it reported distance although in GPS. \n\nIs there a manual I should be reading or can someone walk me through the functionalities and features?","updated":"2021-06-06T15:19:45-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2508960642","userName":"TaisL","userUrl":"https://itunes.apple.com/us/reviews/id647666797","version":"3.7.2","score":5,"title":"Great for general stuff","text":"Really basic things and all I needed!! Even though you can see text messages and phone calls.. i don’t use it (you can disable). It’s super easy to sync with your phone and to “read” the results! I love this watch!","updated":"2018-05-05T11:47:03-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"8040331219","userName":"Ed2008","userUrl":"https://itunes.apple.com/us/reviews/id41858945","version":"5.8.0","score":5,"title":"Caloric goal","text":"Hello! My is Carolina and I love my watch and this app. Although I would like to know if there’s a way I could possibly change in settings or something the amount of calories I want to burn in a day as a goal. Thank you!!","updated":"2021-11-19T05:35:30-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7370621272","userName":"Wisconsin Ski Guy","userUrl":"https://itunes.apple.com/us/reviews/id29672622","version":"5.3.0","score":5,"title":"Gives more information","text":"Polar flow gives a more complete analysis of your workout than Apple Health. What I like is that it gives instantaneous speed, heart rate, and altitude at each location on the map.","updated":"2021-05-21T09:01:16-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7038854209","userName":"DK thoughts","userUrl":"https://itunes.apple.com/us/reviews/id154548889","version":"5.0.0","score":4,"title":"Love it but things to improve","text":"LOVE that it’s water proof and more accurate then Fitbit or iPhone. Not easy to snap in to charge and see if/it when charging and print way to small to read or even understand the sleep info especially on the app.","updated":"2021-02-25T17:22:58-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3370291067","userName":"WV run bike row","userUrl":"https://itunes.apple.com/us/reviews/id501353717","version":"3.8.1","score":3,"title":"Difficult to make adjustments","text":"When I 1st purchased the Watch I loved the options l.  However, now that I’ve had it for a while I’ve wanted to make adjustments to the display settings.  This seems to be impossible.  I’ve spent an inordinate amount of time trying to add and adjust my current settings.  I’m still not able to make adjustments.  Very unhappy!!","updated":"2018-11-01T17:18:54-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6795529031","userName":"Rob - fighting pre parkinson's","userUrl":"https://itunes.apple.com/us/reviews/id1103632959","version":"4.10.0","score":5,"title":"Year review","text":"After a continual use of one year, I can say I am very pleased with my Polar Flow app.  I use it to track all my daily activities from sleep to running. I highly recommend Flow with any of the Polar tracking watches.","updated":"2020-12-26T05:23:55-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3026070766","userName":"cethresher","userUrl":"https://itunes.apple.com/us/reviews/id42630232","version":"3.7.5","score":1,"title":"Connection issues","text":"Getting the OH-1 to sync with this app involves a little luck and a lot of magic. Usually restarting the phone and sensor does the trick but not always, especially if mercury is in retrograde (joking of course, but there really is no rhyme or reason to why syncing is so difficult).  5% of the time it works the first time. I’ve tried this on 3 different platforms and get the same experience. Why can’t I force a sync from the app. Come on, basic functionality here.","updated":"2018-08-06T07:21:13-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7791028079","userName":"glenn1you0","userUrl":"https://itunes.apple.com/us/reviews/id121997864","version":"5.6.0","score":1,"title":"Unreliable","text":"I use a polar verity sense with this app. Most times it works. But about 1 in 5 times it will just fail. Yesterday it worked just fine. Today I ran my 3rd fastest 5k and it registered as 8 calories. 3 blips on the heart rate chart that correspond to when i was looking at the app to verify it was recording. Support is unreachable. I would avoid this if you intend to use the data for more than passing curiousity.\n\nUpdate: I am reducing my review to a single star today because after functioning fine for two weeks it completely dropped the ball on my longest run to date today.  \nThis is nice app, but you can’t trust it.  \n\nAt a minimum it should emit some kind of audio alert if it looses connection or other anomaly.","updated":"2021-09-10T05:40:38-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6022206960","userName":"Doggiepaws1","userUrl":"https://itunes.apple.com/us/reviews/id315430645","version":"4.4.4","score":5,"title":"New to exercise, love the app and watch","text":"My husband gave me his old watch and heart monitor.  I have been walking daily and love to watch my progress.  The app is very friendly.  Thank goodness for You Tube to learn how to use the watch.","updated":"2020-06-01T08:10:29-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5337727444","userName":"Sunbird12345","userUrl":"https://itunes.apple.com/us/reviews/id309588873","version":"4.3.3","score":5,"title":"Share problems H10","text":"The beat and flow does not work with each other. So you can’t Analyze your workout after you done on the beat. It’s doesn’t not show your daily goal 🤬","updated":"2019-12-30T00:11:32-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3226108225","userName":"ItsReiChan","userUrl":"https://itunes.apple.com/us/reviews/id104048257","version":"3.7.8","score":1,"title":"App Keeps Craahing During Install","text":"I was trying to download this app; however during the initial install after signing in, the app immediately crashes. Any subsequent efforts to open the app back up after the crash only leads to MORE crashing. \n\nI also tried uninstalling the app entirely, and reinstalling only to have the same problem. Then I tried restarting my phone. Same problem. \n\nWhat a terrible first impression of the quality of their product!","updated":"2018-09-24T12:53:27-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5527412334","userName":"TheDonNguyen","userUrl":"https://itunes.apple.com/us/reviews/id16743052","version":"4.3.6","score":3,"title":"Good but flawed","text":"Love the tracking this app provides for my workouts but the app itself is frustrating. If you don’t sync daily, sorting gets all messed up. Instead of showing the latest workout, it shows the oldest workout that wasn’t synced and there is no way to sort by date.","updated":"2020-02-13T14:57:49-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7747673809","userName":"FitMomRee","userUrl":"https://itunes.apple.com/us/reviews/id1296964893","version":"5.5.0","score":5,"title":"Love my Unite","text":"I work out between 5-6 days a week, and my watch keeps me on track with my workouts. I also love that it tracks my sleep and tells me what kind of exercise I should do for the day.","updated":"2021-08-29T04:44:05-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5324488990","userName":"petey123","userUrl":"https://itunes.apple.com/us/reviews/id102486737","version":"4.3.3","score":1,"title":"Loved the app till the latest update","text":"I have been using my polar vantage M and the app close to a year now. Everything is great till the last update. No it automatically signs me out every time I quit the app and takes for ever to download load my info on the app again. Download from the site has taken as little as 5 minute to an hour at times!!!! I would have given 5 stars till this latest update!!!!!","updated":"2019-12-26T19:53:48-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3854210180","userName":"Store32Shopper","userUrl":"https://itunes.apple.com/us/reviews/id37527815","version":"4.0.6","score":1,"title":"Buggy - still","text":"Just gets worse. 1. Sport profiles disappear at random, removing them from my M430. It makes it pretty inconvenient to start an activity only to find the profiles are no longer on the watch. \n\n2. I can sync my watch (slowly) and the up to the minute activity is updated in the app. Ten minutes later I can open the app and there is no activity listed at all - as in zero. I have to drag down to resync the app to Polar’s servers to repopulate the data. \n\n3. App constantly nags about a firmware update to my H10, even though it’s updated already- and done through the app. \n\nPolar may have actually gotten worse than Garmin in terms of buggy software. At this rate, when my M430 dies, I’m done with Polar despite being a 25 year customer.","updated":"2019-03-07T12:33:04-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3610850194","userName":"Ck12344567","userUrl":"https://itunes.apple.com/us/reviews/id30616789","version":"4.0.1","score":3,"title":"It’s just OK","text":"I find at times it doesn’t sync correct information. The device and app have different information after a sync. Cured it I have my sleep info listed twice it will show the date(days sleep) the if you scroll over it has last nights sleep, both the same date. Can’t seem to fix it.","updated":"2019-01-04T03:33:27-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3526178209","userName":"Bunkamura","userUrl":"https://itunes.apple.com/us/reviews/id389434335","version":"4.0.1","score":5,"title":"Something is wrong with the watch","text":"To connect the Watch and synchronize has been a problem since day one I wish there were some phone number that I could speak to someone For Help","updated":"2018-12-13T05:49:37-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6503358803","userName":"hin tin tin","userUrl":"https://itunes.apple.com/us/reviews/id87455816","version":"4.6.0","score":1,"title":"Pre planned product obsolescence","text":"I have a drawer full of polar watches which no longer work due to polar’s failure to update/support them.  I’ve been a loyal polar customer for more than 25 years now but no more.  I have a polar v800 (expensive when I naught it).  I also just upgraded to an I phone 11.  Support isn’t going to fix sync bug.  I’m over it.  Ditch or don’t buy Polar get an Apple Watch.  Does more and just as good or better for fitness.","updated":"2020-10-05T07:40:53-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2267312382","userName":"RalphWiggums","userUrl":"https://itunes.apple.com/us/reviews/id167174586","version":"3.6.9","score":5,"title":"Syncing Issues","text":"I like the fit and function of the watch, but the Bluetooth syncing takes 3-5 minutes sometimes.  And occasionally it never will end up syncing and I have to plug it into my laptop.","updated":"2018-03-03T10:39:48-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3443728196","userName":"missffitt","userUrl":"https://itunes.apple.com/us/reviews/id311664163","version":"3.8.2","score":4,"title":"Adjusting to Polar","text":"I switched from Fitbit 2 to Polar after my watch strap broke 2x within 10 months. While I like all the added tracking data, I do miss the tap screen of Fitbit. I also miss the fitness activity choices that are lacking from Polar. I jump rope and do lots of cardio sculpt and these options don’t exist.","updated":"2018-11-21T07:29:47-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6583051051","userName":"Skyblazing","userUrl":"https://itunes.apple.com/us/reviews/id304735821","version":"4.8.0","score":5,"title":"Update to an Old Review","text":"5 stars instead of 1 star! Because you finally fixed what I asked for a few patches later.\n\nAlso, I’m now sure that I want to get the Vantage V2 even though this V Titan is fairly new to me.","updated":"2020-10-28T06:52:30-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3477367135","userName":"prihost","userUrl":"https://itunes.apple.com/us/reviews/id593655780","version":"4.0.0","score":5,"title":"Training Partner","text":"I find Polar Flow to be an incredibly helpful training partner that breaks down my runs or workouts into easily read information to help me get more out of each run, heavy weight session, or simple workout.\nHighly recommend.","updated":"2018-11-30T05:36:20-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3173173994","userName":"Reid Harris","userUrl":"https://itunes.apple.com/us/reviews/id370657758","version":"3.7.7","score":5,"title":"Great app","text":"Great app and the most accurate HR monitor on the market. The only problem is the amount of distance captured on runs by the GPS is inaccurate. The recorded amount is always less than actual distance covered by at least 10%.","updated":"2018-09-09T18:58:25-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1935627891","userName":"Kel 67","userUrl":"https://itunes.apple.com/us/reviews/id257998631","version":"3.6.4","score":5,"title":"Make me move","text":"I really like this app, when I check on my stats I see that I need to get up an get moving. It keeps me trying to do my best. I seem to go up and down weight wise within a few numbers but I'm still new at this.","updated":"2017-11-20T12:54:41-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5191664786","userName":"pedro d'armas","userUrl":"https://itunes.apple.com/us/reviews/id569669101","version":"4.3.2","score":5,"title":"Polar Watch","text":"The look of the watch is very nice but the device is not friendly user at all\nI am still trying to figure out how it work\nHorrible device","updated":"2019-11-24T06:59:15-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3426554377","userName":"WalkandRead","userUrl":"https://itunes.apple.com/us/reviews/id37283231","version":"3.8.2","score":5,"title":"Doesn’t sync to more than one app","text":"The app does all you would expect. I’m only disappointed because when I sync to my phone, I can’t see all the data on my iPad. If I want to do that I need to resync to my second device","updated":"2018-11-16T19:27:43-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2743255222","userName":"Natural_Chick","userUrl":"https://itunes.apple.com/us/reviews/id183936301","version":"3.7.4","score":5,"title":"Dope","text":"I’m so happy they got rid of the strap heart rate monitor & I love that I can charge it instead of replacing the battery every so often. It’s so much more convenient to use, but I have no idea what to do with my previous polar watches and heart rate monitors. I hope the A370 last years.","updated":"2018-06-21T21:27:02-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5506422848","userName":"KMP_Hockey","userUrl":"https://itunes.apple.com/us/reviews/id226578272","version":"4.3.5","score":5,"title":"Problems with recent update","text":"Now problems with syncing.  Always problems with updates.","updated":"2020-02-08T19:39:53-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4836504758","userName":"andybanni","userUrl":"https://itunes.apple.com/us/reviews/id36983725","version":"4.2.6","score":3,"title":"Cardio load","text":"This would be a great app except for the Cardio Load feature. It doesn’t seem to allow recovery period- if you dare take a day off of training, “tolerance” decreases. Seems like it drops dramatically on a new week in the app even if I hit it hard the day before. \nI don’t really see the point of this feature in the format it’s in.","updated":"2019-09-25T08:30:43-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3826495467","userName":"Rocky Mnts","userUrl":"https://itunes.apple.com/us/reviews/id26467726","version":"4.0.5","score":4,"title":"Versitle Watch","text":"This has been a great watch because I can use it while running, hiking, biking and swimming. I recommend it because of the reasonable cost and the design. Being 56, I need glasses but I can adjust the display to be big enough to read while I’m working out. I am glad I bought it!","updated":"2019-02-28T19:12:20-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3922285339","userName":"Pretty Rugged","userUrl":"https://itunes.apple.com/us/reviews/id148632895","version":"4.0.6","score":5,"title":"Easy to use and great information","text":"For me – the key is being able to navigate the software and get information that will help me measure my activity level. Polar is easy fun to use and reliable.  My husband and I love it!","updated":"2019-03-24T11:49:54-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"8038225746","userName":"mahogman","userUrl":"https://itunes.apple.com/us/reviews/id184184013","version":"5.8.0","score":5,"title":"Polar 25 years and counting","text":"Age 78. Polar hrm’s for at least 25 years. Training for aerobic fitness not for sports. It works. Now using A 370 and H 10 with Flow keeping my diary.  Repitition with adequate intensity is the secret. The objective is compression of the morbidity curve.  IE stay fit,stay healthy and drop dead.","updated":"2021-11-18T14:08:46-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"8128343333","userName":"<3 Annonomyous <3","userUrl":"https://itunes.apple.com/us/reviews/id37480859","version":"6.0.0","score":2,"title":"Has potential","text":"The app has so much potential but I can’t seem to figure out the basics.  I created a running program and it sets the time for 6pm for all of my exercises.  I want my run notifications in the morning.  To not be able to change the time of the workouts on the app or on the website is infuriating to me.","updated":"2021-12-13T23:46:24-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4449734745","userName":"FauxTux","userUrl":"https://itunes.apple.com/us/reviews/id114447239","version":"4.2.1","score":5,"title":"Very useful tool to evaluate performance metrics","text":"Excellent tool that maximizes Polar product performance metrics. Data is presented with text, graphs and great graphics like map overlay for my V800. Offers so many tools to aid in decision making that it simply will make you say wow, it’s amazing.","updated":"2019-07-12T13:34:48-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6166397933","userName":"Bo_G_Done","userUrl":"https://itunes.apple.com/us/reviews/id1187187295","version":"4.4.7","score":4,"title":"Follow friend function","text":"Using polar products for a couple years and I like it. However, there is no easy follow friends activity function, which for this days is a must. Please add it ASAP, so we can track our friends. Thanks.","updated":"2020-07-06T19:45:57-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5281060664","userName":"Wind and fire","userUrl":"https://itunes.apple.com/us/reviews/id148063637","version":"4.3.3","score":5,"title":"Awesome App","text":"Been using so many sport application to tracks my activity, polar flow is unique but you must have Polar watch specially Polar Vantage V to get the beat of this application. I gave 5 stars because I have not encounter any negative flow yet ...good luck all","updated":"2019-12-16T14:26:58-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7775029111","userName":"SandMann205","userUrl":"https://itunes.apple.com/us/reviews/id463235490","version":"5.6.0","score":4,"title":"Lots of Info but …","text":"While there is a lot of information, I don’t know how to look at trends easily.  For example a chart or graph of daily heart beat. You can see some what by week.  Data needs to be more flexible to see trends with","updated":"2021-09-05T12:31:52-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6186397578","userName":"Runner obsessed","userUrl":"https://itunes.apple.com/us/reviews/id22914376","version":"4.4.8","score":4,"title":"Not syncing with Strava","text":"I like this app a lot, but even with the newest update it still isn’t syncing with Strava automatically. I manually upload the file each time, but that is annoying.","updated":"2020-07-11T12:38:51-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2072869331","userName":"Vayviene","userUrl":"https://itunes.apple.com/us/reviews/id143118291","version":"3.6.6","score":5,"title":"Superb","text":"Visually pleasing app. When you open the app there’s a big circle with what your day looks like and within one or two seconds you can get an overview of your activity level. It is very, very intuitive","updated":"2018-01-09T10:10:16-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4940861043","userName":"runnergbv","userUrl":"https://itunes.apple.com/us/reviews/id28043043","version":"4.2.7","score":4,"title":"Connectivity","text":"Very poor connection with my watch, always takes my a lot to be able to sync, even though the connectivity has improve still is not easy to sync my watch; but I’m very happy with my V650 that one is very good with my road bike","updated":"2019-10-13T09:24:44-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4596790754","userName":"Faster50","userUrl":"https://itunes.apple.com/us/reviews/id261368297","version":"4.2.2","score":5,"title":"Polar Flow app is fantastic!","text":"I truly enjoy the Polar Flow app. It syncs quickly and gives me up-to-date feedback on my activity. The watch is easy to wear and they work together seamlessly. I would highly recommend these products!","updated":"2019-08-10T07:20:11-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5924570108","userName":"Joe85635","userUrl":"https://itunes.apple.com/us/reviews/id190452180","version":"4.4.3","score":1,"title":"Not that great, too many issues.","text":"I have few issues:\n 1.  Do not start providing data right away, it take few minutes.\n 2. The measurements of the distance are different every time, in all the courses that I use (such as the track). \n3. The settings don’t stay fix (I use the walk, and keep changing to run); on the update change my walk to run. \n 4. Information provided during the walk or run is not help to my training (burning fat - improving fitness).\nBetter information will be:\n a. Provide me with every 1/2 mile or laps when I run or walk.\n b. Provide me with the Heart Rate every 5, 10, 15 or what ever I set it. \n c. Be able to set my maximum Heart Rate for safety.","updated":"2020-05-09T11:51:51-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6498836763","userName":"Arashmx","userUrl":"https://itunes.apple.com/us/reviews/id123489058","version":"4.6.0","score":5,"title":"Grit X sync error","text":"After latest update i have an error on sync :\nCouldn’t sync your watch\n🤦🏻‍♂️🥺\nmy watch is Polar Grit X with latest update\nplease please fix it as soon as possible 🙏🏽🙏🏽","updated":"2020-10-04T01:38:32-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7145376023","userName":"ZrSyX","userUrl":"https://itunes.apple.com/us/reviews/id307399141","version":"5.0.0","score":1,"title":"Kinda Confused","text":"So there is the Polar flow app and the polar beat app? And the Heath app only syncs consistently with the polar beat app. And the amazing Polar HR monitor disconnects from the polar beat app. So even if I wanted to use the training tools I can’t because I don’t want to monitor my HR monitor connection during my entire work out. I could probably disconnect and reconnect and restart and all that or I could just not use Polar apps and avoid the issue.","updated":"2021-03-25T21:15:28-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1885361849","userName":"Eddsol777","userUrl":"https://itunes.apple.com/us/reviews/id193124210","version":"3.6.3","score":4,"title":"Good but app is a bit slow","text":"It takes very long time to sync. I can't add the food I eat to compare how many calories I am eating vs how many I am burning. My polar scale always have isSues reflecting the data on the app. The gps and heart zones are really good, the battery too. Is a good product.","updated":"2017-10-30T05:19:07-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6665575554","userName":"mozgoved","userUrl":"https://itunes.apple.com/us/reviews/id22269303","version":"4.9.0","score":1,"title":"Great hardware, glitchy / broken app","text":"You guys should really invest into smoother app/watch sync experience. My watch wouldn’t sync with an app for a whole week, with me having tried literally EVERYTHING in your manual except factory reset. I can’t understand why you can’t get something as simple as a Bluetooth sync done well. It’s like the most basic bit of any smartwear device. Very disappointing!!","updated":"2020-11-20T01:55:16-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5466409424","userName":"RichL12345","userUrl":"https://itunes.apple.com/us/reviews/id196751464","version":"4.3.5","score":5,"title":"It works... if you follow it.","text":"I enjoy polar flow.  I’ve been using the scale and the 200 watch fir 18 months.  I like that flow works with MyFitnessPal to track my weight (losses and gains) & weigh daily.  Simply diet and exercise work, and that what Flow does.","updated":"2020-01-30T06:30:07-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2923668090","userName":"SabbyNet","userUrl":"https://itunes.apple.com/us/reviews/id25292432","version":"3.7.5","score":5,"title":"Eleminate the need for device sync with PC","text":"It should be sufficient to update GPS data training programs, system updates and everything else that device needs by just syncing it with polar flow app.","updated":"2018-07-17T05:59:10-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2340177103","userName":"Lalaperk","userUrl":"https://itunes.apple.com/us/reviews/id176519547","version":"3.7.0","score":5,"title":"Polar","text":"This is my second polar device, after the FT7. No issues over the last 2 years of owning. Would like to eventually upgrade to one that has wrist-base heart rate sensing, but thus far this does the job.","updated":"2018-03-24T00:28:18-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2096787104","userName":"KPDirection","userUrl":"https://itunes.apple.com/us/reviews/id24440278","version":"3.6.6","score":1,"title":"Will not connect to H10","text":"Purchased a H10 hrm last month. Works great with Polar Beat, but Polar Flow does not see the device, there is no way to pair it, and it won’t take a feed (and shouldn’t have to) from Polar Beat. This is DESPITE the H10 box and Polar “support” claiming it works with both apps. \n\nDon’t like liars. I can’t return the device now, so I’ll just bin it once I find a device that it’s manufacturers stand behind and tell the truth about. The software is already uninstalled.","updated":"2018-01-16T20:25:17-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6158821571","userName":"nightenwolf","userUrl":"https://itunes.apple.com/us/reviews/id327120482","version":"4.4.7","score":4,"title":"Polar loop","text":"Hi ,i have polar loop ! after last update of yoyr app in ios i have crash to sync data in mobile ! connect device and its ok ! \nbut i need my device show me correct data ,\nthanks to fix it as soon as possible .","updated":"2020-07-04T21:01:20-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3448640674","userName":"Applelights","userUrl":"https://itunes.apple.com/us/reviews/id28797729","version":"3.8.2","score":1,"title":"Doesn’t write to Apple Health Active Energy?","text":"I have a MyZone band. It properly writes all heart rate data to Apple Health in Workouts and Active Energy and Restering Energy. Just ordered the H10 but looks like Polar only writes to Apple Health Workouts but not active energy and resting energy. Which means other apps that pull from active energy won’t be able to read the data like you can with competitors such as MyZone. Is this a know issue or are others not experiencing this?","updated":"2018-11-22T14:43:57-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2097056323","userName":"BABNM","userUrl":"https://itunes.apple.com/us/reviews/id355248289","version":"3.6.6","score":5,"title":"Great summary info plus running index","text":"I have used this software for years and it keeps getting better.  Polar regularly adds features that improve the usefulness of info, like cadence and running index.","updated":"2018-01-16T22:27:07-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2020259728","userName":"McCaffreyC","userUrl":"https://itunes.apple.com/us/reviews/id227579574","version":"3.6.6","score":5,"title":"Flow For On The Go Athletes","text":"Love using the app to create workouts on the fly. It simple to use for programming a quick interval or tempo run. Also, seeing my sleep tracker for the week helps me understand when I’m getting the recovery I need.","updated":"2017-12-23T03:57:48-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6485560239","userName":"Model#1","userUrl":"https://itunes.apple.com/us/reviews/id41935432","version":"4.6.0","score":1,"title":"No connection","text":"Can’t connect the stupid polar a370 to my iPhone. Is supposed to automatically find it when I’m in the app even when I put the device on discover. Y make things so complicated? Should just b able to connect via the Bluetooth from iPhone settings. Spent over 30 min trying to connect a370 had to do it over a pc. This is y Apple Watch is winning.","updated":"2020-09-30T10:48:21-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3724839616","userName":"Unfrenchman","userUrl":"https://itunes.apple.com/us/reviews/id254971840","version":"4.0.4","score":3,"title":"Update wiped profiles","text":"I’ve had an A360 and this app for quite a while. After some of the updates it wipes the training profiles from the app and my watch. It tracks everything great but it gets very annoying having to go back in and add my profiles or check they are there.","updated":"2019-02-02T07:32:04-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2407724336","userName":"RHernandezJr80","userUrl":"https://itunes.apple.com/us/reviews/id42195442","version":"3.7.0","score":3,"title":"Sync process has always frustrated me...","text":"This is an OK app, however, I wish Polar with upgrades it’s Apps to compete with UnderArmour better thought & designed apps. In addition, it should be a button to just trigger the sync of devices instead of refreshing unless they can make this more reliable.","updated":"2018-04-10T17:41:48-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7545337102","userName":"Ladyquaterback","userUrl":"https://itunes.apple.com/us/reviews/id22910205","version":"5.4.1","score":5,"title":"Awesome watch","text":"I love this watch, it tells you what zone you are in by color at a glance which helps you accomplish your goals faster.  It is very accurate.","updated":"2021-07-06T05:07:22-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3290623191","userName":"Osyres","userUrl":"https://itunes.apple.com/us/reviews/id39579920","version":"3.8.0","score":4,"title":"Great app but one BIG PROBLEM!","text":"This is a great wya to keep up with all your activity, sleep and work outs.\n\nThere is one big problem in that you can’t modify the distance of a run in the app.  I don’t want to open up my web browser and log into polar flow to do this","updated":"2018-10-11T13:35:07-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6520748936","userName":"albinosaur","userUrl":"https://itunes.apple.com/us/reviews/id192740264","version":"4.7.0","score":4,"title":"Good, but no longer connects to Under Armour apps","text":"I used to be able to connect my Polar to the ‘Map My Walk/Bike/etc’ apps, but it’s no longer an option and it was really helpful for my weight loss goals.","updated":"2020-10-10T08:03:51-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2758654344","userName":"2222reduh34","userUrl":"https://itunes.apple.com/us/reviews/id106146244","version":"3.7.4","score":4,"title":"Exelent activity tracking.","text":"Excellent app for activity tracking in combination with Polar device. \nOnly drawback for this app. it’s  lacking accurate GPS sharing with Polar A370, the device is not receiving an accurate gps signal where phone has a accurate possition.","updated":"2018-06-24T02:43:03-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7924869393","userName":"Cherijj","userUrl":"https://itunes.apple.com/us/reviews/id141329848","version":"5.7.1","score":1,"title":"Never buy Polar again","text":"I have an A360 that’s about 4 years old. I love it for swimming. I’ve never had any problems with it. I got a new phone and suddenly it will not connect to the app and download activity. Polar decided to abandon users of older models. I get that support must end sometime but they could have figured out a way to let us continue to use the app.","updated":"2021-10-17T07:48:55-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3073568157","userName":"gnidybab","userUrl":"https://itunes.apple.com/us/reviews/id38891977","version":"3.7.6","score":5,"title":"LIKE IT BUT...","text":"The wristband is a bit flimsy and the piece that covers the charge connection on the A360 is constantly falling out. I’ve had to replace it once, and believe it’s gone again.😞 Other than that, I enjoy it.","updated":"2018-08-16T10:09:50-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6669972892","userName":"Leaux","userUrl":"https://itunes.apple.com/us/reviews/id17963553","version":"4.9.0","score":4,"title":"Update Falls Short","text":"The recent update falls short in that the “new dashboard” must be swiped up to see everything.  It’s easier to just select each screen than scroll.","updated":"2020-11-21T06:02:04-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6554704014","userName":"Pilot Prop","userUrl":"https://itunes.apple.com/us/reviews/id388339328","version":"4.7.1","score":4,"title":"Overall a solid app...but","text":"Overall a solid app...but i wish Polar Flow provided better weekly/monthly/annual running mileage info. Also i would like it if all my Polar data worked with my Apple Health app better.","updated":"2020-10-20T04:22:01-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1968411292","userName":"sgareffa","userUrl":"https://itunes.apple.com/us/reviews/id86788187","version":"3.6.5","score":5,"title":"Love this device and app!","text":"It’s motivating and easy to use. I gets phone updates, texts and call alerts on it. For the app, great read out on my phone so I can track sleep and activity.","updated":"2017-12-03T14:45:03-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2226149906","userName":"acehiilm","userUrl":"https://itunes.apple.com/us/reviews/id27942797","version":"3.6.8","score":1,"title":"Am I not connected to the internet?","text":"I just downloaded twice the app on my phone, but when I fire up the app and need to connect to my account I get an alert that my mobile device is not connected to the internet. Uhm, I just downloaded it and am streaming, browsing the internet. I can login into my Polar web account without problems through Safari. What gives Polar? Pretty frustrating.","updated":"2018-02-19T11:26:25-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7378130015","userName":"RmLJr","userUrl":"https://itunes.apple.com/us/reviews/id535749825","version":"5.3.0","score":5,"title":"A well designed app","text":"I have been using the Polar Flow app since 2014. The Polar Flow app is well designed and maintained with new useful features.\nHowever, I am not impressed with the Polar Vanage series watches.","updated":"2021-05-23T05:31:52-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6687355696","userName":"DCRiley73","userUrl":"https://itunes.apple.com/us/reviews/id132986165","version":"4.9.0","score":2,"title":"New UI is awful","text":"It was bad enough when they forced blog notifications that you couldn’t turn off. But now they’ve switched to a bloated home screen that makes you dig for your stats. If Fitbit comes out with a chest strap for optimal workout HR meter accuracy I’ll happily switch back and never look back.","updated":"2020-11-26T03:12:51-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5227429169","userName":"Roniiiieeeer","userUrl":"https://itunes.apple.com/us/reviews/id288373028","version":"4.3.2","score":3,"title":"Difficult to program","text":"I love the look and was\nPrimarily looking for waterproof, steps,miles, activity, heart rate. And sleep. It’s more than I need. Also, for some reason it’s leaving marks on my wrist. I’m contemplating the need to return for something more simplified. Plus, I’ve got purple marks on my arm.","updated":"2019-12-02T22:05:05-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1897478349","userName":"HRReviewNStuf","userUrl":"https://itunes.apple.com/us/reviews/id34632089","version":"3.6.3","score":1,"title":"Useless App","text":"If you like and use the Polar Beat app, you'll be... disappointed at how pointless and useless Polar Flow is. The app syncs poorly (it's often missing my latest workout, even the next day still missing). Training Load might be a useful feature if it actually existed, but it's secret analysis Polar claims to present to you but in fact is not presented anywhere. Basically the app doesn't wotk and adds zero value.","updated":"2017-11-04T12:32:47-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4876312220","userName":"Serbugs","userUrl":"https://itunes.apple.com/us/reviews/id249479423","version":"4.2.6","score":5,"title":"Can’t Live Without It","text":"Polar Flow is an Outstanding App!  It allows me be able to gather all the information generated during my workout.  I’m hooked on the information that is provided is pro","updated":"2019-10-02T21:23:53-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6236747434","userName":"I.lopez86","userUrl":"https://itunes.apple.com/us/reviews/id997132301","version":"4.4.8","score":2,"title":"Good but not great","text":"Overall the app is a good app. I like the information it tracks and provides to me. However my watch keeps losing sync with the app, so it’s a hassle to have to keep signing out and sign back in to sync the watch. If I didn’t have to do that almost everyday, it would be a great app.","updated":"2020-07-24T08:34:25-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1796711201","userName":"michiesan","userUrl":"https://itunes.apple.com/us/reviews/id33498935","version":"3.6.1","score":5,"title":"Works very well","text":"I've others complain about sync issues. To be honest I had it once. I called Polar's support line and was back on track, pardon the pun, immediately.","updated":"2017-09-18T10:02:45-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4528407100","userName":"Joseph Conrad 34","userUrl":"https://itunes.apple.com/us/reviews/id4467235","version":"4.2.1","score":3,"title":"Interface is Great... Syncing is a bother","text":"The digital interface is awesome! However, I have go through the additional step of syncing my watch anytime I want to see data! It would be much better to refresh the app and have it sync so I can get to my data faster!","updated":"2019-07-27T16:34:23-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5013517932","userName":"pattyhang","userUrl":"https://itunes.apple.com/us/reviews/id170263080","version":"4.2.8","score":1,"title":"HUGE problems ever since iOS rollout","text":"It’s been 3 weeks now and Polar tech has been unable to remedy my current situation where my v800 will not sync with the Flow app on my iPhone. Even worse, up until recently I could “force” an app sync by re-pairing my v800 with my iPhone every morning but following the recent instructions sent to me from Polar Tech now renders that","updated":"2019-10-25T08:39:29-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3554256903","userName":"sabarney","userUrl":"https://itunes.apple.com/us/reviews/id25977216","version":"4.0.1","score":4,"title":"Notifications","text":"Smart notifications no longer work since the update. Tried resetting app, deleting it and restarting the Bluetooth process with no luck. I won’t where the watch now if not training, rather wear my g-shock.","updated":"2018-12-20T20:36:46-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2632633153","userName":"Savings All The Way","userUrl":"https://itunes.apple.com/us/reviews/id474627395","version":"3.7.3","score":5,"title":"It works!","text":"I have used other monitors and they are comparable.  I love how it tells you like it is...whether you need to step it up a notch or you are have improved your aerobic abilities.","updated":"2018-06-02T12:07:17-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6796731429","userName":"cin®","userUrl":"https://itunes.apple.com/us/reviews/id30093518","version":"4.10.0","score":3,"title":"Great fitness, bad smart watch.","text":"Great fitness watch, but the synching is really bad. Keeps dropping the connectivity. Not all notifications are not sent to the watch. \nFor poor smart watch functions a regular fitness watch works as fine as a polar smart watch.","updated":"2020-12-26T12:13:01-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7898339453","userName":"WIMS Guru","userUrl":"https://itunes.apple.com/us/reviews/id423578589","version":"5.7.1","score":5,"title":"Prime use is to track my sleep patterns & steps","text":"I most enjoy the accuracy of the sleep tracking, especially the REM Quality.  Thank You!","updated":"2021-10-10T02:04:58-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2504093328","userName":"SuzyQ4464","userUrl":"https://itunes.apple.com/us/reviews/id19445050","version":"3.7.2","score":3,"title":"Keeps freezing","text":"I love my Polar fitness monitor but the app leaves something to be desired.  Every time I open the app to sync it, it’s frozen and I have to turn my phone off and back on to get it to work.  When the app is working, it works well...when being the key point.","updated":"2018-05-04T07:38:21-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2367617687","userName":"No longer interested","userUrl":"https://itunes.apple.com/us/reviews/id209844651","version":"3.7.0","score":2,"title":"Not intuitive","text":"Still trying to figure this out.  I have the OH10 and the A370.  Both synch in Polar Flow but apparently only one can be used with Polar Beat.  Are both apps necessary?  Can’t seem to track activity in Polar Flow without Polar Beat.  If I have to keep synching each HR sensor every time I train, this will change to 1 star and I may have to switch back to Fitbit or Garmin.","updated":"2018-03-31T07:04:40-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1994343833","userName":"Mandygabi","userUrl":"https://itunes.apple.com/us/reviews/id207727505","version":"3.6.6","score":3,"title":"Works but steps fail","text":"The app is ok, but the option of sharing the steps to the health app is not working. In the app the steps appear fine but if I try to see it in the health app it doesn’t sync. Try uninstalling and reinstalling but is not working even when the settings are to sync.","updated":"2017-12-13T15:58:53-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1874538938","userName":"Detritusboy","userUrl":"https://itunes.apple.com/us/reviews/id367838920","version":"3.6.3","score":3,"title":"Pretty good","text":"Love the options I have for activities I can record.\n\nI like the active circle for the day.\n\nI don’t like the sleep info. I switched from Fitbit to polar and I really liked their sleep bar graph that I could see a week or month at a time of sleep to see my trends. Haven’t seen a similar display in Polar Flow.","updated":"2017-10-25T11:00:34-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5590264194","userName":"Tibyra","userUrl":"https://itunes.apple.com/us/reviews/id284045194","version":"4.3.8","score":5,"title":"Helpful to analyze the quality of my sleep!","text":"Besides measuring my daily activity, it’s been instrumental in improving the quality of my sleep.","updated":"2020-02-27T20:27:57-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5194097118","userName":"caliper50","userUrl":"https://itunes.apple.com/us/reviews/id244340787","version":"4.3.2","score":4,"title":"Unlike the website options","text":"Cannot make training targets like in the website.\n\nI have bought a new M430 and it does not pair with device.","updated":"2019-11-24T20:43:20-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1788348852","userName":"ValerieFo","userUrl":"https://itunes.apple.com/us/reviews/id455363524","version":"3.6.1","score":3,"title":"Hit or miss.","text":"It seems to be hit and miss when it comes to syncing my a300 to the app on my phone. Often times I have to sync repeatedly 3-4 times before the data will show up in my phone even though my watch is saying \"sync completed successfully\".","updated":"2017-09-13T08:19:42-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7199450570","userName":"AZrunner2UT","userUrl":"https://itunes.apple.com/us/reviews/id38172288","version":"5.1.0","score":4,"title":"Notifications","text":"Notifications aren’t always reliable.  Some texts calls and alerts don’t appear or come in.","updated":"2021-04-08T12:49:53-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7081565165","userName":"HermyBePimpn","userUrl":"https://itunes.apple.com/us/reviews/id251242071","version":"5.0.0","score":4,"title":"Please, please make widgets","text":"I would love a 2x2 widget to view activity of the day on my home screen, in place of the apple fitness widget I currently have, for the apple watch I no longer plan to use.","updated":"2021-03-08T18:05:31-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3826190673","userName":"loop battery","userUrl":"https://itunes.apple.com/us/reviews/id258373248","version":"4.0.5","score":5,"title":"Battery life on loop","text":"I wish there was a way to on demand view the battery life of my Loop either on the actual device or through the app.","updated":"2019-02-28T17:16:59-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3936713527","userName":"Henc12","userUrl":"https://itunes.apple.com/us/reviews/id21051274","version":"4.0.6","score":4,"title":"Love my Polar","text":"I love it!  Never had any problems syncing.  My one complaint is I would like to be able to edit workouts. For example, forget to start or stop the watch tracking a workout.","updated":"2019-03-28T04:52:59-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7092625485","userName":"NataliyaSolo","userUrl":"https://itunes.apple.com/us/reviews/id196454871","version":"5.0.0","score":5,"title":"The best watch for running and exercising!","text":"I have tried a lot of different watches and finally got the Polar Vantage V. I fell in love! It’s not just sport watch it is my personal coach and motivator! Highly recommendation!","updated":"2021-03-11T17:08:30-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3811014456","userName":"Feral Dog","userUrl":"https://itunes.apple.com/us/reviews/id235845847","version":"4.0.5","score":3,"title":"Make it possible to turn off Daily Activity.","text":"I’m using the watch solely for training. I don’t need a Nanny, and I don’t wear it when I’m not running. Love the stats and the HR monitor is working great. Just shift the software to more personalized options. Unless I’m totally missing the Hidden Button, of course. Cheers.","updated":"2019-02-24T15:11:58-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2480908449","userName":"Scribby182","userUrl":"https://itunes.apple.com/us/reviews/id149110694","version":"3.7.2","score":3,"title":"Decent app","text":"The app is ok. It has some decent visuals, and I can look up my data fairly well, but it never quite shows me what I’d like to see in the way I’d like to see it. It’s also very slow at syncing with my watch, although that’s probably more the watch than app.","updated":"2018-04-28T17:18:14-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1862169609","userName":"Cisras","userUrl":"https://itunes.apple.com/us/reviews/id117719076","version":"3.6.2","score":3,"title":"Manual sync, lack of sports profiles","text":"After using a Fitbit for a long while, I was used to an auto-sync. I don’t like having to remember to manually sync up my band to the app. They also had HIIT and elliptical options for exercise. I think this app could learn a thing or two from the Fitbit app.","updated":"2017-10-20T07:37:30-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2946130945","userName":"SleepGWL","userUrl":"https://itunes.apple.com/us/reviews/id25291219","version":"3.7.5","score":5,"title":"Smart notifications","text":"Technical service unable to get smart notifications working.","updated":"2018-07-21T14:52:37-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6885842044","userName":"Dr. Mer","userUrl":"https://itunes.apple.com/us/reviews/id958184927","version":"4.10.0","score":3,"title":"Sync fail at least twice a week","text":"App is great. But sync fails way too often. It gets old after a while. Can’t enjoy benefits of app because my stats are not up to date. Due to sync fails","updated":"2021-01-18T12:36:22-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3777188442","userName":"SMan0245","userUrl":"https://itunes.apple.com/us/reviews/id227051878","version":"4.0.4","score":3,"title":"Complicated app","text":"I bought the Vantage V because I think it has the most reliable HR tracking and I’m pleased with it so far...but the app needs a less complex dashboard - I’ve worn Fitbit for years and they are best in class in syncing, easy to read dashboard.  I want to see steps, calories, HR and distance...on a simple dashboard!","updated":"2019-02-16T08:36:55-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3583511960","userName":"CirienPhoenix","userUrl":"https://itunes.apple.com/us/reviews/id161482089","version":"4.0.1","score":4,"title":"App is good, but missing community","text":"I don’t see a way to find others in the app. I wish there was a better way to find and connect with others. Otherwise, app works great, even with my super old Polar Loop.","updated":"2018-12-28T04:31:48-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2537974457","userName":"Peanuts2112","userUrl":"https://itunes.apple.com/us/reviews/id404554755","version":"3.7.2","score":5,"title":"Works awesome.","text":"I just recently purchased a polar work out heart rate monitor and this thing is awesome it is so accurate all the time I would highly recommend buying one.","updated":"2018-05-12T10:24:17-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2591708094","userName":"Litorr","userUrl":"https://itunes.apple.com/us/reviews/id148610276","version":"3.7.3","score":3,"title":"Problems synching and recording","text":"The overall idea of the app is good, however, I wish there was real time synching. I usually have a problem synching - it’s like it can’t find my device. I have to turn it off/on a few times before it works.","updated":"2018-05-24T17:31:44-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3443185563","userName":"crappyfisherman","userUrl":"https://itunes.apple.com/us/reviews/id307300617","version":"3.8.2","score":5,"title":"Great App.","text":"This app. really makes it easy to log my workouts. I have a pacemaker and Afib. The m430 and Polar Flow keep me in my training zones. My training and racing have really improved since following the Polar guide lines.","updated":"2018-11-21T04:34:30-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2233563479","userName":"SEcarolyn","userUrl":"https://itunes.apple.com/us/reviews/id208121847","version":"3.6.9","score":4,"title":"Last 2 updates destroyed my sync","text":"With the last 2 updates I can not sync with my app on my iPhone. My Bluetooth is working but the watch does not drop down. I have to sync with a cow with my computer . Grrrrr","updated":"2018-02-21T17:40:11-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6607274874","userName":"rezatea","userUrl":"https://itunes.apple.com/us/reviews/id682311005","version":"4.8.0","score":4,"title":"Great app","text":"The app has got much better since I got my v800. Smooth syncing and great features. It would be great if I could see my recovery status and progress reports as well.","updated":"2020-11-04T00:31:46-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4960882982","userName":"digitalsuze","userUrl":"https://itunes.apple.com/us/reviews/id100496253","version":"4.2.8","score":4,"title":"What happened to manual lap view?","text":"In this latest update, the ability to view data for programmed manual laps seems to have disappeared. Please bring it back so I don’t have to check the web app!","updated":"2019-10-17T07:43:34-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7402257731","userName":"werokame","userUrl":"https://itunes.apple.com/us/reviews/id961756375","version":"5.3.0","score":5,"title":"Great app","text":"Very easy to use. Gives a very detailed useful information about your workouts","updated":"2021-05-29T06:27:41-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6834376587","userName":"wildernesscpl","userUrl":"https://itunes.apple.com/us/reviews/id1214738525","version":"4.10.0","score":5,"title":"My new polar watch training device","text":"It took me awhile to pair my watch but once it paired it works great. Has plenty of great features","updated":"2021-01-05T08:55:13-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5936887687","userName":"mgymnop","userUrl":"https://itunes.apple.com/us/reviews/id1104259595","version":"4.4.4","score":5,"title":"Functional app","text":"The app is easy to use and nicely made. The integration of Apple health is buggy. My activities stopped getting imported to Apple Health. Please fix.","updated":"2020-05-12T11:58:01-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3171835140","userName":"shablam","userUrl":"https://itunes.apple.com/us/reviews/id16682710","version":"3.7.7","score":5,"title":"The right combo of functions","text":"Flow gets it right. Good aesthetic, easy to read, interesting features like the movie assembly of your route. Great to be able to overlay charts for cadence, altitude, pace, etc.","updated":"2018-09-09T09:04:18-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2149009019","userName":"Steve0360","userUrl":"https://itunes.apple.com/us/reviews/id241056212","version":"3.6.7","score":5,"title":"Great App","text":"I can always count on Polar Flow! Great sleep monitor and work out monitor and the phone app is more reliable than the computer app or website as the transmission of data is smoother!","updated":"2018-01-31T01:29:49-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3000990599","userName":"niirumner","userUrl":"https://itunes.apple.com/us/reviews/id650068053","version":"3.7.5","score":4,"title":"Reasonably easy to use...","text":"Cons\n you need to use a pc. \nIt’s hard to figure out how to manually enter a non polar program. \nThere is only one program per distance. \nSyncing sometimes takes 5-10 tries. \n\nPros\nOnce you are in a program, it is really easy to use\nWhen syncing works, it auto updates Strava- my record keeper of choice. \nI can personalize the display\nYou can see the hr zone displayed easily for intervals and the watch alerts you to slow hr or transition.","updated":"2018-08-01T04:56:08-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7810378957","userName":"DH Washaibgton","userUrl":"https://itunes.apple.com/us/reviews/id140581009","version":"5.6.0","score":5,"title":"Pollar","text":"I’m new to Polar and am still learning what information I can learn about myself and my training sessions! So far it is amazing and I’m learning a lot.","updated":"2021-09-15T18:06:58-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4394039870","userName":"hash42","userUrl":"https://itunes.apple.com/us/reviews/id17234311","version":"4.2.0","score":5,"title":"Great way to track your daily activity","text":"I use Polar Flow to make sure I hit my daily goals for both activity and fitness, it’s easy and fast to use.","updated":"2019-06-30T17:39:49-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1790216798","userName":"Jacque Wyatt","userUrl":"https://itunes.apple.com/us/reviews/id200803648","version":"3.6.1","score":5,"title":"A MUST HAVE GADGET","text":"polar is the BEST Heart Rate Monitor that I have ever owned. In bought the Apple Watch and had to return it after 30\nDays. It did not give me accurate reading of Heart Rate and Calories burned throughout the day and for an exercise.","updated":"2017-09-14T15:56:07-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3221253647","userName":"app not sarisfied","userUrl":"https://itunes.apple.com/us/reviews/id345450224","version":"3.7.8","score":2,"title":"App update","text":"This app just updated yesterday and for some reason every time I try to open it, it closes immediately. What the heck? I can’t sync or see what my stats are if I can’t get it to stay open. I even shut my phone down to see if that would help. NEVER had this issue before the update!!!","updated":"2018-09-23T05:53:36-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2113576459","userName":"MDF32571","userUrl":"https://itunes.apple.com/us/reviews/id167476154","version":"3.6.7","score":3,"title":"Okay, but...","text":"Doesn’t sync well with iPhones. I had a Fitbit but it was very resilient - not waterproof.  The Polar watch is nice, but the applications do not work well.  They are SLOW to synchronize for downloading my workouts.  Also, the watch doesn’t constantly stay connected to my phone.","updated":"2018-01-21T19:14:15-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1991364016","userName":"AngFad","userUrl":"https://itunes.apple.com/us/reviews/id24220138","version":"3.6.6","score":4,"title":"Great so far","text":"Loving this device so far. Easy to record my Les Mills workouts, track sleep and activity. Love the desktop and mobile views as well. So far loving it. \n\nMy one beef would be that the small sized wristband only comes in 2 colors.","updated":"2017-12-12T12:24:13-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7529207733","userName":"Ceddiecolon","userUrl":"https://itunes.apple.com/us/reviews/id25278926","version":"5.4.1","score":5,"title":"Love it","text":"Okay, get it sync and go. You’ll love it. Connect Strava,Komoot, MyAltitude all with the Polar Flow and you’ll have more Data than anything else you have ever seen.","updated":"2021-07-01T20:04:01-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7286042263","userName":"B4 Picture Model","userUrl":"https://itunes.apple.com/us/reviews/id1219096282","version":"5.2.1","score":5,"title":"Vantage M2","text":"I don’t care if I broke up with your mom, she gave this to me.  It is awesome. Even better with the Polar Flow.  Fits well, good read outs and easy to learn buttons.","updated":"2021-05-01T11:37:13-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3335547297","userName":"pakorrone","userUrl":"https://itunes.apple.com/us/reviews/id176657572","version":"3.8.1","score":5,"title":"about sleeping tracker","text":"It doesn’t track if I wake up for 3 minutes. It doesn’t keep those previous hours.","updated":"2018-10-23T11:45:41-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3156828411","userName":"dpgkBUTTERNUT","userUrl":"https://itunes.apple.com/us/reviews/id138691618","version":"3.7.7","score":4,"title":"Trouble syncing watch with phone","text":"My watch takes hours to sync with my phone. Sometimes it try’s to sync for 8 hours (overnight) and can never complete the task. Frustrating.","updated":"2018-09-05T10:30:07-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6529333526","userName":"Champion Aries","userUrl":"https://itunes.apple.com/us/reviews/id476662494","version":"4.7.0","score":5,"title":"Watch","text":"The Polar Flow works well except for the watch.  It will not connect to the GPS until the first 100 yards or so.\nDon’t know what to do.","updated":"2020-10-12T19:40:21-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7034423447","userName":"Ending Shadows","userUrl":"https://itunes.apple.com/us/reviews/id142206779","version":"5.0.0","score":1,"title":"Great app if not for the syncing issues.","text":"As pretty as the app is, it feels as though Polar wants you to use their website. Watch worked great when I first got it. Over time it developed syncing issues with the app. At one point, it stopped syncing entirely for a period of two weeks. For as expensive as Polar watches are, that’s pretty inexcusable.","updated":"2021-02-24T14:03:04-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6835246542","userName":"hgaleo","userUrl":"https://itunes.apple.com/us/reviews/id167086750","version":"4.10.0","score":4,"title":"Sync","text":"Polar flow works fairly well. Intermittently it does not link with Training Peaks. I have tried the Help columns for both apps and neither is very useful. When it is syncing consistently- it’s great","updated":"2021-01-05T13:58:18-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3907413191","userName":"am rashidi","userUrl":"https://itunes.apple.com/us/reviews/id354193645","version":"4.0.6","score":5,"title":"A perfect training app","text":"It gives good and comprehensive analysis. Helps you to have better balance between workout and rest.","updated":"2019-03-21T03:10:51-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3341222379","userName":"Maple Heights Ohio","userUrl":"https://itunes.apple.com/us/reviews/id14115736","version":"3.8.1","score":5,"title":"Great App","text":"Haven’t used the app to it’s full potential but it works for my needs. Like that I can look back at my progress and consistency.","updated":"2018-10-25T01:30:58-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2098602178","userName":"Powerseller 1234","userUrl":"https://itunes.apple.com/us/reviews/id469630468","version":"3.6.7","score":2,"title":"Glitchy and slow to update","text":"Not a great app, its glitchy and requires the app to be deleted and reinstalled every couple of weeks to show exercise data from Pilar Beat.\n\nIntegration with My Fitness Pal is intermittent at best, this may not be a Polar issue but the other 3 apps that feed into My Fitness Pal work every time. \n\nOn numerous occasions my exercise info from Beat does t transfer across or takes up to 24 hrs, again requiring a reinstall. \n\nThis is a sloppy app that needs looking at by Polar as I no longer use it and have moved to Record by Under Armour instead.","updated":"2018-01-17T09:20:16-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7955943819","userName":"Bdombs","userUrl":"https://itunes.apple.com/us/reviews/id135785059","version":"5.7.1","score":1,"title":"Absolutely Awful Product","text":"Polar Flow doesn’t work along with the device. It always says that the polar needs do be updated even though the polar already has been updated. And when you turn it on and try to connect it says, “can’t connect to sensor”. Need fo fix this app and product!","updated":"2021-10-26T06:59:33-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6782062334","userName":"Orimunoz","userUrl":"https://itunes.apple.com/us/reviews/id429281091","version":"4.10.0","score":4,"title":"Polar & vantage M.","text":"constantly resetting the watch which is annoying. constantly resetting the watch which is annoying.","updated":"2020-12-22T10:19:17-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4054825247","userName":"Love from Colorado","userUrl":"https://itunes.apple.com/us/reviews/id31020211","version":"4.1.1","score":3,"title":"Questions","text":"Why doesn’t it sync automatically? I am attached to blue tooth, but I have to hit the sync buttons each time to upload my days. It doesn’t automatically link in real time or even when I open the app","updated":"2019-04-24T09:54:29-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7124524398","userName":"runnergirl2020","userUrl":"https://itunes.apple.com/us/reviews/id1229258010","version":"5.0.0","score":5,"title":"Dependable and accurate!!","text":"I have always been very pleased with Polar Flow for my serious fitness goals and preparation for races.","updated":"2021-03-20T09:19:04-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2038430702","userName":"Later_Dude","userUrl":"https://itunes.apple.com/us/reviews/id190063579","version":"3.6.6","score":4,"title":"So far, so good","text":"I never give anything five stars to start. I’m still learning all this app and device can do but will upgrade my rating later after more time using it.","updated":"2017-12-29T08:03:46-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7796013502","userName":"Aina_81","userUrl":"https://itunes.apple.com/us/reviews/id319933763","version":"5.6.0","score":2,"title":"Difficult to sync","text":"I like the design of the Polar Ignite 2 but most of the times has issues in synchronization. You need to sync very often, otherwise you loose the data. In addition when swimming, the touchscreen stops working!","updated":"2021-09-11T13:36:51-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4827888735","userName":"Nooruddin1","userUrl":"https://itunes.apple.com/us/reviews/id122023134","version":"4.2.6","score":5,"title":"Love it!","text":"I utilized Strava before it became an advertisemen-based/social experience because I knew it was a way to promote health for all. Once I felt the this goal was met, I transitioned directly into Polar. Seamless and worth it!","updated":"2019-09-23T04:06:53-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1851121347","userName":"SecretsToAGirlLikeMe","userUrl":"https://itunes.apple.com/us/reviews/id207138499","version":"3.6.2","score":5,"title":"I FREAKING LOOOOOOOOOOVE POLAR!","text":"I’m a YouTuber and I love working out and even wanted to do reviews of the polar m400 and boast about it in some of my fitness videos so POLAR SPONSOR ME PLEEAAAAASE! Haha but seriously though, this is the best fitness watch & tech brand I have ever used! Much love Polar! Keep it up!","updated":"2017-10-15T11:28:37-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3556307955","userName":"jtzaimes","userUrl":"https://itunes.apple.com/us/reviews/id179362918","version":"4.0.1","score":5,"title":"Polar Flow 1","text":"Great activity monitor even though it has no\nHeart monitor for an old model still works great, may have to replace batteries after so many years.","updated":"2018-12-21T09:12:03-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7057644623","userName":"ktrj720","userUrl":"https://itunes.apple.com/us/reviews/id85016045","version":"5.0.0","score":3,"title":"Can’t adjust workouts","text":"Appreciate that this is the only free app that gives audio feedback on heart rate, but wish it allowed you to adjust the workouts. I don’t want to include my warmup in my stats.","updated":"2021-03-02T11:13:59-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3793036967","userName":"insanelyblissful","userUrl":"https://itunes.apple.com/us/reviews/id29827596","version":"4.0.5","score":3,"title":"Good info, not intuitive interface","text":"I like the actual content, but the way you get to it could be much friendlier on the app. Fitbit seems to have the app portion figured out, but Polar is better for more rigorous info about your activities.","updated":"2019-02-20T06:11:35-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3534309338","userName":"ddelepiani","userUrl":"https://itunes.apple.com/us/reviews/id229803285","version":"4.0.1","score":5,"title":"Slow sync","text":"I really love Polar but if something you should change is the Sync speed. It’s really really slow","updated":"2018-12-15T09:46:06-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6083267996","userName":"Mrz.Cortez","userUrl":"https://itunes.apple.com/us/reviews/id526370141","version":"4.4.6","score":5,"title":"Great set up! Easy to use!","text":"User friendly! Great features! It has a ton of excellent exercises to choose from!!! Love it!","updated":"2020-06-16T07:35:26-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4906626628","userName":"brian.long","userUrl":"https://itunes.apple.com/us/reviews/id24699244","version":"4.2.7","score":5,"title":"Excellent Sleep Tracking","text":"I appreciate the sleep tracking feature. It is a big help to identify periods of over-training.","updated":"2019-10-07T16:10:05-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4778842264","userName":"igorzing","userUrl":"https://itunes.apple.com/us/reviews/id536431852","version":"4.2.5","score":5,"title":"Can’t upload workouts","text":"Can’t upload workouts like other applications allowed it, garmin ... 😩","updated":"2019-09-14T13:24:21-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2760179790","userName":"lainnie#1","userUrl":"https://itunes.apple.com/us/reviews/id838173477","version":"3.7.4","score":4,"title":"Not syncing","text":"I love the tracking graphs any pie charts. Though the syncing is par standard it flat want 80% of the time. I have to delete the app and reinstall on my apple 7. I which I knew why or how to make it sync on command.","updated":"2018-06-24T07:21:28-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1820800114","userName":"mikeofeconomy","userUrl":"https://itunes.apple.com/us/reviews/id154772492","version":"3.6.2","score":4,"title":"Polar Flow data informative","text":"Loving my new A370+H10 combo and Polar Flow and Polar Beat apps. Only wish syncing was a bit smoother. It works, but sometimes takes a couple tries. Getting a new iPhone soon and hope that smooths it out.","updated":"2017-10-01T07:05:07-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5399948852","userName":"mkx3","userUrl":"https://itunes.apple.com/us/reviews/id114387249","version":"4.3.4","score":4,"title":"App ok, syncing VERY slow","text":"The app is OK, simpler than alternatives but still needlessly complicated. Syncing my M430 watch is very slow: it just took 3 minutes to sync 1 run and 1 bike ride. That is not ok.","updated":"2020-01-13T14:31:32-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5347937793","userName":"westmer.","userUrl":"https://itunes.apple.com/us/reviews/id21701962","version":"4.3.3","score":4,"title":"Limited for cycling","text":"This app should be able to sync with a polar cadence sensor and record my rpms. If the polar watch can do it I’m sure the people developing this app can figure it out.","updated":"2020-01-01T11:04:52-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5125333315","userName":"Siffert1","userUrl":"https://itunes.apple.com/us/reviews/id386835024","version":"4.3.0","score":2,"title":"Constantly Re Syncs","text":"I have this app on my Dell Desktop computer running Win7 with zero problems hooked to my Polar A370. However, using this app on my iPhone 6s is pretty much non functional as it cannot hold a sync (and thus never saving anything) on my Polar A370 with the phone.","updated":"2019-11-11T17:27:22-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3635448670","userName":"Eilanna537","userUrl":"https://itunes.apple.com/us/reviews/id4719948","version":"4.0.2","score":5,"title":"Apple Watch?","text":"I love the Polar Flow app I just don’t like that it doesnt have an Apple Watch version. I’d like to use my Apple Watch instead since I can use it all day.","updated":"2019-01-10T16:02:48-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6753082615","userName":"Alpha.c","userUrl":"https://itunes.apple.com/us/reviews/id27593084","version":"4.9.0","score":5,"title":"Ok interface, needs work","text":"Almost 50% of uploads fail. Updating the softaa we re is alonproblematic.","updated":"2020-12-14T09:40:39-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2888403474","userName":"Sav-D","userUrl":"https://itunes.apple.com/us/reviews/id814322167","version":"3.7.5","score":2,"title":"App doesn’t load well","text":"I love the watch and I was excited to use the app but the app doesn’t sync my data. I refresh the app all day and my workouts and sleep still don’t appear. My watch registers everything but the app doesn’t. Hopefully they update it so it’s more compatible.","updated":"2018-07-11T19:36:11-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6904327223","userName":"Fixedwing2019","userUrl":"https://itunes.apple.com/us/reviews/id368986849","version":"4.11.0","score":4,"title":"Treadmill run","text":"According to the treadmill I am running 2 miles. Heart rate the polar has it, but measuring distance I think the treadmill has it. Maybe allow for adjustments on app, and the app learns ea h person’s stride.","updated":"2021-01-23T07:17:40-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6771437794","userName":"butchthekid","userUrl":"https://itunes.apple.com/us/reviews/id22505724","version":"4.10.0","score":4,"title":"The One Downside","text":"I really enjoy my Polar Flow 400.  The one downside is battery life.  With an improved battery function and life, it could be the perfect fit device.","updated":"2020-12-19T11:03:44-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6386961685","userName":"Saeed Alnuimi","userUrl":"https://itunes.apple.com/us/reviews/id144162320","version":"4.5.0","score":5,"title":"Please I need Arabic language I used polar for long time thanks lot","text":"Please I need Arabic language I used polar for long time thanks lot","updated":"2020-09-02T03:48:26-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5433455941","userName":"RAMinPF-ID","userUrl":"https://itunes.apple.com/us/reviews/id1125073669","version":"4.3.4","score":5,"title":"Great watch!","text":"Reliable, easy to use, great battery life, and quick battery recovery. Very tough, well designed. I’m a happy camper!\n\nBob Miller","updated":"2020-01-21T20:57:38-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4502898868","userName":"Trackee1","userUrl":"https://itunes.apple.com/us/reviews/id11289554","version":"4.2.1","score":5,"title":"Polar A370","text":"absolutely pleased with my watch.  Daily use.  Good motivational tool.  Easy to use and very nice display screen.  Upgraded from A360 watch.  Prefer it over Fitbit Charge 3.","updated":"2019-07-22T12:14:45-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2614561624","userName":"ciccio lexington","userUrl":"https://itunes.apple.com/us/reviews/id666296444","version":"3.7.3","score":5,"title":"Question to ctm service","text":"I submitted a question to customer service please make sure they respond thank you","updated":"2018-05-29T18:09:54-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3506277864","userName":"fliebynight","userUrl":"https://itunes.apple.com/us/reviews/id24967789","version":"4.0.0","score":2,"title":"Notifications stopped with new update","text":"I liked the app and smart notifications on my watch, but the notifications stopped with the new update & Polar Flow is no longer in Settings/Notifications. Hoping it gets fixed with the next update.","updated":"2018-12-07T21:03:20-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6157259910","userName":"mcgomp1588","userUrl":"https://itunes.apple.com/us/reviews/id296295880","version":"4.4.7","score":5,"title":"Info","text":"Whatever you need, whenever you need it.","updated":"2020-07-04T10:14:40-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7388547885","userName":"mightymom12362","userUrl":"https://itunes.apple.com/us/reviews/id1048937834","version":"5.3.0","score":3,"title":"Mediocre","text":"The watch is amazing! The app doesn’t always sync properly and I am left looking at my data from prior days on my phone... please fix this bug!","updated":"2021-05-25T17:36:30-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1858624404","userName":"Jinalru","userUrl":"https://itunes.apple.com/us/reviews/id400899173","version":"3.6.2","score":4,"title":"A360","text":"can you give another update for A360 firmware on calculation towards the distance of running than compiling it in the daily walk when doing a running activity","updated":"2017-10-18T18:58:48-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7222763874","userName":"Romeo Scallion","userUrl":"https://itunes.apple.com/us/reviews/id903227603","version":"5.1.0","score":1,"title":"Watch issues","text":"Watch is great but lately tracking calories and heart rate is inaccurate  as my intense workouts show my heart rate low as it isn’t reading properly. Keeps disconnecting and having to re-sync multiple times. Will be switching to the Apple Watch if not resolved","updated":"2021-04-14T15:16:57-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5518504115","userName":"RSMITH030","userUrl":"https://itunes.apple.com/us/reviews/id241252754","version":"4.3.5","score":5,"title":"Keeps me accountable","text":"Life changing app from a health POV. Once I figured out what I was dealing with - it all makes sense now. Thank you, Polar.","updated":"2020-02-11T13:44:08-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2881060307","userName":"Avg Guy","userUrl":"https://itunes.apple.com/us/reviews/id7605712","version":"3.7.5","score":5,"title":"New Rules - blackmail - holding my data hostage","text":"What kind of company blackmail their customers and holds their data hostage? \n\n1. No I do not consent to allowing my personal data to be moved / transferred to another countrygor processing. What laws govern there? How am I legally protected? \n\nSince I cannot agree to your license:\nReturn all of my data \nWhen I receive my copy destroy your copy of my data","updated":"2018-07-10T17:35:56-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4314487424","userName":"Hawk GT","userUrl":"https://itunes.apple.com/us/reviews/id85012376","version":"4.1.5","score":1,"title":"If only Polar software could sync with polar hardware","text":"I bought the HR 10 to measure my heart rate, and it seems to work with the HRV4TRAINING app. However, it won’t pair with polar’s own app anymore.  So my guess is that this software is bugggy.  Honestly, just buy a Fitbit.  They worked fine for me. Polar’s stuff hr7 and hr10 have worked on the rare occasion , but mostly just leave me frustrated.","updated":"2019-06-14T06:22:36-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2867362408","userName":"Ethiopia20008","userUrl":"https://itunes.apple.com/us/reviews/id42048255","version":"3.7.5","score":5,"title":"polar best fitness tracker","text":"i try different fitness tracker but i end up coming back to polar has everything you ask \nthanks polar M400","updated":"2018-07-08T19:32:33-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1814793270","userName":"RBCOD9910","userUrl":"https://itunes.apple.com/us/reviews/id27114604","version":"3.6.2","score":5,"title":"Best application I ever had","text":"I an excellent application have all the information you need yo improved your training every day","updated":"2017-09-28T05:23:24-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4947282728","userName":"Bobbychris","userUrl":"https://itunes.apple.com/us/reviews/id306651826","version":"4.2.7","score":5,"title":"Satisfied","text":"Thanks for the user friendly device and service.","updated":"2019-10-14T10:24:10-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7023306422","userName":"Bb234$&","userUrl":"https://itunes.apple.com/us/reviews/id186953327","version":"5.0.0","score":1,"title":"Sleep monitor useless","text":"The watch and app are supposed to track your sleep cycles. This feature is completely useless because it thinks you fall asleep hours before you actually do and there is no way to adjust app or settings to fix. Makes it useless","updated":"2021-02-21T17:02:14-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5320427279","userName":"lllusion","userUrl":"https://itunes.apple.com/us/reviews/id138155889","version":"4.3.3","score":4,"title":"Good info","text":"Polar flow provides objective insight into my sleep. Unfortunately there’s no way to delete activities entered erroneously by the watch’s automatic activity tracking.","updated":"2019-12-25T21:23:23-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4397630195","userName":"Swilson186","userUrl":"https://itunes.apple.com/us/reviews/id30355460","version":"4.2.0","score":4,"title":"Lovely app","text":"Does everything I need with my M400 watch. Had very clear and easy to read graphics. An excellent motivational tool for getting to 100% of my exercise in a day.","updated":"2019-07-01T10:38:18-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3197242722","userName":"kvtfox","userUrl":"https://itunes.apple.com/us/reviews/id30530495","version":"3.7.7","score":4,"title":"Like some things...","text":"It is hard to get it too synch up and it doesn’t record your day just training sessions. And heart rate seems off sometimes.","updated":"2018-09-16T14:44:38-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2877898336","userName":"Maxmovie","userUrl":"https://itunes.apple.com/us/reviews/id73028512","version":"3.7.5","score":5,"title":"Great app","text":"I’ve been using this app for 3 years with an M400, I just had to replace the m400 with the m430, looking forward the new features.","updated":"2018-07-10T05:34:16-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6892508469","userName":"b_a_j_9","userUrl":"https://itunes.apple.com/us/reviews/id39340500","version":"4.11.0","score":5,"title":"Great update","text":"This is the best way to track your workouts. Great update that cleared out clutter and made the App better","updated":"2021-01-20T06:26:17-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7241302396","userName":"Ronrythm","userUrl":"https://itunes.apple.com/us/reviews/id15459715","version":"5.1.0","score":3,"title":"Needs some work","text":"Sometimes it connects, sometimes it doesn’t. Sometimes my workouts show up days later.","updated":"2021-04-19T14:42:29-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6771921023","userName":"Woman from Malvia","userUrl":"https://itunes.apple.com/us/reviews/id170481356","version":"4.10.0","score":5,"title":"I love it!","text":"I find it reliable, efficient, easy to use and with a very attractive design!","updated":"2020-12-19T14:20:49-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6867295716","userName":"Oregon Wolverine","userUrl":"https://itunes.apple.com/us/reviews/id167575586","version":"4.10.0","score":3,"title":"When it works well, it’s great.  Software is wonky, syncing often hard to accomplish","text":"Wish it was overall easier to use.","updated":"2021-01-13T20:07:45-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4921034058","userName":"Roses333777","userUrl":"https://itunes.apple.com/us/reviews/id12649539","version":"4.2.7","score":5,"title":"LOVE MY POLAR FLOW","text":"Easy to use.   Accurate.  One thing I miss.  My other polar watch would wish me a happy birthday.  I know it is silly.   Wish this one did also.","updated":"2019-10-10T19:27:10-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4021247384","userName":"M_Raffle","userUrl":"https://itunes.apple.com/us/reviews/id415487991","version":"4.1.1","score":5,"title":"ANT+ Support is Awesome","text":"Thanks so much for adding ANT+ support on the H10!  Stoked to use that vs the Garmin that I got just for use on the cyclometer.  App works well, but don’t use it all that often.","updated":"2019-04-16T13:05:42-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1861942806","userName":"Zolo-K9","userUrl":"https://itunes.apple.com/us/reviews/id36319303","version":"3.6.2","score":5,"title":"Love the Flow","text":"Generally very pleased with the polar flow app. I use it every day—sometimes the sync takes some time or a couple of tries.","updated":"2017-10-20T05:42:55-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6633994114","userName":"ZahraRa13","userUrl":"https://itunes.apple.com/us/reviews/id449008059","version":"4.8.0","score":5,"title":"Zahra","text":"I love this app so much because I can check my training every time...","updated":"2020-11-11T10:08:41-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7851544980","userName":"apre04","userUrl":"https://itunes.apple.com/us/reviews/id200614014","version":"5.7.0","score":2,"title":"Custom Training","text":"The custom training option or favorites needs work. Its to simple it needs more customization to adjust coach training. The app doesn’t allow to add a step inside the training workout.","updated":"2021-09-27T11:10:34-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6521605248","userName":"Chuy78610","userUrl":"https://itunes.apple.com/us/reviews/id635335297","version":"4.7.0","score":5,"title":"Love my Polar","text":"I like the Polar ... it lets me track all my activities and makes me aware if I am training properly.","updated":"2020-10-10T13:01:16-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4997236864","userName":"Cladda","userUrl":"https://itunes.apple.com/us/reviews/id160863503","version":"4.2.8","score":5,"title":"Perfect tracker","text":"It’s is easy to find all information about the fitness session. Love that my workouts can be specified to LesMills workouts","updated":"2019-10-22T06:24:46-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6395979320","userName":"Nash McNieley","userUrl":"https://itunes.apple.com/us/reviews/id103081259","version":"4.5.0","score":4,"title":"Just an app","text":"Love the device and supplemental app.  Sometimes I wonder whether or not the heart rate display and sleep analysis is accurate (Vantage M), but overall happy.","updated":"2020-09-04T17:44:24-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2981531836","userName":"Lockport5","userUrl":"https://itunes.apple.com/us/reviews/id215157433","version":"3.7.5","score":5,"title":"All around Greatness","text":"I have a M400 watch, it is really easy to use and the app is also easy to navigate.","updated":"2018-07-28T01:14:38-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4836622596","userName":"Frisco1366","userUrl":"https://itunes.apple.com/us/reviews/id104368098","version":"4.2.6","score":4,"title":"Why so long to upload","text":"It takes too long to upload a file(s) via the app on my iPhone. My Garmin is ultra fast compared to this Polar GPS watch.","updated":"2019-09-25T09:09:28-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4717260173","userName":"Latimer13","userUrl":"https://itunes.apple.com/us/reviews/id138487287","version":"4.2.3","score":3,"title":"Manual sync?","text":"This appears to be a pretty accurate HR monitor. It looks like you have to sync it to polar flow in order to check you progress on your phone. I like the fit bit mobile much better.","updated":"2019-09-02T16:34:08-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3904588397","userName":"Assjack 2","userUrl":"https://itunes.apple.com/us/reviews/id130929043","version":"4.0.6","score":1,"title":"Constant syncing problems OH-1 & Polar Flow","text":"Constant syncing problems with Polar OH-1 and Polar Flow almost render the device useless. I can’t count how many time I’ve recorded training sessions and not been able to download them due to syncing problems (after spending hours trying to figure out the problem). This is a major issue.","updated":"2019-03-20T09:02:24-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3422736436","userName":"kkbrkadlb","userUrl":"https://itunes.apple.com/us/reviews/id934269291","version":"3.8.2","score":3,"title":"Updating","text":"Takes a while to upload the information.","updated":"2018-11-15T19:29:25-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6257930353","userName":"Douglasarms","userUrl":"https://itunes.apple.com/us/reviews/id267220145","version":"4.4.8","score":5,"title":"I’ve updated...","text":"Syncing failed 😳 over and over, north and south.\n\nStanding by for next patch! ☹️","updated":"2020-07-29T21:25:06-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1851962894","userName":"Weedowee","userUrl":"https://itunes.apple.com/us/reviews/id349629967","version":"3.6.2","score":4,"title":"Sleep tracker","text":"Not really impressed with the sleep tracker module. No way to set the time that you go to bed and wake up to see how many hours of restful sleep you are really getting.","updated":"2017-10-15T21:44:48-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6801382468","userName":"rfryszrak","userUrl":"https://itunes.apple.com/us/reviews/id832764650","version":"4.10.0","score":3,"title":"Mediocre product","text":"Horrible syncing issues.  Entire days with no data recorded even though watch is on tightly.  Really not what I had hoped for.   No help from supprt.","updated":"2020-12-27T17:50:47-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6763740104","userName":"jason1200","userUrl":"https://itunes.apple.com/us/reviews/id160223604","version":"4.10.0","score":3,"title":"Okay","text":"Wish we could update training times if we forget to stop the training on the watch. Ned more user friendly actions.","updated":"2020-12-17T09:48:58-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4748923102","userName":"JBLNOKC","userUrl":"https://itunes.apple.com/us/reviews/id25789911","version":"4.2.4","score":5,"title":"Polar a necessary tool in the toolbox","text":"A tool is made to use and polar is a sharp edged ax that cuts away at the dead tree of passivity. It motivates and keeps you engaged , focusing on health and performance.","updated":"2019-09-08T09:00:09-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4151459833","userName":"Pac NW Racer","userUrl":"https://itunes.apple.com/us/reviews/id1018967076","version":"4.1.2","score":5,"title":"Polar Flow","text":"Comprehensive reporting that is easily accessible. Clarity in reports gives you feedback upon which to act upon. From recovery to sleep to intensity .","updated":"2019-05-14T19:10:08-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6920195598","userName":"jennaglenellen","userUrl":"https://itunes.apple.com/us/reviews/id441964570","version":"4.11.0","score":3,"title":"Great but disappointing","text":"Polar watch is my absolute favorite to use however this app RARELY connects to my watch. Therefore I cannot see any of the data day to day.","updated":"2021-01-27T08:39:50-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4870910559","userName":"PhillyRunningMan","userUrl":"https://itunes.apple.com/us/reviews/id132802880","version":"4.2.6","score":4,"title":"Nice training tool","text":"It is fairly easy to use but let’s you do some pretty sophisticated training without getting in your way.  I’m a fan","updated":"2019-10-01T16:05:49-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4731709238","userName":"Ajparmar","userUrl":"https://itunes.apple.com/us/reviews/id108443156","version":"4.2.4","score":1,"title":"Slow and updates wrong data to Apple health","text":"App is very slow to update data from the watch. It also sends wrong data to Apple health app. When data is synchronized to Apple, it duplicates steps, miles etc if you had phone in your pocket while watch was recording the activity.","updated":"2019-09-05T12:03:01-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2614634059","userName":"rolandomota1","userUrl":"https://itunes.apple.com/us/reviews/id172240170","version":"3.7.3","score":5,"title":"Great watch","text":"This watch is amazing and let’s you track your daily progress! Best heart monitor watch on the market.","updated":"2018-05-29T18:35:37-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5263207184","userName":"abner001","userUrl":"https://itunes.apple.com/us/reviews/id885214431","version":"4.3.3","score":5,"title":"Working fine","text":"At first didn’t know how to sync. Now work s fine.","updated":"2019-12-12T03:24:14-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1912200804","userName":"Skyhawkd","userUrl":"https://itunes.apple.com/us/reviews/id28759196","version":"3.6.4","score":2,"title":"No longer syncs most of the time.","text":"I used to really like the app and had no problems syncing until the most recent version. Now it never wants to sync with my phone and I constantly have to sync by plugging into my computer.","updated":"2017-11-10T18:55:51-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6904258193","userName":"Foreign Bloke","userUrl":"https://itunes.apple.com/us/reviews/id996180689","version":"4.11.0","score":2,"title":"Disappointed","text":"Polar products have a clumsy interface, no longer syncs with my iMac, and the app is not much better. At least the watch has a decent battery life.","updated":"2021-01-23T06:57:06-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4336698642","userName":"Ralphbois","userUrl":"https://itunes.apple.com/us/reviews/id106494608","version":"4.1.5","score":5,"title":"Rafa","text":"Polar is truly the most reliable gadget I’ve encountered so far, the accuracy and reliability \nI experienced with Polar is none other comparable. Hat off.","updated":"2019-06-18T18:42:14-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4739815088","userName":"jeff24paul","userUrl":"https://itunes.apple.com/us/reviews/id695432965","version":"4.2.4","score":3,"title":"love the app & the watch, but...","text":"I've had to restart my watch 2x in the last 2 days because, for some reason, it loses Bluetooth connection. maybe the latest update??","updated":"2019-09-06T21:48:20-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3439647872","userName":"68-69","userUrl":"https://itunes.apple.com/us/reviews/id307168093","version":"3.8.2","score":5,"title":"Polar App","text":"Love my Polar watch and app.  Easy to use, tracks my daily exercise and calorie burn. Syncing is a breeze.   Highly recommend using .","updated":"2018-11-20T05:25:14-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3226499739","userName":"Hyppytyyny","userUrl":"https://itunes.apple.com/us/reviews/id782856368","version":"3.7.8","score":5,"title":"Since the latest update, the app is not usable anymore","text":"Dear developer team,\n\nPlease get this fixed! I am relying on your app to manage my training. I raised a support ticket this morning. It seems to be the latest app version after iOS 12.0 on my iPhone 8.\n\nLooking forward to some quick turnaround.\n\nCheers,\nM","updated":"2018-09-24T16:20:22-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2133044174","userName":"Tonicwax","userUrl":"https://itunes.apple.com/us/reviews/id188832032","version":"3.6.7","score":1,"title":"Issues syncing active calories from workouts with Apple health","text":"Does not sync workout calories with Apple Health.  This limits viewing all of your workout details through any other App that reads data from Apple Health.\n\nSurprisingly, if you use Polar HR  Monitor with competitors apps, it syncs just fine\n\nI recommend using Under Amor Record App.","updated":"2018-01-27T07:17:07-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6432979229","userName":"RoseFattaMari","userUrl":"https://itunes.apple.com/us/reviews/id22796866","version":"4.5.0","score":1,"title":"Not up to date","text":"The most recent activity recorded after syncing today, is Sept 11. Today is the 15th. Why is that?\nAlso, I am unable to change the number of steps for my goal. It should be 10,000, but it is stuck at 6,000 as my goal. 😢","updated":"2020-09-15T15:24:27-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6066749272","userName":"tom&Savannah","userUrl":"https://itunes.apple.com/us/reviews/id145931132","version":"4.4.6","score":5,"title":"Great trading tool","text":"Better than Apple Watch for training.  I use it with scale too.","updated":"2020-06-12T05:40:26-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2941547295","userName":"memdal1","userUrl":"https://itunes.apple.com/us/reviews/id390271496","version":"3.7.5","score":3,"title":"Polar 360a","text":"Not sure if other polars work but when I forget my wrist band, I would like for the polar to take my track my steps, the Fitbit does that even when you don’t wear your wrist band but have your phone!","updated":"2018-07-20T16:43:51-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7688415192","userName":"Luthgar","userUrl":"https://itunes.apple.com/us/reviews/id177872299","version":"5.5.0","score":4,"title":"One Missing Feature","text":"I love my Polar Vantage M and the flow app is a good companion. It would be 5 star awesome if I could selectively upload training activity to Strava.","updated":"2021-08-13T07:26:55-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7498703872","userName":"SajaKooks","userUrl":"https://itunes.apple.com/us/reviews/id459189246","version":"5.4.1","score":1,"title":"Too little privacy","text":"This app saves and releases any information as they see fit in their privacy agreement it states multiple concerning items. This app was immediately deleted off of my phone. Maybe be more private and less invasive","updated":"2021-06-23T16:41:54-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4414550001","userName":"all nanes taken","userUrl":"https://itunes.apple.com/us/reviews/id427144342","version":"4.2.0","score":5,"title":"Polar","text":"Love my Polar watch. Sad that it is no longer working. Will be upgrading soon. Can’t wait to continue using Polar Flow to stay in good health!","updated":"2019-07-05T06:34:55-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5213115304","userName":"vegasgirl78","userUrl":"https://itunes.apple.com/us/reviews/id30525549","version":"4.3.2","score":1,"title":"Smart notifications not working","text":"Frustrating that the smart notifications stopped working after the update. I’ve uninstalled, reset over and over and over. Please fix! super annoying","updated":"2019-11-29T11:25:58-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2998562137","userName":"VJcustomer","userUrl":"https://itunes.apple.com/us/reviews/id246644657","version":"3.7.5","score":5,"title":"Good App","text":"I wish this had an area to track weight or ounces of water for each day. Otherwise a great app!","updated":"2018-07-31T17:50:02-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4407447312","userName":"Psych_ko","userUrl":"https://itunes.apple.com/us/reviews/id187068915","version":"4.2.0","score":3,"title":"Great app","text":"Need to speed up the upload time. That is ridiculously slow. Other than that it gives great feedback and keeps me motivated and on track.","updated":"2019-07-03T18:42:04-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1795777849","userName":"2outrageous","userUrl":"https://itunes.apple.com/us/reviews/id109730704","version":"3.6.1","score":5,"title":"Using w Polar A370.","text":"Amazing range of features. Use it every day to review & save info on heart rate, sleep & activity. Easy to sync & recharge - a d looks good, too. Great job!","updated":"2017-09-17T22:04:56-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2590309996","userName":"Chloe_Chaos_","userUrl":"https://itunes.apple.com/us/reviews/id38982220","version":"3.7.3","score":1,"title":"It was great...","text":"until they updated and asked for all of these permissions for me to agree to such as:\n- Polar may collect and process my personal data \n- My personal data may be transferred and processed outside my country of origin\n- Polar may collect and process my sensitive personal data \n\nThis lead me to delete all of my data and delete the app. I can still see all of the health data from my watch, just a bummer that Polar feels like they need to collect and disseminate information. I suppose at least they let you know they’re doing it.","updated":"2018-05-24T08:28:15-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1903127051","userName":"Lachandy01","userUrl":"https://itunes.apple.com/us/reviews/id243488527","version":"3.6.4","score":5,"title":"My personal trainer","text":"cannot do without it during my workouts. It’s my perfect workout partner!!","updated":"2017-11-06T21:20:53-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2500514194","userName":"GAMZzxzzx","userUrl":"https://itunes.apple.com/us/reviews/id704642765","version":"3.7.2","score":3,"title":"Polar A370","text":"The Polar A370 is an excellent heart tracker. I like tracking diverse training sessions based on the multitude of categories. However, I have to continually sync the Polar A370 with my iPhone 7 Plus. I didn’t have to do that with the Fit Bit or the Philips tracker.","updated":"2018-05-03T10:02:38-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7215637986","userName":"Clarence Boddicker esq.","userUrl":"https://itunes.apple.com/us/reviews/id105941156","version":"5.1.0","score":1,"title":"Weak","text":"For probably 2 years the app provided an objective assessment of the workout intensity  — the training load — and now it’s gone.  Can’t even optionally enable or disable it.  \n\nTraining load has a direct relation to recovery time.  Now polar has robbed us of that feature.  Very weak.","updated":"2021-04-12T16:23:38-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6453211722","userName":"Bay to breakers","userUrl":"https://itunes.apple.com/us/reviews/id110123928","version":"4.5.0","score":5,"title":"Awesome!","text":"Great system. I would like to see more on soccer tracking and profomance","updated":"2020-09-21T09:16:07-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3727055025","userName":"Neilme88","userUrl":"https://itunes.apple.com/us/reviews/id204147456","version":"4.0.4","score":4,"title":"Largest update cleared all my profiles","text":"Got up to run this morning only to find I had to reset my profiles??! Glad this wasn’t on a race day for me","updated":"2019-02-02T21:11:40-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2497212861","userName":"Kvpazal","userUrl":"https://itunes.apple.com/us/reviews/id394016414","version":"3.7.2","score":1,"title":"Doesn't sync with my M400!","text":"I've officially done everything to sync my polar with the app and I just keep getting sync failed! I'am on iOS 10.3.3\nMy boyfriend has the same watch same iOS but version 3.7.0 and everything is working! There must be a bug or something on this version!","updated":"2018-05-02T14:13:38-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2329982529","userName":"LALI 25","userUrl":"https://itunes.apple.com/us/reviews/id311605483","version":"3.6.9","score":4,"title":"Mostly good","text":"When it works it’s great. But sometimes have to uninstall and reinstall to get it to sync with my device.","updated":"2018-03-21T04:59:07-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7396300678","userName":"longshotzero","userUrl":"https://itunes.apple.com/us/reviews/id184215826","version":"5.3.0","score":4,"title":"Unsupported device","text":"I’m glad I can still make it work","updated":"2021-05-27T17:31:09-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6800633705","userName":"Mb5001","userUrl":"https://itunes.apple.com/us/reviews/id129823261","version":"4.10.0","score":1,"title":"Privacy Invader!","text":"Went to set up an account. \n\nPolar thinks their products are so special I’m going to waive all my privacy rights to include exporting my data to a foreign country where there are no rights??\n\nOnce I finished laughing, I stopped charging the watch, boxed it, and deleted the associated apps.","updated":"2020-12-27T12:55:30-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6711273783","userName":"glynn304","userUrl":"https://itunes.apple.com/us/reviews/id619327396","version":"4.9.0","score":2,"title":"Polar App","text":"My activity, sleep, exercise, etc. rarely shows up on the app.  Even after syncing, it doesn’t appear.  Most information shows not available.","updated":"2020-12-02T17:39:33-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6669823877","userName":"Gated cinched","userUrl":"https://itunes.apple.com/us/reviews/id264560731","version":"4.9.0","score":5,"title":"Syncing stinks","text":"Syncing was always a chore requiring repeated attempts with Mac OS and iOS. It keeps getting worse.","updated":"2020-11-21T05:17:34-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5421558210","userName":"josephdecarlo","userUrl":"https://itunes.apple.com/us/reviews/id820980243","version":"4.3.4","score":3,"title":"Bluetooth issue","text":"Always disconnects from Bluetooth so syncing the device to the app can be very annoying","updated":"2020-01-18T19:58:11-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7742744406","userName":"NCG8GT","userUrl":"https://itunes.apple.com/us/reviews/id278129373","version":"5.5.0","score":3,"title":"Kcal is KILLING ME!","text":"I am astute at math, but I would rather see calories not kcal….\nPlease add to app as a function such as metric or imperial \nTruly a pain everyday to convert.\nNot an old fussy duddy just want to keep consistent with other apps POLAR feeds into. \nBtw.  LOVE MY GRIT X","updated":"2021-08-27T20:31:15-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7369343386","userName":"Back doe lil joe","userUrl":"https://itunes.apple.com/us/reviews/id36292034","version":"5.3.0","score":1,"title":"Have to sync everyday","text":"The information doesn’t write over to the app from the watch I have to sync it every single day in order to get my sleep information as well as workout info","updated":"2021-05-21T02:44:25-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3858501200","userName":"Siena099","userUrl":"https://itunes.apple.com/us/reviews/id946771165","version":"4.0.6","score":5,"title":"Five stars","text":"I like how you don’t have to wait to long for it to start!!","updated":"2019-03-08T14:31:36-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5337625403","userName":"Laichzeit53","userUrl":"https://itunes.apple.com/us/reviews/id251202466","version":"4.3.3","score":1,"title":"Most Data Lost After Update","text":"If it wasn’t bad enough that the V800 is not compatible with iPhone 11, the latest version of the flow app, post update has lost most of my Fitness data. Very disappointed in the direction which Polar is heading.","updated":"2019-12-29T23:29:39-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5187388738","userName":"incognito82","userUrl":"https://itunes.apple.com/us/reviews/id14846525","version":"4.3.2","score":5,"title":"Doesn’t sync with MyPlate app","text":"I don’t know why but doesn’t sync with MyPlte app. Says I burned 2300 calories. What?!","updated":"2019-11-23T08:46:33-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2666108890","userName":"Justintime4Music","userUrl":"https://itunes.apple.com/us/reviews/id37125481","version":"3.7.3","score":1,"title":"Your personal data is not safe - Terms And Conditions","text":"Polar wants you to agree to send all of your personal data and health data outside the country. In other words they don’t want to be held responsible for any personal data or health data that might find its way into 3rd world countries.  \n\nSorry - but NO WAY","updated":"2018-06-09T05:36:36-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2534400779","userName":"veroeli","userUrl":"https://itunes.apple.com/us/reviews/id313267989","version":"3.7.2","score":3,"title":"Syncronization takes too long","text":"The app takes a long time to synchronize wi the watch , fitbit  does it much faster.\nThe info on sleeping should be more descriptive and informative.","updated":"2018-05-11T16:22:04-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2368178081","userName":"Qzzi","userUrl":"https://itunes.apple.com/us/reviews/id171756130","version":"3.7.0","score":5,"title":"Nice New Design","text":"The app is great!  Beautiful and full of nice features.  They took away the ability to input your weight 😫.  What up wit dat?","updated":"2018-03-31T10:03:11-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1871688068","userName":"Johandre","userUrl":"https://itunes.apple.com/us/reviews/id131415850","version":"3.6.3","score":5,"title":"Excellent app","text":"All the data you need in a click ok a button","updated":"2017-10-24T06:32:27-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4918463070","userName":"Northland5","userUrl":"https://itunes.apple.com/us/reviews/id25506870","version":"4.2.7","score":5,"title":"Interface Works for Me","text":"Moving from Garmin to Polar I prefer Polar’s feature-rich design for athlete training. Really pleased with Flow app","updated":"2019-10-10T06:47:14-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7848921646","userName":"awqtrew","userUrl":"https://itunes.apple.com/us/reviews/id404924466","version":"5.7.0","score":2,"title":"Upload us way too slow","text":"Uploading my data takes forever!","updated":"2021-09-26T16:57:46-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6036911590","userName":"AmandaJoGodfrey","userUrl":"https://itunes.apple.com/us/reviews/id981927143","version":"4.4.5","score":3,"title":"Graphs and such","text":"Graphs could be a little better as in maybe more bold and solid and app needs more clarity especially with the time marks.","updated":"2020-06-04T21:53:07-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5447827238","userName":"ccoop-a-loopp","userUrl":"https://itunes.apple.com/us/reviews/id37565688","version":"4.3.4","score":3,"title":"Notification Choices","text":"Please add support to choose which notifications show on the watch for iPhone!!!!! Fitbit can do it, so can you!","updated":"2020-01-25T10:02:59-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4470835632","userName":"Lilgenee","userUrl":"https://itunes.apple.com/us/reviews/id43024372","version":"4.2.1","score":5,"title":"Love my polar","text":"I love my polar flow. I love that it tells me recovery time between exercises as well as how hard I push day to day.","updated":"2019-07-16T10:39:56-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6206595640","userName":"juhgvtcrdcgb","userUrl":"https://itunes.apple.com/us/reviews/id25115134","version":"4.4.8","score":5,"title":"Awesome","text":"Everything Polar comes out with is awesome. Flow is such an amazing app and so easy to use.","updated":"2020-07-16T16:30:58-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3145256194","userName":"omar.martinez77","userUrl":"https://itunes.apple.com/us/reviews/id147419849","version":"3.7.6","score":5,"title":"Great!","text":"User friendly, all what you need for your training!","updated":"2018-09-02T08:05:59-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3225847104","userName":"Beefcake777","userUrl":"https://itunes.apple.com/us/reviews/id176993070","version":"3.7.8","score":3,"title":"After update, app no longer opens.","text":"Crashes every attempt to open. Even after restarting my phone. Get on it guys!","updated":"2018-09-24T10:54:58-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3012137189","userName":"Buk Hulk","userUrl":"https://itunes.apple.com/us/reviews/id591881052","version":"3.7.5","score":5,"title":"Awesomeness","text":"Totally worth it! Love it and keeps me on track of my game also keeps me on my toes when I'm slacking lol love this app","updated":"2018-08-03T09:36:06-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1941075320","userName":"rnscare","userUrl":"https://itunes.apple.com/us/reviews/id287029936","version":"3.6.5","score":4,"title":"Donna Kavanaugh","text":"Would be nice if it would sync automatically rather than having to open the app","updated":"2017-11-22T13:58:45-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1937411311","userName":"ErikFlightlife","userUrl":"https://itunes.apple.com/us/reviews/id417143796","version":"3.6.4","score":3,"title":"Does not read Apple Health","text":"Amazing app, but why not read data from Apple Health??? I have nutrition, hydration, and sleep data that I would like synced to Polar but can’t because Polar only writes to Apple Health. Please change that!","updated":"2017-11-21T06:16:16-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5241849640","userName":"KristiLove007","userUrl":"https://itunes.apple.com/us/reviews/id931437652","version":"4.3.2","score":4,"title":"Polar Flow","text":"Good product keeps useful statistics in easy to interpret formats\nIt would be superior if it included a food diary similar to my fitness pal","updated":"2019-12-06T15:49:57-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5036525879","userName":"A370-1","userUrl":"https://itunes.apple.com/us/reviews/id193252310","version":"4.2.8","score":4,"title":"Needs to track elevation","text":"Needs to track elevations","updated":"2019-10-27T14:10:38-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4931438725","userName":"phnichols44","userUrl":"https://itunes.apple.com/us/reviews/id29603202","version":"4.2.7","score":2,"title":"Poor","text":"Syncing and connectivity is poor. App itself needs a better look, very dated. Polar products always frustrating to use, as they care so little about the user experience.","updated":"2019-10-12T07:54:04-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7433669308","userName":"monksealsd","userUrl":"https://itunes.apple.com/us/reviews/id446122522","version":"5.3.0","score":5,"title":"Works great with my device","text":"Like it","updated":"2021-06-06T07:24:26-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2939871151","userName":"kpk1961","userUrl":"https://itunes.apple.com/us/reviews/id339547643","version":"3.7.5","score":4,"title":"Stop “improving “ app","text":"After latest update I loose all daily info whenever I close the app. Makes it totally USELESS!","updated":"2018-07-20T07:00:23-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5929315517","userName":"fast4semperfi","userUrl":"https://itunes.apple.com/us/reviews/id103582299","version":"4.4.3","score":5,"title":"Changing.....","text":"Polar Vantage M and the Polar Flow fitness app are changing fat kids into fit kids everyday...!! Thanks Polar....!! Love this set up.","updated":"2020-05-10T16:03:29-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6760822450","userName":"Brian Maddog","userUrl":"https://itunes.apple.com/us/reviews/id12651188","version":"4.10.0","score":2,"title":"Confusing","text":"I’m new to the Polar device, but I must say that the interface is not at all intuitive. Navigation thru it is a nightmare, and most of the time, I can’t interpret what I’m looking at.","updated":"2020-12-16T14:09:17-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4472058582","userName":"edmensaljr","userUrl":"https://itunes.apple.com/us/reviews/id348967694","version":"4.2.1","score":5,"title":"Utility","text":"User friendly and adequate data. \nGood number of diverse exercises available.","updated":"2019-07-16T17:02:55-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5787962209","userName":"cardio fiend","userUrl":"https://itunes.apple.com/us/reviews/id138821954","version":"4.4.0","score":1,"title":"Not a great purchase","text":"Well I’m not a pro athlete but I was looking for something to help me work out at constant heart rate.\nThis vantage is rubbish - it cannot record heart rate accurately or consistently. And rowing it is not easy to read the misinformation on the screen anyway! A regrettable purchase!","updated":"2020-04-09T15:45:31-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5488558445","userName":"924Racer","userUrl":"https://itunes.apple.com/us/reviews/id974559558","version":"4.3.5","score":2,"title":"Great until the synching stops","text":"Worked great the first week... then no more synch. Now I have a very pretty Ignite watch that is little more than decoration. Still no response from Support...","updated":"2020-02-04T14:57:37-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3032107482","userName":"Mars4ever","userUrl":"https://itunes.apple.com/us/reviews/id7210099","version":"3.7.5","score":5,"title":"Great App","text":"I've become healthier since I started using polar product","updated":"2018-08-07T12:42:43-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3953197894","userName":"not military","userUrl":"https://itunes.apple.com/us/reviews/id176855799","version":"4.0.6","score":3,"title":"Time","text":"I would give this more stars, but all of z sudden the watch went from regular time to military time. Can’t get it back, very frustrating","updated":"2019-03-31T15:08:53-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3714292805","userName":"SerJaum","userUrl":"https://itunes.apple.com/us/reviews/id155827384","version":"4.0.4","score":1,"title":"Where is my previous settings?","text":"I had around 10 sport profiles previous set for my personal use. After this update all my sport profiles was reset and I lost all my settings. I had to re-set everything again one by one.","updated":"2019-01-30T16:24:19-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1905938405","userName":"Ziggy3674","userUrl":"https://itunes.apple.com/us/reviews/id32819772","version":"3.6.4","score":5,"title":"Use it daily","text":"Easy to use, keeps me honest and on track.  The polar monitor bracelet is indestructible.","updated":"2017-11-08T04:16:16-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1847081441","userName":"Twetz","userUrl":"https://itunes.apple.com/us/reviews/id40591436","version":"3.6.2","score":4,"title":"Nice app but syncing is pain","text":"App is fine for beginners who want to track but the syncing is very frustrating. Takes lots of resyncing.","updated":"2017-10-13T17:30:00-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7326275025","userName":"coloradobass","userUrl":"https://itunes.apple.com/us/reviews/id166087203","version":"5.2.1","score":3,"title":"Good to go","text":"Great to keep track of my activities. Please add stand up paddle boarding to the activities. I’ve asked a few times but falls on deaf ears I guess","updated":"2021-05-11T10:28:48-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5351386395","userName":"dcbd18","userUrl":"https://itunes.apple.com/us/reviews/id32672304","version":"4.3.3","score":2,"title":"Ridiculous reloading every time","text":"Why is the app not booting up like it has been for years? You guys go off on holiday and throw this massive bug to the community.  Really ridiculous.","updated":"2020-01-02T06:47:19-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2590429014","userName":"rose.becker","userUrl":"https://itunes.apple.com/us/reviews/id20682470","version":"3.7.3","score":1,"title":"No longer working","text":"New Privacy patch downloaded which you can’t bypass. However, if you try to acknowledge the consent and save, the app silently closes. \nI have consented on the web version. Uninstalled and reinstalled the app with no possibility of using it now. \nPlease fix this issue.","updated":"2018-05-24T09:05:51-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"8091411488","userName":"Max wigglebutt","userUrl":"https://itunes.apple.com/us/reviews/id301151188","version":"5.8.0","score":1,"title":"Just a marketing tool","text":"Terrible app with limited function.  Mostly just a marketing tool.  Difficulty keeping app connected to my phone via BT.  Not able to set the type of workout (biking, hiking, etc).","updated":"2021-12-03T11:51:02-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4369164124","userName":"Fohnml","userUrl":"https://itunes.apple.com/us/reviews/id105570518","version":"4.1.5","score":3,"title":"Sync Issues","text":"For several days the app would freeze and not sync data.","updated":"2019-06-25T13:11:12-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5413369038","userName":"KarlsModernLife","userUrl":"https://itunes.apple.com/us/reviews/id150674847","version":"4.3.4","score":1,"title":"Completely useless if you have an iPhone","text":"Won’t sync with Apple health. Contacted their support team and they completely ignore you. They just want me to delete a reinstall the app until it magically works. Get it together.","updated":"2020-01-16T20:38:55-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5177785572","userName":"xmnbvvx","userUrl":"https://itunes.apple.com/us/reviews/id451692954","version":"4.3.2","score":5,"title":"Bluetooth pairing problems with iphone","text":"Difficult to pair Polar loop with iphone 11.","updated":"2019-11-21T11:02:07-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4227024381","userName":"TheFoxerine","userUrl":"https://itunes.apple.com/us/reviews/id49708967","version":"4.1.3","score":1,"title":"Syncing Failure","text":"Wouldn’t sync my device after multiple tries. The only advice I could get from the “support” provided was to delete the app and re-download. Now it won’t let me log into the app. I won’t be getting another polar device, that’s for sure.","updated":"2019-05-28T15:11:00-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3853559266","userName":"Rosalind6363","userUrl":"https://itunes.apple.com/us/reviews/id408226065","version":"4.0.6","score":3,"title":"Works ok","text":"Love that the polar flow gives me accurate heart rate measurements. Sometimes I have difficulty syncing with the app. Disappointed it won’t connect to other apps.","updated":"2019-03-07T08:06:45-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1815074391","userName":"Shan shopper","userUrl":"https://itunes.apple.com/us/reviews/id23277677","version":"3.6.2","score":1,"title":"Need better app","text":"The app isn’t the best and syncing is terrible. The last two upgrades have helped w/ better synching...still needs work but keep it up!  But, I love that my gym uses Polar and I can login there and my A360 info shows up on the big screen vs using the gym’s HR monitor.","updated":"2017-09-28T08:14:30-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5285506345","userName":"DXRdn","userUrl":"https://itunes.apple.com/us/reviews/id104636923","version":"4.3.3","score":1,"title":"Subject to Change","text":"This app used to be very reliable. Now when I open the app I have to wait for “downloading bits”. This goes on and on. Eventually, the app opens. Once this issue is resolved, Flow can go back to 5 stars.","updated":"2019-12-17T19:24:13-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3002080130","userName":"Petunia767","userUrl":"https://itunes.apple.com/us/reviews/id222876958","version":"3.7.5","score":5,"title":"It does everything I need","text":"I prefer it to the Apple Watch app.","updated":"2018-08-01T09:57:15-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5004297550","userName":"mcmcmcmx","userUrl":"https://itunes.apple.com/us/reviews/id370217062","version":"4.2.8","score":3,"title":"Bugs with A300 in latest update","text":"Also having date and time reset to year 2021 with latest update with any sync for the A300","updated":"2019-10-23T19:23:20-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4709748591","userName":"CBIPRES","userUrl":"https://itunes.apple.com/us/reviews/id121583523","version":"4.2.3","score":5,"title":"Watch readout","text":"Readout is difficult to see when cycling in sunlight","updated":"2019-09-01T08:34:33-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2472437133","userName":"tyler.jacobs","userUrl":"https://itunes.apple.com/us/reviews/id270146470","version":"3.7.2","score":2,"title":"Cumbersome Process","text":"Between having to use two apps, restart my watch to connect with my phone and wait entirely too long for the sync to complete, I won’t be buying Polar ever again.","updated":"2018-04-26T17:50:32-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6129091547","userName":"vo2maxkharmadharma","userUrl":"https://itunes.apple.com/us/reviews/id737586567","version":"4.4.6","score":1,"title":"Cumbersome and slow","text":"Connects poorly and slowly with Strava. Why Strava did the his to their customers I do not know but I am quite certain money is at the core. Very frustrating and inefficient interface.","updated":"2020-06-27T11:58:26-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6058491921","userName":"Gibby Buzzkill","userUrl":"https://itunes.apple.com/us/reviews/id28056799","version":"4.4.6","score":3,"title":"Not very intuitive","text":"Using this app can be frustrating, but generally it is okay","updated":"2020-06-10T04:19:32-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7546964419","userName":"Skookum8","userUrl":"https://itunes.apple.com/us/reviews/id366039391","version":"5.4.1","score":5,"title":"Best of them all","text":"Great analytics provided including TSS,TRIMP, etc. Easy to set up structured workouts.","updated":"2021-07-06T14:11:57-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3787304432","userName":"vmthomas","userUrl":"https://itunes.apple.com/us/reviews/id454972680","version":"4.0.4","score":4,"title":"Wrong reading recorded","text":"When I do same exercise for same duration, the readings are different every day.","updated":"2019-02-18T19:48:27-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3217859161","userName":"Andy Bellamy","userUrl":"https://itunes.apple.com/us/reviews/id555427043","version":"3.7.8","score":2,"title":"Crashing","text":"App keeps crashing, even after deleting it and re-downloading it. Seems to struggle to sync up with A370 watch, often taking 2-3 tries to sync data.","updated":"2018-09-22T08:19:42-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7204208308","userName":"bparker86","userUrl":"https://itunes.apple.com/us/reviews/id314747008","version":"5.1.0","score":5,"title":"Works Well","text":"Tracks workouts and calories. Syncs with Apple Health and Strava. Works well.","updated":"2021-04-09T18:09:41-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6864239667","userName":"50andstrong","userUrl":"https://itunes.apple.com/us/reviews/id482472338","version":"4.10.0","score":3,"title":"Not intuitive","text":"Hard to navigate and watch keeps unsyncing","updated":"2021-01-13T02:23:47-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2738942356","userName":"Ms. G","userUrl":"https://itunes.apple.com/us/reviews/id25486097","version":"3.7.4","score":1,"title":"Unusable","text":"There must be some kind of glitch in the app because I can’t register my watch. Says “complete all required fields” even when all required fields are full.  I’ve tried contacting Polar support online, which was also glitchy.","updated":"2018-06-21T07:07:13-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5327288477","userName":"Red Norse","userUrl":"https://itunes.apple.com/us/reviews/id253153185","version":"4.3.3","score":5,"title":"Transformed workout","text":"This is an amazing tool. How did I ever train without it?!?!","updated":"2019-12-27T10:50:47-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6197940248","userName":"lmc-check","userUrl":"https://itunes.apple.com/us/reviews/id312780631","version":"4.4.8","score":1,"title":"New version not syncing","text":"Downloaded new version.  Rebooted all devices.  Had iOS and polar v650 devices inches apart.  It starts to sync then in about 30 seconds it says connection lost. Repeated a number of times with same result","updated":"2020-07-14T12:28:01-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3549686701","userName":"الأفق","userUrl":"https://itunes.apple.com/us/reviews/id160588136","version":"4.0.1","score":5,"title":"Please support Arabic","text":"I hope to support Arabic in your upcoming updates for the beautiful hour A370","updated":"2018-12-19T13:30:52-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2930433020","userName":"Pwobama","userUrl":"https://itunes.apple.com/us/reviews/id25282513","version":"3.7.5","score":5,"title":"Great product","text":"Love this app! Works well and gives me immediate feedback.","updated":"2018-07-18T11:14:00-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3398146740","userName":"Willefivv","userUrl":"https://itunes.apple.com/us/reviews/id21029171","version":"3.8.2","score":2,"title":"No sleep tracking.","text":"After the latest update, my sleep is not being tracked or at least doesn’t show up in the app under Sleep.","updated":"2018-11-09T04:58:47-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3170260837","userName":"testcrash","userUrl":"https://itunes.apple.com/us/reviews/id101210738","version":"3.7.7","score":2,"title":"MAKE THE MOBILE APP AVAILABLE FOR MY DEVICE","text":"According to your app, I cannot sync my Polar A300 to the app aka my mobile device. What was the point of buying a fitness watch that I can’t even track my daily progress with??? Please fix asap! Thanks!","updated":"2018-09-09T00:03:00-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1851676319","userName":"Kibbereted","userUrl":"https://itunes.apple.com/us/reviews/id200602965","version":"3.6.2","score":5,"title":"I love my “ Flow”.  Wouldn’t be without it.","text":"Only time it is not on my arm is when it is charging. Love it!!!","updated":"2017-10-15T18:32:40-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2596770906","userName":"Racer 103","userUrl":"https://itunes.apple.com/us/reviews/id111339561","version":"3.7.3","score":5,"title":"V800","text":"I have been using Polar for 5 years and I have been very pleased.","updated":"2018-05-25T19:55:59-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7999354771","userName":"igor.grunskyi","userUrl":"https://itunes.apple.com/us/reviews/id333046297","version":"5.7.1","score":3,"title":"Weird design and UX","text":"Really needs refacing and better user experience. Sync is dead slow as well","updated":"2021-11-07T09:07:45-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7722458211","userName":"this is absolutely ridiculous","userUrl":"https://itunes.apple.com/us/reviews/id267808140","version":"5.5.0","score":1,"title":"There are no directions on how to actually read your heart rate","text":"It is incredibly difficult to connect and then there are no directions on how to actually read your heart rate","updated":"2021-08-22T09:29:53-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4697561594","userName":"Ajhanna","userUrl":"https://itunes.apple.com/us/reviews/id171509820","version":"4.2.3","score":2,"title":"Polar 650v","text":"Works like a 80s pc the app has no functionality and does not upload to Strava or down load to Strava all it can do is take manual uploads and cannot upload to Strava \n\nWorst device I have ever used\n\nI bought a Garmin 530 edge plus for the same money it came with a real bike mount made of high quality plastic it works perfectly no need to hook it up to the computer and is user friendly.  \n\nThrowing the polar 650v in the trash","updated":"2019-08-30T11:52:33-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4745277913","userName":"Chanfle80","userUrl":"https://itunes.apple.com/us/reviews/id159092590","version":"4.2.4","score":5,"title":"Almost perfect app!","text":"It is great interacting with my Vantage V... cant believe that it doesnt show a graph for cycling cadence that its shown on web Flow site","updated":"2019-09-07T17:39:02-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4957073627","userName":"TheSlowDown","userUrl":"https://itunes.apple.com/us/reviews/id928961196","version":"4.2.8","score":4,"title":"Competent but not spectacular app","text":"The app works. It’s not too fancy and has most of the features I desire.","updated":"2019-10-16T14:02:38-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3026729536","userName":"Peachface","userUrl":"https://itunes.apple.com/us/reviews/id200317351","version":"3.7.5","score":5,"title":"Top of the line","text":"Best tracker I ever had. Three years old and looks like new. Love it.","updated":"2018-08-06T10:36:31-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1939192231","userName":"PrincessKe","userUrl":"https://itunes.apple.com/us/reviews/id42615146","version":"3.6.4","score":5,"title":"Does it all","text":"I love my polar activity watch and scale. They work so well with my app","updated":"2017-11-21T21:29:50-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"8103145804","userName":"Norwar","userUrl":"https://itunes.apple.com/us/reviews/id229802537","version":"5.8.0","score":5,"title":"Recovery","text":"The Grit X has been key in monitoring my cardiac comback after near drowning and cardiac bypass surgery.","updated":"2021-12-06T18:27:27-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4726351789","userName":"daniellasg","userUrl":"https://itunes.apple.com/us/reviews/id358918533","version":"4.2.4","score":5,"title":"Just Started and I am obsessed !!","text":"Have the polar ignite and it’s super beautiful, wear it everyday to work and to workout.\n\nI paired it with the heart rate monitor and with these apps.... polar flow and polar beat...\n\nThe amount of data and specifics is so amazing! I am truly blown away!\n\nI am a new fan!!! Awesome products!!!","updated":"2019-09-04T08:30:08-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6714273916","userName":"papahenley","userUrl":"https://itunes.apple.com/us/reviews/id683203796","version":"4.9.0","score":2,"title":"Not very accurate","text":"Tracking my runs directly on Strava or Runkeeper are consistently more accurate than what gets recorded in the Polar app.","updated":"2020-12-03T14:15:40-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4970099123","userName":"dr davez","userUrl":"https://itunes.apple.com/us/reviews/id31470371","version":"4.2.8","score":5,"title":"Polar App","text":"Simple, efficient and effective. Keeps you on track and motivated love it!","updated":"2019-10-18T16:55:59-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4130927525","userName":"Jamroxs","userUrl":"https://itunes.apple.com/us/reviews/id106389044","version":"4.1.2","score":1,"title":"Syncing never syncs","text":"It always syncs about 45 minutes into the hour when connected to My Fitness Pal. It never shows the right numbers, despite the fact that I'm still working out!","updated":"2019-05-10T17:07:17-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3796869588","userName":"fitbit123445678","userUrl":"https://itunes.apple.com/us/reviews/id27942244","version":"4.0.5","score":4,"title":"Goal?","text":"Why can’t I determine my own goals eg # of steps, # of calories etc? And how do I know the basis of the goal that polar sets?","updated":"2019-02-21T05:32:42-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1979022574","userName":"Kb196076","userUrl":"https://itunes.apple.com/us/reviews/id132762687","version":"3.6.5","score":3,"title":"Great movement tracker.","text":"So far the movement and heart rate have been right on even the sleep. Wish there was a food/ drink tracker attached to the app, so everything is in one place.","updated":"2017-12-07T20:02:46-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5634576913","userName":"OUCuse","userUrl":"https://itunes.apple.com/us/reviews/id203240655","version":"4.3.8","score":4,"title":"Super easy to use","text":"Pretty solid and easy to use.","updated":"2020-03-08T16:18:20-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4486255914","userName":"Obot1981","userUrl":"https://itunes.apple.com/us/reviews/id137795885","version":"4.2.1","score":5,"title":"M400","text":"Great products from great people,can’t say the same for Nixon smart watche","updated":"2019-07-19T09:14:28-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2270916169","userName":"JMc4000","userUrl":"https://itunes.apple.com/us/reviews/id302150060","version":"3.6.9","score":5,"title":"Data, compatibility, and style","text":"I use the app with the stylish M200. It synchs automatically with Strava and My Fitness Pal. Love it!","updated":"2018-03-04T10:29:15-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2581551378","userName":"skybaby07","userUrl":"https://itunes.apple.com/us/reviews/id29300916","version":"3.7.2","score":2,"title":"Notifications","text":"The notifications of texts and calls doesn’t always work with the new iPhones","updated":"2018-05-22T07:45:46-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2038666629","userName":"Camelsrock","userUrl":"https://itunes.apple.com/us/reviews/id37970446","version":"3.6.6","score":5,"title":"My new polar loop","text":"Love it the A300- it keeps me on the path. Thank you to my sister for the best Christmas gift","updated":"2017-12-29T09:39:14-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3998179064","userName":"scottp7837","userUrl":"https://itunes.apple.com/us/reviews/id109447890","version":"4.1.0","score":4,"title":"Everything I need and then some","text":"Love it, detailed and customizable","updated":"2019-04-11T03:38:50-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7265865413","userName":"lkvahgoihang","userUrl":"https://itunes.apple.com/us/reviews/id141283222","version":"5.2.1","score":4,"title":"How about a dark mode for this exceedingly bright app?","text":"Please","updated":"2021-04-26T04:59:40-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2002516552","userName":"AClutter","userUrl":"https://itunes.apple.com/us/reviews/id188755788","version":"3.6.6","score":3,"title":"Great workout partner","text":"I wish it did more. But it’s really great at what it does. Never lost data, but wished it’s Bluetooth was stronger and more reliable.","updated":"2017-12-16T18:44:39-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5605914647","userName":"mjw2019","userUrl":"https://itunes.apple.com/us/reviews/id916703455","version":"4.3.8","score":4,"title":"Sync","text":"Take s too much time to sync","updated":"2020-03-02T03:40:00-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5808132968","userName":"AndrewTosh","userUrl":"https://itunes.apple.com/us/reviews/id205688403","version":"4.4.0","score":1,"title":"Ridiculous Required Data Rights","text":"You can only use the app if you agree to let them do whatever they want with your data (eg, heart rates and locations).","updated":"2020-04-13T19:18:20-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5728687397","userName":"Rklac","userUrl":"https://itunes.apple.com/us/reviews/id449899980","version":"4.4.0","score":3,"title":"Good HW basic App","text":"HW is excellent. Apps from Polar are kind of junk. Outdated displays, basic features etc. please do better.","updated":"2020-03-28T19:00:22-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2182335139","userName":"Pxtx1","userUrl":"https://itunes.apple.com/us/reviews/id190440531","version":"3.6.8","score":5,"title":"Excellent","text":"I really enjoy the polar system. It connects to spinning equipment and cardio equipment. The new apps are quite good.","updated":"2018-02-08T05:29:04-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5335550413","userName":"OwenYS","userUrl":"https://itunes.apple.com/us/reviews/id244137723","version":"4.3.3","score":1,"title":"Privacy nightmare","text":"I can’t op out of sharing EVERYTHING all the time , which pretty much make the device useless . \n\nAlso , why are you FORCING me to retype my password ? Im generating my password and you should mess with the normal UX flow.","updated":"2019-12-29T10:14:17-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4122000592","userName":"GianMonsalve","userUrl":"https://itunes.apple.com/us/reviews/id105403538","version":"4.1.2","score":3,"title":"Very Unresponsive","text":"It takes way too long to sync my M600 with the app, WHENEVER it chooses to let my sync it in the first place. Its very promising, but definately underdelivers.","updated":"2019-05-08T21:45:33-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4955970161","userName":"Dudebroguydude","userUrl":"https://itunes.apple.com/us/reviews/id183549207","version":"4.2.8","score":5,"title":"Excellent App","text":"Bug free, works great, tracks everything I want. Excellent.","updated":"2019-10-16T08:23:52-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1909765280","userName":"Finance_theory","userUrl":"https://itunes.apple.com/us/reviews/id206157690","version":"3.6.4","score":4,"title":"Polar Flow — Workout Hard, Flow Easy","text":"Easy to collect data and track progress.","updated":"2017-11-09T18:57:58-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1844126837","userName":"TheBoosOne","userUrl":"https://itunes.apple.com/us/reviews/id193942345","version":"3.6.2","score":1,"title":"Flow is slow","text":"Flow is slow to detect my polar device. Not only that, it has been crashing a lot lately. I’ve deleted & reinstalled but the app still crash. Please fix this it soon thanks & appreciate.","updated":"2017-10-12T09:19:01-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6861582946","userName":"No more hot chicks","userUrl":"https://itunes.apple.com/us/reviews/id36962320","version":"4.10.0","score":3,"title":"Syncing","text":"The app is great to track things, but I need to manually sync my Ignite if I want it to update on the app.","updated":"2021-01-12T08:41:05-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2715357704","userName":"krgrat","userUrl":"https://itunes.apple.com/us/reviews/id203373983","version":"3.7.4","score":5,"title":"Geared up","text":"I like my polar monitor, it’s user friendly.","updated":"2018-06-17T19:47:04-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4681187657","userName":"Situ BSC","userUrl":"https://itunes.apple.com/us/reviews/id206345226","version":"4.2.3","score":1,"title":"Works....sort of","text":"I have high hopes for the app.   Mainly because I have many devices to coordinate.   But there are still several kinks in the product that make it painful to use.\nSlow to sync\nSlow to recognize a device \nNot intuitive\nSeems to favor presentation of running data\nDoes not compare training events well (general lack of flexibility)\nCan’t customize display data (like a template)","updated":"2019-08-27T04:50:50-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3452029743","userName":"Bee-A-lot","userUrl":"https://itunes.apple.com/us/reviews/id119722504","version":"3.8.2","score":5,"title":"Great workout app","text":"Love how easy the app syncs with my new Vantage. Lots of data. Works great","updated":"2018-11-23T12:12:46-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7562689238","userName":"gag58","userUrl":"https://itunes.apple.com/us/reviews/id118232963","version":"5.4.1","score":3,"title":"Loses sync","text":"Polar ignite watch loses sync with Polar Flow often. Have to forget device in Bluetooth settings then resync. Not good.","updated":"2021-07-10T19:25:36-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5411222904","userName":"ovalver1","userUrl":"https://itunes.apple.com/us/reviews/id85319365","version":"4.3.4","score":1,"title":"Data not same","text":"I have an iPhone 8 and the app , watch and widget show a different data  even  if I see iPhone health my steps are different from watch vintage M plication and widget","updated":"2020-01-16T07:41:11-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4726957086","userName":"WorksRL","userUrl":"https://itunes.apple.com/us/reviews/id34978700","version":"4.2.4","score":5,"title":"Go to app!","text":"I’m very happy with my polar devices. I’ve been loyal for over a decade. 👍🏽💪🏽","updated":"2019-09-04T11:37:10-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3176425718","userName":"lenedlit","userUrl":"https://itunes.apple.com/us/reviews/id7802347","version":"3.7.7","score":1,"title":"Not as functional as I’d like","text":"The app takes a long time to sync with my A360 watch and exercise feedback is basic at best. Polar is great for their heart rate monitoring products, but their app and its usability still has a long way to go.","updated":"2018-09-10T18:38:27-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3073824328","userName":"hmn76","userUrl":"https://itunes.apple.com/us/reviews/id490130510","version":"3.7.6","score":2,"title":"My gripes","text":"Disappointed in not being able to increase my goal and what the presets are! Also when knitting it counts the movement as steps.","updated":"2018-08-16T11:34:51-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2601118924","userName":"Lseeeee","userUrl":"https://itunes.apple.com/us/reviews/id196062703","version":"3.7.3","score":3,"title":"Polar a360/polar flow","text":"Pretty interesting to view the sleep data but it takes too long to sync the watch with the app.","updated":"2018-05-26T19:33:28-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6717775949","userName":"Bbalee","userUrl":"https://itunes.apple.com/us/reviews/id429942543","version":"4.9.0","score":2,"title":"Struggles to sync with iPhone 11 Pro","text":"Polar watch Vantage M. Can’t sync with my phone and always need to use the cord to sync with the computer.","updated":"2020-12-04T14:19:09-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1802304168","userName":"ezefbeez","userUrl":"https://itunes.apple.com/us/reviews/id141018274","version":"3.6.1","score":5,"title":"I love this app and watch!","text":"Very easy to use.","updated":"2017-09-21T11:39:02-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3762985975","userName":"selmahannen","userUrl":"https://itunes.apple.com/us/reviews/id718494271","version":"4.0.4","score":1,"title":"A370","text":"It will not download on my computer but does over the phone. It is only a couple of years old and it is breaking already. Don’t think I’ll get another polar breaks to much.","updated":"2019-02-12T14:47:28-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2762720598","userName":"greatbodytoday","userUrl":"https://itunes.apple.com/us/reviews/id196912753","version":"3.7.4","score":2,"title":"Suggestions","text":"The app is pretty good. I just wish there was the ability to set more reminders/alarms, and a way to track food.","updated":"2018-06-24T17:50:11-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1991046797","userName":"vimalakirti","userUrl":"https://itunes.apple.com/us/reviews/id32925706","version":"3.6.6","score":1,"title":"Really slow","text":"This app takes forever to upload data from the watch to the phone via Bluetooth—no idea why.","updated":"2017-12-12T09:19:03-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4847265603","userName":"euramosh","userUrl":"https://itunes.apple.com/us/reviews/id203507890","version":"4.2.6","score":5,"title":"Love it!","text":"Great app good to track your workouts and enjoy","updated":"2019-09-27T09:45:56-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6995394194","userName":"ACECOMBAT1","userUrl":"https://itunes.apple.com/us/reviews/id13100564","version":"4.11.0","score":2,"title":"Sync is very hit and miss","text":"Upgraded to grit x from vantage v. Sync is still very hit and miss. \n\nAbsolutely no improvement in 2 years. \n\nDisappointed","updated":"2021-02-14T18:00:34-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6125123014","userName":"Zipeeps","userUrl":"https://itunes.apple.com/us/reviews/id245671724","version":"4.4.6","score":2,"title":"No customization possible","text":"Heart rates are set which makes this app useless for athletes who want to create their own heart rate zones for training","updated":"2020-06-26T11:47:42-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4906649879","userName":"mainlan2","userUrl":"https://itunes.apple.com/us/reviews/id103802352","version":"4.2.7","score":3,"title":"Two way integration","text":"I would like to directly upload my training targets from Training Peaks to Polar Flow and then sync to my Polar Vantage","updated":"2019-10-07T16:18:01-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7241416412","userName":"Gatorzone727","userUrl":"https://itunes.apple.com/us/reviews/id384568706","version":"5.1.0","score":5,"title":"Super","text":"Great watch no more to say","updated":"2021-04-19T15:34:31-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2067228798","userName":"Steph and Emmy","userUrl":"https://itunes.apple.com/us/reviews/id18620325","version":"3.6.6","score":1,"title":"Rarely connects automatically.","text":"It does not record all workouts, does not auto connect and missed several workouts.  Very disappointed .","updated":"2018-01-07T15:15:57-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4289536006","userName":"Ubirajra","userUrl":"https://itunes.apple.com/us/reviews/id129684523","version":"4.1.5","score":4,"title":"Good not great","text":"Unfortunately, the A370 is not as precise or reliable as the chest band models.  It is handsome, though, and “close enough” to accurate bpm measurements.","updated":"2019-06-09T06:49:41-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4142881739","userName":"Britt4733","userUrl":"https://itunes.apple.com/us/reviews/id238945483","version":"4.1.2","score":1,"title":"It’s the small things","text":"My polar A370 does less than I had hoped, mostly the issue being lack of custom alarm setting which stems from this app. Debating going to a fitbit and just using my chest strap in beat.","updated":"2019-05-13T00:53:15-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"1940257400","userName":"Retired70+Mountineer","userUrl":"https://itunes.apple.com/us/reviews/id335497028","version":"3.6.5","score":3,"title":"Crs","text":"With your latest update this morning I can no longer get my Polar Beat to pair. What happened?","updated":"2017-11-22T06:54:20-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7718115772","userName":"Deeeever","userUrl":"https://itunes.apple.com/us/reviews/id205357452","version":"5.5.0","score":3,"title":"Good but needs improvement","text":"Good:\n1. Heart rate zones \n2. Accurate hate rate (ignite 2)\n\nNeeds improvement:\n1. More user friendly\n2. Make it easy to edit sleep on app\n3. More accurate sleep tracking \n\nNeeds to be added:\n1. Community option like whoop","updated":"2021-08-21T05:52:20-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2594151981","userName":"Solrac60","userUrl":"https://itunes.apple.com/us/reviews/id104225563","version":"3.7.3","score":5,"title":"Columbus Marathon","text":"This the perfect coach and partner for my journey in achieving my next bucket list goal!!","updated":"2018-05-25T05:40:05-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5847885251","userName":"Biff4)&&;","userUrl":"https://itunes.apple.com/us/reviews/id388534850","version":"4.4.0","score":2,"title":"Slow Syncing","text":"Took about 20 minutes to sync","updated":"2020-04-22T05:02:42-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6896050300","userName":"Kathie Ellis","userUrl":"https://itunes.apple.com/us/reviews/id932304526","version":"4.11.0","score":5,"title":"Kathie","text":"I think the polar app is so helpful. Great app to have.","updated":"2021-01-21T05:06:53-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"7584561742","userName":"b42!","userUrl":"https://itunes.apple.com/us/reviews/id436743242","version":"5.4.1","score":5,"title":"Best fitness app - Please include Polar Equine.","text":". Thank you so much","updated":"2021-07-16T15:17:49-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3834563970","userName":"kmw421","userUrl":"https://itunes.apple.com/us/reviews/id108895535","version":"4.0.5","score":1,"title":"No longer can use with my watch","text":"No longer compatible with A300 model reasons for no apparent reason then they want you to buy a new model of watch","updated":"2019-03-02T15:15:07-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"4365943611","userName":"please sync","userUrl":"https://itunes.apple.com/us/reviews/id102303633","version":"4.1.5","score":1,"title":"Constant syncing issues","text":"My data RARELY syncs from the watch to the app. The watch is great, but I hate the app! I now have to use a separate app and manually transfer the data over.","updated":"2019-06-24T19:59:57-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5634657009","userName":"crawl21","userUrl":"https://itunes.apple.com/us/reviews/id516195596","version":"4.3.8","score":1,"title":"No longer functions","text":"App no longer functions at all","updated":"2020-03-08T16:49:57-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"6838417734","userName":"jaaytee928","userUrl":"https://itunes.apple.com/us/reviews/id330151613","version":"4.10.0","score":5,"title":"Polar M200","text":"A excellent device to use","updated":"2021-01-06T09:38:29-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"5885000042","userName":"Mullinstudio","userUrl":"https://itunes.apple.com/us/reviews/id713640195","version":"4.4.3","score":2,"title":"Nah","text":"Cluttered inferface and too much in app marketing. Shame - you would get more customer loyalty otherwise.","updated":"2020-04-30T11:17:45-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2291656371","userName":"userofpolar","userUrl":"https://itunes.apple.com/us/reviews/id695890281","version":"3.6.9","score":3,"title":"Very frustrating to use","text":"I follow the instructions in the manual & they don’t work.","updated":"2018-03-10T09:23:47-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3017761033","userName":"tolochos","userUrl":"https://itunes.apple.com/us/reviews/id654889507","version":"3.7.5","score":5,"title":"Wonderful app","text":"The best watch for all sports","updated":"2018-08-04T13:02:34-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"8099773180","userName":"Chan765","userUrl":"https://itunes.apple.com/us/reviews/id247822473","version":"5.8.0","score":1,"title":"Not displaying","text":"Not displaying even after sync shows complete. I even restated my phone.","updated":"2021-12-05T18:20:30-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2804933053","userName":"Calvinsgyrl2","userUrl":"https://itunes.apple.com/us/reviews/id26947638","version":"3.7.4","score":4,"title":"Great App for all around Fitness lovers ❤️","text":"Used this for years !","updated":"2018-06-30T07:52:03-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2480502175","userName":"Cac Lon 21","userUrl":"https://itunes.apple.com/us/reviews/id443257556","version":"3.7.2","score":1,"title":"No text and call notifications","text":"Does not receive incoming text from this app and call notifications.","updated":"2018-04-28T14:39:57-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3226512547","userName":"Britann6","userUrl":"https://itunes.apple.com/us/reviews/id168295214","version":"3.7.8","score":1,"title":"Update causing crash...???","text":"Loved this app up until today when I did the updated now it keeps crashing.... anyone else???","updated":"2018-09-24T16:26:45-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2782888949","userName":"Salem__jihn","userUrl":"https://itunes.apple.com/us/reviews/id544228806","version":"3.7.4","score":1,"title":"Syncing Issues","text":"You guys need an update because I rely on giving my data on the watch to the app because my coach needs it and the app just doesn’t work. PLEASE FIX THIS ISSUE. ITS REALLY ANNOYING THAT THE TROUBLE SHOOTING LIKE RESTARTING EVERYTHING DOESN'T WORK. “Please fix it.”","updated":"2018-06-27T09:59:08-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2070063849","userName":"akelemen","userUrl":"https://itunes.apple.com/us/reviews/id460754915","version":"3.6.6","score":1,"title":"Cycling training not saved","text":"I biked 21 miles this morning and when checking the app to review my data Polar app didn’t save or it won’t show my workout.","updated":"2018-01-08T12:43:06-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"3702710974","userName":"Beosept","userUrl":"https://itunes.apple.com/us/reviews/id208525150","version":"4.0.3","score":1,"title":"More spyware","text":"I purchased a Polar H10, in part, based on the promise of using this app.  No where does it mention the *requirement* of creating an account and logging your activity on their servers.","updated":"2019-01-27T17:19:33-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"},{"id":"2898142280","userName":"TorsionalMetric","userUrl":"https://itunes.apple.com/us/reviews/id43108780","version":"3.7.5","score":1,"title":"App stopped working","text":"Can’t connect to my account, can’t get support, can’t use my device. Will update  this review when it works again.","updated":"2018-07-13T00:54:13-07:00","url":"https://itunes.apple.com/us/review?id=717172678&type=Purple%20Software"}]