[{"id":"1942586992","userName":"Kay Mode","userUrl":"https://itunes.apple.com/us/reviews/id19040222","version":"2.11","score":2,"title":"Poorly executed app","text":"Various bugs left and right preventing and killing the experience to a point where you simply cannot even use your AI light fixture.\n\n- 9/10 times the app will simply not connect to the AI light and throws of various errors.\n\n- Frustrating setup process that is both poorly designed and doesn't work unless you restart your hardware multiple times.\n\n- Lack of any user guide or instruction on how various programs work with your light - no user guide in the box or on the website either.\n\n- App loses saved settings and overrides previous settings sporadically.\n\nSimply a poorly built app that fails miserably at basic items such as connecting to the light fixture to begin with making the experience unusable, frustrating and worthy of a product return. Not ready for prime time and needs to be fixed asap.\n\nConceptually a great idea, but poorly executed.","updated":"2017-11-23T04:01:43-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"7382095264","userName":"TheTruth0606","userUrl":"https://itunes.apple.com/us/reviews/id9542665","version":"3.12","score":3,"title":"Good But Could Use Small Improvements","text":"I use this app for my two Nero 3s. It’s honestly a great app and I love the control it gives you over the powerheads. I’d like to see a few small improvements. \n\n- It would be helpful if the current button (Enable Schedule, Feed Mode, Pumps On, or Pumps Off) you have pressed us highlighted. Sometimes I’ve chosen Feed Mode or Enable Schedule and I’m not sure if the command was taken because the button does show chosen you have to observe the powerheads to see if there was a change. \n- Feed Mode - it would be nice if there was a countdown for the time you’ve chosen. Showing how much time until the powerheads go back on. Then I can program my pump to come on at the exact same time. I have my feed mode set to 15 minutes but it would be nice to know how much time I have left after I finish feeding them. \n- When on Feed Mode, if you look at the individual powerheads under flow, it shows the programmed flow percentage instead of the percentage the powerheads are currently in under feed mode. That should update to show the current percentage the powerheads are at, at that moment and then readjust once the feed mode switches back to the enabled schedule. \n\nAll-in-all I love the app and I look forward to getting the hydras or the prime in the future.","updated":"2021-05-24T04:53:20-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"6007533702","userName":"sullijazz89","userUrl":"https://itunes.apple.com/us/reviews/id169385192","version":"3.8","score":1,"title":"Don’t buy an ai prime!","text":"TERRIBLE customer service. They literally gave me someone else’s information, not to mention these lights burned a hole in my couch. I’m sorry if you get Alex young as your help as he will not respond to you and close out your account even if you are in warranty. They don’t give you any warnings that these lights can start a fire. Make sure if you’re adjusting the spectrum that these lights are not sitting on something as they will start a fire and ruin the light. They will not cover this. Go with kessil instead because there costumer support is top notch. They lost a customer and I will only buy kessil from here on out. Kessil is super friendly and communicate so much better. Ai prime will screw you over once anything goes wrong. Their lights are one of the least reliable on the market. I don’t even want to start about how awful the app is. DONT BUY FROM AQUAILLUMINATION!!!!! Or echo tech for that matter!","updated":"2020-05-28T20:28:51-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"2079494548","userName":"FronheimButter","userUrl":"https://itunes.apple.com/us/reviews/id525658979","version":"2.11","score":5,"title":"Fantastic light (PrimeHD Freshwater)/Fantastic App!","text":"I basically bought the light for a 20 gal refugium/saltwater macro tank. \n- Boosted the red and blue channels a bit for theoretical (mine) improved growth spectrum for macro algae (no rock) and lowered the green channel a bit. \n- Set timer with a 10 hour light cycle with 2-hour ramp up & ramp down.\n- When I’m not traveling, I occasionally set a 4-hour low output blue-spectrum ‘moon light’ to help see the bugs (amphis, copes, bristles and hair worms).\n\nThe green macros (Ulva and chaeto) have had great growth and color. The red macro (gracilaria) is keeping its rich maroon color and is showing significant growth.\n\nFor my usage, the app is a wonderful addition to an elegant small footprint led light. It allows me to customize output intensity and spectrum (as well as timer, ramps, etc). \n\nI never use the weather or moonlight settings. I only use the light’s local hotspot and don’t have it connected online, so I can’t comment on accessing the light remotely. I just set and forget.\n\nOne feature request would be to change the static background color spectrum histogram to a live one that changes as you adjust the color channels.","updated":"2018-01-11T12:44:36-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"6619430638","userName":"Anonymitys","userUrl":"https://itunes.apple.com/us/reviews/id1113875293","version":"3.9","score":1,"title":"Useless app","text":"Can’t setup light with a specific kelvin  in a schedule unless you right down the percentages of light and input the manually into the non easy setup. I guess the lights no longer look for firmware updates envelopes on a wifi connection. Used to be able to click the firmware button in settings and it would look for an update while on wifi. It’s not highlighted anymore. It’s either bugged or they stopped supporting firmware updates... \n\nThese light were always hit or miss when trying to customize the lights . $1,400 and you would think they would include a better cooling fan because in a closed tank hood they get too hot and turn off... A couple buttons on the light for simple on and off and preset kelvins would of been a simple standard ... Nope that’s asking too much. \n\nI’d suggest another company that doesn’t rely on an app for tank lights","updated":"2020-11-07T09:24:49-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"7509865659","userName":"Yearweezy","userUrl":"https://itunes.apple.com/us/reviews/id1197963410","version":"3.14","score":5,"title":"REAL REVIEW !!! PLEASE READ !!!!","text":"Let me start off by saying DO NOT let those other reviews discourage or make you think twice about purchasing the light and using the interface!! The app works seamlessly it took 2secs to connect and a little time to play around with the adjustments to your liking… I suggest putting it on acclimate depending on your previous lighting equipment. But other than than that everything works like a charm between the light and the App. Maybe some people just had bad luck or lack common sense… but either way if I could give this 10 out of 5 i definitely will !!.","updated":"2021-06-26T17:35:52-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"7734969064","userName":"Michiganick","userUrl":"https://itunes.apple.com/us/reviews/id207941038","version":"3.14","score":5,"title":"Confused about the negative reviews","text":"Look, I’m pretty tech savvy, and this app has worked flawlessly for me, in conjunction with both my AI Prime 16HD and my Nero 3. I think what we have here is a fundamental “user error” problem. I’m not saying everyone who has struggled with this is bad at basic Bluetooth tech, and I’m sure the early adopters had their fair share of bugs, but this app and its compatibility with A.I. devices is super slick now. I’ve loved it. If there were bugs, they’re fixed, and I believe a bevy of these negative reviews stemmed from people who just aren’t very technologically adept.","updated":"2021-08-25T19:36:34-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"5079801017","userName":"flips256","userUrl":"https://itunes.apple.com/us/reviews/id191244437","version":"3.6","score":3,"title":"Leaves a bit to be desired","text":"I can't understand why they made it so difficult to shorten the times on a lighting schedule file. It is so convuluted. You would think it would be as simple as clicking on the start or end point and sliding it to adjust but NO... instead, it's a royal pita... So much so that I stopped trying to find lighting schedules that I thought I'd want to try... So sad that they can't keep up with technology... Also, once you set up your account with an email address, there is no way to go back to change it. You have to setup a new account and start all over again...","updated":"2019-11-03T07:08:04-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"5981478433","userName":"sadship13","userUrl":"https://itunes.apple.com/us/reviews/id130980362","version":"3.8","score":1,"title":"Really needs improvement","text":"This app is terrible. It’s hard to actually program what you want and small changes are impossible to implement. It took me about 20 tries to implement a night time lighting schedule. Also, they keep removing features. For example, if you look at the photos of the app listed on this page, you will see a special effects tab that is supposed to recreate weather events. Well apparently the abruptly decided to stop supporting it, despite this being advertised on all the packaging and I the actual App Store. \n\nThe hardware is great. Makes sufficient par and a lot of different color options to really make my tank pop. The app is what brings the product down.","updated":"2020-05-22T18:32:15-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"4419581550","userName":"Bs9119","userUrl":"https://itunes.apple.com/us/reviews/id288516074","version":"3.3","score":5,"title":"Haven’t seen any big issues","text":"I’ve had my AI HD Prime for 3 days now and the app has been awesome. Not one problem like others have reported. I followed the directions and actually setup the light using my computer, I just find it much easier to setup my schedules this way. Once everything was set I downloaded the app and added the light. All my settings were there and I haven’t had an issue yet. Just follow the directions and you shouldn’t run into the problems others have","updated":"2019-07-06T06:10:18-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"3241762615","userName":"Jhbemmer","userUrl":"https://itunes.apple.com/us/reviews/id42833473","version":"3.1","score":5,"title":"Old reviews need updating","text":"Seems all the old reviews need an update, as the current app works. The app has flexibility and ability to upload others saved schedules. \nThe thing that I really like is the gradual light shift, it’s so gentle that fish don’t get startled when the old timer lights used to come on. \nBesides the unlimited flexibility of changing every spectrum of the lights is great. Seems they worked out all the bugs that the early version had, as the current one is working fine.","updated":"2018-09-28T18:55:13-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"4796354200","userName":"nat120096","userUrl":"https://itunes.apple.com/us/reviews/id731581040","version":"3.3","score":1,"title":"Super Buggy Unusable","text":"I went back to using the desktop interface because this app is buggy and unusable. \n\nI have 3 AI Lights all set up on different tanks. Each one of them are parents, non are child to the other ones. When using this app if I set up a specific setting for that light and opened up another light, it automatically copies the settings from the previous light. Really unusable. I set up my hydra 26 at 50% intensity, if I open my AI Prime it automatically copies the 50% setting of the hydra. If I then manually change the Prime to 100%, then all of a sudden my Hydra is now at 100%. Very frustrating. Im currently using the desktop interface. Please fix this app. Thank you.","updated":"2019-09-17T09:45:19-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1821726958","userName":"zpayne10","userUrl":"https://itunes.apple.com/us/reviews/id39862115","version":"2.10","score":2,"title":"OK, but needs work","text":"I’ve recently started using this app with an AI Hydra 26 HD. I enjoy having the ability to control the light from the app, but a number of times I’ve had the light get off the schedule. I have to open the app for it it to hop back on a schedule. While this has been alright that I’ve been home, if I’m away from my tank I cannot risk having the lights be on 24 hours because of it getting “stuck”. Please update either the app or the light to fix this problem.","updated":"2017-10-01T18:19:06-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1902297083","userName":"nano reefer","userUrl":"https://itunes.apple.com/us/reviews/id16132531","version":"2.11","score":5,"title":"Nice lights. App works. Quick customer service","text":"Have had the lights for a year or so now. Work very well. I use with the iPhone app. There was an issue with the newest version of the app working with the iPhone X. Customer service had it corrected in less than 24 hours with good communication. Would recommend this product and app.","updated":"2017-11-06T12:52:44-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"6696074035","userName":"Maddie Fos star","userUrl":"https://itunes.apple.com/us/reviews/id368253457","version":"3.9","score":1,"title":"Not user friendly, don’t waste your time.","text":"The app is not much help. I got the Prime 16HD light, but the app is so confusing I am going to return it. I watched the support video online and read the support steps. I just want to download a preset for my lighting system, but I can’t figure it out. There’s no recommendations in the app, or support, so if you need help you have to go to the actual website. I’m just very disappointed in how unhelpful this app is and because of the lack of support I’m returning the product I was so excited to have.","updated":"2020-11-28T10:24:38-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"5284445945","userName":"iloveapplegrl","userUrl":"https://itunes.apple.com/us/reviews/id129028081","version":"3.6","score":2,"title":"Potential wasted","text":"I really like this light, however the app interface is so frustrating and is not user friendly at all. Seems like they don’t listen to feedback regarding this app. What a shame. I am considering returning this light just due to how this app works. If I can’t figure out how to control and set the lights it is just a waste of money.\nAnd none of the videos on their website reflect the action/options in this app.","updated":"2019-12-17T12:07:33-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"6897515457","userName":"MQCap","userUrl":"https://itunes.apple.com/us/reviews/id1124362741","version":"3.10","score":2,"title":"Basic Control","text":"Not sure why I have to be connected to the light in order to create or edit a schedule.  Needs to be a schedule editor mode within the app so you can make schedules and edit existing ones without being connected to the light.  Love the products hate the app!  Needs improvements!","updated":"2021-01-21T13:20:12-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"5444053944","userName":"Eeric103","userUrl":"https://itunes.apple.com/us/reviews/id317184919","version":"3.6","score":1,"title":"All most the worst app I’ve ever use.","text":"To have such a good light but such a horrible app to control it blows my mind.  It like you let your teenager or maybe anyone with a MacBook program this thing.  Where was the quality control.  You guys can’t enjoy setting or editing a schedule with this.  Its not intuitive, hard to fine tune, and editing a current lighting settings.  Training videos are out dated to current app.  In short I expected more from the hype.","updated":"2020-01-24T12:36:11-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"4170497833","userName":"NeoJeo","userUrl":"https://itunes.apple.com/us/reviews/id188651171","version":"3.3","score":1,"title":"Not stable","text":"Unfortunately when I’m viewing my Nero 5 current gallon per hour in the app within 10 seconds will kick me back to the main menu then I have to select pump again go back to gallon per hour I can view it and then it kicks me back out I’ve reached out to tech-support they don’t know and I have uninstalled the app three times and reinstalled. Also I got an Apple Watch because the app was supposed to be compatible based on their advertising but it seems that it’s not for the Nero 5 pump.","updated":"2019-05-18T08:42:21-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"7037457522","userName":"drphilgetexcited","userUrl":"https://itunes.apple.com/us/reviews/id101533534","version":"3.11","score":1,"title":"So complicated it’s stupid","text":"So excited about getting this light.... then so disappointed when I had to use the app. Tried to make a simple light cycle and it was such a pain. Everything I clicked either erased all my progress or made me restart from the beginning. After 30mins I just did their simple schedule and set the times and walked away. You will not be able to customize your lights easily on this app.","updated":"2021-02-25T08:21:08-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"8041090800","userName":"Do the Jerk","userUrl":"https://itunes.apple.com/us/reviews/id23290478","version":"3.14","score":1,"title":"Really confused","text":"I don’t get this app at all.  The buttons and options  in the pictures look nothing like what appears on the app.  Can’t figure out how to set a lighting program or how to use some of the features.  Online videos are only mildly helpful. \n\nIs there just a simple way to turn all on or off like the picture shows?   What happened to the special effects.    \n\nLove the lights, hate the app","updated":"2021-11-19T09:57:40-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"6010757958","userName":"Doberman26","userUrl":"https://itunes.apple.com/us/reviews/id43799753","version":"3.8","score":1,"title":"Frustrating","text":"Most frustrating lights I've ever had to deal with in 20 years of having fish tanks! Once you get them working on a schedule, they all of the sudden make their own schedule. One on, one off; both on, both off. Contacted customer service and then just send a copy and paste generic, \"Here's how you re set your lights,\" page out of the manual. I would not recommend.","updated":"2020-05-29T14:16:26-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1740651629","userName":"Green man 5","userUrl":"https://itunes.apple.com/us/reviews/id184857216","version":"2.10","score":4,"title":"Works pretty well 👍🏻","text":"When the app 1st rolled out there were a lot of bugs and glitches but now they all seem to be worked out and I'm pretty happy with how well this app works.... my only suggestion is, I wish there was a way to import lighting schedules from the internet 😝","updated":"2017-08-22T18:49:13-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"5559104782","userName":"TerenziAgain","userUrl":"https://itunes.apple.com/us/reviews/id166056961","version":"3.6","score":2,"title":"Disappointed!","text":"I just spent $500 for a crappy app that doesn’t look anything like what I’ve seen online. And what’s with Bluetooth but no WiFi?  This entire set up is very frustrating. I’ve heard “you get what you pay for” ... Chinese black boxes are 1/5th of the price of one AI (plus mount) and are so simple to use.","updated":"2020-02-20T19:50:58-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"4105187349","userName":"Say no to AI","userUrl":"https://itunes.apple.com/us/reviews/id1014142158","version":"3.3","score":1,"title":"Aweful app leads to aweful lights","text":"You can’t use your lights if the app never connects!! This is the most frustrating and most expensive light system that doesn’t work that I own. 9/10 times it won’t connect and there is simply on other way to change your lights.  Should have stuck with the older system. The remedies provided are a joke from AI. Lost a customer for sure. Many other systems out there.","updated":"2019-05-05T09:35:28-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"6416509650","userName":"dietdew321","userUrl":"https://itunes.apple.com/us/reviews/id230427396","version":"3.9","score":3,"title":"This app is meh","text":"It would be AMAZING to be able to adjust the settings on a computer then download the file to the light. Trying to work on a phone (even in landscape mode is rough) I think there’s a lot of room for improvement.","updated":"2020-09-10T18:58:18-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"3912649072","userName":"alex from albuquerque","userUrl":"https://itunes.apple.com/us/reviews/id624133296","version":"3.3","score":2,"title":"Constant connection issues","text":"I have solid internet connection, but seem to constantly have issues connecting with the app.   The parent and child lights have a lag between them most times.","updated":"2019-03-22T08:43:12-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"7771549372","userName":"Marcus.Adams","userUrl":"https://itunes.apple.com/us/reviews/id103232345","version":"3.14","score":1,"title":"Connection timeout","text":"I’m not sure if it’s the app or the hardware, but every time I open the app, I always get a connection timeout. Have to restart the app about a dozen times before it finally connects.  Both of my lights show it’s connected to wifi which makes me think the app is the problem. If this continues I will not get another AI light.","updated":"2021-09-04T14:57:30-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"7398339286","userName":"Jacob Hauschild","userUrl":"https://itunes.apple.com/us/reviews/id48909245","version":"3.13","score":1,"title":"Disappointed","text":"Payed over $200 for an AI Prime 16HD, extremely disappointed that apparently I didn’t give enough money to be able to use a desktop version of this app??? Plus now the app itself does nothing but crash. Day by day you are forcing me to looking at other brands. Most definitely will not recommend!!","updated":"2021-05-28T06:43:49-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"5785752510","userName":"Jarhead_jr","userUrl":"https://itunes.apple.com/us/reviews/id548290928","version":"3.7","score":1,"title":"Great lights, crappy app","text":"The app leaves soooo much to be desired. Poor connectivity, changes settings when saving lighting profile, no finite controls next to sliders, weather no longer there, crashes.... I mean come on. If you design a product that can only be controlled by an app, YOU HAVE TO HAVE THE APP WORKING! This department needs a new supervisor, seriously.","updated":"2020-04-09T05:22:31-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"3867806490","userName":"Dani813727","userUrl":"https://itunes.apple.com/us/reviews/id476759946","version":"3.3","score":3,"title":"Cannot connect but has been for months","text":"Is something wrong with the app?  All my wifi connections are good, only this app is having problems but it’s been working for months?  Bug fix needed?  Network down?","updated":"2019-03-10T19:36:07-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"5390453166","userName":"Knhllr","userUrl":"https://itunes.apple.com/us/reviews/id149836964","version":"3.6","score":1,"title":"Difficult to use","text":"Great lights but the app is poorly programmed. It’s buggy and unintuitive. It’s very difficult to set a desired lighting schedule, especially if you want lights on and off at different times throughout the day. Had I known the shortcomings of the app, I would have purchased a different light.","updated":"2020-01-11T08:42:15-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"3681570748","userName":"azermelda lotta cunda","userUrl":"https://itunes.apple.com/us/reviews/id492319044","version":"3.2","score":3,"title":"iPad missing things","text":"The iPad app is missing the “+” button so basically you cannot use the light fully. I realized this when I went to my iPhone which has the button.","updated":"2019-01-22T05:57:23-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"7394887371","userName":"Bob1a2b3d","userUrl":"https://itunes.apple.com/us/reviews/id168695278","version":"3.13","score":4,"title":"Improvement but a bug on acclimation","text":"I can not adjust acclimation or even disable it. It locks up.","updated":"2021-05-27T08:27:51-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"8137351899","userName":"Joel Joel Binks","userUrl":"https://itunes.apple.com/us/reviews/id110620767","version":"3.14","score":1,"title":"Embarrassingly bad","text":"As I write this I am unable to connect to my light, which happens repeatedly and seemingly at random. Getting exact levels for the different colors of light requires a lot of fine finger dexterity, which is annoying and time consuming.","updated":"2021-12-16T13:31:20-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"3406776329","userName":"cilinia","userUrl":"https://itunes.apple.com/us/reviews/id40133403","version":"3.2","score":2,"title":"Wi go","text":"Great lights if I could use them. Most of the time they will not connect to WiFi or it bumps me out when I open app. Would be great if there were detailed instructions on how to use app.","updated":"2018-11-11T09:07:54-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1904992571","userName":"Dre rocks","userUrl":"https://itunes.apple.com/us/reviews/id135524110","version":"2.11","score":5,"title":"Now works on iPhone X","text":"App now works on iPhone X. Very happy to get the full functionality back. I️ love my Prime 26 hd lights.","updated":"2017-11-07T18:03:26-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"6342625094","userName":"Great app and easy to use","userUrl":"https://itunes.apple.com/us/reviews/id39190681","version":"3.8","score":1,"title":"Not user friendly","text":"I’ve worked in tech for a long time and this app is not only NOT user friendly, it has horrible functionality. They need a new app ASAP. So much so that I regret buying these lights","updated":"2020-08-20T14:43:47-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"7390496200","userName":"Upset and waiting","userUrl":"https://itunes.apple.com/us/reviews/id280270465","version":"3.13","score":1,"title":"Can’t open app very frustrating","text":"After the last update the app cannot be opened…tried deleting it and reinstalling but App Store thinks it’s still installed…would appreciate some help","updated":"2021-05-26T06:05:33-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"7389061692","userName":"babyjesus2112","userUrl":"https://itunes.apple.com/us/reviews/id436298117","version":"3.13","score":3,"title":"App crashing","text":"The app keeps crashing and not loading up","updated":"2021-05-25T21:02:32-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"6294485425","userName":"Antman3212","userUrl":"https://itunes.apple.com/us/reviews/id307376497","version":"3.8","score":5,"title":"It works","text":"Easy set up","updated":"2020-08-08T04:18:11-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"4997429047","userName":"Kelzeylee","userUrl":"https://itunes.apple.com/us/reviews/id49024080","version":"3.6","score":5,"title":"Simple!","text":"Very easy and simple app. Makes controllability easy","updated":"2019-10-22T07:19:31-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"2661366468","userName":"nitro79","userUrl":"https://itunes.apple.com/us/reviews/id35990241","version":"2.14","score":1,"title":"Worst Tech Ever. Hope Red Sea Wakes Up. The problems with AI is destroying Red Sea’s Reputation","text":"Three days without lights cause the tech is completely messed up.  Same problem everyone seems to be having. AI refuses to fix. If you can get your Red Sea without these lights you’ll be much happier.","updated":"2018-06-08T06:38:31-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"4930718257","userName":"BumperKart","userUrl":"https://itunes.apple.com/us/reviews/id107546963","version":"3.5","score":2,"title":"Constantly can’t connect","text":"Decent app when it works. Constantly can’t connect to Director even though it sees it on the network. Only way to fix is to restart Director.","updated":"2019-10-12T06:23:15-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"3599758330","userName":"GW3744","userUrl":"https://itunes.apple.com/us/reviews/id49160710","version":"3.2","score":1,"title":"Awful App","text":"Extremely counter intuitive and difficult to operate.  No where can a person find detailed instructions on how to use this app.  Look elsewhere before buying this thing.","updated":"2019-01-01T06:57:45-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"7396657173","userName":"Mattayo85","userUrl":"https://itunes.apple.com/us/reviews/id180087314","version":"3.13","score":1,"title":"App is broken now!","text":"After this weeks update I can no longer remove my light from acclimation mode. It just spins and eventually crashes. I have zero control over my AI Prime 16 now.","updated":"2021-05-27T19:59:26-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1901916043","userName":"StargateDG","userUrl":"https://itunes.apple.com/us/reviews/id11862642","version":"2.10","score":1,"title":"Does not work iPhone X 11.1","text":"Worked fine on my iPhone 6 but nothing shows up on my new iPhone X 😡. It just flashes but the screen is blank. The light is working as scheduled but I can no longer change anything.😡😡😡","updated":"2017-11-06T08:37:51-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"3591471195","userName":"Schrodinger","userUrl":"https://itunes.apple.com/us/reviews/id22365270","version":"3.2","score":4,"title":"worked out of the box.","text":"the only reason i didn’t give the app 5 stars is due to my head scratching at how to adjust start times of complex presets i wished to try out. i’m sure there’s an easy way to do this. i don’t wanna recreate saxbys zig zags by hand if i don’t have to.","updated":"2018-12-30T04:40:26-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"2777572042","userName":"McBainNY","userUrl":"https://itunes.apple.com/us/reviews/id26799969","version":"2.14","score":5,"title":"Good product","text":"Works well now","updated":"2018-06-26T17:05:36-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"7394907301","userName":"sdiaziii","userUrl":"https://itunes.apple.com/us/reviews/id33221258","version":"3.13","score":1,"title":"Crashing since latest update","text":"The app keeps crashing since the last update In May 2021.","updated":"2021-05-27T08:34:04-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"4944071970","userName":"Xwarcry","userUrl":"https://itunes.apple.com/us/reviews/id277627726","version":"3.5","score":2,"title":"Ups and Downs","text":"This app is good but not the best due to the fact that it keeps losing its signal to the the WiFi with local or cloud","updated":"2019-10-13T20:44:59-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"8020696568","userName":"perverseosmosis","userUrl":"https://itunes.apple.com/us/reviews/id19465430","version":"3.14","score":1,"title":"Never gets any better","text":"These lights almost never connect. An absolute failure of a product.","updated":"2021-11-13T12:16:09-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"7398625536","userName":"iAmJaiWill","userUrl":"https://itunes.apple.com/us/reviews/id189401001","version":"3.13","score":1,"title":"App doesn’t work!!!!","text":"App doesn’t work with recent iOS update! Really disappointed that this is now the case.","updated":"2021-05-28T08:04:44-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"5661303048","userName":"090987546","userUrl":"https://itunes.apple.com/us/reviews/id114106662","version":"3.7","score":1,"title":"Nothing works","text":"Bluetooth constantly crashes. Settings don’t save. This app is worse than corona","updated":"2020-03-14T14:21:09-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"5411360746","userName":"Loonietunes59","userUrl":"https://itunes.apple.com/us/reviews/id79005549","version":"3.6","score":1,"title":"Horrible","text":"Can’t even sign in! Need to reset password and app locks up. Won’t give keyboard to type info","updated":"2020-01-16T08:23:45-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1956294947","userName":"RGM26","userUrl":"https://itunes.apple.com/us/reviews/id497976330","version":"2.11","score":2,"title":"Error","text":"I keep getting a timed out error when I try and connect to my light","updated":"2017-11-28T18:04:29-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1899534825","userName":"Carlosxe","userUrl":"https://itunes.apple.com/us/reviews/id191192738","version":"2.10","score":2,"title":"Crashes after ios 11.1 update","text":"It won’t open after 11.1 update","updated":"2017-11-05T08:12:40-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1962357977","userName":"marvinflanery","userUrl":"https://itunes.apple.com/us/reviews/id668907721","version":"2.11","score":2,"title":"Marvin","text":"Why does my lights keep on blinking for","updated":"2017-12-01T06:21:14-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1900440143","userName":"mvasquez02","userUrl":"https://itunes.apple.com/us/reviews/id103217234","version":"2.10","score":1,"title":"App not working","text":"Trying to open app and it’s not opening, I’m running IOS 11.1. Can you please fix because I need to adjust my lights on my aquarium","updated":"2017-11-05T17:40:02-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"5730722266","userName":"frog dood","userUrl":"https://itunes.apple.com/us/reviews/id659092192","version":"3.7","score":1,"title":"Help!!!","text":"Won’t turn lights on or off after about 8 months","updated":"2020-03-29T05:38:53-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"6165960237","userName":"truth2ak","userUrl":"https://itunes.apple.com/us/reviews/id205206482","version":"3.8","score":5,"title":"AWESOME","text":"One very dynamic lighting experience!","updated":"2020-07-06T17:03:52-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"3561285847","userName":"Puckhoggg7845","userUrl":"https://itunes.apple.com/us/reviews/id150344249","version":"3.2","score":1,"title":"Greedy","text":"I don’t like being charged for an app that is required to run a light that I paid $200 for.","updated":"2018-12-22T16:30:23-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1900635489","userName":"SS0805","userUrl":"https://itunes.apple.com/us/reviews/id151666224","version":"2.10","score":1,"title":"Crashing on iPhone X","text":"App attempts to open and immediately closes on the iPhone X.","updated":"2017-11-05T19:41:13-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1380851435","userName":"TJ the fishman","userUrl":"https://itunes.apple.com/us/reviews/id162517910","version":"2.2","score":2,"title":"Infancy stage","text":"So I've owned the AI Hydra for about 2 1/2 years. Their concept is amazing AND when it works, the light is amazing. \nThe problem is from the first month I've owned the light I've had multiple programing issues. Funny as it seems (it's really more like panic) every time I go away, my light goes off line. It takes multiple calls to the company. I'm a master at all the different resets, and I've had to send the light in 3 times. Still have no answer why this happens very randomly. \nOnce AI figures out the technical wifi issues, so there is no panic induced downtime, anyone who is thinking about purchasing any of their lights MUST have a backup just in case this happens to them. \nI will say AI is very good at getting back to their customers. They also have sent me \"replacement parts\" that were supposed to fix my issues. We shall see as the last down time was very recent. What I'm really hoping for is the real FIX with their wireless controller which is what I think the problem is.","updated":"2016-05-19T02:00:59-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"6976124137","userName":"Lord Krath","userUrl":"https://itunes.apple.com/us/reviews/id37720084","version":"3.10","score":3,"title":"Works.","text":"Pros:\n* Single app for managing AI devices.\n* Not too much chrome means you see more stuff and not fluff.\n* Basic functions work as expected.\n\nCons:\n* Unusable cloud account creation.\n* Weird organization of devices.\n\nThe app works to control my Prime32HDs and Nero3s, but the organization of devices into “tanks” is weird. You have to configure a  “tank” for each device *type*. Intuitively, we should be able to group lights, power heads, etc. logically under a single “tank.”\n\nMy biggest gripe?  Probably the organization.  \nBut then also there is the “waiting for authorization” message I get when I try to create a cloud account. What does that even mean?  It’s been months since I got my first device.\n\nThe products themselves work great and I quite like them. This app makes them usable, but it does feel also like a missed opportunity.\n\nFeature requests that would be fantastic:\n* Fix cloud account creation\n* Enable smart home capabilities for use with SmartThings, Alexa, or even adjacent smart systems like Neptune’s Apex Fusion\n* Enable “slide-locked” touch motions to adjust intensity for all channels for all times at once. I can do it with a single time setting, but not for the whole scheme. It is a challenge on a mobile phone and have to use iPad for these types of edits otherwise.\n* If cloud account creation doesn’t allow for saving of profiles in the cloud (or if it will never allow registration), then perhaps at least enabling cloud profile saving (OneDrive, Google Drive, etc).\n* Finally, an add-on module that would allow for WiFi control with the Prime32HDs and Nero3s which might enable the request smart home capabilities mentioned previously.","updated":"2021-02-09T21:33:46-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"3951635183","userName":"Snapperer","userUrl":"https://itunes.apple.com/us/reviews/id281891686","version":"3.3","score":1,"title":"WiFi connection","text":"Horrible service!!!l","updated":"2019-03-31T07:13:48-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1900521920","userName":"jsne","userUrl":"https://itunes.apple.com/us/reviews/id24574149","version":"2.10","score":1,"title":"iPhone X","text":"App does not work on iPhone X","updated":"2017-11-05T18:31:23-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1234544146","userName":"samdlovelaceiv","userUrl":"https://itunes.apple.com/us/reviews/id40115504","version":"1.5","score":2,"title":"Needs an Overhaul","text":"AquaIllumination makes the best reef led lights out there, yet they have the worst software. I don't get it. This app has basically no features, and same for the my ai website. It's just so basic, I expect so much more from a company who produces such amazing products. They need to focus on their software too!","updated":"2015-07-28T11:28:11-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1573143852","userName":"Mcorkin","userUrl":"https://itunes.apple.com/us/reviews/id16330935","version":"2.9","score":3,"title":"No desktop version?","text":"The iphone app, though relatively instructionless, can be figured out in the course of an hour (though therea are a few details I havent explored yet). Before upgrading to the Hydra 26HDs I ran the previous version of the lights with controller. I found the old physical controller to offer much more control than the current iphone/ipad software. I decided to download the desktop version of the software (for Mac, of course) hoping it would offer me more control of the lighting. Unfortunately, no desktop version exists.","updated":"2017-03-26T05:49:39-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"899144643","userName":"huntd5","userUrl":"https://itunes.apple.com/us/reviews/id186917937","version":"1","score":5,"title":"Just got it today","text":"I just got it today and after having tried to set up my new Vega's on my computer, I got this and it made it much easier. The only thing is I wish there were more effect options and there was a button to click to test out each effect in the tank. Great app simple and easy","updated":"2013-11-22T14:34:18-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1300749510","userName":"Coke Can Dan","userUrl":"https://itunes.apple.com/us/reviews/id42520733","version":"2.0","score":1,"title":"Horrible reliability","text":"Every time I open the app it refuses to memorize the last settings. Also once I reopen the app days later after setting up the lights the app refuses work. Long story short the Technology is new and very buggy. Every time I want to check the app settings of the lights through the app , I have to reset the lights to default to make the app recognize the settings I saved. When it works it works good needs work and updates for 6s phones. I would wait for 2nd version to come out before investing in these lights","updated":"2015-12-14T18:58:30-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1325700775","userName":"Nfidndn!;","userUrl":"https://itunes.apple.com/us/reviews/id136728685","version":"2.1","score":1,"title":"Biggest PoS ever!","text":"This app is the worst, along with the light that can't even stay on without me fiddling with the app every day. Then when you finally get it to slightly work, the programmers decide to change the app and mess with all your settings so you have to repeat the BS process of dealing with it constantly crashing on you daily. Don't bother wasting your time with this piece of junk product. All the reviews online have to be fabricated or they payed people to write it for them. I would rather spend my money buying petco products","updated":"2016-01-31T12:10:41-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1070180696","userName":"SWMorrow","userUrl":"https://itunes.apple.com/us/reviews/id10027900","version":"1.2","score":3,"title":"Ok but very minimal","text":"This app is ok but if you switch it to weather effects and later turn them off you have to get on your laptop to go back to your preset. \n\nWith the new controller you can pull up storms on demand, but with this and the director it takes forever (15 minutes or so) for the weather to take effect and it changes to a very vanilla ramp timer setting. \n\nWhile you can manually change the color settings you lose the ability to retain your preset while in a weather effects mode. \n\nThese can all be done to some extent with the new controller, but with this and the director for some reason you lose those abilities. \n\nAI, if you could fix all of that you would have the perfect setup.","updated":"2014-09-25T11:36:43-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1304985393","userName":"hkremer","userUrl":"https://itunes.apple.com/us/reviews/id37001451","version":"2.0","score":5,"title":"Great improvement!","text":"It took a while to get to iPad, but they really did it right. I had to go to my Mac to do anything serious before, now this has everything and more than the web interface. Love the kelvin dial, great labeling, and layout. Also nice addition of all off/on, which was very much needed. Nice job AI.","updated":"2015-12-23T06:55:42-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"948368424","userName":"BlinkingSun","userUrl":"https://itunes.apple.com/us/reviews/id136705955","version":"1.1","score":5,"title":"Much improved!","text":"Not only did AI work with me to  fix my buzzing hydra52, they also listened to complaints an fixed the \"no Internet\" issue with the iPhone app. Great product support! Since purchasing my hydra52s, I have added three sol blues to the line-up an they are all running seamless with the director.","updated":"2014-02-22T10:59:56-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1477572278","userName":"jdmdc2nr","userUrl":"https://itunes.apple.com/us/reviews/id31320733","version":"2.8","score":5,"title":"Update","text":"Nice update. Using on my 26hd. I like being able to save and share the presets from the app now. You guys should get some sort of database of presets going that users can add to. I think the option for cloud cover only with no lightning would be cool also. \nthanks","updated":"2016-11-02T18:57:50-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"912218822","userName":"Jamesmkalbaugh","userUrl":"https://itunes.apple.com/us/reviews/id42041189","version":"1","score":5,"title":"Good Stuff","text":"Great App. Very user friendly, and accurate. It's hooked to my Hydra 52, and already noticed everyone seems very happy in my 75 gallon reef.  Under the Control tab, I would like to see a drop down list for the preset modes. All I see is one. Great stuff though!","updated":"2013-12-20T18:22:23-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1564368375","userName":"B_Dawk5","userUrl":"https://itunes.apple.com/us/reviews/id556423041","version":"2.9","score":5,"title":"Awesome software","text":"This app works great on my IPad and 6s iPhone. Can control or check on my settings in a different state as long as I have a wifi connection. Up and running for 5 months without any issues whatsoever.","updated":"2017-03-14T08:09:28-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"900255823","userName":"LLkoolAid24","userUrl":"https://itunes.apple.com/us/reviews/id280613560","version":"1","score":4,"title":"Early stages...","text":"So excited to see this out! Can tell you already, needs an update/fix. Changes to weather effects does nothing through the app. Would also like to see an On/Off selection as well. Great layout though! Looks amazing!","updated":"2013-11-24T20:27:21-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1670148246","userName":"iphone boss 420","userUrl":"https://itunes.apple.com/us/reviews/id145093662","version":"2.9","score":5,"title":"App works flawlessly","text":"I have no idea why there would be any bad reviews about this app. It works flawless and is a great controller, follow the simple directions on the card that comes with your product. Very happy with my AI Prime HD purchase.","updated":"2017-07-05T11:11:44-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1489733329","userName":"lambogurl123","userUrl":"https://itunes.apple.com/us/reviews/id191170558","version":"2.8","score":4,"title":"Cloud Cover","text":"This is very versatile app and i love the fact that i can control my lighting from my iphone. i am disappointed that there is no cloud cover separate from the lightning. please let us use cloud cover and lightning separately on the next update.","updated":"2016-11-23T11:33:41-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1486932477","userName":"It's ah me","userUrl":"https://itunes.apple.com/us/reviews/id159559517","version":"2.8","score":3,"title":"Cloud cover please.","text":"The app offers great controllability of your AI lights but the version from a few years ago offered separate cloud cover and storm effects. This version can not do cloud cover effects without lightning. The app would be perfect if they brought back cloud cover separate from storms.","updated":"2016-11-18T17:08:55-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1486829290","userName":"Prekaza","userUrl":"https://itunes.apple.com/us/reviews/id43240866","version":"2.8","score":4,"title":"Needs more","text":"It needs to be able to remove the flashing lightning affects from the weather controls. I like that they dim periodically instead of a constant beat down of light onto the corals but the flashing is annoying and stresses fish.","updated":"2016-11-18T11:11:42-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"960724490","userName":"Grabby180","userUrl":"https://itunes.apple.com/us/reviews/id49239556","version":"1.1","score":3,"title":"Missing Things","text":"Kind of disappointed with the app. Would like to see buttons for on demand cloud sweeps and lightning to show off the lights. Also, adding the ability to load pre made lighting schedules would be great. And an app designed specifically for the iPad would be great too...","updated":"2014-03-16T10:41:41-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1227700328","userName":"Canvoniman XXI","userUrl":"https://itunes.apple.com/us/reviews/id114491174","version":"1.5","score":5,"title":"Works great","text":"It works great for me, no bugs, though it would be cool to have a setting where the colors would cycle on their own on an adjustable power level","updated":"2015-07-15T08:11:00-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1540268472","userName":"Kdhander","userUrl":"https://itunes.apple.com/us/reviews/id24252593","version":"2.9","score":1,"title":"Frustrated","text":"So far this has been a failure and I'm not happy with the money I spent on this system. Tried to connect with my iPad and that would not work correctly. Was told works far better with the iPhone, so I'm now trying to set it up there. App is not recognizing the light I'm trying to set up. Instructions need to be a bit detailed, not as simple as they indicate.","updated":"2017-02-08T17:19:31-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1286973371","userName":"DollarBill 78","userUrl":"https://itunes.apple.com/us/reviews/id324556105","version":"1.91","score":2,"title":"App is worse than before an no iPad app!","text":"This update has brought on a lot of frustration and shocked my coral because the lights aren't pairing. I've had these light for almost a year and you still haven't released an iPad app. GET WITH THE TIMES. Update your IT department!","updated":"2015-11-15T05:33:06-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1384807042","userName":"Alpha91_cn1","userUrl":"https://itunes.apple.com/us/reviews/id16967696","version":"2.3","score":4,"title":"Good app, more features","text":"The app works perfectly with my new hydra 26 HD. Can add new feature allow users to save personal lighting profiles, also make fast switch?","updated":"2016-05-27T04:22:30-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1179522547","userName":"Zip651","userUrl":"https://itunes.apple.com/us/reviews/id219990037","version":"1.4","score":5,"title":"Cool concept","text":"Take control of your AI Prime with your phone! Easy to use and convenient.  Each LED is adjustable, there is a storm mode to simulate thunder storms, and a lunar mode. I really like the light and app!","updated":"2015-04-07T19:03:17-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"898584798","userName":"Harkinstein","userUrl":"https://itunes.apple.com/us/reviews/id221024237","version":"1","score":4,"title":"I love this app!","text":"It is so much fun to play with the lighting with this app instead of sitting at the computer in another room. I couldn't be more happy that I chose AI products for my aquarium. Keep up the good work!","updated":"2013-11-21T07:28:44-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1243668188","userName":"Crazy Brit 63","userUrl":"https://itunes.apple.com/us/reviews/id430251409","version":"1.5","score":5,"title":"Great lights","text":"My partner and I own a company that does aquarium maintenance.  This App is fantastic. So far no problems and absolutely love the options this app provides.  Very impressed w the Director!!!!!","updated":"2015-08-15T14:43:15-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1263197068","userName":"Carlitos78257","userUrl":"https://itunes.apple.com/us/reviews/id12553684","version":"1.5","score":1,"title":"Junk","text":"Horrible app for very advanced lights. Crashes and deletes all your settings very easily. Shop for other light manufactures because these lights are no good without an advanced controller.  I am tired of losing my programming and having to manually reenter every piece of data. Lacks any valuable presets or suggestions on how to adjust your lights.","updated":"2015-09-26T13:03:24-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1321315970","userName":"Marcmolitor123","userUrl":"https://itunes.apple.com/us/reviews/id228745477","version":"2.1","score":1,"title":"This is the word light I have ever had","text":"This app crashes all the time it's always causing me problems I hoped with the updates that it would fix the problems now I go to set a 24 hr cycle it works but won't put the light power above 40 percent this has been the worst light I have ever had app is so bad it's horrendous never I repeat NEVER BUY THIS LIGHT EVER","updated":"2016-01-23T17:33:39-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1300657840","userName":"The_Pale_Rider","userUrl":"https://itunes.apple.com/us/reviews/id29444963","version":"2.0","score":5,"title":"Great update!","text":"I particularly like the Kelvin color settings which only used to be accessible on the web portal.","updated":"2015-12-14T14:01:07-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1265175617","userName":"Chunt0212","userUrl":"https://itunes.apple.com/us/reviews/id144571947","version":"1.8","score":2,"title":"What happened?","text":"App was working flawlessly until this last update...now it gives me an error msg every time I try to select any of my AI primes...I don't have a laptop anymore so it seems like I am locked out of my light! VERY frustrating!","updated":"2015-09-30T20:42:47-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1265101141","userName":"Rvca25","userUrl":"https://itunes.apple.com/us/reviews/id262010563","version":"1.8","score":4,"title":"About prime light","text":"So my prime light is not reading  my app I can not control it with my phone to adjust the light..and when I go on the app they say it an error","updated":"2015-09-30T17:06:16-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1300460009","userName":"Thomas with two ai hydro52s","userUrl":"https://itunes.apple.com/us/reviews/id422076503","version":"1.91","score":1,"title":"What happened ?it got worse!","text":"Fix it. Or we will go, its that simple! Used to at lease be able to set controls now With app its near impossible. Doesn't connect to the cloud very buggy and when you do have it connected its to hard to use if near impossible! Fix it!","updated":"2015-12-14T04:01:43-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1272415831","userName":"Zebrolmannnnn","userUrl":"https://itunes.apple.com/us/reviews/id424522616","version":"1.9","score":4,"title":"Glad i dont have corals yet","text":"Seems to be fixed. Would be nice if I could log onto light without changing networks.","updated":"2015-10-16T02:44:46-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1266464684","userName":"This name isnot taken","userUrl":"https://itunes.apple.com/us/reviews/id131935269","version":"1.8","score":1,"title":"Others are right","text":"I just bought this light no more than 20 minutes ago. I can't turn it on and it seems that I need the app. \nThis would be fine if the app was functional. I can't wait for another update. My coral doesn't deserve this.","updated":"2015-10-03T12:11:16-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1265523892","userName":"Miotch!","userUrl":"https://itunes.apple.com/us/reviews/id34034789","version":"1.8","score":1,"title":"Great light, terrible app","text":"The app will not connect to the light about 90% of the time. Randomly, without reason, the app connects. My tank, however, is thriving and doing better than ever with these fantastic lights. I just wish the app was working so I could control them when I need to.","updated":"2015-10-01T14:21:11-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1266008133","userName":"Njuare00","userUrl":"https://itunes.apple.com/us/reviews/id431375381","version":"1.8","score":2,"title":"Issues with update","text":"So since the new update I tried to change my color spectrum and it will not allow me to change the percentage if I touch it it goes to zero","updated":"2015-10-02T15:43:17-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1079292499","userName":"Coral84","userUrl":"https://itunes.apple.com/us/reviews/id242850807","version":"1.2","score":2,"title":"Still needs work","text":"Needs a lot of work still in my opinion. Crashes a lot on me or won't even connect","updated":"2014-10-12T08:17:51-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1286619308","userName":"redfisher18","userUrl":"https://itunes.apple.com/us/reviews/id29347467","version":"1.91","score":1,"title":"What did they do ????","text":"App used to work fine but now it's terrible. \nUse to be easy to use on iPad not any more.......I hate to use it now,  My problem is I'm using the director of there's and don't have options to not use it.","updated":"2015-11-14T11:37:27-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1215458936","userName":"Freaktravis0717","userUrl":"https://itunes.apple.com/us/reviews/id260505809","version":"1.5","score":1,"title":"Great light bad app!!","text":"Light is amazing an though the app would be the same but can never get it to connect right for any kind of adjustments. Please fix app!!\nDon't want to sell or trade this light, but if the app doesn't get fixed it must go.","updated":"2015-06-20T21:31:16-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1305178344","userName":"D0sE","userUrl":"https://itunes.apple.com/us/reviews/id33262634","version":"2.0","score":2,"title":"Crashes on some light profiles","text":"It crashes every time I go to control on some light profiles","updated":"2015-12-23T15:49:24-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1307273413","userName":"queremos noticias","userUrl":"https://itunes.apple.com/us/reviews/id352669974","version":"2.0","score":1,"title":"Horrible","text":"Horrible,it crashes all the time when I tried to open Control . Don't know what to do. I deleted the app and downloaded again and still. Don't work properly. Helppppp.","updated":"2015-12-27T18:28:50-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1314091607","userName":"Lepchitz","userUrl":"https://itunes.apple.com/us/reviews/id119359633","version":"2.1","score":1,"title":"New update not working","text":"I try and log in and get Authentication error message since update. I was ok with the bland software because I could at least use it and control my lights, but now I'm jus SOL.","updated":"2016-01-09T20:33:00-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1269839027","userName":"RickyRick0828","userUrl":"https://itunes.apple.com/us/reviews/id114616333","version":"1.9","score":1,"title":"Prime","text":"I should've went with a different light. This app needs to be improved badly! I like the the light but not the app! The last update take a lot of the control away!","updated":"2015-10-10T17:01:01-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"919257223","userName":"tomtly","userUrl":"https://itunes.apple.com/us/reviews/id42362992","version":"1","score":3,"title":"still rough","text":"for a $100 director module, this app should at least emulate the web version, but doesn't.  hopefully it will soon have presets, regional weather, and real time light status in the controls.","updated":"2014-01-03T00:58:47-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1280759404","userName":"Idontwantto1112211","userUrl":"https://itunes.apple.com/us/reviews/id146058701","version":"1.91","score":1,"title":"Less Usable than Before","text":"The app for the director was Ok but the new update removed functionality so it is actually worse now. Thumbs down.","updated":"2015-11-01T21:03:02-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1598484120","userName":"Stydmuffin304","userUrl":"https://itunes.apple.com/us/reviews/id42897005","version":"2.9","score":1,"title":"Terrible","text":"This app is terrible... my light never connects via wifi or cloud... yet the light on the prime is solid green... and I have no wifi connection issues","updated":"2017-04-26T18:35:51-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1170732457","userName":"Frogmantx","userUrl":"https://itunes.apple.com/us/reviews/id49593997","version":"1.3","score":1,"title":"Can't login with new update","text":"I can't login wit the new updat from the 19th. The app crashes every time I try to login. You guys are better than this!","updated":"2015-03-20T07:50:32-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"2439718934","userName":"@DREWSLAGOON","userUrl":"https://itunes.apple.com/us/reviews/id780094647","version":"2.13","score":3,"title":"@drewslagoon review","text":"I've had this app since the AI prime and it has improved quite a bit...I really wish there was a way to adjust weather settings like cloud cover into more detail. It's a mixture between lightning and cloud cover which even though you're able to set likability for those settings it's very silly to have a small lighting storm EVERY day. If you could separate those two factors that would be great...I like the cloud cover because it gives my corals a resting period.\nPeople are sharing settings out there that have this built into their day schedule where the lights go up and down, I want this setting without having to change my current light settings. Thanks guys! My favorite lights(:\nAi Hydra HD series*","updated":"2018-04-18T23:10:49-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1270458660","userName":"Fish503","userUrl":"https://itunes.apple.com/us/reviews/id108303897","version":"1.9","score":1,"title":"App update...","text":"I just logged into the Director on the app and it shut down my lights. Auto is not working on my preset light schedule, leaving tank in the dark...","updated":"2015-10-11T22:36:33-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1170462837","userName":"DavideAM","userUrl":"https://itunes.apple.com/us/reviews/id23734209","version":"1.3","score":1,"title":"Fix your bugs!","text":"AI needs to be more proactive in fixing software issues to be more in line with their great lighting systems!","updated":"2015-03-19T17:28:53-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1266469521","userName":"Nscott408","userUrl":"https://itunes.apple.com/us/reviews/id449526913","version":"1.8","score":1,"title":"Was working great, now works like crap","text":"Major bugs and glitches...please fix. Can't use lights now 😡😡😡","updated":"2015-10-03T12:27:13-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1268392448","userName":"Ai owner","userUrl":"https://itunes.apple.com/us/reviews/id443058796","version":"1.8","score":1,"title":"Saved settings","text":"Update already!!!!","updated":"2015-10-07T12:40:58-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1374005963","userName":"mdwill1","userUrl":"https://itunes.apple.com/us/reviews/id11184676","version":"2.2","score":5,"title":"App","text":"Works as described.  Thanks","updated":"2016-05-05T13:00:14-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1266963888","userName":"Doing the foxtrot","userUrl":"https://itunes.apple.com/us/reviews/id21563959","version":"1.8","score":1,"title":"Great light, terribad app","text":"App is basically unusable. Bugs all over the shop make the light just barely useable. Please fix.","updated":"2015-10-04T10:31:36-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1212975089","userName":"Jdginley","userUrl":"https://itunes.apple.com/us/reviews/id457369440","version":"1.5","score":1,"title":"Needs fixing","text":"Not compatible with iOS 8.3 extremely upset","updated":"2015-06-15T18:48:07-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1207265103","userName":"Lenlenjan","userUrl":"https://itunes.apple.com/us/reviews/id106700031","version":"1.5","score":1,"title":"Yep, they broke it","text":"The new update doesn't allow me to see anything but a zoomed in screen on my ipad","updated":"2015-06-04T14:50:44-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1265643117","userName":"Arkimarc","userUrl":"https://itunes.apple.com/us/reviews/id213930257","version":"1.8","score":1,"title":"Unknown Error","text":"With this latest version my connection says \"unknown error\" so now what do I do?","updated":"2015-10-01T20:34:06-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1227840951","userName":"Anthony Mallo","userUrl":"https://itunes.apple.com/us/reviews/id39318415","version":"1.5","score":1,"title":"Problems","text":"The light works great but the app is full of bugs!\nPlease fix!","updated":"2015-07-15T15:18:40-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1215324747","userName":"Ashley1111121","userUrl":"https://itunes.apple.com/us/reviews/id193686795","version":"1.5","score":1,"title":"What a pathetic app","text":"So many problems","updated":"2015-06-20T15:02:57-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"6063479711","userName":"exam461","userUrl":"https://itunes.apple.com/us/reviews/id684952775","version":"3.8","score":1,"title":"I had to call the company","text":"As you all know, these lights are expensive. The app is confusing and not easy to navigate. The acclimation setting is not in the setting menu but the moon icon on the upper right. \nSo this app is not good for the beginner. \n\nCall the company ‭(515) 393-6703‬ for help or find a mentor.","updated":"2020-06-11T08:27:58-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"},{"id":"1447941947","userName":"Yb2323","userUrl":"https://itunes.apple.com/us/reviews/id524110286","version":"2.4","score":1,"title":"Non","text":"Saks !!!!!","updated":"2016-09-11T02:02:42-07:00","url":"https://itunes.apple.com/us/review?id=731463335&type=Purple%20Software"}]