[{"id":"7854901014","userName":"ZZIGGY.JOE","userUrl":"https://itunes.apple.com/us/reviews/id46092408","version":"3.57","score":3,"title":"First Apple Watch","text":"Installed the app on my wife’s phone No support for Apple Watch You had a number of updates please bring back Apple Watch support i’ve been with you guys for many years few problemsI’ve had I was able to solve myself I believe one time I need a tech support you guys got right back to me it was deeply appreciated. With Apple‘s iPhone 13 release and Apple software updates maybe you guys can find the time to bring back support for the Apple Watch it was truly amazing.                                    Thank you in advance","updated":"2021-09-28T09:59:19-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"7136847664","userName":"Wanna Stay Healthy Dude","userUrl":"https://itunes.apple.com/us/reviews/id645834671","version":"3.51","score":5,"title":"Excellent Support like Gold!","text":"The VeraPlus Advanced Home Controller isn’t the most intuitive thing to set up using this app or the WebUI. However with all of the incredible capabilities for controlling devices once you get them set up is extremely empowering in so many ways! Not only can you observe the status and control so many devices throughout your home and property but you can do it from virtually anywhere! One of the most amazing aspects of this app and VeraPlus Controller along with the devices you add & control is the incredible technical support staff! I’d have to rate this product support group as the most responsive and helpful support I’ve ever dealt with, by far! Quick responses to my original question to setup the controller and for all my follow-up questions to setup a Z-Wave deadbolt and PIN codes with start & end dates & times. Once they explained what I was missing, the regular operation of these tasks are easily repeatable and flawless in their performance. These tools along with their responsive support team are Game Changers! Thanks Vera.","updated":"2021-03-23T14:37:55-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"6881911530","userName":"datakeepr","userUrl":"https://itunes.apple.com/us/reviews/id142638899","version":"3.51","score":4,"title":"Awesome Support","text":"I’ve recently transitioned from Nexia to Vera Plus.  Nexia has a monthly fee and we used it for 7 years.  My 16 devices are ZWave and the change over was slow and mildly frustrating.  It took about 4 days to transition.   After the devices, I needed to replicate my Nexia scenes which included some delayed timer functions and some dependent device functions.  With the help of the Vera Support Team, we were able to replicate all the Nexia functions successfully.  These folks know what they are doing and helped lots in getting my new security controller setup.  The Vera interface is quite different so it’s been a learning experience.   The support team from Vera has been invaluable !!!!!!  Kudos to these folks - you go above and beyond !!!!!  Thankyou for all your help.","updated":"2021-01-17T12:12:50-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"3743857796","userName":"Twiggiewoodhd","userUrl":"https://itunes.apple.com/us/reviews/id211612841","version":"3.23","score":5,"title":"Been using Vera since  2008 love it","text":"I have been using the Vera controllers since the initial era was introduced and have had great success with the controller and upgraded to the Vera edge a couple years ago” \nI have over 20 devices in my homeroom white switches wall plugs garage door opener smart thermostats and smart smoke detectors all linked and working in union with my vera very reliable controller like there is no fees associated with this controller unlike some carriers and companies who try to sell you this service for money Vera has always been an open and free platform love my controller tech-support is always been good never been an issue definitely can recommend this product and this company wouldn’t switch it out for Samsung","updated":"2019-02-07T09:45:05-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"5238788576","userName":"itisappleBS","userUrl":"https://itunes.apple.com/us/reviews/id199646120","version":"3.30","score":4,"title":"Great stuff of late... little bit of love hate!","text":"Great long overdue updates to the interface... old dashboard was horrible! Much improved user experience and overall usability with the customizable and streamlined dashboard updates!  For the price the functionality and compatibility as a smart home hub with voice assistant integration are phenomenal...  I’ve had 2 controllers bricked along with firmware updates which is frustrating but otherwise the hardware functionality is unmatched at the price and have never had issues with daily operation... no monthly fees... overall i don’t think there’s a better DIY low cost smart home hub!","updated":"2019-12-05T21:49:45-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"6394371188","userName":"KnoKnickKname","userUrl":"https://itunes.apple.com/us/reviews/id305025736","version":"3.45","score":5,"title":"I like the app","text":"And I like Vera.  I’ve been using Vera since the beginning.  This is an outstanding product with great support.  Last week I caused a malfunction that caused my 70 devices.  Support called me back quickly and helped me restore everything quickly with a backup.  A+. First class all the way with very nice, intelligent people. \n\nOur house is highly automated with about 70 devices. With Vera and Vera mobile this is Very easy to do. Automation and voice control at home are now easy to integrate into your lifestyle. You’ll never want to go back.","updated":"2020-09-04T07:03:58-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"5203860025","userName":"Gr8hifi","userUrl":"https://itunes.apple.com/us/reviews/id42216854","version":"3.29","score":2,"title":"Geofence used to work.  Update broke it.","text":"I’ve been using this app for a long time.  It has been rock stable at setting away for whenever me and my wife are both gone as well as setting home for when either of us return.  It has also been great about turning lights on automatically (through scenes) when dark outside and we return.  After the update, these features no longer work.  I’ve tried disabling and re-enabling the geofence on both of our devices and no luck.  We have separate accounts for the Vera (which was the problem I had long ago) so that’s not it.  Nothing has changed other than the update.  Please help restore that functionality.  Thank you.","updated":"2019-11-27T06:46:46-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"3287657265","userName":"Gentle Explorer","userUrl":"https://itunes.apple.com/us/reviews/id11202563","version":"3.17","score":1,"title":"Great support. Bad product. Very very bad.","text":"I so wanted Vera to work. But it suffered from endless zwave connection problems, a corrupted database, and intermittent connectivity. The Vera Customer Service is good,  it it cannot make up for a fundamentally poor quality product.\n\nThe final straw was that I discovered that many devices that are listed as compatible are Not...On,y older firmware on these devices is supported. To make the device work you must downgrade the firmware to older, obsolete versions. (Such as Aeotec Switch 6) This is complicated, time consuming, error prone, and a pain.\n\nYou should also know that Vera does not support logical operations or variables, so if you want a lamp to be on if BOTH a particular scene is active and a device is on this is not possible. You CANNOT use the dimmer brightness setting from one device to set the brightness on other devices.\n\nYes, there is a tool called PLEG that you can use to implement some logic, but it is less than obvious and I found it couldn’t do the types of things I needed (such as synchronizing brightness levels for multiple lamps.)\n\nThe summary is that Vera has great customer service but a terribly unreliable and outdated product.","updated":"2018-10-10T19:16:48-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"6981246222","userName":"vladthebeerman","userUrl":"https://itunes.apple.com/us/reviews/id105143247","version":"3.51","score":4,"title":"Great App and Great Products","text":"As far as I’m concerned there is no better value out there than Vera/Ezlo. One time controller purchase. Free life time support. Their techs are responsive and knowledgeable on the rare occasions something challenging comes up. \n\nYes, if I were to have designed the layout it would be a little different based on my personal needs. And yes, there are minor nuisances that pop up occasionally. And yes, there are limitations on what can be connected and controlled. I wish I could connect my Hunter Douglas shades and my VELUX skylights. Otherwise this would be a 5 star rating.","updated":"2021-02-11T04:47:39-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"7133097744","userName":"Bob417","userUrl":"https://itunes.apple.com/us/reviews/id25695928","version":"3.51","score":5,"title":"Works great. Customer Support is awesome","text":"Have used Vera for many years now. From time to time a z-wave unit will have an issue, or my Vera software will need updating. I can usually do it myself but have needed help from time to time and have emailed or phoned support and they have always helped me through it. They have even remoted into my controller and straighten it out for me.   Such a great support group. Yes they are on a different time zone so it might take overnight but it gets done. They are good at what they do. \n\nBL","updated":"2021-03-22T15:13:28-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"7263900412","userName":"LonestarAudio","userUrl":"https://itunes.apple.com/us/reviews/id218736386","version":"3.53","score":5,"title":"Best Home Automation App","text":"I’ve been using the Vera app to control two home automation systems for the last decade. Both Vera Plus systems have been rock solid. I’ve had no major issues. When I’ve encountered occasional issues with a new Z-Wave device, Vera customer support has always been there to help. \nThis iOS app does almost everything, from setting up a Vera controller to controlling devices to setting up scenes. \nCompare features and see you yourself. Vera will not disappoint.","updated":"2021-04-25T14:35:54-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"6339224630","userName":"ndnsjaijsjx","userUrl":"https://itunes.apple.com/us/reviews/id1041518285","version":"3.45","score":5,"title":"This is the Best zwave HUB You can buy","text":"Hello All,\nI am a Vera client since 2014 and since then i updated my devices every year, the customer service is the best I saw in the world, they are always available when you need them, always fixing your issue if needed. Honestly i wish that all customer service were the same in all companies.\nIf you are thinking about Zwave dont look elsewhere, at least you know you cannot go wrong with Vera","updated":"2020-08-19T16:44:50-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"3585667865","userName":"J_Kulit","userUrl":"https://itunes.apple.com/us/reviews/id354594342","version":"3.19","score":5,"title":"Awesome compared to my Iris.","text":"This app works most of the time. The only down side for me for now is that the button can be easily switch. I would suggest if I switch any device it should prompt me first like “Do you wish to continue?” If I accidentally switched it I can still cancel it. The problem now if I accidentally switched it I won’t even noticed till my wife called me that the alarm is on. Please if possible consider what I have experience. Otherwise works great!","updated":"2018-12-28T17:32:27-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"3200559897","userName":"Run_FatBoy","userUrl":"https://itunes.apple.com/us/reviews/id37433633","version":"3.17","score":4,"title":"Works as advertised","text":"App really works well. Zero issues controlling my extensive device collection over Zwave. Highly reliable, and super easy to use. Why four and not five stars? The Dashboard is the first thing you see when launching the app, but it is mostly useless. I always have to tap twice to get to my device list. What I really would like is the ability to put my favorite devices / scenes on the dashboard front page. There is a favorites tab, but again that’s still one tap away and doesn’t support scenes","updated":"2018-09-17T13:07:22-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1871767943","userName":"Elbobo79","userUrl":"https://itunes.apple.com/us/reviews/id206517529","version":"3.8","score":3,"title":"Fixed security flaw","text":"Update:previous issue was with 3.6 it has been addressed thank you, please do something about the constant barrage of ads.\n\nWhen the app loads it prompts for my password, if I click cancel it still opens and I am still able to unlock my doors. My phone is no more secure than a key that looks like a rock. \nAlso, I get showing me an ad... once but the same services repeatedly, I'm aware you have subscriptions, when/if I want one I know where to go.","updated":"2017-10-24T07:10:59-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"5326732915","userName":"CurtMorehouse","userUrl":"https://itunes.apple.com/us/reviews/id171844418","version":"3.31","score":5,"title":"Has always worked for me.","text":"I truly do not understand why there are so many bad ratings and comments.\nI have a Vera Secure and an iPhone 7 running the latest iOS and have never had a problem that didn’t turn out to be me not using the app correctly.\n\nLatest update fixed geofencing not working since last update.","updated":"2019-12-27T07:59:46-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"6859255582","userName":"BobXXX-ZZZ","userUrl":"https://itunes.apple.com/us/reviews/id405614421","version":"3.51","score":3,"title":"No longer works with Apple Watch","text":"The latest version of this app no longer works with my Apple Watch. The complication has totally disappeared. It would be nice if this functionality could be restored. The previous version of this app seem to work just fine, both on the Apple iPhone and the Apple Watch.\n\nThank you so much for taking a look at this issue!","updated":"2021-01-11T18:28:58-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"5621503619","userName":"Shad0wm3n","userUrl":"https://itunes.apple.com/us/reviews/id202112096","version":"3.36","score":4,"title":"Need Help","text":"I just updated the IOS app and now when I use the live camera feed to monitor the gates it now has a bold “play” button in the middle of the screen that does not go away.\n\nBefore this update it had the failure to connect notice that you could dismiss that support was well aware of.\n\nAlso; the refresh rate is now ridiculous; 20-30 seconds .... come on team. This does not allow any sort of real time monitoring.\n\nI have several of your systems, helped install many others, and referred many folks to your product. This is not good.\n\nYour system and support team are great but the basic interface issues make it difficult to recommend.\n\nThank you","updated":"2020-03-05T16:35:38-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"7191982689","userName":"Yak046","userUrl":"https://itunes.apple.com/us/reviews/id342685695","version":"3.51","score":4,"title":"Great Customer Service Team","text":"I was having trouble with my controller going offline only to return on its own shortly thereafter. I emailed on a weekend and was shocked to receive an email addressing my problem within a few minutes. They were able to remotely troubleshoot the issue and it has worked fine since then. Thanks , Vera!!","updated":"2021-04-06T15:31:48-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"6778281858","userName":"Michael Doug","userUrl":"https://itunes.apple.com/us/reviews/id156112100","version":"3.50","score":5,"title":"Amazing functionality for the money","text":"I have been using a Vera Controls HA controller for more than 10 years. There is so much functionality that you can do practically anything your mind can conceive. The Vera app is great and their support team is always ready to help when you get stuck.","updated":"2020-12-21T08:49:08-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"5535483349","userName":"Nanabug124524","userUrl":"https://itunes.apple.com/us/reviews/id28066268","version":"3.34","score":3,"title":"Pinch to zoom","text":"The last three updates have had pinch to zoom disabled on camera view. Please update and bring this back on the live view. The cameras also give an error of not connected right before they show the live view. Otherwise the app has been great. I use it for a quick view as it comes up quicker than the NAS view on cameras.","updated":"2020-02-15T09:28:45-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"6248252643","userName":"accuroll","userUrl":"https://itunes.apple.com/us/reviews/id134586776","version":"3.44","score":5,"title":"Vera range extender issues","text":"My system lost contact with 4 lite’s, turns out, there was a issue with my extenders.\nThe guys at Vera immediately returned my\nemail and we set up a scheduled time, to go through system and repair. Within a short period I was up and running again.\nGreat system with great service.\nLou F NY","updated":"2020-07-27T09:10:49-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"6866154561","userName":"Drew555-5555","userUrl":"https://itunes.apple.com/us/reviews/id223775560","version":"3.51","score":3,"title":"Apple Watch app disappeared","text":"The Apple Watch app disappeared, which I had become dependent on. Searching for another app that has one and coming up blank. Was this intentional or an error?\n\nI really have no reason to come back if it was purposely removed. The Apple Watch was the only reason I usually use this app.","updated":"2021-01-13T12:56:59-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1973621851","userName":"FlatiorNY","userUrl":"https://itunes.apple.com/us/reviews/id46245160","version":"3.9","score":5,"title":"I love this app BUT","text":"Update. No more “But” — the app now works on 11.2. I didn’t realize how dependent I was on it until it was gone! \n\n=== Previous review ===\n\nIt stopped working. Apparently it is not compatible with IOS 11.2 (on both iPhone X and iPad). I’m giving it 5 stars because 8 miss it so much. But will revise to 0 if I can’t use it!","updated":"2017-12-05T16:59:12-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"7246112633","userName":"pcjr","userUrl":"https://itunes.apple.com/us/reviews/id40178080","version":"3.53","score":2,"title":"Less features than web based app","text":"This app has less features than the web based app.  For example, if you have an A/C, you can’t control the fan in this app but you can do it from the web based version.  You also can’t chance the Wifi bridge of a Vera 3 with the app, but you can do it with the web version.  Not worth getting. Just use the web based app on your browser.","updated":"2021-04-20T23:25:23-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"6507232318","userName":"Seances an","userUrl":"https://itunes.apple.com/us/reviews/id301945859","version":"3.48","score":5,"title":"Vera Control for Business","text":"For our needs, this has been a great system to change Z-Wave locks at our properties. Pretty reliable and tech support has always been helpful. Would recommend using this for smarthome application.\n\nThanks!\n\nSean","updated":"2020-10-06T09:54:48-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"2636229558","userName":"Finkleburn Cosmos","userUrl":"https://itunes.apple.com/us/reviews/id34096022","version":"3.15","score":4,"title":"Latest version 3.15","text":"There seems to be a bug on the home page - my controllerS status is continuously and simultaneously UPDATING but I can still press the WHITE CONNECT button for each (while still updating status) to connect to each one.  Why doesn’t the update finish updating and display a GREEN button?","updated":"2018-06-03T06:39:23-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"6701078139","userName":"Hitechrr","userUrl":"https://itunes.apple.com/us/reviews/id106616183","version":"3.50","score":5,"title":"Works well","text":"I have been using Vera for 6 years now. It was a big help when I lived in NY and I had a house in SC. I was able to control the lights, a/c , water heater and door locks. I just hope that they will continue to support the older Vera controller.","updated":"2020-11-29T19:49:25-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1907127491","userName":"Dkydkdhfxhc","userUrl":"https://itunes.apple.com/us/reviews/id202840085","version":"3.8","score":3,"title":"WatchOS app too limited , iOS app ok","text":"The watch app really needs the  ability to fire of a favorite like switch switches etc. the need to change the home mode will be needed almost never. \n\nThe iOS app is ok. It a bit clunky. The finding of stuff is a bit unintuitive and the menu is full of things that are more setup but less everyday.","updated":"2017-11-08T15:52:24-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"7495599115","userName":"inGratitudeForBooksLike This","userUrl":"https://itunes.apple.com/us/reviews/id112860898","version":"3.54","score":4,"title":"Troubleshooting","text":"Jesus was very helpful in attempting to resolve our issue. Unfortunately he feels our Apple devices may have a bug related to the app continuously crashing. He has referred our problem to his engineering department and we are hoping for a successful resolution!","updated":"2021-06-22T21:06:11-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1991650216","userName":"Skyoughn","userUrl":"https://itunes.apple.com/us/reviews/id113860757","version":"3.9","score":3,"title":"You broke notifications?","text":"Right after the last update, notifications have stopped.  I’ve had to turn on text notifications to get any at al. But I don’t like having my texts mixed in with notifications.  I’ve already tried deleting the app and reinstalling, but nothing still.","updated":"2017-12-12T15:21:36-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"3596830880","userName":"phantomaudio72","userUrl":"https://itunes.apple.com/us/reviews/id115913777","version":"3.20","score":4,"title":"Fix crashing on opening in IOS please","text":"I give 4 stars because after this last update, the app crashes as soon as it’s opened on iPhone. It’s been working great and stable until this last one. Please fix ASAP. I love the ease of use and functionality.","updated":"2018-12-31T12:29:11-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"6431658656","userName":"Freezes like Ice","userUrl":"https://itunes.apple.com/us/reviews/id143794039","version":"3.47","score":5,"title":"Amazing Support","text":"Recently Upgraded from Vera3 to Vera Plus. Tech support was amazing and took over my computer and system and in no time got me up and running back to normal. Have used Vera for 8 years and LOVE it.","updated":"2020-09-15T06:56:42-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"6428290859","userName":"Funkybj","userUrl":"https://itunes.apple.com/us/reviews/id232051958","version":"3.47","score":3,"title":"New camera issue","text":"....latest update causes the app to shut down immediately after streaming a live-view.","updated":"2020-09-14T06:39:57-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"5191599161","userName":"JoeMob0","userUrl":"https://itunes.apple.com/us/reviews/id333881967","version":"3.28","score":4,"title":"Making progress with the mobile app","text":"The recent update was a major revamp with an entirely new UI for the Dashboard. So far it’s been working great. I am very pleased that the developer is investing time and energy to improve this application!","updated":"2019-11-24T06:42:18-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"3351309496","userName":"CoreySW","userUrl":"https://itunes.apple.com/us/reviews/id29495395","version":"3.17","score":2,"title":"Not reflecting the state of my lock","text":"Strange that I get notifications from Vera when my lock is either opened or locked, but the app does not reflect the present state. Lock the lock from the keypad (Yale), and I get an email stating the lock is locked. I see that in the Alerts. But the lock state is not right in the app. Luckily, when I lock a locked deadbolt from the lock, it does keep it locked!","updated":"2018-10-27T14:24:46-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"7786038503","userName":"90001213","userUrl":"https://itunes.apple.com/us/reviews/id448878741","version":"3.56","score":2,"title":"Ezlo","text":"Ezlo can not be accessed through the website, app based only that keeps crashing. \n\nI purchased a thermostat from Vera and have tried to set up scenes unsuccessfully. The support team has been working on it for over two weeks and I haven’t heard from them in over a week. Wish I would have never upgraded to Ezlo.\n\nUpdate. After four months, 114 emails and one conference call it appears the app doesn’t work on the thermostat with iOS. Not verified yet. So I’m disappointed. \n\nHowever would like to give a shout out to Daniel who has been working to solve the problem, so I’m hopeful","updated":"2021-09-08T18:32:52-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"3278342180","userName":"Fabo1-1","userUrl":"https://itunes.apple.com/us/reviews/id242510790","version":"3.17","score":5,"title":"App works perfectly, excellent customer support.","text":"Initially I had an issue with not being notified, but after customer support worked to find a solution.","updated":"2018-10-08T07:29:10-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"2044478679","userName":"DR172","userUrl":"https://itunes.apple.com/us/reviews/id121021811","version":"3.12","score":5,"title":"Super responsive support","text":"Recent update caused crashes.  Company responded with bug fix and personal notification. I wish other companies would learn how to be customer oriented.","updated":"2017-12-31T08:00:04-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"6366805496","userName":"SGMFish","userUrl":"https://itunes.apple.com/us/reviews/id14649054","version":"3.45","score":5,"title":"Excellent sopport","text":"I had an update problem on my controller. I send a message to the developers, and to my amazement they contacted me within 36 hours with a fix.","updated":"2020-08-27T07:27:20-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"2683185526","userName":"Solo Blue","userUrl":"https://itunes.apple.com/us/reviews/id110381370","version":"3.16","score":4,"title":"Can’t enable/disable scenes after update","text":"After the latest update (3.15) I can’t enable/disable scenes, the button is just missing, very frustrating. Please fix ASAP.\n\nUpdate: on version 3.16 Vera fixed this bug and the buttons are back. Thanks team Vera!","updated":"2018-06-12T11:09:20-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1935528481","userName":"menicknicknick","userUrl":"https://itunes.apple.com/us/reviews/id42896583","version":"3.8","score":1,"title":"Crashes every time","text":"Crashed for months.  Tried it again on a whim, started working for a little bit, but now crashes on start up every time again.\n\nEdit:  it's been a long time since I tried this app. Finally got a response from Vera that it was fixed.  Tried it again; no dice.  Crashes EVERY time I open it.  I've given up on this product.","updated":"2017-11-20T11:46:44-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"3636325968","userName":"Jbitson","userUrl":"https://itunes.apple.com/us/reviews/id42052153","version":"3.22","score":4,"title":"Working now","text":"After a couple of weeks of “no connection” errors the app is up and running. Looks like it took a few tries address the issue.","updated":"2019-01-10T21:53:32-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"3176969782","userName":"MorganHertel","userUrl":"https://itunes.apple.com/us/reviews/id26876121","version":"3.17","score":4,"title":"When are you going to fix the geofencing","text":"Tech support says an update is coming to fix it but it’s been six months.. everything else is solid ..","updated":"2018-09-10T22:56:28-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"2617351110","userName":"bjwhite3114","userUrl":"https://itunes.apple.com/us/reviews/id105611361","version":"3.15","score":2,"title":"App not working","text":"My wife and I can’t make any changes to devices or see camera due to “Controller is busy updating data” message in this app.   Inside or outside of house.  Using safari on Mac works fine from outside the house and have latest firmware, so problem seems to be with app.  VeraEdge","updated":"2018-05-30T07:39:26-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"4877638832","userName":"Scottbofaustintx","userUrl":"https://itunes.apple.com/us/reviews/id204697486","version":"3.25","score":1,"title":"Don’t get Vera","text":"I can’t login, the forgot password link sends you to an error page and support from the website is no help. \nSo not only does the app buggy and have a lag, even the reset password doesn’t work.\nI’m now officially out, unplugged and lesson  learned.\nSwitching to Nest as that system works flawless every time with incredible support.","updated":"2019-10-03T04:46:59-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1974018384","userName":"drew covi","userUrl":"https://itunes.apple.com/us/reviews/id37164758","version":"3.9","score":5,"title":"Keep it up!","text":"Apologies for sounding bipolar on the reviews. This is my controller of choice and it’s something I’m heavily invested in. Thanks for resolving the 11.2 issue. \n\nNow to resolve those Schlage firmware issues 😉","updated":"2017-12-05T20:32:31-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"6538798724","userName":"jefsfshahjaj","userUrl":"https://itunes.apple.com/us/reviews/id20146941","version":"3.49","score":1,"title":"Just one thing and it won’t do it","text":"I bought a Zoom motion detector and a Zoom light switch and the Vera Ezlo Atom as the controller. I wanted it to do just one thing (turn on a light when it detects motion) and it can’t even do that! \n\nTechs are supposedly working on it (software I presume) but at this point I can not recommend this product.","updated":"2020-10-15T12:57:29-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"5188723570","userName":"IronScott","userUrl":"https://itunes.apple.com/us/reviews/id26045662","version":"3.28","score":1,"title":"Do you actually test your changes?","text":"Where are my favorites? You make massive changes to the app with ZERO notification. I spent a lot of effort getting things setup exactly as I needed for quick usage on certain activities and objects and now it is all gone. Thanks for screwing up my weekend.","updated":"2019-11-23T15:08:29-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"2054874892","userName":"Littleflower0624","userUrl":"https://itunes.apple.com/us/reviews/id7122087","version":"3.12","score":2,"title":"Pin login broken again","text":"Good app when it works correctly. Unfortunately this is the second time using a PIN number to secure it has been broken. Currently if you have a 4 digit pin the app will only let you enter 3 digits which prevents you from entering the app at all.","updated":"2018-01-03T19:27:30-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"2033546532","userName":"Veigavm","userUrl":"https://itunes.apple.com/us/reviews/id287830423","version":"3.11","score":3,"title":"Kwikset door lock does not working properly","text":"after the last update when I try to access my kwikset door lock to add or change a pin the application closes","updated":"2017-12-27T17:40:30-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"7886718958","userName":"Richierich480","userUrl":"https://itunes.apple.com/us/reviews/id209719920","version":"3.59","score":2,"title":"Not What It Used To Be","text":"Good luck trying to call tech-support they are down in Columbia and do not answer your phone calls. When you leave a message they call you a week later.","updated":"2021-10-06T21:31:48-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"7610274707","userName":"dcw_NCSU","userUrl":"https://itunes.apple.com/us/reviews/id46165105","version":"3.56","score":4,"title":"Iwatch Update?","text":"This was promised in the next update back in January. Just wondering if the watch portion has a low priority. \n\nOne of my favorite features. Please reinstate. \n\nThanks.","updated":"2021-07-23T13:59:17-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"2407452561","userName":"Sedsa","userUrl":"https://itunes.apple.com/us/reviews/id87396334","version":"3.12","score":1,"title":"Cannot log out","text":"Over and over I am unable to log out in order to log in to a different controller. There’s nothing to screen shot and send to help desk because NOTHING happens. This is not a unique bug as my husband has the same issue. Using iOS 10. Have to delete app and redownload.  Please fix?","updated":"2018-04-10T15:39:39-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"2010228649","userName":"Solomon","userUrl":"https://itunes.apple.com/us/reviews/id34645827","version":"3.10","score":4,"title":"Update much better","text":"Gave it 1 star until recent updates made app much better. Looking forward to new WatchOS app features!","updated":"2017-12-19T15:40:52-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"2208197089","userName":"RC W.","userUrl":"https://itunes.apple.com/us/reviews/id106568475","version":"3.12","score":3,"title":"Almost good","text":"The app is OK, but since I updated to iOS 11 the geofencing works sporadically.  It use to work 95% now it is down to maybe 10%","updated":"2018-02-14T12:20:01-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"7841305599","userName":"i hate you 125689","userUrl":"https://itunes.apple.com/us/reviews/id1082952124","version":"3.57","score":2,"title":"Latest update broke my thermostat control","text":"The update that just came out have removed the “heat” button from my thermostat control.\n\nI can now turn off my fur7, but can’t turn it back on.","updated":"2021-09-24T13:37:12-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"4705231802","userName":"bspen","userUrl":"https://itunes.apple.com/us/reviews/id31893050","version":"3.23","score":4,"title":"Good app. Could Be Awesome. Add Support For Siri Shortcuts Please!","text":"Overall, the app is pretty solid. However, it really needs to support Siri Shortcuts for enabling voice control. This would be huge. Thanks!","updated":"2019-08-31T15:32:17-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"7290657093","userName":"64tracks","userUrl":"https://itunes.apple.com/us/reviews/id20331542","version":"3.53","score":1,"title":"Vera Ezlo","text":"I have multiple Vera hubs including the Vera Ezlo. The Ezlo is a major disappointment. Just lost 50+ devices (corrupt database) that took forever to install...days. No way to restore to previous version. So many issues. Slow. Unresponsive. Inconsistent. No web access","updated":"2021-05-02T15:08:33-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"4498323773","userName":"SJC622","userUrl":"https://itunes.apple.com/us/reviews/id118759069","version":"3.23","score":2,"title":"Limited Complications Support","text":"There are very few Apple Watch faces that support this complication.  This has been an issue for a while, makes we wonder if the engineers actually use their product.","updated":"2019-07-21T12:11:10-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"3629968871","userName":"Zman1962","userUrl":"https://itunes.apple.com/us/reviews/id202460532","version":"3.21","score":1,"title":"Cameras haven’t streamed in almost a year","text":"Notified vera support team back in March 2018. Slow to respond to my concerns of my cameras not streaming. Almost a year later no change. Very disappointed, especially after spending so much money for their products.","updated":"2019-01-09T04:45:35-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"2646101613","userName":"Malv0209","userUrl":"https://itunes.apple.com/us/reviews/id102495068","version":"3.15","score":2,"title":"Won’t connect after the update","text":"After the latest update my 3 controller will not connect, they are stuck on “updating status” and stays like that and never connect.","updated":"2018-06-05T08:45:11-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"3582029872","userName":"Rad tech 823","userUrl":"https://itunes.apple.com/us/reviews/id32965009","version":"3.19","score":1,"title":"What happened?","text":"App no longer works after last update. All I get now is “controller busy updating” and “no devices installed”.  Also recently bought an Apple Watch and the controller has never worked from the watch.","updated":"2018-12-27T19:08:12-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1971370312","userName":"NetEagle","userUrl":"https://itunes.apple.com/us/reviews/id12237456","version":"3.8","score":1,"title":"Not working at all on iPhone X","text":"Since upgrading to iPhone X this app freezes on splash screen. Uninstalling and reinstalling didn’t help. Needs to be fixed. Bought 3rd party app to work around this issue, but it also suffers from issues on iPhone X.","updated":"2017-12-04T19:18:48-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"3549661750","userName":"pjgolian","userUrl":"https://itunes.apple.com/us/reviews/id32175445","version":"3.18","score":1,"title":"Can’t connect to controller","text":"Been using my controller for years and this latest version can’t connect to the controller. I can log in fine using a web browser or 3rd party iOS app. Something is broken in this build","updated":"2018-12-19T13:19:44-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"3565119047","userName":"jschaffe","userUrl":"https://itunes.apple.com/us/reviews/id13310770","version":"3.19","score":1,"title":"Can’t connect to controller","text":"Latest update (Dec 23, 2018) can not connect to controller. I looked on the Vera settings via Web browser and can’t find any permissions to enable. Deleted and redone loaded the app, signed in again, still can’t connect. No idea what to do next!","updated":"2018-12-23T15:47:09-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"2761746141","userName":"Recardo66","userUrl":"https://itunes.apple.com/us/reviews/id109248663","version":"3.16","score":2,"title":"3.16 update broke the app","text":"Update to version 3.16 has mad the application almost unusable. It’s now very unresponsive when turning lights on and off. I’ve been controlling my lights from the web site since the update.","updated":"2018-06-24T12:43:56-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"2046561772","userName":"FS 82","userUrl":"https://itunes.apple.com/us/reviews/id355795573","version":"3.12","score":2,"title":"Doesn’t always work. Crashes!","text":"Sometimes I can’t control devices although I’m logged in.  \n\nCrashes and won’t let me log in.\n\nStill doesn’t work.  Piece of junk!!!!","updated":"2018-01-01T01:33:33-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"7875248453","userName":"Bob207","userUrl":"https://itunes.apple.com/us/reviews/id352712131","version":"3.58","score":1,"title":"Stopped working","text":"App is great.   Recent update caused it to stop working on IOS 13.4.1.   When opened the app comes on screen for a secondary and then goes away.  I have to manually close the non-working app.","updated":"2021-10-03T19:44:04-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"7362499659","userName":"Titsmagee1199","userUrl":"https://itunes.apple.com/us/reviews/id124167942","version":"3.54","score":1,"title":"Garbage app now","text":"Had so many problems with latest release...I think the company is slowing down response times for Vera models so users buy the new ezlo model...same thing Apple does...switching to another z wave hub company ASAP","updated":"2021-05-19T13:35:49-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"2396080788","userName":"Rebrabkram","userUrl":"https://itunes.apple.com/us/reviews/id29216654","version":"3.12","score":3,"title":"No Dimming?","text":"I have dimmer switches, but there doesn’t seem to be any way to adjust them in this app. Am I missing something?","updated":"2018-04-07T16:42:54-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"7855741574","userName":"hedbbdbd","userUrl":"https://itunes.apple.com/us/reviews/id456149092","version":"3.57","score":1,"title":"Used to be Perfect","text":"This use to be the best app ever. Now it does not work for geofencing since I updated to the latest iOS. Please fix so I can change my review back to 5 stars!!!!","updated":"2021-09-28T15:25:57-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"2035137337","userName":"Flanagan2nv","userUrl":"https://itunes.apple.com/us/reviews/id49535913","version":"3.11","score":1,"title":"Push Notifications","text":"New update broke push notifications. The bugs with the last few updates have been onerous to deal with.","updated":"2017-12-28T06:14:32-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"2645123247","userName":"Emgtrain","userUrl":"https://itunes.apple.com/us/reviews/id133469534","version":"3.15","score":3,"title":"App stopped working","text":"Stopped working after last Apple Update","updated":"2018-06-05T04:31:10-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"3621736230","userName":"Chris C W","userUrl":"https://itunes.apple.com/us/reviews/id960667377","version":"3.21","score":2,"title":"Latest version crashes on iOS 12.1.1","text":"Runs for few seconds then exits. Reinstalled , still broken","updated":"2019-01-06T22:42:03-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1973662857","userName":"Icepop789","userUrl":"https://itunes.apple.com/us/reviews/id24127051","version":"3.9","score":3,"title":"Now works with 11.2","text":"So far so good with 11.2","updated":"2017-12-05T17:21:32-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1967805003","userName":"Trebor1776","userUrl":"https://itunes.apple.com/us/reviews/id33540741","version":"3.8","score":5,"title":"App Broke with 11.2 Update","text":"Can't open scenes on 11.2 update.","updated":"2017-12-03T09:07:43-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"3483757471","userName":"Nathan Thai","userUrl":"https://itunes.apple.com/us/reviews/id186478662","version":"3.17","score":1,"title":"Press firmly to change the house mode","text":"When I hold it, nothing changes. I was expecting a prompting asking for change. But nothing! Buggy please fix it!","updated":"2018-12-01T20:22:45-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"7338168736","userName":"Xiao-tai-tai","userUrl":"https://itunes.apple.com/us/reviews/id122980908","version":"3.53","score":1,"title":"App login fails","text":"I can login to the Vera Mios website, but using the same userid and password fails when trying to login to the app.","updated":"2021-05-14T09:17:28-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"6853698411","userName":"robzr","userUrl":"https://itunes.apple.com/us/reviews/id21867578","version":"3.51","score":1,"title":"Vera is a terrible platform","text":"It’s a crime how little Vera has improved over the years. Their UI overhauls are cosmetic and dated on arrival. The UI is unintuitive, and the local devices inexplicably require cloud auth.","updated":"2021-01-10T08:15:52-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1991974168","userName":"Steve0212","userUrl":"https://itunes.apple.com/us/reviews/id42140945","version":"3.9","score":4,"title":"Works","text":"Please add a widget for quick access to scenes","updated":"2017-12-12T18:20:33-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"3605174271","userName":"finepl1","userUrl":"https://itunes.apple.com/us/reviews/id24890351","version":"3.20","score":1,"title":"Broken for a month","text":"Fails to connect to UI 7 for the last month.","updated":"2019-01-02T15:54:04-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"7034261794","userName":"Zurap","userUrl":"https://itunes.apple.com/us/reviews/id139561091","version":"3.51","score":1,"title":"Pushes are not working","text":"From time to time pushes are not working. Please check it and fix.","updated":"2021-02-24T12:53:24-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"2500706111","userName":"JJDaBean","userUrl":"https://itunes.apple.com/us/reviews/id359171457","version":"3.12","score":2,"title":"Buy The Vera Plus use this App w/Ads","text":"Really, Not cool popping your ad’s up on the app.  We already own your product.","updated":"2018-05-03T11:20:09-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"5044024655","userName":"kevrirotridanm","userUrl":"https://itunes.apple.com/us/reviews/id192523170","version":"3.26","score":1,"title":"Doesn't work on iOS 13","text":"This stopped working on iOS13. It just turns exits the app as soon as you log in.","updated":"2019-10-28T20:45:40-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"3613877838","userName":"looking4u","userUrl":"https://itunes.apple.com/us/reviews/id6259382","version":"3.21","score":1,"title":"Useless","text":"This latest update is broken.  App crashes on opening.","updated":"2019-01-04T22:05:23-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"5972856290","userName":"zeta9009","userUrl":"https://itunes.apple.com/us/reviews/id50027700","version":"3.41","score":1,"title":"Cannot connect to WiFi","text":"The controller will not connect to my WiFi. What a waste.","updated":"2020-05-20T20:28:57-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"3614733410","userName":"Bnyced0","userUrl":"https://itunes.apple.com/us/reviews/id36420945","version":"3.21","score":1,"title":"App Crashes on iOS devices, it’s only job","text":"As of 5 Jan 2019, the app crashes constantly on iPad and iphone, have to use web portal USELESS","updated":"2019-01-05T03:24:10-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"7259934638","userName":"xTexLutz","userUrl":"https://itunes.apple.com/us/reviews/id36367476","version":"3.53","score":5,"title":"Great Product and \"honest\" business model","text":"For full disclosure: I am using Vera for many many years and come to enjoy the reliability and straightforward business model (NO monthly subscritpions! They are doing it the \"honest\" way: produce good HW, sell it at a good price AND provide good customer support).\n\nThe reason I'm doing a review right now: My Vera Plus stopped working. Oh no! 50 Z-wave devices are dead (some not really accessibel behind furniture). I so dreaded unpairing all those, and migrating to a new unit.\nTurns out, Vera support was super cool: I opened a ticket, they assigned a support person, asked for a time-/date-slot at which I could be contacted. All within 48hours. The person called on-time(!), asked for remote access (like: remote desktop/teamviewer) and I watched him fixing the problem in ~20minutes. Turns out, the problem was an old App (Plug-in) I had loaded years earlier to test and and never really used it... but forgot to remove it also. It just sat there, unsupported by the plug-in dev and it caused memory exhaustion in the Vera unit. After removing it, doing a garbage mem collection, the Vera runs like new.\nBack to Vera's \"honest\" business model: no subscritpion and STILL reliable support. How many companies fall in to the \"Greed Trap\" as I call it, to force customers into subscription models. It's only good for the constant revenue stream of the company and very seldom provides benefits for the customer. I avoid subscriptions like the plague.\nIf all sounds over-the-top, sorry: I am that impressed with Vera and feel confirmed in that opinion after the last unit-recovery/remote-support. \nCheers! Lutz","updated":"2021-04-24T13:53:56-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"7259950825","userName":"xTexLutz","userUrl":"https://itunes.apple.com/us/reviews/id36367476","version":"3.53","score":5,"title":"Great Unit, great App... AND some tech support","text":"For full disclosure: I am using Vera for many many years and come to enjoy the reliability and straightforward business model (NO monthly subscritpions! They are doing it the \"honest\" way: produce good HW, sell it at a good price AND provide good customer support).\n\nThe reason I'm doing a review right now: My Vera Plus stopped working. Oh no! 50 Z-wave devices are dead (some not really accessibel behind furniture). I so dreaded unpairing all those, and migrating to a new unit.\nTurns out, Vera support was super cool: I opened a ticket, they assigned a support person, asked for a time-/date-slot at which I could be contacted. All within 48hours. The person called on-time(!), asked for remote access (like: remote desktop/teamviewer) and I watched him fixing the problem in ~20minutes. Turns out, the problem was an old App (Plug-in) I had loaded years earlier to test and and never really used it... but forgot to remove it also. It just sat there, unsupported by the plug-in dev and it caused memory exhaustion in the Vera unit. After removing it, doing a garbage mem collection, the Vera runs like new.\nBack to Vera's \"honest\" business model: no subscritpion and STILL reliable support. How many companies fall in to the \"Greed Trap\" as I call it, to force customers into subscription models. It's only good for the constant revenue stream of the company and very seldom provides benefits for the customer. I avoid subscriptions like the plague.\nIf all sounds over-the-top, sorry: I am that impressed with Vera and feel confirmed in that opinion after the last unit-recovery/remote-support. \nCheers! Lutz","updated":"2021-04-24T14:00:47-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"6729154302","userName":"mikemilmilemil","userUrl":"https://itunes.apple.com/us/reviews/id14192208","version":"3.50","score":1,"title":"Vera app not showing in shortcuts","text":"Unable to use Vera in shortcuts on 14.2.1. App does not show up as shortcut enabled","updated":"2020-12-07T19:07:06-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"3236137585","userName":"mntlvr","userUrl":"https://itunes.apple.com/us/reviews/id911514549","version":"3.17","score":1,"title":"OS 12.0","text":"App completely stopped working with the update of OS 12.0 and after writing Mios Ltd I was told that the App was not theirs so no help","updated":"2018-09-27T07:05:43-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"2185826007","userName":"Shahgdjsomabdh risks judge","userUrl":"https://itunes.apple.com/us/reviews/id105687326","version":"3.12","score":1,"title":"Avoid investing in Vera","text":"This is absolutely the buggiest, least reliable app I use.","updated":"2018-02-09T01:02:42-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"946765048","userName":"Beo13jkl","userUrl":"https://itunes.apple.com/us/reviews/id232472874","version":"1.0","score":3,"title":"Not ready yet, but better.","text":"Temp displays Celcius despite Fahrenheit setting on Vera. Also pins high and low temp together so I cannot set a range. Don't know if it's an app problem or a UI6 problem. Camera display is much improved, but still no interface for PTZ functionality. This is needed on mobile apps most of all. Splash screen obviously amused the developer, but annoys users. Lose it. Agree with comments about the home screen. Unless I have multiple units (how many do?) I never need to default to unit selection. Home screen should be pinned devices. Lock controls aren't intuitive. It says \"lock,\" does that mean it IS locked or sliding the button will lock it? Users shouldn't have to speculate; needs to be clear. I like the interface and look/feel. I'm excited to see a finished product. This is only a good start so far.","updated":"2014-02-19T19:49:04-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"5068498454","userName":"Vandikar","userUrl":"https://itunes.apple.com/us/reviews/id36314350","version":"3.26","score":1,"title":"No.....just no.","text":"There are no words.","updated":"2019-11-02T00:55:46-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1907128840","userName":"Hawkeye886","userUrl":"https://itunes.apple.com/us/reviews/id127496760","version":"3.8","score":1,"title":"IOS 11","text":"It is not supported by IOS 11","updated":"2017-11-08T15:53:14-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1847060443","userName":"Dubble_E","userUrl":"https://itunes.apple.com/us/reviews/id33271140","version":"3.7","score":2,"title":"Vera needs to get it together","text":"The app for the controllers Vera sells is a weak link I. Their product line. The app should be a well built and simple to use interface for managing whatever you are automating in your home. The app is clumsy and ugly to navigate which makes it frustrating to deal with. Maybe ,are the default screen when it loads a dashboard that doesn't look like circa 1996 website? How about a screen with obvious but not overly stated buttons to switch modes and an info icon for each mode that you can tap to  get to deeper settings in the modes? The scene configuration is ok but still a little clumsy. Sadly I'd say that the app version of the scene configuration tools is better than the web UI version. That's not saying much. Vera needs to work on the whole scene logic set up anyhow but that's outside the scope of the app review. Anyhow, this app is pretty weak but it gets the job done if you can bear some frustrations with ugly UIs and non-intuitive layout. It's probably a hit with hipsters who are into vintage stuff with its ancient UI and all.","updated":"2017-10-13T17:16:14-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"997183388","userName":"bblack07","userUrl":"https://itunes.apple.com/us/reviews/id85558355","version":"1.0","score":1,"title":"Piece of crap","text":"I have never written a review for an app for as long as I have existed, but I will say that this app is the absolute biggest piece of crap I have ever had the displeasure of using. I have a vera lite at this point to do one job and one job only, unlock my Yale deadbolt on my front door. The when I was using ui4 it worked ok, but was sketchy at best, but after upgrading to UI6 and this god foresaken app it won't even load the lock on the app when I am staring at it in ui6 on a computer connected to the network. The couple times I got it to show up it didn't respond, never reported correctly so I never knew if the lock was locked or unlocked and in most cases just failed to operate at all. This was after spending over an hour with one of the nice ladies at tech support remotely controlling my computer just to get the vera to sync with the lock again. I am seriously about to throw the veralite in the trash and delete this app from my phone so I can get something that works. Vera is only good for building an unreliable and generally crippled home automation system.","updated":"2014-05-22T17:58:34-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1513284654","userName":"michaeljf","userUrl":"https://itunes.apple.com/us/reviews/id42658253","version":"3.2","score":4,"title":"Great for basics","text":"Overall the app does what it claims to do.  That said, it does have some issues as well as limitations. As an example, Alerts seems to only inform you when a door lock (Kwikset in my case) goes to the locked state.  Unfortunately I am really only concerned with be notified when it is unlocked.  The fact that it natively only supports a few camera brands makes it a little less valuable too. \n\nAnother problem I see is that when you attempt to change the state of a device (e.g. unlocked to locked) the app seems to show a spinning progress indicator that never stops unless you exit and reenter the app. \n\nSo if you are ok with minor buggy behavior and a few limitations, this is a decent  app.","updated":"2017-01-01T06:26:11-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1060419304","userName":"VanitaVanilla","userUrl":"https://itunes.apple.com/us/reviews/id36243587","version":"2.1.3","score":5,"title":"Micasa Vera3 & Get Vera Home Auto/Sec","text":"This is my first version of this APP and our first use of the MiCasa Vera 3 controller. After taking some time to understand some of these items this system works flawlessly! This has been a lot of fun installing, not done yet because of the ability to expand as you go but I can see where this system would be the very best value.  Depending on who manufactures the sensors as some act as repeaters so you can expand the distance that the system operates. Draw out on paper what you want to do then go about doing it smartly!  I would recommend this system over all others since you do not have to break the bank to get the system started.","updated":"2014-09-07T04:34:58-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1293744023","userName":"PileHigherAndDeeper","userUrl":"https://itunes.apple.com/us/reviews/id480728628","version":"2.2","score":3,"title":"Not ready for prime time","text":"Neither app nor the actual home automation system is ready for release. It is a very poorly executed engineering concept. Whole vera ecosystem is at development phase and definitely not a release candidate. My app shows that my system setup is not complete. While I have completed my setup 3years back. It takes nearly 1 min to load the app. Ideally, I would prefer the app loads quickly and keeps on updating the values in background. So, as J said, it is just a suboptimal, proof of concept system which needs patience and technical expertise to operate. However, this is the most versatile HA system in the market.","updated":"2015-11-29T22:32:38-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1038590945","userName":"ebobulous","userUrl":"https://itunes.apple.com/us/reviews/id31409630","version":"2.0","score":2,"title":"Improving, still needs work","text":"2.0 fixes the need to log in every 24 hours for me. Big improvement, I'll give another star for that!\n\nHowever, now door locks are broken for me with the update.\n\nHave not re-tried setting password, so no idea if complexity is still enforced.\n\nThermostat (trane) now appears better - can see temp adjustment controls clearly. However, on auto cool/heat, the temp is completely wrong.\n\nSmall progress, but progress nonetheless.\n\n \nOld 1/5 star review below:\n***********************************\nI’ve been a user since UI4, I was currently using UI5 before upgrading to UI6 to use this app.\n\nHuge mistake. Previously, I used iVera - which is a great app. After upgrading to UI6, I am forced to only use this app.\n\nMy big problems with this app are:\n• This app and new UI6 require arbitrary complexity. Please do not enforce this - require min length, not special and caps/numbers. I would like to use long sentences as password.\n• App requires re-login every 24h or less. Old system kept username/password for a month. When users need to access the systems once or twice a day, this requires entering a password almost every time.\n\nHope this app gets better, or iVera updates to support UI6/UI7.\n***********************************","updated":"2014-08-01T00:22:15-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1381456404","userName":"hax0rmort","userUrl":"https://itunes.apple.com/us/reviews/id100613442","version":"2.4","score":4,"title":"VeraPlus + VeraLite Home controllers","text":"My current controller is the Plus. This app really works well and consistently for my family and I.  There is almost a perfect (100%) response rate when using on either local or through the remote relay.  \n\nIf you are a power user, I recommend signing up with Vera devs to beta test as you will receive access through TestFlight app.  They keep it current and are extremely responsive to input/issues.  Devs are dedicated and are willing to work with the user.  Lot of  small issues/requests to work out with the firmware for the new controller as well as the app, but it just works for basic device control.  Reliable.","updated":"2016-05-20T07:33:12-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1430111578","userName":"Rtannerm3","userUrl":"https://itunes.apple.com/us/reviews/id30619058","version":"3.0","score":4,"title":"Crashes Consistently","text":"If you haven't yet upgraded to 2.2, I would definitely hold off. The app locks up without fail. I have restarted phone, rebooted Veralite, restarted app at least 20 times. Using an iPhone 6 Plus in case it matters, I will definitely update this review after the issue is resolved. \n\nLooking forward to geofencing, and the DSC Alarm module looks more polished from the favorites screen. I did try to arm my alarm and it actually froze my alarm keypad so hopefully that is part of the same problem. Now nothing responds within the app.\n\nUpdate 8/9/16:\n\nBeen using the app for several months now with huge success. Most issues have been fixed for me, logging in is as fast as can be expected now with the help of Touch ID. I have an occasional hiccup but usually it's the veralite's issue. \n\nI see some very recent reviews of people have similar problems that I had long ago and wonder if I am just lucky. Using the same iPhone 6 Plus with around 50 z wave devices on Veralite.","updated":"2016-08-09T18:18:39-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1221898003","userName":"ekimsknird","userUrl":"https://itunes.apple.com/us/reviews/id37644497","version":"2.2","score":1,"title":"Major Security Risk to the U.S.","text":"Popular VeraLite runs notifications through its own servers, taking 20+ minutes (if ever) to get a notification via text.  Check the forums.  The fix? Buy a plugin.  Seriously that's the fix.  Supposedly from Texas.  The Vera software product is built in Hong Kong with Romanian offices.  To get notifications with the Vera Alerts plugin you have to enter your SMTP server/user/pass.  Gmail doesn't work.  All in clear text through the MiCasa servers and btw they can login and see your setup.  And as for the iOS app, long delay and gripe message at every load that you haven't given continuous access to your GPS location.  While waiting, if you jump back to the home screen when waiting to load, it freezes up.  Sketchy stuff, looking to move to a U.S. based product like Indigo.","updated":"2015-07-03T22:28:25-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1635790243","userName":"Zenak","userUrl":"https://itunes.apple.com/us/reviews/id113509676","version":"3.5","score":4,"title":"Clunky, but works. Alexa support? Huh?","text":"It's clunky to get it to sync with devices. Doing a door knob install might want to sync the door knob BEFORE you install it (unless you have a 50ft cat5 to bring the device closer to the door later). The latest version of the app states Alexa supported, but the Alexa skills search menu has nothing matching \"Vera\". All in all the controller is a decent value for the price. Getting better with age, but by the time it gets going better there are newer devices coming out all the time that are a bit more intuitive to use. Been using this now three years with my Vera.","updated":"2017-06-06T17:06:42-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1201620905","userName":"PCR4YOU","userUrl":"https://itunes.apple.com/us/reviews/id118881488","version":"2.2","score":4,"title":"Great app and system","text":"I use the Vera system to make my home a smart tech home as well as a security system.  Even though this app and system is great and all that one would need to setup a smart home as well as a great security system, it does take some tech knowledge to make it work just perfect.  Vera tech support is great and very helpful.  The software setup and engineering of the program needs some more fine tuning as well as a more user friendly approach.  I would recommend this system to anyone that needs to setup a smart home that does not want to be paying some company monthly fees.","updated":"2015-05-23T12:30:33-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1580696219","userName":"Brandon098","userUrl":"https://itunes.apple.com/us/reviews/id295797248","version":"3.4","score":1,"title":"Needs work","text":"This app is just ok.  It does what it needs to do but does it very poorly. \n\nMy biggest complaint is the app is just slow. When you launch it your forced to wait for it to update. Your devices are hard to find and you have to navigate menus to find things (honestly it would be better and faster if they were in one big master list sorted alphabetically then what they currently have). When I launch the app I have a clear goal in mind (e.g turning a fan on) and they certainly do not make that process easy. Bottom line is that when I'm in bed it's simple to just get out of bed and turn the fan on with the physical switch than it is to use the app which shouldn't be the case. \n\nThe other problem is when you turn a switch on, it immediately switches off, and then a short time later switches back on - in other words they are waiting for confirmation from the controller before they show the desired state of your switch. \n\nAll of this tells me they are more interested in releasing new products than they are in making their app a first class experience.","updated":"2017-04-04T11:13:04-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1040357595","userName":"PhuongVo","userUrl":"https://itunes.apple.com/us/reviews/id142870389","version":"2.1","score":4,"title":"Nice recent update","text":"I just updated version 2.1 and tested my front door. It works! Thanks for quick fix. It would be helpful if the app has a tab for all devices that are \"On\".\n\nI just test my front door lock and it does not work. I have to change 3 stars since it breaks one of the features. Please fix it.\n\nThe UI looks nice. Old features work properly after download. Support more features such as adding a room, not sure how good yet. Will test it on the way using. Finally for awhile we have a new update. It a lot of better than previous version!","updated":"2014-08-03T23:17:51-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1083783885","userName":"abulkhil","userUrl":"https://itunes.apple.com/us/reviews/id105243781","version":"2.1.3","score":3,"title":"Improvement but not quite there yet","text":"Definitely an improvement from the previous version. Can't get rid of instructions, Needs better flow, not fully optimized to take advantage of the iPhone could be done better. Smoother than the previous version but still clunky seems something lacking on the backend. Not very user-friendly especially when adding more devices/sensors. Overall it's a great help but need some modifications and some cosmetic touches.","updated":"2014-10-20T23:32:13-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1025823766","userName":"Blueclone","userUrl":"https://itunes.apple.com/us/reviews/id238902608","version":"1.0","score":1,"title":"Unstable and Time Consuming","text":"The Vera lite is a decent controller with good support however it requires “support” when it should need it.  This is not a set and forget, between this App, Veralite and the UI updates, you really never know when things are going to work.  We had all the issues that most are complaining of.\nRecently, the APP stopped working completely. We logged out and back in like we usually have to do but after a few days called back into tech support.  They were Aware of the issue that will be fixed in the next APP update.  So for now, the app is going to be broke for at least a few months.\n\nSupport stated that don’t provide updates for when things break or will become available again, so “you have to just keep trying and once it’s fixed you’ll be able to log in”.\n\nThe beta testing this company does obviously isn’t working and the app is too unstable to use even when it’s up.  They really need to focus on stability and usability instead of focusing on a fancy splash screen that is useless.","updated":"2014-07-10T12:20:32-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1112719276","userName":"Mjsamaan","userUrl":"https://itunes.apple.com/us/reviews/id146575039","version":"2.1.3","score":1,"title":"Unstable","text":"I was having trouble getting two dimmers connected to my vera lite. Had tried removing and the connecting, but no response on the vera during pairing. So I decided to upgrade from UI5 to UI7, hoping it would solve a couple other issues I've had as well.\n\nUpgrade was smooth, but still no luck getting dimmers paired. So I bit the bullet and reset the vera to start from scratch. Now, the two that couldn't connect before are on, but 3 other devices won't pair. In addition, once I got my lock connected, this app crashes about 10 seconds after opening. I'm going back to UI5 and the other app.","updated":"2014-12-13T12:01:36-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1304169218","userName":"Cxzy","userUrl":"https://itunes.apple.com/us/reviews/id138770544","version":"2.4","score":3,"title":"Apple Watch Let Down","text":"The new app layout is an incremental improvement on the previous version with the added use of Touch ID. What lets this release down is the watch app. You can't control anything from it and it's limited to setting your home/away Etc. status. I've already removed it from my watch layout. Come on Vera you should be able to control devices from it like you can with veramate.","updated":"2015-12-21T17:50:22-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1126303623","userName":"billnvalley","userUrl":"https://itunes.apple.com/us/reviews/id31369438","version":"2.2","score":1,"title":"Terrible upgrade","text":"This upgrade is\nAbsolutely the worst! The\nSoftware will not load and the interface has not been corrected to fix the short comings from the last revision . The only improvement is a change to the icon on iPhone . I wish I could use the original  iPhone app from three years ago. It may not have been flashy but at least it worked. A lot of time making changes that has rendered the vera lite system horribly buggy and unreliable. Please get some software QC people on your staff. I am sick of wasting my time debugging your products.","updated":"2015-01-07T17:05:27-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1118340940","userName":"Counciltuckian","userUrl":"https://itunes.apple.com/us/reviews/id17642311","version":"2.1.3","score":1,"title":"Slow freezing death","text":"Pretty much describes the state of this company and the functionality if this app.  Slow to connect or to make changes.  Freezes often when trying to edit modes. And frequently misfires when scrolling through the list of devices including unlocking my front door and turning off lights.  \n\nUI7 is a leap ahead of where it used to be and that is horribly sad because it still makes me want to throw it out the window weekly. Having said that, I am almost at a stable state with my Vera Lite. Almost.  Wouldn't purchase again though.","updated":"2014-12-23T22:34:50-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1135685093","userName":"justsomeguyfromsomeplace","userUrl":"https://itunes.apple.com/us/reviews/id117487577","version":"2.2","score":1,"title":"Fire whomever is responsible for this release","text":"This release has made known unto me new horizons of ineptitude in iOS app development! The only thing it does reliably or quickly is lock up and crash.  \n\nThere was clearly no QA involved in this release, unless the QA team is comprised of poorly trained chimpanzees.  The developers responsible this release should either be ashamed of themselves for replacing a much more stable and useful release with this deadlock-prone, slow, horribly  unresponsive, and utterly useless  excuse for an app.\n\nPlease don't ruin a good thing by releasing apps that make your otherwise powerful home automation system look like a bad joke being played upon the people endeavoring to use it.  \n\nThis is an unnecessary embarrassment that has been left lingering for far too long. \n\nPlease get your house in order so I can start controlling mine again.\n\nSincerely,\nEveryone who has a Vera and an iPhone","updated":"2015-01-24T21:36:06-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1150706971","userName":"jconleymo","userUrl":"https://itunes.apple.com/us/reviews/id41674514","version":"2.2","score":2,"title":"Slow & Only Portrait Orientation in iPad","text":"I was really excited to get this up and running. But it is very slow and the iPad orientation is only Portrait which is awkward in a stand.  Mostly disappointing is the slowness.  I have only had one day so not aware of any crashing yet. For home control this is a very good option but I would think it would run faster bing an established product.  I am setting this up as a beta test for my business. Not sure I would recommend it to my clients at this point.","updated":"2015-02-16T09:10:40-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1126693856","userName":"asggold","userUrl":"https://itunes.apple.com/us/reviews/id36347237","version":"2.2","score":3,"title":"Good start but MANY bugs.","text":"I am glad they did an update to fix a few of the cosmetic errors but seem to have missed the major bugs. Apparently, no matter what you set the main router to, everything shows in Celsius.  Even more confusing is that it is not really Celsius but Fahrenheit with a \"C\". Also, can't set your Scenes correctly from the phone. MUST be set on the router to work (only about 80% of the time do they actually work).","updated":"2015-01-08T12:12:51-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1140533838","userName":"nicknamegeo","userUrl":"https://itunes.apple.com/us/reviews/id113346413","version":"2.2","score":5,"title":"I've been with Vera for at least 2 years...","text":"The couple of times that I had question Vera tech support was ALWAYS there to solve it.  I suppose that if you totally don't want to have to think at all tech support would probably log on to your system with you and do everything for you!","updated":"2015-02-02T08:06:05-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1058524155","userName":"Maxyz","userUrl":"https://itunes.apple.com/us/reviews/id25922593","version":"2.1.3","score":3,"title":"An overall improvement. Still needs work","text":"This has better user interface and more features, but somethings still don't work properly. For instance, in My Modes, you can only change what each mode does for the first 10 devices and nothing after that.\n\nUpdate: the new version still takes A WHILE to connect and crashes frequently.","updated":"2014-09-03T13:25:25-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1598400688","userName":"Tricia CL","userUrl":"https://itunes.apple.com/us/reviews/id413250223","version":"3.4","score":1,"title":"Update crashes","text":"Guys really you seem to be going backwards on the progress... App crashes and we can't even get anything to pull up through the web browser.. This app used to be low maintenance on the consumer end, the last few updates have been causing more issues and more resets on our end.  In response to the development team. We gave up on Vera totally in our household. And mind you this product was not geared toward the casual user but towards people that at least have some knowledge of how electronics and programming work...","updated":"2017-04-26T15:56:43-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1127916301","userName":"Itfarmer","userUrl":"https://itunes.apple.com/us/reviews/id145077927","version":"2.2","score":1,"title":"Horrible update!!!! Mediocre to Useless","text":"Absolutely useless with this recent update. Tap 'Away' to set my alarm only to find Vera switches back to 'Home'. - Repeatedly!!!!!!!!\nTurn off lights only switches the app's button to off. Lights are shown 'Off' at 100% bright. \n'Turn all lights off/on' only switches the app's button ms on/off. Does nothing for any of the actual lights it's supposed to be controlling. \nLights and appliances randomly turning on and off. \nThermostat NEVER changes based on Vera. Only changes by manually adjusting thermostat - even though Vera reports 'command sent successfully'.","updated":"2015-01-10T19:19:54-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1168967023","userName":"DJGoodies","userUrl":"https://itunes.apple.com/us/reviews/id100869368","version":"2.2","score":5,"title":"Been great as of mid 2014","text":"Since the app update last year this apps been working pretty great. Those have issues may want to confirm that your hubs firmware is up to date now too. Using Schlage door locks, linear garage door opener and a couple light switches and overall happy with how it all works-and no monthly fee!","updated":"2015-03-16T11:37:21-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1137455667","userName":"mactechnian.org","userUrl":"https://itunes.apple.com/us/reviews/id158701042","version":"2.2","score":4,"title":"So far the best one out there for Vera","text":"I have tried several others although this could have more features it works and works consistently where the other apps have been a nightmare to setup and some just stop working where this is easy to setup and has worked consistently and dependably since I installed my VersLite","updated":"2015-01-28T04:06:12-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1148606449","userName":"Ptg322","userUrl":"https://itunes.apple.com/us/reviews/id101284123","version":"2.2","score":1,"title":"Unreliable, slow and too busy","text":"This app is unreliable, and very slow on start up. There is no iPad app in landscape mode. Mobile App needs to be a condensed version of the web app, this is too busy and constantly hit lights on while scrolling to find room and light you want. Vera 3 constantly needs re booting and regularly loses devices.  Need to log out or reboot 3 out of 5 devices added.  Scenes do not always run. Tech support is non responsive to emails and online support is confusing, incomplete and hard to navigate.","updated":"2015-02-14T12:47:42-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1087167098","userName":"philclimb","userUrl":"https://itunes.apple.com/us/reviews/id39329618","version":"2.1.3","score":2,"title":"Not ready for prime time","text":"Vera works only sporadically even though home internet access is working consistently. I only use Vera to control a door lock at this point but on multiple occasions I could not connect to the door lock via Vera on the iPhone app or via the web on a laptop. Imagine having a car start occasionally.\n\nWhen I can connect to Vera, the information log provides limited information, e.g., \"51 hours ago\", rather than a time stamp.","updated":"2014-10-27T06:29:40-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1124828230","userName":"vipercompany","userUrl":"https://itunes.apple.com/us/reviews/id42166232","version":"2.1.3","score":3,"title":"Great start for UI7 but needs improvement","text":"This is a good app in that it has most of the features of the web app and has a similar UI. The only problem I have is that lights and objects are easily triggered by accident when just scrolling through the list. Also I have the \"Congratulations your Vera is ready\" banner ALWAYS on, it never goes away and is very annoying.","updated":"2015-01-04T18:36:18-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1439744451","userName":"Ace1068","userUrl":"https://itunes.apple.com/us/reviews/id146086417","version":"3.0","score":4,"title":"Works well to keep me connected to Vera","text":"No trouble logging in or using the app. The app has many useful features and some advanced options I didn't expect to find in an app. I still prefer to use the browser based UI for most configuration changes but for basic control and monitoring of my VeraEdge this app is great.","updated":"2016-08-26T14:57:16-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1064523067","userName":"Garage Battle","userUrl":"https://itunes.apple.com/us/reviews/id42555531","version":"2.1.3","score":2,"title":"This is pathetic compared to Nexia","text":"update: at least it works.  The app is not designed well. Every time I use the app I have to wait for it to connect (5 seconds or so). Then it has these idiotic dashboard cards at the top that are supposed to show my system status. Instead they say I have no devices connected, even though 8 are listed just below. \n\nI never realized how hard it was for companies to design a simple, logical UI. Vera is just waiting for someone to replace them. \n\n________________________________________\nSure it's great to not have a monthly fee, but $8 a month got me an easy to setup bridge, and a super smooth app for my iphone. This is garbage. \n\nThe entire vera setup process is fragmented, poorly documented, and simply not ready for prime time. \n\nIt's not smarter home automation, it's dumber.","updated":"2014-09-14T17:59:31-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1174383141","userName":"pwhid","userUrl":"https://itunes.apple.com/us/reviews/id24925498","version":"2.2","score":2,"title":"Promising but too many bugs","text":"Nice UI but often will not connect when the web interface will work fine on my iPhone.  Displays t-stat temperatures in C not F.  Fortrezz temp sensors do not display the actual temperature (which they do on the web interface) - they show as an ‘Armed’ sensor.  Had to stop using as it randomly changed my t-stat settings to 95 deg (from 55 - 65 deg).  This might be related to the C / F problem.  If you don’t catch this quickly it gets uncomfortable & expensive - ouch!!","updated":"2015-03-28T04:30:24-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1095537670","userName":"Grizwald Fubar","userUrl":"https://itunes.apple.com/us/reviews/id43016254","version":"2.1.3","score":2,"title":"Yuk","text":"The visual layout of the app is the best part of the whole thing and about the only good thing I can mention. \n\nI have mis-fired devices just scrolling, I continuously get the \"welcome\" message no matter how many times I dismiss it and one time the app launched and said I had no devices!!  It's sluggish to start and awkward to use without misfires. \n\nNeeds a dramatic re-design and a lot more use-case study work to see what flies and what doesn't. I think I will switch to ST or Revolv.","updated":"2014-11-11T15:19:26-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1533297941","userName":"BubbaABCDEFGHIJK","userUrl":"https://itunes.apple.com/us/reviews/id36317418","version":"3.3","score":3,"title":"Needs Some Work","text":"For the most part, the app is decent.  However, the developers should use the product outside of a lab to understand what users really want. \n\nFor example, allow scenes to be a favorite, so that they will be on the dashboard screen.  Make scenes that you use frequently, be easily available.\n\nThe company, in general, needs help.  They frequently put out firmware updates without testing it properly.  They have no rollback in place when the updates don't work, or cause your devices to stop communicating with the controller.\n\nBecause of this frequent issue, I'm beginning to look at other smart home controllers.","updated":"2017-01-29T19:41:46-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1597658587","userName":"MacUser43","userUrl":"https://itunes.apple.com/us/reviews/id87274786","version":"3.4","score":1,"title":"App won't update lock status","text":"When I lock deadbolt from outside lock status does not change on app. Because it says lock is still open I can no longer unlock the dead bolt without physically being at my door. How do I fix? Also, alerts about lock activity doesn't clear when I click on alert page. I have to manually delete all alerts. They should mark as read once clicking on alerts. Will give more than 1 star if I can fix this","updated":"2017-04-25T18:13:33-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1857476951","userName":"d0z0s","userUrl":"https://itunes.apple.com/us/reviews/id41940662","version":"3.7","score":1,"title":"Too much frustration","text":"I'm incredibly disappointed the features, bad user interface and bugs in this app. Its scrolling and small buttons are difficult to use. Simply touching the screen can unlock doors, accidentally switch modes, or toggle a device. Scene and device names are truncated and confusing.  Editing scenes does not work correctly and changes are lost. Even worse, the app now has pop-up advertising! I'd recommend looking elsewhere for home automation.","updated":"2017-10-18T06:40:38-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"945007857","userName":"rumpelstilzkin","userUrl":"https://itunes.apple.com/us/reviews/id3352586","version":"1.0","score":3,"title":"Works with UI6 but needs a home screen","text":"For those of us with just a few devices, it would be great if we could have a home screen that combines the most used and monitored devices in one place. The home screen defaults to the unit, which is useless. Give us the home screen in the web view or let us move favorites to the home screen.","updated":"2014-02-16T21:26:35-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1143925874","userName":"Funluvn","userUrl":"https://itunes.apple.com/us/reviews/id87097857","version":"2.2","score":4,"title":"Awesome","text":"I don't know what everybody's complaining about. So far it works better than before. User-friendly. Seems to solve the problems I had with my camera. Just a bit slow to load and the logged alerts don't clear. Also other basic users can't log in.","updated":"2015-02-08T14:20:05-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1086638781","userName":"LostinSF","userUrl":"https://itunes.apple.com/us/reviews/id177123246","version":"2.1.3","score":3,"title":"Little buggy but works ok for basic stuff","text":"I'm new to the casa verde world. This app is very basic--it would frustrate experts--but it's working fine for basic building of scenes. The dashboard keeps telling me I don't have any devices installed, even though I've created several scenes using the one electrical switch I've installed so far.","updated":"2014-10-26T06:32:22-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1425851707","userName":"Bluevynal","userUrl":"https://itunes.apple.com/us/reviews/id277200358","version":"3.0","score":5,"title":"Thank you Support","text":"Thank you for the prompt response to my email complaint not being able to login. The instructions worked: disable wifi and sign in on cellular network. Much appreciated!","updated":"2016-08-03T07:49:53-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1126783497","userName":"Louis F. - NY/NJ","userUrl":"https://itunes.apple.com/us/reviews/id100618599","version":"2.2","score":1,"title":"Need improvement","text":"Getting worse and worse with each release.\n.\nThe superstructure of the app is there, but need a lot of tweeting and improvement.  The previous UI app was much more usable and iOS friendly.  \n.\nOn the critical side....The integration with thermostats needs improvement.  Doesn't display current room temps and adjusting is terrible.  Also displays C instead of F even though it the information is in F.\nCan't easily switch between two Vera's.\nThe overall display is space inefficient and requires too much scrolling to see or access your various devices.  Plus while scrolling, it is way to easy to change. a devices setting accidentally.\nI would also like the scenes to be specific to away or home or night or vacation selections.","updated":"2015-01-08T16:52:49-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1058630121","userName":"Chris22222222","userUrl":"https://itunes.apple.com/us/reviews/id86709849","version":"2.1.3","score":5,"title":"Huge improvement","text":"Much better than the previous version. Now I don't have to login so many times...and less crash. Device control seemed to have improved. This is a must update for everyone!","updated":"2014-09-03T19:00:47-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1219856620","userName":"RandyInTempe","userUrl":"https://itunes.apple.com/us/reviews/id316330202","version":"2.2","score":5,"title":"Clean & logically laid out!","text":"I've use SmartThings for a while and was shocked how poorly organized it was. \n\nSo I've switched to Vera and really enjoyed the clean, organized and logical layout. It also seems very reliable so far.\n\nI'll update this review if anything changes.","updated":"2015-06-29T19:14:31-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1261132390","userName":"GirlsReviewIt","userUrl":"https://itunes.apple.com/us/reviews/id30973768","version":"2.2","score":1,"title":"Buggy and they don't fix it","text":"Terrible app. Very buggy.  When you attempt to change temperature, it will sometimes change the temperature to 99 instead.  Once it does this,  you have to retry numerous times to get it to register the proper temperature. Crazy part is they haven't fixed the bugs. Note the persistent complaints that it displays your F temperature with a new F number but a C next to it.  Buggy junky app with developer who doesn't care enough to fix it.  Avoid","updated":"2015-09-22T02:35:19-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1032577505","userName":"Jeff_NC","userUrl":"https://itunes.apple.com/us/reviews/id33145245","version":"2.0","score":4,"title":"Needs UI 6","text":"Like others, I was unable to login and gave a negative review. I checked my Vera lite unit for updates and it said I had the latest. Then I went to the Vera web site and used its links for firmware update. It pushed UI 6 to my device and this app works fine.\n\nAlso like others have mentioned, I was getting temps in C and not F. That is also not the fault of the app. I found in the forums where I just needed to manually poll the z-wave device from the Vera lite. After that all was fine. The app works well.\n\nUpdate July 21, 2014:\nIt now remembers login information and works much better.","updated":"2014-07-21T13:12:32-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1131410931","userName":"NicolasFM","userUrl":"https://itunes.apple.com/us/reviews/id3279383","version":"2.2","score":5,"title":"Not Experiencing the Issues","text":"I have been using U17 since it came out and it's been working great for me. I am not sure what issues everyone is screaming about, although, I am not using the GeoFencing everything else works great!","updated":"2015-01-17T05:33:27-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1064401606","userName":"Drewbiedoo","userUrl":"https://itunes.apple.com/us/reviews/id30116916","version":"2.1.3","score":1,"title":"Horrid","text":"Vera is running ui7. Thermostat control is significantly degraded vs ui5. (No fan or energy save control)\nWorse, thermostat and Vera http show Fahrenheit but the mobile app shows as Celsius. So it converts up and tries to set thermostat to 74 Celsius.  Horrible bug. And dangerous\nLastly, thermostat control tries to push every degree change to stat rather than setting to 74 from 68, you have to press (and wait) each degree up. This is really bad testing and coding and makes me want to go back to ui 5. Or dump Vera like a bad habit","updated":"2014-09-14T12:02:39-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1030611719","userName":"Jmauld","userUrl":"https://itunes.apple.com/us/reviews/id28670568","version":"1.0","score":2,"title":"Not compatible with ipad2, won't stay logged in","text":"This app doesn't display properly on an ipad2.  I am able to get it to work on an iphone, but it loses information between uses. Everytime I load the app I have to log out and log back in to get it to see my system. This kind of defeats the purpose of having one of these systems that is supposed to add convenience to your life.","updated":"2014-07-18T06:10:40-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1092682629","userName":"CatPrint.com","userUrl":"https://itunes.apple.com/us/reviews/id135420897","version":"2.1.3","score":5,"title":"Works!","text":"The app works fine, and has nice features.\n\nWhat is great is that the hardware hub works great even over a 3G hookup.\n\nAlso their customer support is very capable, and they can remotely login to your hub and fix any issues you might have.","updated":"2014-11-06T10:26:48-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1120015952","userName":"carlosrestrepopelaez","userUrl":"https://itunes.apple.com/us/reviews/id111903970","version":"2.1.3","score":4,"title":"Easy to connect, little bit slow","text":"Easy to connect, little bit slow\nWhen already have the unit configured is easy to connect with the app but takes a while to respond","updated":"2014-12-27T04:48:27-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1098987055","userName":"bmrgato","userUrl":"https://itunes.apple.com/us/reviews/id41116918","version":"2.1.3","score":2,"title":"I like the direction, but getting frustrated","text":"I feel like it's time to give up.  The system has lots of nice new features, easier to program, but\n\nNo responses to my last 2 support requests.\n\nAfter some months I still can't control furnace temperature or fan from app.  Being a Michigan resident that's kind of a critical feature.  \n\nThe system also occasionally notifies me to death about sensor activations, I can't find any setting telling it to notify me.\n\nHave alsteon which shows as a disconnected device.  I spoke to Vera support, they said it would be fixed in next release, there have been 3 releases and it still says disconnected device.","updated":"2014-11-18T03:54:47-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1290855393","userName":"MDBike","userUrl":"https://itunes.apple.com/us/reviews/id213459851","version":"2.2","score":1,"title":"Why does it insist on knowing where you are at?","text":"Every time you start it, it checks to see if you have turned on tracking so it knows when you are gone. It would be OK if it checked once and then did nag you again but it does it every time you start it, and it takes quite a while when it is checking so you can't turn anything on or off while it does its snooping!","updated":"2015-11-23T20:02:15-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1169826469","userName":"JosieDeRo","userUrl":"https://itunes.apple.com/us/reviews/id119552951","version":"2.2","score":3,"title":"Good for the most part","text":"The hub and components were very easy to install and configure!\n\nThe laptop app works great, but the mobile app definitely has some issues.  The issues that I've been having really revolve around my thermostat settings, cooling and auto.\n\nOther than that, it's a good app.","updated":"2015-03-18T08:44:27-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1598413834","userName":"123CarGuy123","userUrl":"https://itunes.apple.com/us/reviews/id42751069","version":"3.4","score":4,"title":"Seems to work ok.","text":"Generally works fine.  Still has problems with Trane Thermostats however.  It can't control the fan state.   An older version of VeraMobile worked fine but they broke something in this latest version.","updated":"2017-04-26T16:28:29-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1155550257","userName":"fjp8021","userUrl":"https://itunes.apple.com/us/reviews/id260807802","version":"2.2","score":4,"title":"Great Reliability","text":"Been using it to keep an eye on the while away for the last 2 months and it's worked flawlessly.  So far, very good. The device setup could a little more user friendly - needs better documentation.","updated":"2015-02-21T11:24:15-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1129050986","userName":"Apples and Oranges","userUrl":"https://itunes.apple.com/us/reviews/id37783016","version":"2.2","score":2,"title":"Poor app.","text":"Cons:\nTakes a long time to launch.\nOften times it loses my vera controller.\nIf you have scenes set up, it seems to actuate pretty quickly. Otherwise it can take forever.\nOften hangs, then becomes un-responsive.\nOn generic Z-wave dimmers, the app doesn't seem to update the current state. Often shows my back deck lights are on at 75%, but they are actually off.\nI can't figure out how to add devices via the app. Don't know if it is possible.\nNo way to customize any of the 'look' of the app- no icons or ability to add photos.\nFrustrating to set up.\nPros:\nIt's free.\nMostly does what it claims eventually.\nThe bulb icons do dim as a nice UI visual.","updated":"2015-01-12T21:41:41-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1032670227","userName":"guevs","userUrl":"https://itunes.apple.com/us/reviews/id42032721","version":"2.0","score":3,"title":"Much Better","text":"Much better than the previous version.  The layout is simpler and more intuitive.  Option to remember you so you do not have to login again after 24 hours.  Let's hope the stability has improved.","updated":"2014-07-21T17:34:50-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1133880936","userName":"Sinlok","userUrl":"https://itunes.apple.com/us/reviews/id111906460","version":"2.2","score":2,"title":"Works but slow","text":"Seems to bounce all your requests to their web server or something because even turning on lights takes a few seconds. Doing anything more complicated takes way longer. Would Be nice if it was able to interface with the device directly.","updated":"2015-01-21T14:53:31-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1232867401","userName":"trackpad","userUrl":"https://itunes.apple.com/us/reviews/id20918442","version":"2.2","score":1,"title":"Needs Work.","text":"Needs a lot of work.\n\nThe iOS app feels and functions like a wrapper around a universal web interface...that is to say, slow and janky and non-native. All-in-all, a pretty abysmal experience.\n\nNeeds input from professional app developers, designers and UI specialists who speak English as a first language.\n\nIt looks slightly better than what many of the smaller zwave controller vendors have managed to produce, but that's also a very low bar. It's still very far from approaching the level of polish seen in the app from smartthings – which is of course native to iOS ...and not a web interface dressed up as a native app.\n\nAlso: rating nag screens = automatic low rating.","updated":"2015-07-25T05:48:58-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1142833446","userName":"Momarlin","userUrl":"https://itunes.apple.com/us/reviews/id266168097","version":"2.2","score":2,"title":"Way to slow.","text":"I'm only giving this 2 stars because it's a really good idea. The interface needs serious work, and it takes way to long to load. Most of the time, I'm waiting 5+ minutes for the app to even get to the point to turn on/off anything. Fix this issue and you have a solid app here.","updated":"2015-02-06T18:17:47-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1329343231","userName":"ScottHammet","userUrl":"https://itunes.apple.com/us/reviews/id101042684","version":"2.4","score":1,"title":"Not As Good As It Should Be","text":"Vera is a good product. It's a shame that there's not more effort going into the software. Marginal, buggy features. Maybe they're just waiting on Homekit to be released. Otherwise, a lot more energy should be put into the software or other products with better integration will quickly supplant.  And potentially one of the most useful features, geofencing, doesn’t work at all.","updated":"2016-02-07T06:31:36-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1054653574","userName":"Jim & Nelda","userUrl":"https://itunes.apple.com/us/reviews/id40960346","version":"2.1.2","score":4,"title":"Great when working","text":"App is fluid and easy to use, just has trouble staying connected to the router. Might be the fault of the router and finding ISP addresses. Have not tried with camera yet, only lights. Will review again later if it improves stability.","updated":"2014-08-27T15:31:55-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1071990704","userName":"1ntegritas","userUrl":"https://itunes.apple.com/us/reviews/id36462297","version":"2.1.3","score":5,"title":"Works good","text":"Works great so far. Was thinking of going back to UI because of reviews. So far, no need yet. I'll feel better once they come out with the next version.","updated":"2014-09-28T18:29:29-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1374365603","userName":"Toonad235","userUrl":"https://itunes.apple.com/us/reviews/id173304374","version":"2.4","score":1,"title":"Not ready for prime time","text":"I like Vera however the app is a ugly and it appears that the manufacturer does not care about it. After the last update I can't start the app. Also, very very very basic, how about some graphics, ability to take pictures of the room and use it as background. I also have the Savant app as I control the Vera system through it, much much better app.","updated":"2016-05-06T06:26:43-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1305197812","userName":"KevNee96","userUrl":"https://itunes.apple.com/us/reviews/id3777567","version":"2.4","score":4,"title":"No fader/dimmer control","text":"The connecting and startup time is GREATLY improved, but the app no longer has faders to dim lights. Everything is only on/off - a pretty big piece of functionality that is missing from an otherwise good overhaul.","updated":"2015-12-23T16:53:13-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"943375658","userName":"EMCStoney","userUrl":"https://itunes.apple.com/us/reviews/id107245039","version":"1.0","score":2,"title":"Works but could be better","text":"Trouble logging in was fixed, but there are other issues. Splash screen comes up every time you open the app which is annoying. Loses communication with vera unit and doesn't recover with a refresh. Means you have to log in again. It functions but it needs work.","updated":"2014-02-14T08:40:56-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1133944043","userName":"shoover02","userUrl":"https://itunes.apple.com/us/reviews/id20045762","version":"2.2","score":3,"title":"Good features but slow to load","text":"It does what it needs to do, but it's takes so long to load the dashboard when first connecting to the Vera, I pity the person who needs to quickly turn on a light, lock a door, or trigger a camera.","updated":"2015-01-21T17:49:25-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1469068683","userName":"'Squid","userUrl":"https://itunes.apple.com/us/reviews/id49289758","version":"3.1","score":1,"title":"Doesn't work","text":"I had an older app that stopped working correctly. My assumption is because that app is old, written several iOS releases ago. \nSo I downloaded this app. It simply doesn't work. I cannot login to an existing (valid) account. If I try to add the unit from scratch I get the never ending spinning wait thing. No error messages, nothing.  I emailed tech support... no reply.  Look elsewhere is my advice.","updated":"2016-10-18T13:57:48-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1066059382","userName":"JeffS179","userUrl":"https://itunes.apple.com/us/reviews/id34220479","version":"2.1.3","score":1,"title":"Rarely works","text":"Much like the Vera Home device, the reliability of this app is terrible. On most days, the app fails to launch (it hangs at the startup page). On the rare chance that I am able to load the app, it doesn't work.\n\nYou're better off with one of the many other apps out there for Vera (or better yet --finding a home automation system that actually works).","updated":"2014-09-17T19:27:47-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1051290082","userName":"Dallisjc","userUrl":"https://itunes.apple.com/us/reviews/id24308686","version":"2.1.2","score":5,"title":"Works great","text":"Upgraded to UI17 firmware on Vera Lite unit, logged in with latest app,everything has worked great.  Multiple scenes, devices, no problems.  App is very well designed and easy to use.","updated":"2014-08-22T09:33:40-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1223155191","userName":"Nerdren","userUrl":"https://itunes.apple.com/us/reviews/id34742356","version":"2.2","score":2,"title":"Buggy & Weak Interface","text":"The graphics are pretty clean, but the interface too closely resembles the browser interface, and is clunky for phones.  It might be okay for iPads; I'm not sure.  (The browser interface is adequate--for PCs with decent screens.)\n\nI've very seldom seen something as buggy coming from the Apple Store.","updated":"2015-07-06T11:23:48-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1097793226","userName":"Shawn_KY","userUrl":"https://itunes.apple.com/us/reviews/id125376348","version":"2.1.3","score":3,"title":"Meh","text":"It has some nice features and perhaps might get there one day. Maybe it would be better if they bought out Vera Mate and combined the two.  Thermostat control flaky. Try changing and it automatically sets the temperature to 90C. (I have settings set to F to begin with.) UI7 has been average at best... So is this app.","updated":"2014-11-15T21:04:08-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1132255422","userName":"mc1home","userUrl":"https://itunes.apple.com/us/reviews/id29080945","version":"2.2","score":4,"title":"Seems to be fixed","text":"This upgrade at first would crash or not connect. Seems like there has a fix made and it works good for me no problems.","updated":"2015-01-18T14:11:06-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1106966391","userName":"whowman","userUrl":"https://itunes.apple.com/us/reviews/id190822243","version":"2.1.3","score":5,"title":"App works very well","text":"Great little app and works as advertised.\n\nI love being able to see the status of my house when I am halfway across the planet.","updated":"2014-12-02T13:17:39-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1146614335","userName":"Brett.H.Howell","userUrl":"https://itunes.apple.com/us/reviews/id85693334","version":"2.2","score":3,"title":"Simplify and make faster","text":"The app works but the update slowed login times to the point that it makes it less convenient that working items manually. Please hear my concerns and refocus the app of doing the required essentials well and quickly.","updated":"2015-02-12T17:51:29-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1211621291","userName":"Jeremy S","userUrl":"https://itunes.apple.com/us/reviews/id31629242","version":"2.2","score":1,"title":"Freezes / crashes often","text":"The app will lock up and become unresponsive often.  I resorted to loading the web UI and saving as a bookmark on the home screen.  This also has the advantage of being able to change advanced settings which is not exposed in the mobile app for some reason.","updated":"2015-06-13T03:11:59-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1110644503","userName":"Mr Vaz","userUrl":"https://itunes.apple.com/us/reviews/id140841993","version":"2.1.3","score":3,"title":"It's adequate, but can use improvements!","text":"After a few tries, I finally got it to schedule one light switch. May be its me being spoiled by Apple easy interface methodology, but the UI on this app remind me of old days when programming on mainframe computers.","updated":"2014-12-09T14:29:02-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1128952092","userName":"OkeyMor57","userUrl":"https://itunes.apple.com/us/reviews/id112708677","version":"2.2","score":1,"title":"I Regret Updating My firmware to U17","text":"For several weeks I have debated with myself whether to update or not, finally today I did and regret it.\nIt cannot log on to my device so the only control I have is via the web and on an iPad, whether using Safari, Chrome or Mercury, it just crashes.\n\nI lost the ability to set temperature range on my thermostat that I could on U15.","updated":"2015-01-12T17:27:46-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1066891518","userName":"Sbidwell","userUrl":"https://itunes.apple.com/us/reviews/id26032684","version":"2.1.3","score":1,"title":"Man this is bad!","text":"I really thought vera was going to be a good home automation solution, but if this app and the new UI7 is an indication of what this company is doing I suggest you run away from their products as fast as you can. I'm ditching my Vera lite and moving on. The new UI7 no longer works reliably with even the simplest of task such as turning on my driveway lights at sunset, and the mobile app is a complete joke. My Vera lite is going on eBay.","updated":"2014-09-19T09:42:11-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1155751523","userName":"Jeffliang","userUrl":"https://itunes.apple.com/us/reviews/id38999229","version":"2.2","score":2,"title":"Forever to load","text":"Takes 10-15 seconds to connect AFTER the app has loaded even when I'm at home. I expect it to connect through the local network. What's the point?  I could've already walked towards the light switch and turned off lights in that time frame.","updated":"2015-02-21T18:16:58-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"933905131","userName":"KF6DLQ","userUrl":"https://itunes.apple.com/us/reviews/id14465768","version":"1.0","score":5,"title":"Work wonderfully!","text":"You guys need a UI6 vera account. The UI5 accounts won't work. Works great and love the app, but you need the new version for vera first and use the new account you have to create for UI6.","updated":"2014-01-30T18:05:04-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1130087587","userName":"tccmn glad","userUrl":"https://itunes.apple.com/us/reviews/id431745673","version":"2.2","score":2,"title":"A step backwards","text":"The previous version worked better. This version forces me to log back in each time I exit the app.  The previous version kept me logged in.  It also spins for quite a while after log in thanking me for my patience which is annoying.","updated":"2015-01-14T18:17:55-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1062502636","userName":"Jasonkhonlaw","userUrl":"https://itunes.apple.com/us/reviews/id185853463","version":"2.1.3","score":2,"title":"Buggy, can't connect regularly","text":"Kind of works, but pretty buggy.  The dashboard is worthless as it always says I have no devices, lights, or security devices installed, even though I have several.\n\nThe worst is that it doesn't connect a good portion of the time, which makes it useless.","updated":"2014-09-11T05:53:24-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"966593692","userName":"jkuskowski","userUrl":"https://itunes.apple.com/us/reviews/id103728897","version":"1.0","score":2,"title":"Works great after you can get logged in!","text":"I really like this app once you are able to get connected.  It worked for a while, then all of a sudden to get connected I had to logout then back in. Which is very annoying!!!  Hopefully this bug gets fixed soon.","updated":"2014-03-27T16:12:53-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1060689872","userName":"ZeeJae","userUrl":"https://itunes.apple.com/us/reviews/id246921468","version":"2.1.3","score":1,"title":"Vera is not a reliable home automation system","text":"Although it's very flexible, reliability is a real issue. Software version control is real issue for this company. Support is only email and nonexistent over weekend. God forbid , if their servers go down on Friday evening, you literally cannot control anything device in your house using this device. Be prepared to have a backup plan.","updated":"2014-09-07T14:40:45-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1630446688","userName":"wjparris","userUrl":"https://itunes.apple.com/us/reviews/id86179642","version":"3.5","score":2,"title":"Now with pop-up advertising!","text":"Now contains pop-up ads for their products that get in your way while loading the app. You have to exit the ad before using their application. Just go get HomeWave or another app that doesn't have ads.","updated":"2017-06-01T05:12:44-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1573447317","userName":"Hatter81","userUrl":"https://itunes.apple.com/us/reviews/id126882018","version":"3.4","score":1,"title":"App crashing","text":"So every few days I have to delete and reinstall the app because something seems to be getting corrupted and forces the app to crash during launch. Phone restarts, and other trouble shooting checks do nothing. Please find the data leak and update so that we can use this app regularly again.","updated":"2017-03-26T18:02:39-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1215950600","userName":"MB-Denver","userUrl":"https://itunes.apple.com/us/reviews/id10328644","version":"2.2","score":4,"title":"Better than the old one","text":"I moved to the new edge from an older vera3.  The UI is much better.  Yes, I agree there are bugs, but I think it is much better.  \n\nI wish startup was faster.","updated":"2015-06-21T20:25:56-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1135499955","userName":"TechnologyTalisman","userUrl":"https://itunes.apple.com/us/reviews/id17291545","version":"2.2","score":5,"title":"Works well","text":"I use this to control z wave devices connected to my Vera at home. Works great whether I'm on home wireless or cellular network data connection.","updated":"2015-01-24T12:58:20-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1140747432","userName":"Frustrated user 100026","userUrl":"https://itunes.apple.com/us/reviews/id140954628","version":"2.2","score":1,"title":"I wish I could give this app zero stars.","text":"Sure this app looks pretty, but functionally it's awful, especially for an app that you use to control simple things like lights in your home. Nothing is more frustrating then opening the app and waiting up till a minute before you can turn on your living room lights.","updated":"2015-02-02T18:20:35-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1132911606","userName":"Ralphsson1","userUrl":"https://itunes.apple.com/us/reviews/id244768974","version":"2.2","score":1,"title":"Horrible Update","text":"New proximity feature is worthless; does not appear to work. App takes significantly longer to be ready to do anything--requiring tens of seconds standing there waiting for \"Thank you for your patience\" to go away so you can set \"Away\" or \"Home\" when you are leaving or coming home. Please fix these!","updated":"2015-01-19T19:01:55-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1744214978","userName":"Isthisnicknmaetakentoo4132","userUrl":"https://itunes.apple.com/us/reviews/id29035685","version":"3.6","score":1,"title":"An ad? Really?!","text":"Probably the dumbest decision I have seen in the history of apps (and I have seen a lot).\nNo way to get rid of the ad.  An encroachment on my personal space because this is not just any other app but my home controller. Really feels like I don't have control at all and makes me almost paranoid about what they can do to my house.","updated":"2017-08-23T22:34:08-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1348351813","userName":"CandyLineup","userUrl":"https://itunes.apple.com/us/reviews/id345112612","version":"2.4","score":1,"title":"Can't login with known working user name!","text":"I can login with my user name and password on the website but this app acts like I put in an incorrect password or something. \"Login failed... Please try again\", it repeatedly says. I had stuck with the old app but that has now stopped working unless I am home so I have renewed interest in this app.","updated":"2016-03-15T11:41:45-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1180893675","userName":"Dazzlingk","userUrl":"https://itunes.apple.com/us/reviews/id146927753","version":"2.2","score":1,"title":"Worthless","text":"This app is so bad is crashes every few minutes.  Worse, it mistakes my initial swipe to initiate a scroll with am actual command powering or switching a device without desiring to do so. Just trying to scroll the screen up or down can unintentionally open a garage door, turn off a thermostat or flood light, etc. Terrible!","updated":"2015-04-10T15:56:10-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1124038053","userName":"Zombie...","userUrl":"https://itunes.apple.com/us/reviews/id148848689","version":"2.1.3","score":2,"title":"Good to have on mobile, but needs work","text":"Nice app to have mobile, but things like temperature settings needs work.  It's show C when everything is operating in F. It doesn't show the electrical utilization info like in the web interface. It is nice to have on mobile though.","updated":"2015-01-03T09:02:23-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1042631469","userName":"SoCal Jay","userUrl":"https://itunes.apple.com/us/reviews/id14434891","version":"2.1","score":5,"title":"Finally Arriving ...","text":"Had a lot of negative experiences with old UI.  Under this new UI7 version many of the bugs have finally been addressed.   \n\nThis is getting much closer to the experience expected for consumer-level adoption.  \n\nOnly recommend a more formal and simple way to report on bugs and enhancement requests.  \n\nI commend the move forward.  Thank you.","updated":"2014-08-07T21:55:38-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1241210555","userName":"Dthedba","userUrl":"https://itunes.apple.com/us/reviews/id179069956","version":"2.2","score":4,"title":"Cool app","text":"While it takes a bit of work to get the security set up (and easier to do on the pic for that particular), the app works well for monitoring. \n\nAll in all very pleased.","updated":"2015-08-10T20:29:36-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1135956309","userName":"My name is Don","userUrl":"https://itunes.apple.com/us/reviews/id38998397","version":"2.2","score":1,"title":"Slow to connect","text":"Slow to connect. 6 seconds on average. \nI called support for them to act surprised (they must not read the reviews) \nThe operator said February may see a update that might fix this issue. Slow response in my option. Back to wink. Too bad as I have much better rules with this system.","updated":"2015-01-25T09:33:10-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1055026458","userName":"Trekfrk","userUrl":"https://itunes.apple.com/us/reviews/id335026348","version":"2.1.2","score":2,"title":"Too soon","text":"Much cleaner interface than the old one but not as reliable. Doesn't connect all the time and often shows no devices. Response time seems slower and sometimes freezes. Can't wait for update.","updated":"2014-08-28T07:02:08-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1127003418","userName":"WishIstayedwithUI5","userUrl":"https://itunes.apple.com/us/reviews/id102768020","version":"2.2","score":1,"title":"Don’t do it !","text":"Decided to upgrade after almost 2 years to UI7, worst decision ever.  UI7 is super buggy and ultra slow response times when it does work.  This mobile app looks cool but locks up after a few seconds, rendering my system useless.  If your Vera3 is working ok with an older version, stay with that, this isn’t ready yet.","updated":"2015-01-09T04:11:42-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1089416084","userName":"JerryK","userUrl":"https://itunes.apple.com/us/reviews/id40205776","version":"2.1.3","score":1,"title":"Nice looking interface, too bad it doesn't work","text":"Even more buggy than UI6. I need to go back to UI5, at least on my devices worked under that. Most of my devices don't work under UI7. Total garbage. I'd even be willing to pay a small monthly fee if it would help them hire programmers that knew what they were doing","updated":"2014-10-31T13:43:17-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1299259886","userName":"pshoover","userUrl":"https://itunes.apple.com/us/reviews/id40217948","version":"2.2","score":4,"title":"Works as designed.","text":"A little slow but does the trick. App does not have all features of the web but works perfect.","updated":"2015-12-11T16:52:48-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1142266827","userName":"Chezeit","userUrl":"https://itunes.apple.com/us/reviews/id135287745","version":"2.2","score":3,"title":"Improvement","text":"Definitely better then the previous version. Worth the effort. Looking forward to more improvements.","updated":"2015-02-05T16:30:02-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1147515271","userName":"DblJBird","userUrl":"https://itunes.apple.com/us/reviews/id109864389","version":"2.2","score":1,"title":"Pointless","text":"Incredibly slow load & refresh time. Bulky, slow and next to impossible to navigate. \n\nI've been with Vera since close to their inception. One thing they can never seem to get down is their interface, which is in my opinion, absolutely as important as its reliability. \n\nYou scroll endlessly through menus and devices scrambling to find what you want. My wife and daughters wouldn't even give it a chance. \n\nIf you're reading this and are searching, try VeraMate. At this point, it's the best thing out there for the Vera community.","updated":"2015-02-13T14:00:24-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1567285071","userName":"Brijam","userUrl":"https://itunes.apple.com/us/reviews/id42906783","version":"3.4","score":5,"title":"Great!","text":"Thanks for the update, now I can add/delete pin codes from the app. That's exactly what I have been waiting for. 👍🏼","updated":"2017-03-18T10:19:08-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1126725545","userName":"Engzr016","userUrl":"https://itunes.apple.com/us/reviews/id39651224","version":"2.2","score":1,"title":"Horrible Update","text":"The only good that came out of this update was the new icon. Otherwise, it loves to crash whenever you try to do something. Oh, and it takes forever to load, so much so that it's actually quicker to grab my laptop and sign in on the web to control my system.","updated":"2015-01-08T13:56:32-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1580060918","userName":"30hen801","userUrl":"https://itunes.apple.com/us/reviews/id384447275","version":"3.4","score":4,"title":"App unstable","text":"Constantly crashes. Have to log in through the web site.","updated":"2017-04-03T19:04:09-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1213671211","userName":"JSY33","userUrl":"https://itunes.apple.com/us/reviews/id255013110","version":"2.2","score":4,"title":"Awesome","text":"I really like the easy and big interface this app has, very easy to see my devices and no problem navigating thru the app.","updated":"2015-06-17T06:34:19-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1129959985","userName":"Kazakaz","userUrl":"https://itunes.apple.com/us/reviews/id19188751","version":"2.2","score":1,"title":"Geofencing!","text":"I was excited for this update to finally be able to change scenes based on my location. Too bad it doesn't work consistently. When I'm sitting at home it randomly switches to away and my motion sensors trip. When I leave home, it doesn't know I left and keeps the mode in Home.","updated":"2015-01-14T12:15:05-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"988787449","userName":"mch7","userUrl":"https://itunes.apple.com/us/reviews/id26911920","version":"1.0","score":2,"title":"Needs work!","text":"I agree with many of the people here. It constantly loses the unit and a refresh does not work. You have to logout and log back in. Not at all convenient.  Please fix!  Will rate higher once problem is fixed!","updated":"2014-05-06T14:52:27-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1234371559","userName":"jboze_qt","userUrl":"https://itunes.apple.com/us/reviews/id26003426","version":"2.2","score":1,"title":"Wow, shockingly bad","text":"I really like the vera home automation system, but this mobile app is just terrible and kills the experience. It usually takes 15 seconds or so to connect to the Vera system. That alone is a dealbreaker. I'm going to try some third-party apps in hopes of finding something more responsive and stable.","updated":"2015-07-28T04:03:22-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"946012894","userName":"SINBIN RUGBY","userUrl":"https://itunes.apple.com/us/reviews/id29274869","version":"1.0","score":3,"title":"One big request","text":"PLEASE get rid of the splash screen every time I go back to the app. Other than that it seems to be working well.","updated":"2014-02-18T11:41:05-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1134865419","userName":"Linderballs","userUrl":"https://itunes.apple.com/us/reviews/id30577265","version":"2.2","score":5,"title":"So far so good","text":"App works great for me. I only have two devices on my network but so far it's been great!","updated":"2015-01-23T10:49:23-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1128894680","userName":"NaeemInSJ","userUrl":"https://itunes.apple.com/us/reviews/id237267044","version":"2.2","score":2,"title":"Why not test before releasing?","text":"Every firmware or app release has basic issues that points to no testing (or poor testing) conducted by you guys.\n\n I am willing to test for you if you like.\n\nIn this update annoying welcome message is gone and has been replaced with geo location not configured message.\n\nApp and Veralite is constantly loosing password, I have reset passwords 3 times by now.\nHorrible as usuall !!!!\nIt will get better but please learn from previous releases  and do not repeat them","updated":"2015-01-12T14:38:32-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1505626928","userName":"Ohhhhnoooo","userUrl":"https://itunes.apple.com/us/reviews/id540341961","version":"3.2","score":1,"title":"Don't do upgrade","text":"Since performing the upgrade I am not able to open the app. It crashes instantly. I emailed for support and they replied quickly asking for more information-which I provided. Now I have not heard back for over 5 hours. Do not install this version!","updated":"2016-12-20T10:29:39-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1245953371","userName":"NE1BUTYOO","userUrl":"https://itunes.apple.com/us/reviews/id42787765","version":"2.2","score":1,"title":"So buggy and unreliable","text":"The app really hampers the reliability of the entire system.  Currently, it shows my home being 80 degrees and set at 165 degrees.  Celsius!?! The overall latency of the Vera app and the entire system means that it will likely be replaced in my home soon if these glitches aren't addressed quickly.","updated":"2015-08-20T06:59:38-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1210802573","userName":"taylorkt32","userUrl":"https://itunes.apple.com/us/reviews/id42635298","version":"2.2","score":1,"title":"Terrible","text":"I upgraded, so I thought lol, from UI5 to UI7 back in Dec 2014. UI7 was too buggy for me. Things which worked just fine in UI5, no longer work in UI7. Too many problems to list here. Plus, the problems have all been documented by other users. Stay away from this product from this vendor. PERIOD","updated":"2015-06-11T10:26:04-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1129729161","userName":"Bbbilll63582752","userUrl":"https://itunes.apple.com/us/reviews/id32754633","version":"2.2","score":1,"title":"Not ready for market... Run from this","text":"App does not stream video from camera. \nApp does not always connect to the controller. \nApp does not always execute commands thou it says I did. \nHad to return non working components... Weeks later replacements have not arrived. \nSpent hours with tech support with little results. They seem to know little more than I do about the system. \nRegular software updates show the lack of readiness. \nThe vistacam often stops responding and must be power-cycled to reset it (not a good thing for a remote security system).","updated":"2015-01-14T02:56:56-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1304038551","userName":"BillyBoJangles","userUrl":"https://itunes.apple.com/us/reviews/id101089308","version":"2.4","score":5,"title":"So much better","text":"This update is so much better. Thank you!","updated":"2015-12-21T11:08:45-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1202200829","userName":"FrankFlorida","userUrl":"https://itunes.apple.com/us/reviews/id179586012","version":"2.2","score":1,"title":"Useless bad","text":"I followed exactly the instruction but it did not work, took minutes to login and start, but showed that I had no devices, 2nd start the app froze complete, I gave up after 15 minutes of trying. On my PC it all is working well but this iPhone app is totally useless.","updated":"2015-05-24T16:25:14-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1290075820","userName":"Mr. Joefield","userUrl":"https://itunes.apple.com/us/reviews/id114133558","version":"2.2","score":2,"title":"Wish it was better!","text":"Apps works sometime, temps are shown as Celsius but the numbers are actually Fahrenheit.  Also a little slow to process commands even when home on the same network..","updated":"2015-11-22T03:32:58-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1108469407","userName":"ncraigg","userUrl":"https://itunes.apple.com/us/reviews/id110996951","version":"2.1.3","score":1,"title":"Unresponsive","text":"It's not often that I take the time to write a review.  I only bother if the app is really good, or really bad.  This one is really bad.  Something simple like flipping on a light right many, many attempts.  The slider just doesn't respond. Spend the $5.99 on HomeWave.  It does exactly what I ask it to, every time.","updated":"2014-12-05T15:49:35-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1473468240","userName":"jrabakker","userUrl":"https://itunes.apple.com/us/reviews/id11446174","version":"3.1","score":1,"title":"Geofence. When?!?!","text":"Been waiting and waiting and waiting on the updated version where the geofence actually switches the system from 'home' to 'away'. It properly provides notifications, but zero actual action. Come on Vera, get your act together.","updated":"2016-10-26T14:19:14-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1598899063","userName":"Rondl74","userUrl":"https://itunes.apple.com/us/reviews/id18905873","version":"3.4","score":1,"title":"Poor.","text":"It's just hard to know where to start.  On the occaisions where it works, it's not bad.  But some much of the time, it's just either hung or \"thinking\".  \nAnd it truth - it may not be the iOS at fault completely.  The web interface to the Vera 3 controller (UI7) isn't much better.","updated":"2017-04-27T04:14:30-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1068317651","userName":"Darren D74","userUrl":"https://itunes.apple.com/us/reviews/id407315097","version":"2.1.3","score":2,"title":"Vera lite control of Trane 400BB","text":"The app cannot fully control the Trane 400BB thermostats I can only read the temperature and not alter them up or down. I can only control the vera lite system through a desktop web interface a fix will be great!","updated":"2014-09-21T19:13:47-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1063706532","userName":"Rgtk","userUrl":"https://itunes.apple.com/us/reviews/id31870789","version":"2.1.3","score":2,"title":"Very buggy, limited usefulness","text":"Like the other reviewer mentioned, dashboard is useless and a joke.  Trying to see a larger view of the cameras never works, just says \"loading\" but never does.  Developers, are you listening?","updated":"2014-09-13T08:40:55-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1062261769","userName":"Mjfender","userUrl":"https://itunes.apple.com/us/reviews/id121902700","version":"2.1.3","score":2,"title":"Help me","text":"Still needs some help. Works for a while and then bombs. Takes a call to customer support to get back on track. This doesn't work so well when the system is 1300 miles away.","updated":"2014-09-10T18:30:59-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"966716615","userName":"CraigCraig74","userUrl":"https://itunes.apple.com/us/reviews/id4817141","version":"1.0","score":1,"title":"Loses Vera unit constantly","text":"Every few days the app can no longer find my Vera unit and I have to delete and reinstall the app in order for it to show up again. Pretty much useless until this is fixed.  Hope someone is working on this.","updated":"2014-03-27T21:44:00-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1128923638","userName":"NeeditBad!","userUrl":"https://itunes.apple.com/us/reviews/id346792201","version":"2.2","score":2,"title":"Very slow...","text":"I have only written a couple app reviews - but I really need this app to work!  I have \"banked\" on the z-wave product line - and Vera runs it all.  Please fix the speed issues.  I do like the geofencing capability, but have not used it yet.","updated":"2015-01-12T16:05:58-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1635030431","userName":"CougsFan04","userUrl":"https://itunes.apple.com/us/reviews/id42882603","version":"3.5","score":2,"title":"Schedules no longer work","text":"After the last two updates, my schedules no longer work. I've tried everything. Very frustrating. Please fix ASAP.","updated":"2017-06-05T22:04:05-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1063023625","userName":"SolarDell","userUrl":"https://itunes.apple.com/us/reviews/id33076973","version":"2.1.3","score":2,"title":"Mostly does not work when you need it","text":"The older version of the app worked just fine, this improvement is not an improvement.","updated":"2014-09-12T05:07:55-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1304427111","userName":"TBMN","userUrl":"https://itunes.apple.com/us/reviews/id31760540","version":"2.4","score":1,"title":"Watch app?  Doesn't work at all far as I can tell.","text":"For the life of me I can't figure out what if anything you can do with watch app?  Would be nice if you could do something useful, like turn on lights or unlock doors.  Near as I can tell it's pretty much just viewer for alerts. Lame","updated":"2015-12-22T05:53:03-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1375137328","userName":"Hotkey","userUrl":"https://itunes.apple.com/us/reviews/id5096471","version":"2.4","score":1,"title":"It WIll Cost YOu Dearly","text":"Every time I start the app, it would automatically sets my thermostat to 90. I just walked in to yet another household sauna. \n\nAnd the Geo Fencing was quirky at first but it hasn't worked at all since before Christmas. \n\nSave yourself the bother. Look for a better alternative.","updated":"2016-05-07T17:20:42-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1129536453","userName":"Techie-","userUrl":"https://itunes.apple.com/us/reviews/id85609448","version":"2.2","score":1,"title":"Wow, Just Terrible","text":"I am regretting telling friends to get a Vera now. This upgrade is horrible, constantly crashes, and makes me want to switch to something who has a staff that doesn't have a constant negative attitude about upcoming technology like Apple's built in home automation tools.","updated":"2015-01-13T18:20:29-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1272750374","userName":"soon2fly","userUrl":"https://itunes.apple.com/us/reviews/id305437469","version":"2.2","score":5,"title":"Vera Edge is making progress","text":"Progress is being made.","updated":"2015-10-16T16:34:15-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1131458035","userName":"RKhanuja","userUrl":"https://itunes.apple.com/us/reviews/id85962891","version":"2.2","score":1,"title":"Horrible upgrade there QA is a joke","text":"Constant crashes.. Not able to use it..So many basic things are not working. Seems this app was released without QA. Even developer probably didn't test what they wrote. Don't install this it is junk","updated":"2015-01-17T07:02:06-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"949204209","userName":"theduma","userUrl":"https://itunes.apple.com/us/reviews/id224696636","version":"1.0","score":2,"title":"Ui6?","text":"Not sure i the problem is ui6, but my other apps won't recognize this.  Other than that, the camera screen is not set up for a PTz camera. Hopefully they fix soon","updated":"2014-02-23T19:26:37-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1067057055","userName":"Tylermagne","userUrl":"https://itunes.apple.com/us/reviews/id15103931","version":"2.1.3","score":1,"title":"Terrible","text":"Was far more reliable and easier to use 6 months ago. Since then, it has turned for the worse and makes me regret using this system. Too bad I can't get my money back on the controller and all of the pieces.","updated":"2014-09-19T17:36:22-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1518240488","userName":"Mo Zhang","userUrl":"https://itunes.apple.com/us/reviews/id86363509","version":"3.3","score":1,"title":"They want way too much information","text":"Why the hell do I have to provide my cell phone number, cellphone carrier, street address, and name to be able to use this product. If I knew this, I wouldn't buy vera at the beginning.","updated":"2017-01-08T19:27:19-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1426704595","userName":"ChristianRiley","userUrl":"https://itunes.apple.com/us/reviews/id27717973","version":"3.0","score":1,"title":"Can't login","text":"Now it just says \"Login failed.  Please try again!\"  \n\nVera has been somewhat reliable in the past, but the last year or so their updates and improvements have been anything but.","updated":"2016-08-04T13:19:43-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1284132818","userName":"eljst","userUrl":"https://itunes.apple.com/us/reviews/id33040386","version":"2.2","score":1,"title":"Barely functional","text":"App takes 15+ seconds to fully launch and then frequently freezes before being able to input a command to the system. Pretty much useless.","updated":"2015-11-08T23:55:36-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1019464493","userName":"C.13","userUrl":"https://itunes.apple.com/us/reviews/id135196695","version":"1.0","score":1,"title":"Software is crap","text":"Product is awesome, however I cannot even turn on or off my ac thermostats, also only displayed in celsius Can't change to Fahrenheit.  Along with other issues.  They really need to fix these simple issues.","updated":"2014-06-29T20:39:37-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1134997236","userName":"Lotus2424","userUrl":"https://itunes.apple.com/us/reviews/id276043860","version":"2.2","score":2,"title":"Horrible interface and wait times","text":"Works, but slow to connect, slow to respond.","updated":"2015-01-23T17:18:49-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1215718024","userName":"Du.ma.50617927","userUrl":"https://itunes.apple.com/us/reviews/id107683583","version":"2.2","score":2,"title":"Slow and inconvenient","text":"Takes 10 secs to dim light on first startup, other apps are instant..\nHome screen also too busy, make it simple and convenient please..","updated":"2015-06-21T08:47:25-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1124781731","userName":"S9601694","userUrl":"https://itunes.apple.com/us/reviews/id118584479","version":"2.1.3","score":2,"title":"Used to work fine..","text":"This app WAS great for activating scenes from the couch or wherever. Now it does nothing but crash.. I haven't been able to open it for a while.","updated":"2015-01-04T16:37:01-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1168484934","userName":"BCS Customer","userUrl":"https://itunes.apple.com/us/reviews/id267000195","version":"2.2","score":1,"title":"Thank you for your patience...","text":"App takes forever to load!! It's annoying when you want to run scenes, etc... You get the \"Thank you for your patience...\", but I only have so much patience!! Please do something about this!","updated":"2015-03-15T12:22:02-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1112591892","userName":"ChipsterGuy","userUrl":"https://itunes.apple.com/us/reviews/id40569114","version":"2.1.3","score":5,"title":"Nice App","text":"Works just fine. No problems here.","updated":"2014-12-13T07:17:02-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1513048357","userName":"Chrisx11","userUrl":"https://itunes.apple.com/us/reviews/id186564277","version":"3.2","score":1,"title":"Cannot launch the app anymore after upgrade","text":"The new version 3.2 has serious problem. Crashes after login, completely unusable.","updated":"2016-12-31T22:14:39-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1243570198","userName":"R0okey","userUrl":"https://itunes.apple.com/us/reviews/id180341837","version":"2.2","score":1,"title":"Vera mobile app","text":"I really wanted to app to work but it's just not stable. Push notifications don't work. The app constantly is freezing. This app needs to get higher priority from Vera and get all the bugs out.","updated":"2015-08-15T09:32:29-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1131403883","userName":"ixos","userUrl":"https://itunes.apple.com/us/reviews/id107458909","version":"2.2","score":1,"title":"Sloooooow","text":"Often this has to be killed and restarted to work.. Then it takes forever to connect. Takes another forever to effect commands. Sometimes (often) it's fa aster for me to go upstairs and use a computer.","updated":"2015-01-17T05:19:11-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1712358261","userName":"GJCrawford","userUrl":"https://itunes.apple.com/us/reviews/id113350285","version":"3.6","score":1,"title":"Use A Different App","text":"Such such an annoying app to begin with...then they decide to add pop up ads promoting their products and service.  Shame I have to use a third party app to use their hardware without a hassle.","updated":"2017-08-04T01:17:37-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1202651267","userName":"Crisnofear","userUrl":"https://itunes.apple.com/us/reviews/id185701711","version":"2.2","score":1,"title":"Slooow bugs","text":"Takes long time to open the app. When you create or change a scene configuration, most of the time it doesn't save it. The geofence doesn't work most of the time too..","updated":"2015-05-25T15:44:30-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"938637794","userName":"Narster","userUrl":"https://itunes.apple.com/us/reviews/id107663032","version":"1.0","score":3,"title":"I can login but,","text":"I can login but, it shows temperature in Celsius. I would like to change it to Fahrenheit. The thermostat is showing the temperature in Fahrenheit.","updated":"2014-02-07T07:02:26-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1114741260","userName":"Arcusjim","userUrl":"https://itunes.apple.com/us/reviews/id230828013","version":"2.1.3","score":1,"title":"Keeps blowing up","text":"Since I moved to a 6plus application will load then shows no devices then blows up and go away. Reset phone and reloaded app but same results. Also Vera ui7  is very unstable and should have not been released.","updated":"2014-12-17T05:43:52-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1099300734","userName":"Jhos88","userUrl":"https://itunes.apple.com/us/reviews/id134503039","version":"2.1.3","score":1,"title":"Junk","text":"This is junk. I upgraded to Vera 1.7 and lost half my functionality. Interface stinks. iPhone app no longer works. I can restore factory defaults and start over again...way to go development team!","updated":"2014-11-18T18:43:31-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1284276036","userName":"SamsocaI","userUrl":"https://itunes.apple.com/us/reviews/id387145161","version":"2.2","score":1,"title":"Inferior in many ways","text":"It is slower than the older app.\nIt does not show all devices available.\nDashboard shows climate temperature in Celcius when it should be Fahrenheit.\nOlder app allowed input of desired temperature. New app only allows +/-1 degree.","updated":"2015-11-09T07:36:04-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1034487714","userName":"Ford3113","userUrl":"https://itunes.apple.com/us/reviews/id48862659","version":"2.0","score":3,"title":"Lock does not work from App","text":"Tried to lock/unlock my Kwikset lock and does not work from the App. Layout is nicer.","updated":"2014-07-24T21:15:57-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1158285104","userName":"garretn","userUrl":"https://itunes.apple.com/us/reviews/id29261810","version":"2.2","score":2,"title":"Thermostats Don't Adjust","text":"Make adjustments and they appear to take but the heat never adjust.  Very slow to load app. Looks good but bugs need to be fixed. Shows Celsius temp no adjustment","updated":"2015-02-25T06:20:02-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1132884357","userName":"60DeviceGuy","userUrl":"https://itunes.apple.com/us/reviews/id415141028","version":"2.2","score":1,"title":"horrible device","text":"none of there units, wether its vera2 vera lite, or vera3, non of them can  handle more then 50 devices, there customer support will keep upgrading you (and charge you for it) to the next higher model, but its just a proven fact that no matter how you add them, you network becomes unstable around 50 or more devices thats the limit, so try something esls if you have more then 50 zwave devices.","updated":"2015-01-19T17:49:36-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1124876174","userName":"jeremy480","userUrl":"https://itunes.apple.com/us/reviews/id7031636","version":"2.1.3","score":1,"title":"Slow response","text":"App takes a long time to load, often freezes and I cannot view my camera in full screen.","updated":"2015-01-04T20:46:50-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1219234874","userName":"Xyzzy plugh","userUrl":"https://itunes.apple.com/us/reviews/id178342883","version":"2.2","score":3,"title":"Decent","text":"Annoying quirks like long load time. C incorrect for temperature. A true iPad app would be a lot more useful.","updated":"2015-06-28T11:44:07-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1084146068","userName":"Jewelz2017","userUrl":"https://itunes.apple.com/us/reviews/id87639580","version":"2.1.3","score":3,"title":"Needs immediate facelift","text":"User Interface looks outdated and unreliable. Would look for alternatives...","updated":"2014-10-21T16:54:34-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"963793781","userName":"Hotopic88","userUrl":"https://itunes.apple.com/us/reviews/id25287954","version":"1.0","score":1,"title":"Nothing but trouble","text":"This app is trouble every since I downloaded it. I have to constantly login and logout of the app because it doesn't see my unit. So sorry I ever downloaded it and upgraded my firmware.","updated":"2014-03-22T05:45:54-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1431888799","userName":"Miguelromero1&","userUrl":"https://itunes.apple.com/us/reviews/id420385465","version":"3.0","score":1,"title":"Can't log in","text":"I have not been able to log in to the vera system either through my mac (wether i use safari or google chrome).  NOW I cant even log in to it with my iphone. So basically I HAVE A DEVICE THAT IS USELESS TO ME BECAUSE I CANT ACCESS IT.","updated":"2016-08-12T17:24:42-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1163335642","userName":"videoguymike","userUrl":"https://itunes.apple.com/us/reviews/id100137283","version":"2.2","score":1,"title":"Chat even login using UI7","text":"I would love to try this app. I can't even login to the app. :( fail!\nTheir other vera app has many bugs and freezes all the time. Please update and fix this app.","updated":"2015-03-04T13:50:25-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"928961746","userName":"tracker_oz","userUrl":"https://itunes.apple.com/us/reviews/id8851257","version":"1.0","score":1,"title":"Can’t log in","text":"I would like to review this app, but it won’t even let me log in. I have an account and have checked the credentials several times. \n\nPlease fix!","updated":"2014-01-21T15:47:09-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1286624440","userName":"Jaypup","userUrl":"https://itunes.apple.com/us/reviews/id106650062","version":"2.2","score":1,"title":"Unable to even login","text":"I'm using Veramate and others just fine with my Vera3 unit. Even reset my password on the site, still cannot login using this app.","updated":"2015-11-14T11:54:34-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1257301762","userName":"Fairly Incredible","userUrl":"https://itunes.apple.com/us/reviews/id26425126","version":"2.2","score":2,"title":"Doesn't even support iPhone 6","text":"Everything looks blurry in this app.","updated":"2015-09-14T00:00:31-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1033869567","userName":"Jenni b case","userUrl":"https://itunes.apple.com/us/reviews/id315610419","version":"2.0","score":2,"title":"Door lock doesn't work.","text":"The door lock feature doesn't work with my iPhone.","updated":"2014-07-23T18:39:37-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"923423367","userName":"Pawsoutst4324","userUrl":"https://itunes.apple.com/us/reviews/id101420156","version":"1.0","score":2,"title":"Bugged","text":"It will not let me login it gives me an error and before you ask yes I have an account","updated":"2014-01-10T18:12:33-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1165247817","userName":"Crazy-Cactus","userUrl":"https://itunes.apple.com/us/reviews/id35050951","version":"2.2","score":1,"title":"Hangs constantly","text":"The product was a good idea. It has a very poor implementation. I wish I could get my money back.... Hangs constantly, it is essentially worthless. Buyer beware","updated":"2015-03-08T07:50:09-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1435981464","userName":"SmoochiesBoss","userUrl":"https://itunes.apple.com/us/reviews/id42534664","version":"3.0","score":1,"title":"Won't even load","text":"Past versions of this app have been passably acceptable, but this newest one won't even load to get me to the sign in screen.","updated":"2016-08-19T23:08:17-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1187019775","userName":"SpaceGrey","userUrl":"https://itunes.apple.com/us/reviews/id28104381","version":"2.2","score":1,"title":"Frustrating and useless","text":"Using this is like running up a greased slide. One bug after another - impossible to get anything accomplished.","updated":"2015-04-23T14:58:01-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1130413275","userName":"Big Lynxy","userUrl":"https://itunes.apple.com/us/reviews/id43533910","version":"2.2","score":1,"title":"Thermostats don't work from favorite menu","text":"Problem with thermostat temperature update, only if I go rooms, not work from fav. menu. Very slow, not reliable, shows wrong temperature","updated":"2015-01-15T08:10:30-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1071395554","userName":"FIVEfingersFIVE","userUrl":"https://itunes.apple.com/us/reviews/id43105725","version":"2.1.3","score":2,"title":"Rudimentary at best","text":"Awful. The whole going from a vera2 which worked to a vera 3 which virtually nothing transferred is a joke.  This system is not for the feint of heart.","updated":"2014-09-27T18:11:10-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1126348109","userName":"Redemily","userUrl":"https://itunes.apple.com/us/reviews/id27607377","version":"2.2","score":1,"title":"Keeps crashing","text":"The latest update crashes and won't let me log in or keep me logged in. Fix it please!","updated":"2015-01-07T19:08:54-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1261460942","userName":"Mattdoesnthaveanickname","userUrl":"https://itunes.apple.com/us/reviews/id13586486","version":"2.2","score":2,"title":"Works well","text":"Crashes a lot in io9. Lacks Touch ID to access the app. It's slow and freezes","updated":"2015-09-22T19:09:07-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1055958019","userName":"Biggest Bopper","userUrl":"https://itunes.apple.com/us/reviews/id101245137","version":"2.1.2","score":5,"title":"Brilliant","text":"This App is Brilliant- can't wait to finish the install!\nFlood protection, crime detection and prevention, HAVAC, lighting, and monitoring my BMW I3","updated":"2014-08-29T22:31:12-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1286096218","userName":"Fieldmedic","userUrl":"https://itunes.apple.com/us/reviews/id167316332","version":"2.2","score":1,"title":"User UNfriendly","text":"This was written rather poorly. It's difficult to do much of anything in this app.\n\nI guess I shouldn't complain because it's free. I got exactly what I paid for.","updated":"2015-11-13T09:33:31-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1855047925","userName":"Jacob Khan","userUrl":"https://itunes.apple.com/us/reviews/id43931182","version":"3.7","score":1,"title":"Problem with I watch app after update","text":"The new iOS and I watch update messed up veras app. It keeps crashing on the watch","updated":"2017-10-17T05:38:25-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1522429224","userName":"Sailorboy63","userUrl":"https://itunes.apple.com/us/reviews/id129522910","version":"3.3","score":1,"title":"Don't bother getting this app","text":"This is one of the worst app's I have ever come across. It's hard for me to understand why apple let this a app get through.","updated":"2017-01-14T21:11:49-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1316062856","userName":"Yukongold25","userUrl":"https://itunes.apple.com/us/reviews/id22217327","version":"2.4","score":2,"title":"Lost dimming function","text":"Like the app hate the last update. I cannot dim any of devices!!","updated":"2016-01-13T16:50:43-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1171463058","userName":"vbchrisj","userUrl":"https://itunes.apple.com/us/reviews/id39039459","version":"2.2","score":1,"title":"Is it supposed to work??","text":"I can't even log on! I've installed and uninstalled a number of times, but still nothing.","updated":"2015-03-21T17:12:16-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1059625896","userName":"GrandpaFlavors","userUrl":"https://itunes.apple.com/us/reviews/id109029091","version":"2.1.3","score":5,"title":"Great App for home automation","text":"Love the product and the app","updated":"2014-09-05T19:52:05-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1567170326","userName":"bolkboy7","userUrl":"https://itunes.apple.com/us/reviews/id37102033","version":"3.4","score":1,"title":"App will not work with latest update.","text":"Usually this app works great but the update a couple days ago now won't let the app load.","updated":"2017-03-18T07:04:01-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1058929809","userName":"MIStateCJ","userUrl":"https://itunes.apple.com/us/reviews/id105337973","version":"2.1.3","score":1,"title":"Total Garbage","text":"I love my Vera, but hate the new UI7 and this new app. I will be going back to UI5 today and rebuilding the scenes and devices I lost when I upgraded. Come on guys, step up in the automation game, or throw on the towel!!","updated":"2014-09-04T09:19:10-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1844055967","userName":"Found missing info","userUrl":"https://itunes.apple.com/us/reviews/id27609206","version":"3.7","score":1,"title":"App crashes","text":"Attempted to open app via fingerprint or pin with app crashing - doesn’t open back to home screen. Ios 11.0.3 on iPhone 7.","updated":"2017-10-12T08:37:17-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1571096523","userName":"cozmogeek","userUrl":"https://itunes.apple.com/us/reviews/id102772710","version":"3.4","score":1,"title":"Totally unstable","text":"Since the last update I can't even get the app to open without crashing.  Please fix it!","updated":"2017-03-23T16:27:32-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1158496320","userName":"TexKlein","userUrl":"https://itunes.apple.com/us/reviews/id21934964","version":"2.2","score":1,"title":"Consistently crashes","text":"What else can I say?  I only wish I could give feedback on actual features.","updated":"2015-02-25T13:55:25-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1420938120","userName":"jedrgy","userUrl":"https://itunes.apple.com/us/reviews/id27636536","version":"3.0","score":1,"title":"This version doesn't launch on my phone.","text":"I have an iPhone 6 and this update has bricked the app on my phone.","updated":"2016-07-27T06:41:52-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1293855006","userName":"Steve P Charleston","userUrl":"https://itunes.apple.com/us/reviews/id383481577","version":"2.2","score":1,"title":"Useless.","text":"That is all. Useless. OK more? Locks and falsely reports device fails. Entire Vera system is not even beta-ready. I have had Veralite and VeraEdge. App useless for both. Oh and security risks. Read on.","updated":"2015-11-30T04:56:42-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"933382481","userName":"lucien.hache","userUrl":"https://itunes.apple.com/us/reviews/id179126775","version":"1.0","score":1,"title":"Do not download","text":"Do not download, I believe this a fake app to get your password and account. Change your password immediately for safety.","updated":"2014-01-29T19:32:58-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1452036603","userName":"Deemonseed","userUrl":"https://itunes.apple.com/us/reviews/id9515375","version":"3.1","score":1,"title":"Aweful","text":"Was going to buy another Vera controller but now have second thoughts. If I cannot depend on the APP/controller, then the system is useless. This version of the APP never finds my controller.","updated":"2016-09-18T16:01:04-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1106043263","userName":"Motorcyclemike75","userUrl":"https://itunes.apple.com/us/reviews/id6621975","version":"2.1.3","score":1,"title":"Crashes Everytime","text":"This app crashes after opening so it is unusable.","updated":"2014-11-30T15:36:26-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1029770154","userName":"Agent47_jk","userUrl":"https://itunes.apple.com/us/reviews/id5184927","version":"1.0","score":1,"title":"Crashes every time","text":"I really like my Veralite controller most of the time, but this app is very poor indeed. Crashes every time during login.","updated":"2014-07-16T20:32:09-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"931165027","userName":"Happydad36","userUrl":"https://itunes.apple.com/us/reviews/id287907381","version":"1.0","score":1,"title":"Come on!!!!!!","text":"Still can't login!! Had to pay 15 bucks for another app that works great with no log in issues!!","updated":"2014-01-25T22:44:40-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1127708506","userName":"Felddy","userUrl":"https://itunes.apple.com/us/reviews/id30908175","version":"2.2","score":2,"title":"Very rough experience.","text":"Too much time waiting for the UI to initialize. Very un-iOS like.  Now with crashes.","updated":"2015-01-10T10:19:52-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1675977592","userName":"Snowcrest1","userUrl":"https://itunes.apple.com/us/reviews/id344225214","version":"3.5","score":1,"title":"Useless","text":"crashes when opening. Useless and a waste of time","updated":"2017-07-09T19:05:58-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1584959166","userName":"The Next Red Solo Cup","userUrl":"https://itunes.apple.com/us/reviews/id27703783","version":"3.4","score":1,"title":"Stopped working","text":"Do not update.  This version crashes upon open","updated":"2017-04-09T15:54:17-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1258654133","userName":"Rengie Ramirez","userUrl":"https://itunes.apple.com/us/reviews/id39486437","version":"2.2","score":1,"title":"Empty Promises","text":"This app boarders on useless. Vera reps constantly claim an update is coming. Not sure when it really will happen. I'm ready to sell my Edge and purchase a different hub!","updated":"2015-09-17T03:25:59-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1015942074","userName":"Arrh","userUrl":"https://itunes.apple.com/us/reviews/id86291980","version":"1.0","score":1,"title":"Fail Boat","text":"This app will work for a day then loses the Vera unit. Have to uninstall and reinstall for it to work for a day. The VeraMate app is working great for me. The system is great, just one bad apple of an app","updated":"2014-06-23T22:10:33-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1085198924","userName":"AtlScoob","userUrl":"https://itunes.apple.com/us/reviews/id37480408","version":"2.1.3","score":1,"title":"Looks better, but doesn't work!","text":"Crashes every time it's launched.","updated":"2014-10-23T16:31:25-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"2089034883","userName":"Jon757","userUrl":"https://itunes.apple.com/us/reviews/id15408466","version":"3.12","score":3,"title":"Camera Issues After Firmware Update","text":"I’m a big fan of Vera and like the app, but have experienced issues after updating to the latest firmware. I have a VeraPlus and when I updated to firmware version 1.7.3453, it broke all my camera feeds. I then updated to beta version 1.7.3488 and all my camera are back on the unit itself when viewed from a browser, but the app shows a still frame grab for the live view on some of them that refreshes at random intervals varying from 10 seconds to 5 minutes. Others show the live video stream. In particular one of the cameras that doesn’t show the live stream is a raspberry pi camera being used as a baby video monitor. Any assistance would be greatly appreciated. Thanks!","updated":"2018-01-14T09:52:45-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"977150921","userName":"Mumdog57","userUrl":"https://itunes.apple.com/us/reviews/id13197879","version":"1.0","score":1,"title":"Awful","text":"Must logout then login each time to access my home screen. Pain in the neck.","updated":"2014-04-14T17:59:36-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1181365043","userName":"D_Bollinger","userUrl":"https://itunes.apple.com/us/reviews/id188296698","version":"2.2","score":1,"title":"Vera let","text":"I had high hopes, this is a poor app! Very glitchy.\nGoing to look for other apps, any suggestions?","updated":"2015-04-11T12:29:55-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1126520885","userName":"Freserf","userUrl":"https://itunes.apple.com/us/reviews/id430640074","version":"2.2","score":1,"title":"Doesn't work!","text":"Always wait for reviews before updating.  Have no control now ... Thanks Vera!!!!!!!","updated":"2015-01-08T04:32:50-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1185133256","userName":"adamadam09","userUrl":"https://itunes.apple.com/us/reviews/id22306042","version":"2.2","score":1,"title":"Terrible","text":"Vera continues to disappoint.  I'd like a home automation product that a guy with 3 college degrees can quickly implement.   This is not the product.   Am migrating to belkin wemo.","updated":"2015-04-19T07:54:09-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1176024604","userName":"Frank893729","userUrl":"https://itunes.apple.com/us/reviews/id238550727","version":"2.2","score":1,"title":"Slow and buggy","text":"Please get this app fixed!!  It's super slow to load!!!","updated":"2015-03-31T16:35:03-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1059315848","userName":"Mgb 33","userUrl":"https://itunes.apple.com/us/reviews/id201507970","version":"2.1.3","score":5,"title":"Great product","text":"Love it.","updated":"2014-09-05T05:41:47-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"928601874","userName":"Harleen Kaur","userUrl":"https://itunes.apple.com/us/reviews/id141678977","version":"1.0","score":1,"title":"Won't allow sign in","text":"Keeps returning error saying incorrect credentials. Wonder if this is authors way to collect Vera account holders credentials","updated":"2014-01-20T21:12:43-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1474974234","userName":"Plan-g","userUrl":"https://itunes.apple.com/us/reviews/id499556803","version":"3.1","score":1,"title":"Won't login to ui5 devices","text":"Can't even log in. Other apps work.","updated":"2016-10-29T00:30:45-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1218084278","userName":"BertinJacobs","userUrl":"https://itunes.apple.com/us/reviews/id146954145","version":"2.2","score":1,"title":"Slow","text":"Like most Vera products..... Good idea. Bad implementation. This app is slow and hard to navigate. Sad really.","updated":"2015-06-26T04:51:57-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"930561160","userName":"surfingman1","userUrl":"https://itunes.apple.com/us/reviews/id42301083","version":"1.0","score":1,"title":"Useless","text":"Cannot log in app. This goes with every other 3rd party app for vera. Password setup on vera unit will not work, please fix !","updated":"2014-01-24T20:53:46-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1190471280","userName":"Tayo F.","userUrl":"https://itunes.apple.com/us/reviews/id12607836","version":"2.2","score":4,"title":"Decent app","text":"The app is decent and functional but the UI is dated IMHO.","updated":"2015-04-30T18:52:10-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1048469252","userName":"DrvNsily","userUrl":"https://itunes.apple.com/us/reviews/id28811537","version":"2.1.2","score":4,"title":"Good","text":"Works good easy to use.","updated":"2014-08-17T13:10:11-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1033341782","userName":"DPJ912","userUrl":"https://itunes.apple.com/us/reviews/id23953160","version":"2.0","score":1,"title":"Not Good","text":"Will not unlock doors! Also \"turn on all\" for the lights and \"lock all\" for door locks does not work. Needs work ASAP!!","updated":"2014-07-22T20:44:08-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"940249951","userName":"Ljnewlin","userUrl":"https://itunes.apple.com/us/reviews/id377054256","version":"1.0","score":1,"title":"Log in","text":"Can't scroll down to log in on my iPad. Therefore the app is useless.","updated":"2014-02-09T08:47:49-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"991498249","userName":"App+97","userUrl":"https://itunes.apple.com/us/reviews/id355786684","version":"1.0","score":1,"title":"Doesn't work","text":"Continues to tell me my password is wrong. Fail.","updated":"2014-05-11T18:42:34-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1654006080","userName":"Also wWaiting for a fix","userUrl":"https://itunes.apple.com/us/reviews/id196085532","version":"3.5","score":1,"title":"Cannot connect to controller","text":"Just doesn't work","updated":"2017-06-22T18:36:42-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1272707145","userName":"Jaelub","userUrl":"https://itunes.apple.com/us/reviews/id100234894","version":"2.2","score":5,"title":"Great App","text":"A must have app!!!","updated":"2015-10-16T14:32:23-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1124212754","userName":"kvesterling","userUrl":"https://itunes.apple.com/us/reviews/id47654303","version":"2.1.3","score":1,"title":"Opens then crashes...","text":"Worthless","updated":"2015-01-03T16:51:29-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"982324507","userName":"GiuseppeDGC","userUrl":"https://itunes.apple.com/us/reviews/id155488712","version":"1.0","score":1,"title":"So many bugs","text":"Doesn't work lost the conection a lot, not remote conection","updated":"2014-04-24T14:56:00-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1045665075","userName":"Svstud86","userUrl":"https://itunes.apple.com/us/reviews/id407347513","version":"2.1.1","score":1,"title":"Worthless","text":"Waste of time.  Hire some real programmers.  This product could be great, but instead it's a POS","updated":"2014-08-12T20:16:56-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1508460597","userName":"Dayton F.","userUrl":"https://itunes.apple.com/us/reviews/id32505798","version":"3.2","score":1,"title":"Crashing","text":"Not working on iPad mini","updated":"2016-12-24T20:08:37-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1299707686","userName":"Sag Harbor, Ny","userUrl":"https://itunes.apple.com/us/reviews/id148195390","version":"2.2","score":1,"title":"Frustratingly Buggy","text":"Not a good experience. Just not seamless. Just not smart. This is a JV option.","updated":"2015-12-12T14:07:24-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1033678265","userName":"Shannon 14","userUrl":"https://itunes.apple.com/us/reviews/id265357896","version":"2.0","score":1,"title":"Cannot control door locks","text":"This application does not lock/unlock my Yale touchscreen locks.","updated":"2014-07-23T09:47:13-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1246590338","userName":"Bliksimstraal","userUrl":"https://itunes.apple.com/us/reviews/id217614835","version":"2.2","score":1,"title":"This is a useless POS","text":"I want to get rid of my Vera because of this software!","updated":"2015-08-21T13:26:56-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1129135906","userName":"FORTESEA","userUrl":"https://itunes.apple.com/us/reviews/id210549127","version":"2.2","score":2,"title":"long time to load :(((","text":"take to much time to load connection","updated":"2015-01-13T02:17:38-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1106799202","userName":"tdavis312","userUrl":"https://itunes.apple.com/us/reviews/id16069880","version":"2.1.3","score":1,"title":"Crashes with IOS 8","text":"Loads then crashes on my iPhone 5S.","updated":"2014-12-02T05:35:33-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1138956719","userName":"K9usmc","userUrl":"https://itunes.apple.com/us/reviews/id130972650","version":"2.2","score":1,"title":"Terrible app","text":"App is slow or totally locks up.","updated":"2015-01-30T17:53:04-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1186245248","userName":"Muffey2","userUrl":"https://itunes.apple.com/us/reviews/id187210184","version":"2.2","score":1,"title":"Garbage","text":"Utter garbage. The old mios app was bad enough but this one doesnt even get past a login...","updated":"2015-04-21T16:22:29-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"931642624","userName":"DBSpider90","userUrl":"https://itunes.apple.com/us/reviews/id34215050","version":"1.0","score":1,"title":"Terrible","text":"Cant login.  How about fixing this????","updated":"2014-01-26T18:11:11-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1441755814","userName":"Meeeeeeeeeeeee.e","userUrl":"https://itunes.apple.com/us/reviews/id188928549","version":"3.0","score":1,"title":"Bad app","text":"Doesn't connect to my unit, Vera Edge. This is a joke app","updated":"2016-08-30T07:07:10-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"936493320","userName":"KTMRider990","userUrl":"https://itunes.apple.com/us/reviews/id35792166","version":"1.0","score":1,"title":"Login","text":"What good is this app if you can't login!  PLEASE FIX!!!","updated":"2014-02-03T19:07:47-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1285639878","userName":"hugojr","userUrl":"https://itunes.apple.com/us/reviews/id40523754","version":"2.2","score":1,"title":"Horrifying UI","text":"Please for the love of God, hire a UX designer. PLEASE(!!)\n\nOr go out of business. Your choice...","updated":"2015-11-12T09:34:40-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"929396360","userName":"Denayarb","userUrl":"https://itunes.apple.com/us/reviews/id100055546","version":"1.0","score":1,"title":"Bugged","text":"Cannot log in.","updated":"2014-01-22T12:26:30-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1304267272","userName":"Autohome222","userUrl":"https://itunes.apple.com/us/reviews/id155560084","version":"2.4","score":1,"title":"No light dimming functions!","text":"No light dimming functions!","updated":"2015-12-21T22:32:27-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1145434955","userName":"your biggest fan =]","userUrl":"https://itunes.apple.com/us/reviews/id41620570","version":"2.2","score":1,"title":"DOA","text":"This POS is DOA out of the box. No instructions. So sad. DONT BUY IT.","updated":"2015-02-11T12:17:16-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"7378407337","userName":"Luckies1","userUrl":"https://itunes.apple.com/us/reviews/id121767650","version":"3.54","score":2,"title":"A big disappointment!","text":"As long as Vera has been doing this you would think their controller would function better than it does. The eslo secure is not ready for prime time. My door lock only partially works. My door sensor doesn’t send alerts. My lights do turn on and off. (Yippee) Tech support fell off the planet. I’ve called sent emails. No response! If they don’t fix these problems soon I want my $400.00 back. Next step is BBB. Oh and I can’t seem to post a review here. Maybe the second time is a charm.","updated":"2021-05-23T06:52:51-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"6253168093","userName":"Bonz99999","userUrl":"https://itunes.apple.com/us/reviews/id343258720","version":"3.44","score":5,"title":"Outstanding Home Automation Hub","text":"I just recently upgraded to the Vera Plus from a Vera Edge for some extra horsepower.  I’ve used the Vera hubs for quite a few years now and very happy with them.  I like the ability to make my own luup code for specific scene conditions I may want to use as a trigger.  The forum has a ton of example code to use and learn from.   In the beginning you don’t need to do this but after a while you will love the fact that it is an option.  \n\nSupport has been very responsive whenever I need help.  I have no idea why there are so many negative reviews.   The reality is home automation is not always simple and you need to read forums occasionally to fix things.  \n\nBottom line is this product has been giving me rock solid performance for years. I have over 45 device ids and over 50 scenes and it just works.  Everything from integrating my existing dsc alarm system to full Alexa control over devices and scenes, to energy monitoring.   Vera engineering is always adding new devices so I see no reason to go anywhere else.   \n\nThis product rocks.","updated":"2020-07-28T16:02:04-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"6030887077","userName":"BsAppHaHa","userUrl":"https://itunes.apple.com/us/reviews/id145221984","version":"3.42","score":1,"title":"App crashes repeatedly while deleting device","text":"App crashes repeatedly while deleting Schlage lock. \nNo option for lock code length longer than four characters.","updated":"2020-06-03T10:38:53-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"5736519969","userName":"Raysharley","userUrl":"https://itunes.apple.com/us/reviews/id203014815","version":"3.37","score":5,"title":"Older Vera with u17 installed","text":"I’ve had this Vera now for about 5 years or longer it’s all ways worked great. Until now cameras are have problems now and they can’t figure it out hope they get a handle on it soon because it is driving me bonkers the cameras show up even though it says  connection failed but there is a black play button in the center of the screen that doesn’t do anything but blocks the center of the camera and will not let you operate them\nThat’s using the Vera mobile app that’s all  happened since they added the new dashboard. Anybody else having this  proble\n\nUpdate I had A Vera customer care person call me come to find out there is a glitch in the Vera mobile app it has been fixed but they are waiting on Apple to release the updated version. I would have to have an iPhone the update for Android is already out. The customer care person was really helpful showed how to work with the new dashboard  I was told the update version should be out soon so I will wait patiently it’s only affecting my cameras everything else is working great","updated":"2020-03-30T09:36:24-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"3301141058","userName":"Spacedog725","userUrl":"https://itunes.apple.com/us/reviews/id10304518","version":"3.17","score":4,"title":"Great app but one issue","text":"Great app! Can use the app for everything I need EXCEPT when I add restrictions for a door pin code via the app. When I specify times on specific dates during setup and save them, the times are never correct. I’ve tried doing this several times with the same problem.","updated":"2018-10-14T07:05:13-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"2021055762","userName":"Mister_Bushido","userUrl":"https://itunes.apple.com/us/reviews/id43654119","version":"3.11","score":3,"title":"App Crashes","text":"The app keeps crashing when I try to access the security door code storage to add new or delete old codes, since 12/21/2017 please fix ASAP","updated":"2017-12-23T09:40:05-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"2017991467","userName":"Deniolan","userUrl":"https://itunes.apple.com/us/reviews/id40561948","version":"3.11","score":3,"title":"When it works it’s nice.","text":"Push notifications never work right it seems.  Last version they released an update to fix this - and then they promptly did something with cloud servers that promptly broke it again.  \n\nTheir status page is never correct (always shows everything working fine).  I have three iOS devices, two windows devices and SMS alerts enabled...  I get push to windows and SMS fine, none of the three iOS devices ever get a notification and they show as “failed” in the alerts on my vera - but somehow vera doesn’t show anything is down.   \n\nI’ve contacted support with no resolution...  \n\nIt seems this company breaks things in an instant and then takes forever to fix them...  I can only assume that their test team is non existent or not very good at identifying bugs before code is released.\n\nAfter the last fix, push worked again for all of one day after the last app update and now it’s been broken for almost a week again.  Sad, cuz i like their hardware.","updated":"2017-12-22T09:00:13-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1977767638","userName":"More Birdies Please","userUrl":"https://itunes.apple.com/us/reviews/id110459163","version":"3.9","score":2,"title":"Vera control if you can wait for it to load","text":"This app connects to your vera device and all of its appliances, however it takes forever to load actual ‘NOW’ data.   Example; If I go to change the temp on the thermostat,  wait first of course for it to show the actual temp...once it does, I change it...all good.   Open the app 10 mins later and it shows you what it looked like before you made the change!   Wait for 3 mins and it shows the updated change.   Why this pathetically long delay??    I also have a Honeywell wifi thermostat in another house...when I open the app, it is always exactly as the device reads, make a change..instantly changes...always accurate, always fast.   Vera is pathetically slow.   It does ‘work’ and Need it for door code changes, etc...but really frustrated with the lag.","updated":"2017-12-07T08:02:05-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1268137501","userName":"Nicoletrichick","userUrl":"https://itunes.apple.com/us/reviews/id16350139","version":"2.2","score":2,"title":"SLOWEST app ever!!!","text":"This is the slowest app ever!! Takes a minimum of 60 seconds to open, average 90-120 seconds. You can't even navigate away to another app while you wait- you have to stare at the spinning wheel or else the load restarts. Super frustrating. Works fine once opened. My husband has a droid and says his app works fine, so fix the iPhone version please!!! The whole point of spending big bucks for a smart home was convenience! This app makes it super irritating to remote control my home and I really avoid having to use it.","updated":"2015-10-06T23:40:51-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1630640809","userName":"Greg_W","userUrl":"https://itunes.apple.com/us/reviews/id41557933","version":"3.4","score":1,"title":"Terrible","text":"Interface is terrible.\nNot well designed.\nVeraPlus Hub = Junk.\nSwitched to Phillips Hue with Apple HomeKit = 10000% better.\nAvoid this app and the hardware.","updated":"2017-06-01T10:01:47-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1417198438","userName":"ElThuetar","userUrl":"https://itunes.apple.com/us/reviews/id41411060","version":"3.0","score":1,"title":"Way to early","text":"Updated 7/2116---\nSTILL Unstable, but some improvements in features. The UI is marginally improved, but still ugly as all h**l, crashes, and hides device values. Vera should hire a professional team. It's like a team of interns wrote this without any direction or designer.","updated":"2016-07-21T21:10:00-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1313251380","userName":"Script Guy","userUrl":"https://itunes.apple.com/us/reviews/id85348178","version":"2.4","score":1,"title":"Can't login?!?!","text":"Can't even login to the app. Tried multiple times on my phone and my roommates phone. Tried same username and password on a laptop and Voila. Really disappointed. Want to experiment with Apple Watch app!!!","updated":"2016-01-08T08:31:23-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1304387703","userName":"DCassidy","userUrl":"https://itunes.apple.com/us/reviews/id11408101","version":"2.4","score":5,"title":"Great update !","text":"Update 12-21-15: Loads fast now, great update!\nThanks!\nSorry, I'm not that patient. Would be okay if it didn't take 30-40 seconds to load the app!","updated":"2015-12-22T04:22:00-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1144751580","userName":"Rpowell18","userUrl":"https://itunes.apple.com/us/reviews/id7414415","version":"2.2","score":4,"title":"Better than before","text":"This ui7  is a lot better than before .i can now control my smoke dectors and zoom and pan my cameras...mor control over the system..the customer service still needs work..after several times I finally got a great person and we got it going.great app though","updated":"2015-02-10T05:43:27-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"937527145","userName":"JeffC2k","userUrl":"https://itunes.apple.com/us/reviews/id32335709","version":"1.0","score":4,"title":"Login problems","text":"One other note for the folks having issues logging in. Make sure you put your username in all lower-case characters. Once I finally got logged in, it seems good so far.","updated":"2014-02-05T11:41:42-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1138125839","userName":"JimInTheBox","userUrl":"https://itunes.apple.com/us/reviews/id42075376","version":"2.2","score":1,"title":"Nice hardware, horrible software","text":"I got this hub to replace my slightly buggy SmartThings hub.  The hub I had would work perfectly until the server went down, and then it was useless.  The Vera hub promised local control so the server crashing should not disrupt all services, but the problem is that it takes a minimum of 30 seconds and so far a maximum of about 10 minutes for the app to load.  Also without writing your own code it is impossible to even get the most basic functionality to work correctly.  For example I am trying to turn on a light with a motion sensor and turn it off when motion stops.  This will not work by default","updated":"2015-01-29T07:58:00-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1123458094","userName":"SMU Control","userUrl":"https://itunes.apple.com/us/reviews/id28991438","version":"2.1.3","score":1,"title":"Crashes with latest Vera firmware","text":"Updated my VeraEdge to 1.7.906 and the app crashes every time, shortly after startup.  Just before the crash the screen shows no devices configured on Vera, even though I have over 30 set up.  Rumor has it that a new version of this app is waiting for Apple to approve.  I hope that this is true and that it fixes the problem.","updated":"2015-01-02T09:09:01-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1115318573","userName":"tallchinese","userUrl":"https://itunes.apple.com/us/reviews/id156648333","version":"2.1.3","score":1,"title":"Junk","text":"This app is a joke. It always has issues connecting to my Vera Lite. I just don't see myself using this for critical tasks like unlocking doors and such. Returning the Vera Lite back to Amazon and looking for a better solution than this.","updated":"2014-12-18T07:43:46-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1093239164","userName":"VeraBad","userUrl":"https://itunes.apple.com/us/reviews/id160106459","version":"2.1.3","score":1,"title":"Useless for door locks","text":"This app is useless for door locks.  What is lacks:  \n1. can’t see the details of log entries.  I shows a list of log entries, but it provides no information about the entries (i.e. “invalid code entered”, “battery low”, “code for housekeeper entered\" \n2. can’t add, delete, or change lock codes.","updated":"2014-11-07T11:46:57-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1065546463","userName":"I wish it were better","userUrl":"https://itunes.apple.com/us/reviews/id221023255","version":"2.1.3","score":1,"title":"New account will not connect","text":"Just created an account and set up my devices. The app refuses to connect with my username. Useless.","updated":"2014-09-16T16:51:56-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1058930854","userName":"ZuZ.","userUrl":"https://itunes.apple.com/us/reviews/id42128836","version":"2.1.3","score":1,"title":"Piece of Sh*t","text":"I would've given it half a star if i could. Why does this app need 30+ seconds to connect! I don't get it!","updated":"2014-09-04T09:22:00-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"1045741514","userName":"dA arcHITect","userUrl":"https://itunes.apple.com/us/reviews/id25173168","version":"2.1.1","score":1,"title":"Worst Vera app ever!!!!!!!!!","text":"I never had any problems with my Vera unit until I downloaded this app and start using it. Before I used Vera Mobile.  I recent visit the mi casa Vera site and it redirect me to a new Vera site. There I came across the new app and that's when my problems began.  Now I can't login via Mobile  apps new and old.  If you are using a Vera/ zwave control app, stick with that one before upgrading or should I said downgrading to this app.\n\n08/13/2014 App still doesn't work .","updated":"2014-08-12T23:11:18-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"961360825","userName":"JDian","userUrl":"https://itunes.apple.com/us/reviews/id78017262","version":"1.0","score":1,"title":"Buggy","text":"Good app but it's not ready.  If you want to turn lights on/off or lock/unlock the door you have to log out and re-login every. Single. Time. Re-enter your username and your mandatory long complex password including symbols. Something that used to be effortless in the old app, is a complete chore in this new one.","updated":"2014-03-17T17:10:21-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"},{"id":"941586249","userName":"Skyhopper88","userUrl":"https://itunes.apple.com/us/reviews/id377492929","version":"1.0","score":5,"title":"Great, but has iPad issues","text":"MMS Vera is unusable on a non retina ipad on IOS7. iOS 7 makes two significant changes to non-Retina iPads’ handling of apps with iPhone/iPod-specific interfaces. Previously, non-Retina iPads displayed iPhone/iPod apps at a classic 480x320 resolution, upscaling them with a “2X” button to a larger, chunky-looking 960x640 window. On a non-Retina iPad 2 or iPad mini running iOS 7, the apps are now displayed at the larger size by default, but use the higher-resolution text and graphics seen on the Retina iPhone 4/4S and fourth-generation iPod touch, while removing the ability to shrink to “1X” size. Retina iPads, however, still give users the choice of toggling between 1x and 2x mode.\n\nNow, on an non retina iPad on I0S7 the username and password fields display, but the bottom with login, create account is cut off. in fact you only see half of the Vera Logo and you cannot login. Also when the app loads the logo is in portrait but then the login screen shifts to landscape, which is odd for an iPhone app, unless this is supposed to support landscape unlike the old vera mobile app.","updated":"2014-02-11T11:53:45-07:00","url":"https://itunes.apple.com/us/review?id=787203434&type=Purple%20Software"}]