[{"id":"6189252878","userName":"Wreshles","userUrl":"https://itunes.apple.com/us/reviews/id100164411","version":"5.0.2","score":4,"title":"Fixed Location Services","text":"The latest update from the end of May (5.0) broke the location services that were working perfectly fine up until the latest update. Even though it lists both my wife and I as inside, it states that our location services are off and never triggers Auto-Away. I’ve uninstalled, turned location services off and back on in the app and on both phones to no avail. \n\nI was enjoying the system and app until this latest update. Please fix this asap as it’s been over a week and this is a big feature that a lot of people use. It’s hard to believe that it made it through Beta testing without being noticed. I’ll change my review once this has been fixed.\n\nEdit: They have fixed the location services. The new app is still wonky from time-to-time but is on its way to being a really nice, smooth and functional app. The service itself is still really nice and I’d recommend it over most others on the market.","updated":"2020-07-12T06:39:43-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7820615954","userName":"bp526264","userUrl":"https://itunes.apple.com/us/reviews/id34266098","version":"5.3.5","score":5,"title":"Great app and system!","text":"We’ve had our Abode system since it was first introduced in 2019 and haven’t had a single hiccup or even had to reboot it once. Set-up of devices has been easy, including Abode window/door sensors, Zigbee water leak sensors, and a Z-Wave water main shut-off valve, triggered by leak sensors we placed below pipes in the crawl space under the house. Through firmware updates that are advertised via the Abode app, they’ve added HomeKit and have simplified features, making things ever more simple the longer we’ve had the system. Alerts for home monitoring took some time to set up but all was relatively straightforward once I figured it out. I’d suggest that the Abode team recommend some standard alerts (I.e. send me a notification if someone leaves a door open for more than 20 minutes, etc.) to introduce how the app can be used to simplify life at (or away from) home. It’s amazing how the system just works with any home automation part we can find. 10/10!","updated":"2021-09-18T17:12:02-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7667416629","userName":"ellka","userUrl":"https://itunes.apple.com/us/reviews/id26297705","version":"5.3.5","score":4,"title":"Fine functional app","text":"I’m not reviewing the hardware here as so many have. My hardware is working perfectly fine. This app is adequate. No problems at all. Does the job both for set up and remote control of system. It’s simple. For some settings you’ll need to log in to site in a desktop browser. Most of the bad reviews here are fior customer service or system .  I’ve also had good (but minimal) interactions with CS.  1 star off for inability to change orientation, esp to enlarge video still for larger image.","updated":"2021-08-07T19:20:17-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8037402013","userName":"sototallycarl","userUrl":"https://itunes.apple.com/us/reviews/id20717760","version":"5.3.8","score":3,"title":"It’s fine","text":"There is a lot to love over the competition (HomeKit, cheaper fees, lots of different sensors) but just as much I don’t like. The over all product experience is surpassingly rough for a 4+ year old company. \n\nFor example adding a bunch of sensors at once, every 5th one seems to make the app hang and leave the sensor in limbo. Force quite, re-open, remove sensor, force quite so it’s internal cache doesn’t get confused, re-add. That’s dumb. \n\nThe industrial design is basic. Just barely passable compared to pretty much everyone but old school SimpliSafe or hardwired ADT. If you can do the embedded or slim sensors, I’d go that route. The sounds it makes are also unpleasant and the integrations to make custom sounds are so slow you might as well not have them. People have been asking for good sound for literally years and nothing changes…\n\nPerformance is also meh. Supposedly can cover large houses but I have some sensors that trigger open but never trigger back to closed. Move closer and it works just fine. Rapidly open and closing a door often SKIPS an alert. It’s conceivable that such a lag is a security concern. HomeKit support is top notch, it’s as fast and as accurate as the underlying Abode bridge. \n\nAt the end of the day I wish I would have stuck with SimpliSafe. It’s more expensive and has no official HomeKit support, but at least it’s a rock solid and nicely designed system.","updated":"2021-11-18T08:18:59-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6975006638","userName":"golfrun6","userUrl":"https://itunes.apple.com/us/reviews/id464943632","version":"5.2","score":1,"title":"Forced into monthly subscription after 2 years","text":"We had the system for 2 years with no monthly subscription. It included timeline features and auto set alarm based on phone location and auto set features for night and morning. They also advertise short term package with professional monitoring. We tried to use this when going out of town for a week and have our system monitored. When we returned we tried to return to a free self monitored program but were informed the auto set feature now needed a monthly subscription and since we used their pro service short term we could not return to subscription free program and still have the features we had the week before. But they did offer a dollar a month discount… Thanks for nothing.I had recommended this product over the previous years but after being tricked into a subscription Hope no one makes the same mistake","updated":"2021-02-09T14:13:36-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8102227084","userName":"LaAllanHau75","userUrl":"https://itunes.apple.com/us/reviews/id325988652","version":"5.3.8","score":3,"title":"Auto features lacking","text":"The feature that allows you to have the alarm automatically turn on and off when you enter or exit the home has never worked correctly. Even though the app has location services turned on and my phone also has locations services turn to “always “, the alarm does not register my location correctly and will not turn on and off automatically which causes issues if I forget to manually set the alarm. It is a nice thought but in practice it fails 90%of the time. I have even logged out, logged back in, deleted and reinstalled the app as well as turned on and off the location services in the app and on my phone, but unless my app is open and running the auto set feature will not work.","updated":"2021-12-06T11:26:14-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7363634715","userName":"Gcjensen","userUrl":"https://itunes.apple.com/us/reviews/id168571297","version":"5.3","score":2,"title":"Fine if you don’t need the cameras","text":"The door and window sensors are good. They are reliable and easy to install, but window sensors aren’t the main event here. The cameras are the reason anyone buys a security system and with abode they have given me nothing but trouble. The Cam 2 has been delayed and delayed and delayed, so I bought an Outdoor Cam to at least get something I can monitor my porch with. It won’t sync with the app and the customer service rep tasked with helping me just up and ghosted. No response for over 5 days. Did you know that you can’t use the cameras if your SSID has a hyphen in it? The standard router from every ISP I’ve ever had uses a hyphen in the default name from the factory.  You’ve got to rename your SSID and reconnect everything in your house. It shouldn’t be this hard to secure your house, especially when you shell out $500+ on gear.","updated":"2021-05-19T19:47:37-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8069873714","userName":"Jon_Shearer","userUrl":"https://itunes.apple.com/us/reviews/id1053521159","version":"5.3.8","score":1,"title":"Prettier but not dependable","text":"The app update looks better, but the trade off has been inconsistent functionality. Cue automations sometimes work, sometimes don’t. This evening for instance I’ve tried running the “turn off all lights” automation and it keeps throwing an error (“The request is timeout”). When combing on/off and color settings for lights in automations, the color settings are ignored until the second time the automation is run every day. Errors are thrown with no clarity as to why when trying to create certain automations but not others. Some of the Abode hardware works with IFTTT, but not all. Their own motion sensors for example do not integrate. Abode’s website simply says they “proudly support IFTTT”...this is misleading. This app needs a lot of QA, exception handling, user testing, and clearer descriptions on their website as to which products do or do not integrate with other platforms.","updated":"2021-11-27T10:23:41-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6646539141","userName":"Dmatt41","userUrl":"https://itunes.apple.com/us/reviews/id367699283","version":"5.1.4","score":3,"title":"Disappointing Camera Performance","text":"For configuring your security system and changing system status, works as intended, with next to no issues; however, don’t plan on utilizing your cameras. It takes 10+ seconds to load the current stream, and then it lags and freezes, making it essentially pointless to even try and utilize. Not to mention, that when you try and talk through the app to the camera, the app looks up and crashes. This was never an issue when I first purchased the system, but since the original app version that I utilized, the updates have been making the app worse.  I would just avoid spending extra on their cameras and look to another company for camera integration.","updated":"2020-11-14T19:47:56-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7465899465","userName":"Brenton07","userUrl":"https://itunes.apple.com/us/reviews/id38772670","version":"5.3.1","score":3,"title":"Avoid the headache. Go with established vendor.","text":"Abode has been terrible from the start. My original system took over 5 weeks to ship with no shipping updates. My outdoor camera that was advertised to support HomeKit STILL does not support HomeKit. It also barely streams and the quality is pretty terrible. I made the mistake of ordering additional cameras because the price was good, and of course, more shipping delays. I can understand everyone dealing with the chip shortage right now, but the next delay was because of QC issues. \n\nOh, and my support ticket took over ten days to get a response. \n\nAbode is going to be my window/door alarm, as well as a motion sensor in my basement. But DO NOT purchase any additional accessories from this company. You’ll thank me later.","updated":"2021-06-14T20:01:54-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6316797842","userName":"Whompus12","userUrl":"https://itunes.apple.com/us/reviews/id111449712","version":"5.1.0","score":2,"title":"Good Security System but ..,","text":"[update: We have two Ring Systems and one Abode system.  \nSorry Abode but Ring is App easier to use and Ring’s system is better integrated. Their support is also better ]\n\nPROS: \n• Great Security System with many features and controls. BUT ....\n\nCONS:\n• MANY FUNCTIONS ARE NOT AVAILABLE from within the app. You HAVE to go to your account on the Browser.  And the problem with that is many of those functions on the web based version are NOT smart phone friendly. You’d best have access to a desktop PC. \n\n• THE AUTOMATIONS FUNCTION is only available as a beta version.  It frequently acts buggy for me -probably because they are making changes.\nGuess I’m old-fashioned - the companies I worked for we all tested our stuff BEFORE we released it.\n\n• Abode NEEDS TO REDESIGN THE COLORS OF THE APP. Light cyan against a white background is difficult for some of us to read.  The present color scheme might look cool but not every user has 20 year old eyes. \n\n• Abode NEEDS TO REDESIGN THE APP UI TO MAKE IT SIMPLER - Especially if they are not going to make all the presently web-based functions available in the app.\n\nAbode are you listening?","updated":"2020-08-13T20:11:43-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8123491429","userName":"Rene7","userUrl":"https://itunes.apple.com/us/reviews/id26838758","version":"5.3.8","score":3,"title":"Nice but has shortcomings and still buggy","text":"I find it a little ironic that you can buy a keypad that also has a motion detector built in, but you can’t change any settings on the keypad such as volume or chimes. The app treats it like a paperweight! \nAlso, You apparently sort the order of your devices in the list, but the order keeps on changing on its own!\nIn addition it’s location services are quite antiquated. It uses a country list that is more than a decade old!  Sint Maarten became a country in 2010 along with two others, but the app still only shows the old Netherlands Antilles. God only knows what other updates are missing???","updated":"2021-12-12T12:22:56-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7467642837","userName":"TrappedGiraffe","userUrl":"https://itunes.apple.com/us/reviews/id403527431","version":"5.3.1","score":1,"title":"Not with your time or money","text":"Garbage system, garbage app, garbage support. App drains battery in order to use the geofence feature, which doesn’t work half the time to disable the alarm when you’re nearby. The cheap covering on the key fob fell off within a few months. Tried contacting support and they told me to just buy another. Wanted to give Abode another chance even after that and held out hope for HomeKit integration, which they had just announced. After a year or so I tried contacting them again about it, this time with no response. Don’t bother with this worthless system, they don’t care about you at all. Threw the whole system in the garbage, went with Ring, and never looked back. Will never be recommending this product to anyone ever.","updated":"2021-06-15T07:26:04-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7158853421","userName":"UGHHhh!","userUrl":"https://itunes.apple.com/us/reviews/id33420607","version":"5.2.2","score":1,"title":"Door Unlock Glitch","text":"Abode is a weird and loose description of a security system. I have the digital door lock on my front door and from time to time, abode unlocks it when ever it feels like it. It’s sensitive when it wants to be: cat can move freely until the system says otherwise. My alarm goes off every time I am out because the cat got off the couch. Never any other time she does this. Just when Away.   The service is terrible also. Cancel at anytime is not true. The app looks like you can downgrade at anytime but you get a convenient system error every time. When they get called out on it, they act like they are doing you a favor for completing a request that you did all the work for. I’m so over this alarm system and it’s glitchy ways.","updated":"2021-03-29T07:50:00-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7916099554","userName":"astroshark","userUrl":"https://itunes.apple.com/us/reviews/id42982539","version":"5.3.7","score":2,"title":"Horrible App","text":"Just got the system was pretty excited installed everything…..but the excitement quickly ended the app does not consistently notify me of when I open windows or doors sometimes it’s instant sometimes it takes minutes up to 30 minutes for the app to basically say oh hey you just opened your front door. Camera from the iota cam? Every time I try to view the iota cam it says stream unavailable - API Error - Server Error. For as much as I spent on this system I definitely don’t feel safe with it! \n\nAlso, when you restart your phone and you have Face ID enabled the app for some odd reason disables Face ID doesn’t that defeat the purpose of keeping access to the app secure?","updated":"2021-10-14T22:48:53-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7635935020","userName":"BLBCmO2","userUrl":"https://itunes.apple.com/us/reviews/id522407948","version":"5.3.5","score":5,"title":"Good overall system","text":"We really like our system and think it’s the best one on the market.  We use the key fobs and the app constantly and have no issues.  The best features of the system is integrated battery backup and the cell phone backup which can arm and disarm the alarm if the internet or power goes out.  The app works great however there’s not a good/easy way to rename the sensors in the app.  The camera in the motion sensor offers relatively poor definition but we love the system overall.","updated":"2021-07-30T09:09:32-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6299034311","userName":"Charley Porter","userUrl":"https://itunes.apple.com/us/reviews/id162500698","version":"5.0.5","score":1,"title":"No Stars!!!","text":"Congratulations Abode, you’ve joined the ranks of XFinity/Comcast in your level of product support.  Just received my Iota system, got everything unboxed and all setup, downloaded the app and then couldn’t connect to create an account.  Tried going straight to your website, same experience, the little progress indicator just spins and spins.  Phoned customer support and after being on hold for a while, I was sent to a recorded message stating that no support agents were available and that I needed to leave my contact information.  Did so but after many hours, I’ve not received a call back. Bravo, you managed to crush my hopes for a reliable product before I could even get it setup.","updated":"2020-08-09T08:12:58-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7769975956","userName":"Hdoggg007","userUrl":"https://itunes.apple.com/us/reviews/id48814468","version":"5.3.5","score":2,"title":"Faux badge numbers","text":"Badge randomly shows 1, but there’s no notification in the app. Open it and it goes away for a while and then comes back. I really don’t want to inhibit notifications (badges) for my home alarm system. This needs to be fixed. Using location in the background, despite the fact that I have it set to “only while using the app”. Which means you have to force close it after every use. Shame because the alarm system on its own is pretty sweet. Thankfully I can use Home Assistant to efficiently do all the stuff this app should be able to do (proper geofencing without killing the battery, etc.).","updated":"2021-09-04T05:35:31-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6602889889","userName":"Clutch5000","userUrl":"https://itunes.apple.com/us/reviews/id38304245","version":"5.1.3","score":1,"title":"Constant Issues with Location","text":"I think Abode has just turned into a company that tries to sell a lot of equipment and no longer cares if the service works. I’ve had Abode for a number of years and it used to work great. However, the last year or so has been nothing but service issues but a lot more product offerings.  I’m not sure if they’re trying to sell a lot of product to boost their sheets to potentially get bought out; but something has significantly changed for the worse.  I’ve had to delete and reinstall this app so many times and the location service constantly works for a week or so and then always fails.  Abode has been a poor investment.","updated":"2020-11-02T17:32:59-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7623247835","userName":"Lebellasita","userUrl":"https://itunes.apple.com/us/reviews/id218990378","version":"5.3.4","score":1,"title":"Epitome of a product driven to the ground","text":"Loved the system and had no issues…over a year ago! Since then, the iPhone app and widgets do not function properly. The app has all sorts of interface issues — broken tap targets, broken layout, constant warning without context, and no reliable support. The widget never loads, never arms the right way, and all the icons are out of line. Exactly what you want in a security system, right? I can’t tell you how many times I’ve been waiting outside the garage door tapping furiously on the widget and app trying to get the system unarmed (or armed!). Don’t waste your money. Go with an established vendor that values their product and customer service.","updated":"2021-07-27T03:17:49-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7859122643","userName":"jsnaow zifmldwvaha","userUrl":"https://itunes.apple.com/us/reviews/id391179483","version":"5.3.6","score":4,"title":"Doesn’t work on my phone after update","text":"I just updated on my iphone 8 which this app says it works on and whenever i open the app it force closes still after a fresh update, fresh restart, closed all my apps, and cleared my ram and i can’t get into my app to unarm my house so i gotta set off the alarm and use the keyfob\n\nupdate a week later: i still can’t unlock my house because the app won’t work","updated":"2021-09-29T12:50:53-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8092699404","userName":"Maxstar","userUrl":"https://itunes.apple.com/us/reviews/id24743245","version":"5.3.8","score":5,"title":"Very Sophisticated Alarm Sustem","text":"This is an excellent application for managing the Abode alarm system. The alarm system itself is really fantastic!  It has many devices. It has many automations. I am currently using the Ring alarm system while using the Abode alarm system at the same time. So far the Abode contacts and security devices are superior. But most of all, the alarm monitoring system is way better than the service provided by Ring.","updated":"2021-12-03T20:57:30-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7946359765","userName":"GMGruman","userUrl":"https://itunes.apple.com/us/reviews/id42789063","version":"5.3.7","score":1,"title":"Location awareness no longer works reliably","text":"The issues with Abode’s location services have gotten so bad I have turned off that feature and the automations using it. The system no longer tracks where you are (even with location set to Always in iOS Privacy settings) and its location status will have the last reported location from days, even weeks ago. So it won’t know if you’re home or not, so features like Auto-Home and Auto-Away simply don’t work. \n\nThis seems to be related to iOS 15. The same issue happened during a previous major iOS upgrade and took the developer months to fix.","updated":"2021-10-23T12:30:56-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7956621587","userName":"OGT","userUrl":"https://itunes.apple.com/us/reviews/id39229554","version":"5.3.7","score":5,"title":"Best security & home automation system!","text":"Used for years with great success. Reliable and easy to use.   A couple of minor hiccups over the years, but nothing significant. It sounds like some of the issues people mention are possibly what could be referred to as user error.  The ability to choose between self monitoring or using a service is a great option. Nice not having big tech behind system.","updated":"2021-10-26T11:00:38-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7804308560","userName":"Underhinged","userUrl":"https://itunes.apple.com/us/reviews/id119875513","version":"5.3.5","score":1,"title":"Extremely poor tech support & CS","text":"Hi, I had a lot of questions about the set up & functionality of this alarm system. It looks like it works and functions pretty well but to get any sort of help from this company is impossible! I called at least a dozen times waited hours on hold only to be promise to call back or email that never occurred. They promise all sorts of how to emails but those never arrive either. The foreign call centers folks are very nice people but extremely untrained & ineffective. I regret spending the 700+ dollars on the system. It is very basic functionality but easy to hook up once you watch all the online videos from outside the company…","updated":"2021-09-13T23:43:10-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6122391685","userName":"jsmith325","userUrl":"https://itunes.apple.com/us/reviews/id33500281","version":"5.0.2","score":3,"title":"It’s making its way to a good app","text":"Video still takes forever to show up, and I have to refresh my device page after I lock or unlock my Schlage door lock so that the goggles are in the right spot.\n\nI also have an issue with the loose descriptions on the website about what products integrate - they say “Schlage z wave doorlocks” but I bought a z wave handle lock and was told it wouldn’t work. Just put mode numbers on the page people...\n\nIt feels like they have a lot of the raw materials here for a really good app - just not all the way there yet.","updated":"2020-06-25T19:41:48-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6438342591","userName":"Unclesaltee","userUrl":"https://itunes.apple.com/us/reviews/id24812308","version":"5.1.1","score":1,"title":"Product has been driven into the ground","text":"If only I had waited a couple months to buy. Reviews were so positive in May 2020 but now nothing but single stars and that includes mine. Your app is a joke and nothing that your product used to tout works anymore. Geofencing is broken and you are either unable or unwilling to fix it. Your customer service says to delete the cue automation and set it up again. Sometimes that works for a day or two and sometimes it doesn’t. My system randomly arms and disarms itself. It seems that the problem is entirely the app and not the devices. Word to the wise, buy something else.","updated":"2020-09-17T06:33:22-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6816730901","userName":"JoRhett","userUrl":"https://itunes.apple.com/us/reviews/id12587157","version":"5.1.5","score":1,"title":"Nice system, Abode has no idea how it works.","text":"Technology is good (made by Taiwanese company) US Support is friendly but overwhelmed and incompetent. They try and help until they just give up.\n\nThe phone app really only has one feature—geolocation tracking. Great if you want constant notifications that your automations aren’t working because this or that phone isn’t reporting. It’s constant, and often reporting the phone you are using which shows its geolocation within Abode service. An hour later it will be a different phone.\n\nTrying to engage support is just a waste of time. Even if you can get a response they can’t fix anything","updated":"2020-12-31T21:30:08-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7561472009","userName":"Zinc_t","userUrl":"https://itunes.apple.com/us/reviews/id8363640","version":"5.3.3","score":1,"title":"Not user friendly","text":"Worked well for sometime, but God help you if your gateway loses connection to abode servers. Its a huge problem that even abode could not resolve. Then after a month, they sent me a replacement, that seemed have the same problem. Setting up a replacement device is a nightmare. If you have a subscription, you cannot cancel if your gateway is down without having abode cancel it on their end. Even while the gateway is down, they continue to charge for monitoring. I’m now switching to a more user friendly system, with services that are easy to change, switch or terminate easily.","updated":"2021-07-10T10:42:14-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6954516010","userName":"DukeNukem05","userUrl":"https://itunes.apple.com/us/reviews/id30602856","version":"5.2","score":4,"title":"Good app","text":"Props to the developer for promptly re-updating the app to use the old widget (changing system status) again following my previous review. I appreciate their responsiveness. \n\nThe only thing keeping me from a 5-star is that I’m asked to enable location permissions / maybe later whenever the app is opened for the first time in a while. That is a feature I never intend to enable. I’d like to permanently silence that pop up.","updated":"2021-02-04T14:41:52-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6126892414","userName":"Tbeck1","userUrl":"https://itunes.apple.com/us/reviews/id265838343","version":"5.0.2","score":4,"title":"Improvement: Sort by open/closed...","text":"I love the system and use it throughout my house. \n\nI’d love it if you could add a way to sort device status by open/closed (or even show only open items) for a quicker review before going to bed and setting to ‘Home’.\n\n👍🏼","updated":"2020-06-26T23:28:31-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6140275651","userName":"I can't have nice things","userUrl":"https://itunes.apple.com/us/reviews/id978250018","version":"5.0.2","score":1,"title":"App just doesn’t work half the time","text":"My biggest problem with this newest version of the abode app is that it doesn’t work. When I have people at my home while I’m not there and I set the app to standby; it does say it is set to standby, but the alarm still triggers as if it’s set to away.\n\nI have this same problem when I arrive home and the geofencing sometimes doesn’t work. I set it to standby, wait a few seconds, walk in, alarm still triggers. \n\nAll previous Abode apps worked fine. This one just doesn’t half the time. 1 star until this gets sorted.","updated":"2020-06-30T07:48:06-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8018441441","userName":"j.vonv","userUrl":"https://itunes.apple.com/us/reviews/id122058353","version":"5.3.8","score":1,"title":"Doesn’t work at all","text":"I have tried to work repeatedly with abode support because none of my three cameras can record a video. I subscribed to their new live streaming and it doesn’t record. Support would close my tickets with out notice and never solve these problems. When they take forever to answer their excuse was they have a backup of tickets. My guess is that many customers are having the same issues. Do not waste your money here. Try blink, ring, or nest perhaps then your camera will be more than an expensive decoration.","updated":"2021-11-12T22:30:27-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7813717784","userName":"Worker19","userUrl":"https://itunes.apple.com/us/reviews/id159469893","version":"5.3.5","score":2,"title":"Excellent until firmware update","text":"Overall have had little problem with the program.  However with a recent firmware update pushed to the webcam 2’s, the infrared now turns on though there is still plenty of light.  Wouldnt be an issue but i have the cameras behind glass so all the infrared sees is itself (infrared does go through glass).\n\nI am happy to change to 5 star when we get the ability to turn off the infrared option in the camera options/settings.","updated":"2021-09-16T17:30:26-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6299316226","userName":"bnells88","userUrl":"https://itunes.apple.com/us/reviews/id490596833","version":"5.0.5","score":1,"title":"Terrible app","text":"Won’t even let me create a new account. I had to reload the app 4 times before it would let me log on for the first time. When I finally logged in, the app was supposedly going to send a verification email but never did. I’ve now deleted the app another 4 times and tried to log on on two different iPhones and still no luck. \n\nKinda stinks when you buy a new system and can’t even set it up due to a crappy app. It takes the excitement out of buying a new product.","updated":"2020-08-09T09:47:27-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7895623302","userName":"Avid Mac Fan!","userUrl":"https://itunes.apple.com/us/reviews/id15582449","version":"5.3.7","score":1,"title":"Does not work","text":"I paid an extra $99 to record video 24/7. All I get when I try to play something in the timeline is “video playback error”.  My iota cam keeps dropping off line. It is the only device on my network to do so.  I’ve been working with tech support for two months troubleshooting and finally asked for a replacement and they just stopped communicating with me.  I love the design of their products bit there major flaws in how well they work.","updated":"2021-10-09T08:07:12-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7053409614","userName":"M_user_review","userUrl":"https://itunes.apple.com/us/reviews/id30581516","version":"5.2.2","score":2,"title":"Widget broken & stop location!!","text":"I agree with the other users. The widget is now useless. It doesn’t show the current state of your alarm properly and it requires you to go into the app the change status.  Additionally abode needs to stop pushing location tracking every time I open the app. That functionality doesn’t work for our household and so we will not be enabling it.  We shouldn’t be penalized for that.","updated":"2021-03-01T08:33:06-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7687886875","userName":"Ultimate Rose","userUrl":"https://itunes.apple.com/us/reviews/id285548905","version":"5.3.5","score":3,"title":"No Guides","text":"I set up the two Abode 2 cams. The video quality is excellent. However,I can’t find any help section on the app. I have to call or email for simple questions. The app doesn’t even have the support # listed. The support team has had to send several updates to my system and I still don’t have the service running properly.","updated":"2021-08-13T04:44:03-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7397207483","userName":"pauljlucas","userUrl":"https://itunes.apple.com/us/reviews/id13697315","version":"5.3.1","score":3,"title":"Devices screen is worse with latest update","text":"The latest update makes the devices screen more annoying by taking up far more space than is necessary. The kicker is that the space in blank. I want to see as much useful information per screen and to have to scroll the minimum amount.","updated":"2021-05-28T00:03:26-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8024529760","userName":"Spizer","userUrl":"https://itunes.apple.com/us/reviews/id35909250","version":"5.3.8","score":2,"title":"iOS 15 - location assistant doesn’t work","text":"In our house we have 3 users on abode. 1 on iOS 14 two on iOS 15. The two users get occasional push messages telling us we haven’t interacted with the system recently, so it’s gonna ignore us. Which is… frustrating, since all 3 of us work from home and have largely separate lives. Nothing like the house arming while you’re in the middle of a meeting!","updated":"2021-11-14T13:37:43-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6267206153","userName":"Hyns","userUrl":"https://itunes.apple.com/us/reviews/id4590007","version":"5.0.4","score":1,"title":"Prompts and widget issues","text":"Every time I open the app I get asked to enable location services. It doesn’t let you say “No”, you have to respond EVERY TIME you reopen it, “maybe later”.  Let users select “No” so the prompt doesn’t show up every single time. \n\nAlso the widget rarely works. I always arm and disarm via the widget. Ever since they updated to the new look and feel it either lags significantly to select Arm/Standby or just simply doesn’t work at all.","updated":"2020-08-01T05:46:21-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7778255094","userName":"BradPA","userUrl":"https://itunes.apple.com/us/reviews/id33363255","version":"5.3.5","score":4,"title":"Needs Reference Manual","text":"Most of the time I need to quickly look up something such as how to replace a battery, what type of battery, how to silence an alarm, what does a blinking light mean etc.   The app should have all these answers readily available.","updated":"2021-09-06T10:52:40-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6413294765","userName":"6 stars","userUrl":"https://itunes.apple.com/us/reviews/id74025332","version":"5.1.1","score":5,"title":"Stopped getting notifications","text":"I’ve paid for full service but stopped getting any notifications of any kind from the app. Defeats the purpose of having a security system","updated":"2020-09-09T20:04:39-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8025341249","userName":"funinmoney","userUrl":"https://itunes.apple.com/us/reviews/id943036749","version":"5.3.8","score":5,"title":"Abode","text":"The App is very good and easily navigated. I’m not sure if it’s the App or IOS, but it would be extremely beneficial to have the option to change different sounds for different events and/or functions..","updated":"2021-11-14T19:49:51-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7905418646","userName":"Creative Chris from Nice","userUrl":"https://itunes.apple.com/us/reviews/id127360090","version":"5.3.7","score":5,"title":"Best security app","text":"This app has been working flawlessly with my 5  Abode Cam 2 and door sensors. I love how easy it is to install new piece of hardware, and control everything through the app. The timeline with all the video clips is really helpful.","updated":"2021-10-11T23:40:37-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7759322493","userName":"Speakkofthedevil","userUrl":"https://itunes.apple.com/us/reviews/id166035979","version":"5.3.5","score":1,"title":"App problem or system problem?","text":"Yesterday I was unable to turn the app off from either phone that’s connected to our system. The alarm went off and we couldn’t turn it off from the app. I had to go in and unplug the and switch off the Gateway. I called support and emailed and have heard nothing back. My system is still disable since I have no idea if they’ve corrected their issue.","updated":"2021-09-01T08:30:58-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7752784642","userName":"Jeffery Tha","userUrl":"https://itunes.apple.com/us/reviews/id86967316","version":"5.3.5","score":5,"title":"Happy customer","text":"A very happy customer with this highly customizable system! Great features for an affordable price and a one time fee! Whenever we are going for vacations we just add the 7 day plan!","updated":"2021-08-30T13:18:24-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7413845304","userName":"Sodium Bisulphate","userUrl":"https://itunes.apple.com/us/reviews/id115268276","version":"5.3.1","score":3,"title":"Door locks stopped working after update","text":"Both my Schlage door locks stopped working after this update. Never had a issue before. Shows that they are online but do not show correct position and also do not have the ability to lock/unlock anymore.","updated":"2021-06-01T06:19:59-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8081949897","userName":"Sweet May Sr","userUrl":"https://itunes.apple.com/us/reviews/id685682014","version":"5.3.8","score":3,"title":"Good Alarm System","text":"Alarm works as it should when triggered. I am finding it impossible to change sensor settings. I disabled one of the door sensor chimes over Thanksgiving because visiting dogs would go berserk whenever someone came in the door. Now I can’t restore the chime setting. Pretty disappointing.","updated":"2021-11-30T19:51:52-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6722475640","userName":"Newbie Doc","userUrl":"https://itunes.apple.com/us/reviews/id30078807","version":"5.1.5","score":1,"title":"Not Responding","text":"All I see in HomeKit it 32 accessories Not Responding all the time. Only reason I bought this instead of more established reputable system was HomeKit integration. CS keeps saying delete the system and add again. It works for half a day and back to no response. I can’t do that every single day with 32 accessories that all get added to the same room because the app won’t let you select the HomeKit rooms for the accessory locations.","updated":"2020-12-05T21:44:54-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7711000937","userName":"Brian NE PHILLY","userUrl":"https://itunes.apple.com/us/reviews/id144214225","version":"5.3.5","score":4,"title":"Abode app","text":"App is very easy to use.  Has all the info needed to check all areas of the house. I only wish it still worked along with the Nest cameras. It used to but for some reason it doesn’t anymore.","updated":"2021-08-19T07:28:48-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7885335917","userName":"cbgdoqm","userUrl":"https://itunes.apple.com/us/reviews/id1310433690","version":"5.3.7","score":3,"title":"Every update causes the widget to disappear","text":"I want to use the widget that has the buttons to set the status. But every time the app updates, it replaces that widget with a less useful widget that is only capable of showing the status. I have to reinstall the app to get the useful widget back. Please fix this!","updated":"2021-10-06T11:15:11-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7788776369","userName":"Thurston Howell IV","userUrl":"https://itunes.apple.com/us/reviews/id875815251","version":"5.3.5","score":5,"title":"Works","text":"I have been using Abode alarm for almost 3 years. Has worked flawlessly and at a decent price. The only flaw is the tape on sensors eventually needs replacement; but, the app is great.","updated":"2021-09-09T13:06:05-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7624566109","userName":"Aaronide","userUrl":"https://itunes.apple.com/us/reviews/id446304629","version":"5.3.4","score":5,"title":"Easy to navigate and add devices","text":"App is very streamlined and allows full control on mobile. No use for desktop site. Plays well with iPad. Two thumbs up!","updated":"2021-07-27T10:29:21-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6292307335","userName":"E Yeezy Gee","userUrl":"https://itunes.apple.com/us/reviews/id141335801","version":"5.0.5","score":3,"title":"Can't reset outdoor siren","text":"It's frustrating that in order to reset a tampered outdoor siren you will need to open the device. There should be an option within the app to reset the device. In addition, it'll be a nice feature to reset Abode after the alarm has been triggered.","updated":"2020-08-07T14:08:13-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6240690360","userName":"EMSJeff","userUrl":"https://itunes.apple.com/us/reviews/id117797142","version":"5.0.4","score":1,"title":"App is not responsive","text":"I’ve had various updates of this app for over a year and none of them have been reliable. There will be days on end when the App simply doesn’t work at all. Most annoyingly is when the app shows info that isn’t current and you can’t change the system mode, see the current timeline, cameras, log out, etc.","updated":"2020-07-25T08:36:15-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6442610547","userName":"thepicker19","userUrl":"https://itunes.apple.com/us/reviews/id103469239","version":"5.1.1","score":5,"title":"New app is working great","text":"After a few bumps, the new app is working great! So many more features than the old one and they keep updating regularly!","updated":"2020-09-18T11:07:48-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8009884417","userName":"JAR2104","userUrl":"https://itunes.apple.com/us/reviews/id503271054","version":"5.3.8","score":4,"title":"Flexible and easy.","text":"I’m using different camera brands, door sensors and a panic button. Pretty easy to set up. It automatically arms when my phone leaves the house.","updated":"2021-11-10T12:11:12-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7585126049","userName":"cathalope","userUrl":"https://itunes.apple.com/us/reviews/id1016087328","version":"5.3.3","score":5,"title":"Working as advertised","text":"New system , setup was without major issues , and is working very well . Will update if I run into issues but so far so good.","updated":"2021-07-16T19:09:12-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6968230220","userName":"UserKevin","userUrl":"https://itunes.apple.com/us/reviews/id427939981","version":"5.2","score":2,"title":"Timeline changed","text":"Something happened with a previous update.  The timeline now shows the prior day’s events as most recent if the timeline hasn’t been checked for a while.  I have to manually select today’s date then refresh the page to see what door or window just opened.","updated":"2021-02-07T22:18:35-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7566545665","userName":"Steve3717","userUrl":"https://itunes.apple.com/us/reviews/id30261067","version":"5.3.3","score":1,"title":"Forced Prompt to Enable Location Services","text":"To use the Abode app, you must enable location services, or decline a prompt for them every single time you open the app. Enabling location services can consume 15 - 20% of you battery daily. This is a disappointing UI decision that causes daily frustration. The integration with Apple Shortcuts would alleviate this issue, but arming and disarming are not reliable through Shortcuts.","updated":"2021-07-11T20:31:35-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7699792684","userName":"Buzzed Ninja","userUrl":"https://itunes.apple.com/us/reviews/id101040896","version":"5.3.5","score":1,"title":"Figure it out Devs/Product","text":"If users are reporting an error, FIX IT instead of telling them to write in. I have many of the same issues. This is negligence from the Development and Product teams…\n\n1) Camera setup freezes on firmware update. \n2) Cameras “flip” feature doesn’t work at all. All my cameras are upside down. It’s like it knows exactly the opposite of what you need. \n3) 2 out of 3 cameras are offline. I have to constantly reset them and the point of this is to monitor a home I don’t live in now. WHATS THE POINT. \n4) Recording or capturing a photo never works.  Says to try again or contact support. Don’t you guys monitor system errors?","updated":"2021-08-16T08:26:57-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8103520511","userName":"Annnatar","userUrl":"https://itunes.apple.com/us/reviews/id129169012","version":"5.3.8","score":1,"title":"Very bad app and no customer service agent available to talk","text":"The app doesn’t provide any details when the beep or chime sounds comes from IOTA in middle of the night. When wanted to call customer support, no number is there. \n\nI have only the option to chat with the Bot. It doesn’t connect with human and simply collects my email. Worst app and customer service ever.","updated":"2021-12-06T21:22:05-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8122854596","userName":"TokyoSailor","userUrl":"https://itunes.apple.com/us/reviews/id428789852","version":"5.3.8","score":3,"title":"Buggy App/doesn’t update device name","text":"The app picks and chooses when it want to work. Slow response time. Automations do not save. Device names do not update inside of automations. No way to remove a device that was signed in when it broke.","updated":"2021-12-12T08:24:12-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7978943136","userName":"anonymous47732","userUrl":"https://itunes.apple.com/us/reviews/id122705560","version":"5.3.7","score":2,"title":"1990s app in 2021","text":"The app is very basic and lacks a lot of normal features. \n\nThere is no great way to view and adjust your schedules and no contact us / help number anywhere in the system. \n\nThe functionality works, but could be greatly improved with a little attention.","updated":"2021-11-01T15:34:43-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8007096778","userName":"PrecisionGem","userUrl":"https://itunes.apple.com/us/reviews/id85127116","version":"5.3.8","score":2,"title":"Love Hate relationship","text":"When the system works it’s great. I have an outdoor camera that would capture the movement of any intruder but in only captures me walking by in jumping up and down and waving to it about 10% of the time. It used to work before the last update about 70% of the time.","updated":"2021-11-09T17:27:05-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7873560688","userName":"Bagamam","userUrl":"https://itunes.apple.com/us/reviews/id29011382","version":"5.3.6","score":2,"title":"Not reliable","text":"Signal goes on and off periodically.\nSound is very low.\nSound off is very static from the speaker, although it comes clear in the camera .\nSystem does not automatically start recording as it should so we miss most interactions .\nWe pay $100 for the yearly plan but at this point we fell it is not worth it.\nWe contacted customer service a couple of times , they made us disconnect, reconnect, reset, uninstall , reinstall , etc but it only worked partially for a period of time and then we have the same issues .","updated":"2021-10-03T08:29:19-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6426826722","userName":"hasbamm","userUrl":"https://itunes.apple.com/us/reviews/id419847053","version":"5.1.1","score":1,"title":"Getting worse planning to sell system","text":"I don’t know what’s happening but it just getting worse. I couldn’t stop alarm for almost five minutes today. The app didn’t respond. Now I’m trying to arm system but it doesn’t work again. I’m thinking about to sell my system because it’s not reliable.","updated":"2020-09-13T19:13:57-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7727619650","userName":"WFBuckley","userUrl":"https://itunes.apple.com/us/reviews/id301797896","version":"5.3.5","score":4,"title":"Trouble connecting to HomeKit","text":"I bought this system for its HomeKit integration. It was difficult to get connected but support got it set. Pushed firmware to unit and fixed the problem.","updated":"2021-08-23T20:26:04-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7975219207","userName":"kkishfy","userUrl":"https://itunes.apple.com/us/reviews/id41255370","version":"5.3.7","score":1,"title":"iOS 15 Bugs","text":"The Abode app doesn’t work well under iOS 15.1.  When launching it, it just stays on the loading screen with the animated spinning circle.  My alarm has gone off several times now because the app wouldn’t load quickly and correctly unless I force quit the app and relaunch it.","updated":"2021-10-31T14:12:52-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7521073384","userName":"RadAdam111","userUrl":"https://itunes.apple.com/us/reviews/id326210322","version":"5.3.3","score":5,"title":"Amazing App & System","text":"Gotta love 1 star ratings for an app when ppl can’t get a shipment (not the same thing).  My shipment came fine and the app is great","updated":"2021-06-29T17:48:34-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6979555148","userName":"E Jeff H","userUrl":"https://itunes.apple.com/us/reviews/id1258928286","version":"5.2.1","score":2,"title":"Negative customer experience","text":"The merchant makes it near impossible to cancel an order and the return policy link does not work.  Do your research before purchasing.  There are dozens of security and alarm services that provide a better customer experience.","updated":"2021-02-10T17:54:20-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7627751240","userName":"mrastrong","userUrl":"https://itunes.apple.com/us/reviews/id12424","version":"5.3.4","score":4,"title":"5.3.4 issues may require app reinstall","text":"In order to get mine working again I had to delete, install, and log in.","updated":"2021-07-28T07:18:56-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7625263267","userName":"brutius","userUrl":"https://itunes.apple.com/us/reviews/id581783738","version":"5.3.4","score":4,"title":"Good product","text":"Good products works well. Need to understand how to make system works. Then it is easy I ‘m not tech savvy at all. Very pleased with this system.","updated":"2021-07-27T15:16:37-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6378645706","userName":"BPhilipV","userUrl":"https://itunes.apple.com/us/reviews/id143547194","version":"5.1.0","score":1,"title":"Status Keeps Showing 'Away' Status","text":"The app is trash... I've rebooted the hub 5 times and re-downloaded the app more times than I can count. Constant glitches. Now for some reason it always show the arm mode is in 'Away.' Please get new developers, or do more beta testing prior to releasing updates. Total disappointment.","updated":"2020-08-30T15:04:21-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6302464498","userName":"Yashxo","userUrl":"https://itunes.apple.com/us/reviews/id200736824","version":"5.0.5","score":1,"title":"Planning to cancel","text":"Abode is not good anymore, what am I paying for yearly if the location services doesn’t work and I have to manually lock and unlock my house every time? I’ve contacted support and they told me to wait for the next app update, what a joke. Planning to sell my system and switch to a better company.","updated":"2020-08-10T06:26:35-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7558802622","userName":"rbswrds","userUrl":"https://itunes.apple.com/us/reviews/id113052524","version":"5.3.3","score":5,"title":"What’s not to love?","text":"Works great with HomeKit and app has plenty of deep dive options. How this got a low score I have no idea, previous versions perhaps??","updated":"2021-07-09T17:54:30-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6234460568","userName":"Time to kill","userUrl":"https://itunes.apple.com/us/reviews/id43827189","version":"5.0.4","score":2,"title":"Getting worse with time....","text":"The latest update did NOT fix my geofencing problem!! We have had Abode for two years now and it seems to be getting worse and worse. I think I will be switching soon 😞","updated":"2020-07-23T19:50:25-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7829852221","userName":"After8tracks","userUrl":"https://itunes.apple.com/us/reviews/id957624033","version":"5.3.5","score":4,"title":"Good System","text":"Easy to install and set up.  Most devices paired on first or second attempt.  The cameras are excellent.","updated":"2021-09-21T06:49:33-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6587198228","userName":"JodyRobinson","userUrl":"https://itunes.apple.com/us/reviews/id163316078","version":"5.1.3","score":1,"title":"DO NOT BUY!!!","text":"The devices do not work and the service is a joke. I’ve had the police at my door 3 times telling me that my Abode alarm was going off when it was not. \n\nGo with Ring or any other a home security service unless you like the police at your door and terrible customer service.","updated":"2020-10-29T10:25:28-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6405981148","userName":"Chubrok","userUrl":"https://itunes.apple.com/us/reviews/id74877","version":"5.1.1","score":2,"title":"Geofence broken","text":"It used to be great… Would always arm the alarm every time all of the phones were out of the house. Now the Geo fence appears to be broken since the latest updates and Alarm no longer arms automatically. Please fix.","updated":"2020-09-07T15:59:41-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7946996984","userName":"Bcannon","userUrl":"https://itunes.apple.com/us/reviews/id25915556","version":"5.3.7","score":3,"title":"Suddenly not consistent","text":"I’ve had it forTwo years and suddenly it’s not consistent with the triggers and automations. I’ve even moved it to a different part of the house away from the Wi-Fi wireless router per your suggestions.","updated":"2021-10-23T17:20:30-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6602852889","userName":"heavyhitter719","userUrl":"https://itunes.apple.com/us/reviews/id42645518","version":"5.1.3","score":2,"title":"Disappointing","text":"Abode clearly doesn’t listen to its customers. Same issues are a constant problem. Too bad because it seems to be a high end system. Abode just doesn’t listen to the problems the customers face.","updated":"2020-11-02T17:17:25-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6705624188","userName":"himmel2064","userUrl":"https://itunes.apple.com/us/reviews/id31114627","version":"5.1.5","score":2,"title":"Unable to add to HomeKit","text":"The whole reason I bought this system was integrating with HomeKit and it aint happening. I’ve been in touch with a very friendly tech through email but they cannot get it fixed on the back end.","updated":"2020-12-01T03:58:31-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7701041446","userName":"T_M__A","userUrl":"https://itunes.apple.com/us/reviews/id110560236","version":"5.3.5","score":2,"title":"Buggy and hard to understand","text":"Firmware update failed upon setup. App options are weird and hard to understand. HomeKit integration also didn’t work. \n\nInteresting product but can’t recommend this app.","updated":"2021-08-16T16:33:58-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6399917224","userName":"Rstar62","userUrl":"https://itunes.apple.com/us/reviews/id12241968","version":"5.1.1","score":1,"title":"Geofence Failures","text":"About once every 2-3 weeks the abode app and gateway just decide to stop acknowledging when our devices go to and from our house. It’s extremely annoying and never used to happen before the major ‘upgrade’ to the app. I wish they would fix this.","updated":"2020-09-05T20:57:23-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7827673629","userName":"zaaaj","userUrl":"https://itunes.apple.com/us/reviews/id110664506","version":"5.3.5","score":1,"title":"Not recommended","text":"Every month or so this crappy app is not available in the apple home app.  I have to call and speak with someone and more fiddling around to get it to work again.  Maybe in 3-5 years it will be ready for prime time.  Till then find something else.","updated":"2021-09-20T15:43:36-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7764013817","userName":"manatee55","userUrl":"https://itunes.apple.com/us/reviews/id36116959","version":"5.3.5","score":1,"title":"Only slightly useful","text":"Has a history section that doesn’t tell you all of the history.  You can’t access everything, it makes you go to the website for some reason.  No customer service contact in app.","updated":"2021-09-02T15:21:30-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6983967401","userName":"HuskyJ","userUrl":"https://itunes.apple.com/us/reviews/id31942569","version":"5.2.1","score":1,"title":"Bring back the old widget","text":"The new Home Screen widget is useless. The old one that let you set and turn off alarm with one click was far more functional and was the widget I used most on the whole Home Screen. Very sad to see it go. Bring it back!","updated":"2021-02-11T21:18:14-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7697013388","userName":"Jay Schneider","userUrl":"https://itunes.apple.com/us/reviews/id144540805","version":"5.3.5","score":1,"title":"Password reset from phone and tablet is a fail","text":"Your password reset link, when using an iOS device, takes you to the frigging App Store to download / open the app. So there is no way to do a password reset without a computer. Complete fail.","updated":"2021-08-15T14:44:46-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7745705694","userName":"NuggetsRule","userUrl":"https://itunes.apple.com/us/reviews/id19946714","version":"5.3.5","score":5,"title":"Love this system","text":"1 year in…still enjoy the flexibility / ease of this system.","updated":"2021-08-28T14:58:27-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8109857393","userName":"ENM","userUrl":"https://itunes.apple.com/us/reviews/id32345208","version":"5.3.8","score":1,"title":"Issues everywhere","text":"Connection issues with cameras and wireless!\nMotion sensors are set off by even the smallest pet. Do not buy with any kind of cat or small dog let alone large pet. \nWe have to reset system constantly especially when a firmware update is released.","updated":"2021-12-08T17:35:08-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7946499605","userName":"why only one nickname","userUrl":"https://itunes.apple.com/us/reviews/id126048210","version":"5.3.7","score":1,"title":"Bad","text":"All the quality of devices are outstanding the software has much to be desired. It is poorly laid out difficult to navigate and not intuitive at all. They need to completely revamp this very difficult to use software.","updated":"2021-10-23T13:30:02-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6609689064","userName":"Jw23.","userUrl":"https://itunes.apple.com/us/reviews/id212240660","version":"5.1.3","score":1,"title":"Bad business practices","text":"They have changed what functions require a subscription, basically taking away functionality that was available at the time of purchase of the system.","updated":"2020-11-04T16:26:48-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7869235860","userName":"smw333pep","userUrl":"https://itunes.apple.com/us/reviews/id26801048","version":"5.3.6","score":1,"title":"Abode mobile app opens for 1 second the crashes","text":"Unable to get the App to stay open. I’ve updated the App but still unable to get working on my iPhone. This means I cannot set alarm from bed, or remotely. Please fix, this is new as of 3-4 days ago.","updated":"2021-10-02T06:13:40-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6779954535","userName":"Winedoc","userUrl":"https://itunes.apple.com/us/reviews/id121282647","version":"5.1.5","score":2,"title":"I want to like it","text":"Support is excellent—sometimes. Geofencing is a disaster and stops working for no reason and then it takes a software engineer and hours to reinitiate it. They should merge with Ring or another big company.","updated":"2020-12-21T20:24:56-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7817001704","userName":"lanew2020","userUrl":"https://itunes.apple.com/us/reviews/id956555510","version":"5.3.5","score":3,"title":"Poor behavior for Cam 2 & can’t chk for updates","text":"Two main Issues:\n\n1. On web app, I am unable to chk for firmware updates; on phone app, nothing happens when I want to see what the current firmware is\n\n2. Cam 2 issue: can’t view live video on web app, but can view on phone app\n\n3. Cam 2 issue: unable to flip video on one of the cameras; flipped no matter what I try","updated":"2021-09-17T16:32:30-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7623628618","userName":"thejackoftrades","userUrl":"https://itunes.apple.com/us/reviews/id156326289","version":"5.3.4","score":1,"title":"Do not buy","text":"This company feels like a scam. Pretended to be easy to install. Have only had connectivity issues and have never heard from support despite multiple inquiries. Now trying to return and they are still not responding to me.","updated":"2021-07-27T05:30:25-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7756619513","userName":"Wangmonkey","userUrl":"https://itunes.apple.com/us/reviews/id145306854","version":"5.3.5","score":1,"title":"Terrible software and product","text":"Buggy and lacking features they advertise on the website for various components.  I would never buy this product again.","updated":"2021-08-31T15:03:21-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7727926987","userName":"rainsong72","userUrl":"https://itunes.apple.com/us/reviews/id46120865","version":"5.3.5","score":1,"title":"Motion detected and then no video recorded","text":"Ridiculous. Getting woken up in the middle of the night for what I can only assume is a false detection, but since the video fails to record I can’t know for sure. Camera randomly shows as offline as well.","updated":"2021-08-23T22:38:05-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7955078934","userName":"CAM22CAM","userUrl":"https://itunes.apple.com/us/reviews/id167415986","version":"5.3.7","score":4,"title":"Monitoring Device","text":"Monitoring is precise . Camera quality is awesome","updated":"2021-10-26T01:39:37-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7681960272","userName":"MrMorden","userUrl":"https://itunes.apple.com/us/reviews/id24090108","version":"5.3.5","score":2,"title":"Buggy","text":"New system activation is totally broken. Can’t update gateway firmware; says it wants to do setup of the devices that came with the kit but then dumps into the dashboard. “Check for firmware updates” does nothing.","updated":"2021-08-11T14:09:35-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7993356698","userName":"MICHAEL EDWARD HOFF","userUrl":"https://itunes.apple.com/us/reviews/id298735372","version":"5.3.8","score":3,"title":"I have an issue no contact button","text":"System down transformer heated up and is discolored no power.","updated":"2021-11-05T19:27:27-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7743963510","userName":"Ramidon79","userUrl":"https://itunes.apple.com/us/reviews/id18902360","version":"5.3.5","score":2,"title":"New Version Issue","text":"I can’t open system settings in the new version. When I click the top left three-bar, I get a blank screen that says “Done”.","updated":"2021-08-28T04:34:08-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8134370474","userName":"mrkingkeith","userUrl":"https://itunes.apple.com/us/reviews/id128098061","version":"5.3.8","score":2,"title":"Abode outdoor smart will quit work","text":"Abode Outdoor Smart Camera will quit working every few days. Customer support is very weak. Two star because door sensors work good. Save yourself the headache and don’t get there cameras. Enough said !!!","updated":"2021-12-15T17:10:25-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7979308670","userName":"SolanaJeff","userUrl":"https://itunes.apple.com/us/reviews/id174224234","version":"5.3.7","score":1,"title":"Update?","text":"Since the most recent update, the only way to open up the app is through a notification.  Needs to be fixed immediately as it’s unusable","updated":"2021-11-01T18:18:15-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7927582374","userName":"unabletoputanickname","userUrl":"https://itunes.apple.com/us/reviews/id117704973","version":"5.3.7","score":1,"title":"Not working","text":"Bought a camera and have tried to get it to work for any movement and it doesn’t. I tried reaching out and initially responsive but no more response and not working","updated":"2021-10-18T04:08:49-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7663148759","userName":"RED953","userUrl":"https://itunes.apple.com/us/reviews/id154051182","version":"5.3.5","score":1,"title":"Worst Hardware/Software Integration Ever","text":"Everything about tut has been an email to abode to find out what/how to do something to get the system started. One week later, it still not working. I asked for an RMA. They stopped responding.","updated":"2021-08-06T15:21:28-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7869789072","userName":"kiki$$$$","userUrl":"https://itunes.apple.com/us/reviews/id309840472","version":"5.3.6","score":1,"title":"Server often offline.","text":"Getting worse and worse. What is the use of a security monitoring product if server offline and not able to monitor?","updated":"2021-10-02T08:54:46-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7128860792","userName":"rsanonymous","userUrl":"https://itunes.apple.com/us/reviews/id689793548","version":"5.2.2","score":1,"title":"Email verification on setup doesn’t work","text":"Poorly designed app. Email verification just sent me in circles and could never verify account or use product. Received as a gift so will have to go in the trash.","updated":"2021-03-21T12:19:23-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7677437660","userName":"Zointicus","userUrl":"https://itunes.apple.com/us/reviews/id477313445","version":"5.3.5","score":1,"title":"HomeKit Integration","text":"Don’t use abode alarm system if HomeKit integration is a goal. Was a pain to setup, worked a couple weeks then stopped and now can’t setup again due to a variety of different errors.","updated":"2021-08-10T09:26:54-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7723768946","userName":"jayhswk","userUrl":"https://itunes.apple.com/us/reviews/id652834442","version":"5.3.5","score":1,"title":"Alert video","text":"Cannot view captured alert videos. When clicking the video the video picture goes all black and nothing happens.","updated":"2021-08-22T18:55:14-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7394344033","userName":"MarcosIncognito","userUrl":"https://itunes.apple.com/us/reviews/id383530493","version":"5.3.1","score":5,"title":"Great App","text":"Not sure why there are any bad reviews.\nThis app works great","updated":"2021-05-27T05:47:41-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6990650470","userName":"MrF2028","userUrl":"https://itunes.apple.com/us/reviews/id178868414","version":"5.2.1","score":1,"title":"Went backwards in the latest update","text":"They got rid of one useful widget that let you change your system status and replaced it with five useless widgets.","updated":"2021-02-13T12:51:30-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6378829776","userName":"Fieldhippie","userUrl":"https://itunes.apple.com/us/reviews/id135915819","version":"5.1.0","score":1,"title":"Phone App","text":"I’ve been trying to get the Abode live image to work on my iPhone for 3 months. I have contacted Abode 7 times to resolve this matter and it hasn’t been fixed. I’ll be canceling them soon.","updated":"2020-08-30T16:35:45-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7896274445","userName":"alec_520","userUrl":"https://itunes.apple.com/us/reviews/id228986089","version":"5.3.7","score":1,"title":"Continually pops up pro feature ads $","text":"Don’t need to be harassed every week telling me I can get 24/7 recording or professional monitoring when I do not want them.","updated":"2021-10-09T11:36:45-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7799145022","userName":"ssund","userUrl":"https://itunes.apple.com/us/reviews/id37766983","version":"5.3.5","score":2,"title":"Stream Unavailable","text":"The most simplest thing a security camera app should do is stream video. I haven’t yet been able to.","updated":"2021-09-12T09:51:41-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8038306725","userName":"cpthogie","userUrl":"https://itunes.apple.com/us/reviews/id22712888","version":"5.3.8","score":1,"title":"Can’t do half the necessary functions","text":"What’s the point of the app if I have to go to the computer to actually configure the system properly","updated":"2021-11-18T14:47:50-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7954194652","userName":"SteveClark1000","userUrl":"https://itunes.apple.com/us/reviews/id29406630","version":"5.3.7","score":2,"title":"Geofencing Terrible","text":"Geofencing does not work unless the app is always open in the background. If you quit the app, the geofencing automations no longer trigger.","updated":"2021-10-25T18:27:06-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7809759678","userName":"zazabt1","userUrl":"https://itunes.apple.com/us/reviews/id244104055","version":"5.3.5","score":1,"title":"Need monthly plan to use features","text":"Not practical to self monitor without paying for a monthly plan.\nNot what I was lead to believe when purchasing.\nBait and switch-not happy","updated":"2021-09-15T13:03:21-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7864120351","userName":"NelsensAustin","userUrl":"https://itunes.apple.com/us/reviews/id11859149","version":"5.3.6","score":1,"title":"Gateway always goes offline","text":"I  connected via Ethernet and the internet is always working. But then my alarm isn’t on for a day and then app says Gateway offline. No support. I’m switching to Nest","updated":"2021-09-30T22:11:56-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6877138988","userName":"AJR000003","userUrl":"https://itunes.apple.com/us/reviews/id1142308325","version":"5.1.5","score":2,"title":"Just okay","text":"Please make it compatible with Apple Shortcuts. I want to say “hey Siri - open garage door” and have it at least open the app or preferably toggle the switch.","updated":"2021-01-16T07:47:39-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8074171953","userName":"5688993321","userUrl":"https://itunes.apple.com/us/reviews/id533764491","version":"5.3.8","score":1,"title":"Latest update bug","text":"I downloaded the most recent update and now the app crashes when opened.","updated":"2021-11-28T14:16:25-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8112815099","userName":"mrsamc","userUrl":"https://itunes.apple.com/us/reviews/id113318470","version":"5.3.8","score":1,"title":"Latest update crashes every time I try to open it","text":"Can’t even open the app now. Completely useless.","updated":"2021-12-09T13:51:55-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6492433529","userName":"Blownear","userUrl":"https://itunes.apple.com/us/reviews/id635702330","version":"5.1.2","score":1,"title":"Getting worse and worse","text":"It used to be great now the cameras never work. Look to a different product. Now no notifications work. Cameras very flaky.","updated":"2020-10-02T07:53:20-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8076814939","userName":"kellogg kyle","userUrl":"https://itunes.apple.com/us/reviews/id33839877","version":"5.3.8","score":2,"title":"Too buggy","text":"Lots of bugs that are frustrating to resolve","updated":"2021-11-29T08:45:03-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8016846237","userName":"Ger Today, Jew Tomorrow","userUrl":"https://itunes.apple.com/us/reviews/id566328125","version":"5.3.8","score":2,"title":"Support Staff","text":"How does one ask for support? Surely rating the app is not the only way to reach customer service?","updated":"2021-11-12T11:15:21-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7766593170","userName":"Jan Rune","userUrl":"https://itunes.apple.com/us/reviews/id144091701","version":"5.3.5","score":1,"title":"Many broken features","text":"This system is not ready for use. Firmware update not working. Cam2 integration not working properly in app.","updated":"2021-09-03T08:05:16-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6186003448","userName":"Tiferna","userUrl":"https://itunes.apple.com/us/reviews/id49425412","version":"5.0.2","score":2,"title":"Abode App","text":"Pictures captured are not shown from latest to earliest so you’re obliged to scroll down.","updated":"2020-07-11T10:18:17-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8106629025","userName":"Onyx718","userUrl":"https://itunes.apple.com/us/reviews/id207365124","version":"5.3.8","score":1,"title":"App is so confusing and doesn’t do most basic functions","text":"App is so confusing and doesn’t do most basic functions","updated":"2021-12-07T19:14:44-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8116334366","userName":"joebraidwood","userUrl":"https://itunes.apple.com/us/reviews/id12903550","version":"5.3.8","score":1,"title":"A mess","text":"This app and the company that operates it have really gone down hill. Lots wrong with the app. The service is losing network access. Very clunky. Avoid.","updated":"2021-12-10T14:10:32-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7664136418","userName":"NateMustang","userUrl":"https://itunes.apple.com/us/reviews/id39201379","version":"5.3.5","score":3,"title":"Works when it works, but not reliable","text":"App works ok but every update seems to need a delete and reinstall. Sometime the app update logs me out or loses some devices … just wait a day or two they have come back so far. Service is really hit and miss, have had support staff that seem to know less about the tech than the average customer and motion sensors are a joke. The IP cameras are ok, live feed defiantly needs a good internet connection and cell backup has lots live feed. Motion cameras were all defective, even the 3rd replacements didn’t work. Overall though SimpliSafe was not much better and costs so much more, I am stuck with abode until a more reliable service and still affordable like abode comes along. Even this latest update was a full app crash, can’t even launch the app on an iPhone 12 with up to date iOS. Response time is not very fast, water leak sensors worked but if you don’t set up your own text or email alert then you will not get notified as abode will not call you about a leak. All in all it works, not super great but worth the money thus far in my years worth of use. Expect to do your own trouble shooting and have to tell tech support what they need to do, stay away from the motion cameras and the multi sensors are ok for temperature and light readings but don’t rely on them for motion alert coverage. Even on lowest setting and lots of distance between sensor and nearest object resulted in alarm trigger and cops all around the house at 4 am when not a sole was home.","updated":"2021-08-06T22:14:59-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7951103167","userName":"tgwaste","userUrl":"https://itunes.apple.com/us/reviews/id315638007","version":"5.3.7","score":1,"title":"Absolute Garbage","text":"This is one of the worst products I’ve ever purchased in my life.  I am trying to get it out of my house as fast as humanly possible.","updated":"2021-10-24T20:32:25-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7917144254","userName":"mesmanc","userUrl":"https://itunes.apple.com/us/reviews/id87374065","version":"5.3.7","score":1,"title":"Stay away from Abode","text":"Horrible interface. Horrible customer service. Cheap products that do not work.","updated":"2021-10-15T05:49:09-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7784679229","userName":"OrneryDawg","userUrl":"https://itunes.apple.com/us/reviews/id100273115","version":"5.3.5","score":1,"title":"Firmware updates","text":"Can’t do firmware updates,  the option in the app brings up a blank screen","updated":"2021-09-08T08:29:22-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7689215889","userName":"0-1","userUrl":"https://itunes.apple.com/us/reviews/id201157973","version":"5.3.5","score":1,"title":"Very Buggy and Laggy","text":"The app is really not reliable, and there are multiple menu buttons that don’t work.","updated":"2021-08-13T12:02:52-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7972446012","userName":"p7050","userUrl":"https://itunes.apple.com/us/reviews/id198382987","version":"5.3.7","score":1,"title":"Last update is trash","text":"Since the last update I can’t even open up the app on my phone. Thanks Abode","updated":"2021-10-30T21:13:43-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7949359213","userName":"Simon GV","userUrl":"https://itunes.apple.com/us/reviews/id984987237","version":"5.3.7","score":2,"title":"Cameras","text":"App is not very user friendly! Deleting of images and video clips is a pain!","updated":"2021-10-24T08:26:38-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7667152069","userName":"M B","userUrl":"https://itunes.apple.com/us/reviews/id37002583","version":"5.3.5","score":1,"title":"Latest version bugged: instantly crashes on open","text":"Won’t even let me open the app anymore. So infuriating!","updated":"2021-08-07T17:30:19-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8044906562","userName":"deitet","userUrl":"https://itunes.apple.com/us/reviews/id214688965","version":"5.3.8","score":1,"title":"Doesn’t work","text":"Geofencing doesn’t work at all! It does not keep track of the phone locations. Terrible","updated":"2021-11-20T10:35:43-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7756659877","userName":"Coffee & Convos with Liz","userUrl":"https://itunes.apple.com/us/reviews/id318004522","version":"5.3.5","score":1,"title":"No contact info available","text":"No contact info via the app to connect with emergency response or technical support","updated":"2021-08-31T15:22:43-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7061389911","userName":"smithc1016","userUrl":"https://itunes.apple.com/us/reviews/id243345398","version":"5.2.2","score":1,"title":"Annoying app","text":"HomeKit often loses connection to the Abode IOTA. When connection is lost, I am forced to manually unplug and reboot the base station to get it to connect to HomeKit again.","updated":"2021-03-03T10:55:53-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8129228433","userName":"DanMedStudent","userUrl":"https://itunes.apple.com/us/reviews/id24232977","version":"5.3.8","score":1,"title":"New issue: always wants me to re-login","text":"Not sure why but nowadays the app always wants me to re-login when I launch it.","updated":"2021-12-14T05:44:11-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7985252423","userName":"raprtip","userUrl":"https://itunes.apple.com/us/reviews/id140518325","version":"5.3.7","score":1,"title":"Run do not get this system","text":"Cameras always offline, terrible customer service","updated":"2021-11-03T10:55:13-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7717235663","userName":"RonMoff","userUrl":"https://itunes.apple.com/us/reviews/id387370051","version":"5.3.5","score":1,"title":"Do not buy.","text":"Save yourself the money and aggravation. This never works, I write this now as my gateway is offline for the 10,000th time.","updated":"2021-08-21T00:22:42-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6169948095","userName":"Me212312","userUrl":"https://itunes.apple.com/us/reviews/id109170766","version":"5.0.2","score":1,"title":"Terrible new app!!!","text":"Used to work fine until new app was released. Now it is glitchy and   messy","updated":"2020-07-07T16:30:40-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7893711477","userName":"JustinInAtlanta","userUrl":"https://itunes.apple.com/us/reviews/id15992360","version":"5.3.7","score":1,"title":"Doesn’t work","text":"The app no longer loads, just a logo and a loading spinner. It’s physical keypad only for me now.","updated":"2021-10-08T20:00:18-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7906703377","userName":"littlefb","userUrl":"https://itunes.apple.com/us/reviews/id33066503","version":"5.3.7","score":1,"title":"Terrible customer service","text":"So hard to get any help","updated":"2021-10-12T07:17:10-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6521555258","userName":"Mariano Americano","userUrl":"https://itunes.apple.com/us/reviews/id488716471","version":"5.1.2","score":1,"title":"This app needs daily updates!!!","text":"This app is so buggy that it should be updated on daily basis.","updated":"2020-10-10T12:39:31-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6189826558","userName":"4x13","userUrl":"https://itunes.apple.com/us/reviews/id237573643","version":"5.0.2","score":1,"title":"Broken app","text":"New version is broken. Fan control doesn’t work. Ecobee doesn’t work. Buggy app.","updated":"2020-07-12T09:44:24-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7674098433","userName":"Tamarindophoto","userUrl":"https://itunes.apple.com/us/reviews/id188756780","version":"5.3.5","score":4,"title":"Good","text":"Good","updated":"2021-08-09T12:59:13-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8074679780","userName":"808Miles","userUrl":"https://itunes.apple.com/us/reviews/id669095286","version":"5.3.8","score":1,"title":"Set up has been a nightmare","text":"Can’t activate my proplan among other problems so far.","updated":"2021-11-28T18:04:45-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7771955604","userName":"dismayed buyer","userUrl":"https://itunes.apple.com/us/reviews/id103878201","version":"5.3.5","score":3,"title":"Poor instruction guides","text":"Explanation on turning off alarms are not easy to follow.","updated":"2021-09-04T18:00:34-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8092406987","userName":"wsfuller","userUrl":"https://itunes.apple.com/us/reviews/id149391988","version":"5.3.8","score":1,"title":"Cant sign in","text":"Sign in broken on app. Unable to access anything. HomeKit integration broken.","updated":"2021-12-03T18:58:29-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7706796553","userName":"see77777","userUrl":"https://itunes.apple.com/us/reviews/id433373711","version":"5.3.5","score":1,"title":"Cameras never function","text":"The cameras never work. I have Amcrest cameras for free and I never have issues like this. Plus Amcrest is free.","updated":"2021-08-18T05:11:49-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7983124926","userName":"USACaper","userUrl":"https://itunes.apple.com/us/reviews/id1104720916","version":"5.3.7","score":5,"title":"So far, so good!","text":"So far, so good","updated":"2021-11-02T20:48:52-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6267726168","userName":"SweetestEvil","userUrl":"https://itunes.apple.com/us/reviews/id24054889","version":"5.0.4","score":3,"title":"Widget is confusing","text":"The icons need help","updated":"2020-08-01T08:20:25-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8048141871","userName":"SkyMac5287","userUrl":"https://itunes.apple.com/us/reviews/id109558273","version":"5.3.8","score":1,"title":"Follow up to a previous one star rating: Great idea terrible follow through","text":"It’s a great idea to have a truly HomeKit integrated security system, but their follow through is terrible and their customer service is a joke. It took a week just to get a phone call to buy the system, there’s zero help or support when something goes wrong, there is no help or contact us button in the app, and it has de-integrated twice in the past month and every time it does, I have to set up each and every window and door sensor in each and every room, organize them to the rooms I want them in in HomeKit, and redo all the automations. Which means the more products and equipment you get from them, the harder it is and longer it takes to set it up again. And after months of having the system with several instances of having to set it up several times in HomeKit, my keypad battery is low-totally fine and to be expected. However, I plug it in to charge it and have no way of knowing what the actual battery level is. Is it even charging? The symbol is green so I suppose it is, but the base station continues to beep at me every 30 seconds and there is no percentage indicator anywhere in the app as to the battery level. Is it at 1% or 50%? Will I know when it’s done charging? If anyone else integrates with HomeKit, I’d likely leave Abode, even if it meant losing all the money I paid for equipment. Honestly, here’s hoping they get their act together and focus on UI and UX because when you’re claim to fame is integrating with Apple, I think we expect more.","updated":"2021-11-21T07:38:16-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8020605329","userName":"daveinptld","userUrl":"https://itunes.apple.com/us/reviews/id225641921","version":"5.3.8","score":1,"title":"Confusing set up info.","text":"Crappy set up.","updated":"2021-11-13T11:37:34-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8020920813","userName":"codemannh","userUrl":"https://itunes.apple.com/us/reviews/id8254141","version":"5.3.8","score":1,"title":"Don’t bother","text":"The app is just like the rest of Abodes equipment. Highly questionable.","updated":"2021-11-13T13:56:05-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8140663040","userName":"ttttt i","userUrl":"https://itunes.apple.com/us/reviews/id293090551","version":"5.3.8","score":1,"title":"Firmware. Update","text":"The firmware does not update","updated":"2021-12-17T12:26:57-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7330440099","userName":"SeattleGlen","userUrl":"https://itunes.apple.com/us/reviews/id483957401","version":"5.3","score":1,"title":"Buggy app, not yet prime-time","text":"I feel that Abode is making a good effort at making this work, but are releasing products and app updates too early, without proper testing.\n\n I installed the Iota gateway and Outdoor Smart Cam; setup was pretty smooth, but the IOS app won't hold onto certain settings (like camera sensitivity), and some functions do not work correctly; (when I turned-off notifications to mobile devices on image capture, it ignored the setting and continued sending alerts) Some system settings exist in the IOS app that don't in the web app, another indication they are getting ahead of themselves.\n\nDocumentation is basic, which for many functions and devices is fine, but the myriad settings within Abode are not well explained. Some have a useful note, many don't, and the interactions between certain settings are unclear. In my perfect world, each setting should have a little (i) alongside that when clicked would describe the setting and its interactions thoroughly.\n\nAlexa integration went fine initially, but a simple Alexa routine to trigger an audio alert on camera motion and start the video feed on an Echo Show would fail about every third time. While this could certainly be on Amazon's side, it's still not a good experience for a security solution.  That said, getting video within the Abode app worked consistently for me. \n\nI've had several interactions with three of their support team, both via email and phone, most quite positive. \n\nI so wanted this to work, but for a security system I need to rely upon, Abode is not yet prime-time.  Too much beta testing with production customers, which might be fine for a music app, but for home security, unacceptable to me.","updated":"2021-05-12T10:37:14-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7991070209","userName":"mikeacatl","userUrl":"https://itunes.apple.com/us/reviews/id132914011","version":"5.3.7","score":2,"title":"Abode App","text":"Navigation not good.","updated":"2021-11-05T04:57:14-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8120679334","userName":"king hotone","userUrl":"https://itunes.apple.com/us/reviews/id1346879854","version":"5.3.8","score":1,"title":"Abode app","text":"The worst system ever !!!!","updated":"2021-12-11T18:44:58-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8055734557","userName":"cc cc ccccc","userUrl":"https://itunes.apple.com/us/reviews/id15521822","version":"5.3.8","score":1,"title":"Fails to maintain setup","text":"Help","updated":"2021-11-23T11:56:52-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1803040450","userName":"Son D.","userUrl":"https://itunes.apple.com/us/reviews/id21207877","version":"3.95","score":4,"title":"Great product, app could use some improvements","text":"Overall I’ve been really happy with Abode. Installing the sensors was easy and they were all recognized by the app without any issues. \n\nThe app is responsive and changing the system status is a breeze. I often use it instead of the key fob since my phone is always on me. Getting notifications of the status change is great since it lets me and my wife know that we didn’t forget to arm the system.\n\nI’ll echo two suggestions that have been mentioned: 1) battery life needs to be improved and 2) more settings should be available within the iOS app rather than the web app. The battery drain is the biggest issue for me. According to iOS, Abode is one of the biggest battery drains for me yet it’s active on the screen for only a few minutes in the past week. Most of the battery drain is in the background. I’ve disabled the feature to arm/disarm the system based on my location yet it’s still draining my battery.","updated":"2017-09-21T22:22:21-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1622254619","userName":"sk44tyler","userUrl":"https://itunes.apple.com/us/reviews/id101349940","version":"3.89","score":4,"title":"Great App - Needs better battery life","text":"Let me start off by saying I love the abode product and think it's the best security system on the market. In general I really enjoy using the mobile app. I really only have 2 areas that I think could be improved. 1) Geofencing - while the core functionality of the geofencing is fantastic, it really drains the battery life on my iPhone 6s. I'm hoping there is a way of optimizing the way the Abode app is using GPS for geofencing in a way that will prolong battery life. 2) Certain settings cannot be changed from the mobile app. There are two potential ways to address this - either update the mobile app to support more setting changes or make the website more mobile compatible. Currently when accessing the website from a phone, the site is almost unusable. You have to go to landscape mode just to see certain things...  even then, some things are impossible to do through your phone. \n\nOverall a fantastic product and app...","updated":"2017-05-23T13:22:16-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1707076939","userName":"AreuSleepy","userUrl":"https://itunes.apple.com/us/reviews/id294624688","version":"3.93","score":4,"title":"Love the system, could use some refinement","text":"The system works great!  Super customizable, fast notification.  With any software there can be improvements.\n\n1. The main screen/ page- would be nice if it had a simplified arm / disarm button.  \n\n2. Device list - Allow for organize by type, name, or room.\n\n3. Allow same functionality as web app- edit setting within the app\n\n4. Image capture- show the name of the user who took the image\n\n5. Limited access accounts, for kids. \n\n6. Allow custom sounds for door chime.\n\n7. Support with skybellHD\n\n8. Custom \"modes\"- be able to fine tune multiple modes and name them.  Not super important.  Rational. We have a hot tub on back porch, I would like to create a separate \"home\" arm command to have all the same settings and ignore the back door.  \n\n9. The \"protect your home while away\" pop up is quite annoying, I get it's part of the business, maybe just keep it on one page. \n\n10. Watch OS app.\n\nLike I said, solid hardware, solid app.  Could alway use more software awesomeness.  Good job Abode!","updated":"2017-07-31T18:18:29-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"2879989383","userName":"dsnatale","userUrl":"https://itunes.apple.com/us/reviews/id25326083","version":"4.1.1","score":3,"title":"Not quite there yet","text":"Overall I am pleased with abode, but I think the price is a bit high for the quality of the app.  I like the automation capabilities and ease of use. The unit also switches appropriately between WiFi and cellular in the event of service disruption. The camera I bought is HD, yet the quality is relatively low and you can’t maximize the view in the app. As far as I know the only way to capture video is during 30 second frames offloaded to a mini SD. For whatever reason when I press record, nothing happens. This worked previously but I may need to reset the base station?  The “online” storage doesn’t continuously record and only keeps a record of events. Handy but not entirely clear in the advertising. I also have no ability to test the alarm to see if the connection actually works in the event of an emergency. With all the sensors, camera and subscription I’ve invested over 1k.","updated":"2018-07-10T12:42:08-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1853168065","userName":"christian.j.allen_","userUrl":"https://itunes.apple.com/us/reviews/id139222274","version":"3.96","score":5,"title":"A True Review","text":"First off, some of these reviews are asinine. Panic buttons and not being able to see well in the dark sounds like personal issues. An issue that should have been resolved with research before purchasing a security system.\n\nI find that the IR technology works fairly well in the dark. If someone comes through my doors, I will definitely be able to see their face.\n\nMy favorite feature about this system is the live streaming camera. From my phone, I’m able to speak through my Echo dot and look through my Abode Live Stream camera allowing me to talk to my dog who has anxiety. One feature that I wish Abode could improve is saving more that 7-8 seconds of video.\n\nAbode’s customer service is “on point.” I had an issue where the live video stop recording sound. I called Abode and they resolved the problem within minutes. They were kind and answered all of my questions.\n\nSure, there are other security services. Possibly some with better cameras or with panic buttons. Nonetheless, for the price of his system, I am more than pleased.\n\nI hope Abode continues to integrate with Nest. Hopefully, Abode can start producing outdoor cameras and doorbells.","updated":"2017-10-16T09:28:20-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"3612344177","userName":"santosanto1235","userUrl":"https://itunes.apple.com/us/reviews/id373719391","version":"4.1.8","score":5,"title":"Great System!!","text":"Had been working flawless after 6 months, with sensors and motion camera, aftermarket also always works,it has become the brains of my smart home and never fails with Alexa, bulb lights, and Nest smoke sensors. Automations also never fail. It does take a little tech savvy to use all functions though, someone with little tech skills could get frustrated with some features like integrations and automation. The only issue I have is the fact you can’t have more than one location working on the mobile app. You would have to log out  to change from work to home for example, which is impractical. But I understand that it takes probably some major changes to the app and the system to allow for that.","updated":"2019-01-04T12:12:22-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"5594384094","userName":"sfdieseldad","userUrl":"https://itunes.apple.com/us/reviews/id31140664","version":"4.3.7","score":1,"title":"App can’t provision a new user","text":"I got an invite from another user to join an abode home.  The link takes me to a page where I enter user information and the password (twice). I get an error saying the user name and sword don’t match.  Odd error when trying to set up a new account.  So I figure maybe I set up an account for my email address and I forgot. I go to the log in page, enter my email address and click on ‘forgot password’. I get an error saying there is no account.  So I can’t create an account for an email address because it already exists and I can’t get the password for an account for an email address because it doesn’t exist.\n\nI can’t comment on the actual features of the app since I can’t login.  Given that simple provisioning (which tens of thousands of other applications have accomplished) has not been mastered by this app yet, I’m not optimistic.","updated":"2020-02-28T17:45:58-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"5010569299","userName":"mlgreene","userUrl":"https://itunes.apple.com/us/reviews/id41930041","version":"4.2.9","score":5,"title":"Needs some work.","text":"The app gets [most of] the job done. There’s still a lot that has to be done using the web app on a computer. Abode has been talking about adding HomeKit support for quite some time. I would honestly rather have the team invest in updating and bringing the app to 2019 than continue to work on something that must been too difficult to accomplish. It appears the app is essentially a web app embedded within an app. At this point in time, this shouldn’t be considered a permanent solution. I would encourage the team to develop a native app with a cleaner and more intuitive interface. Overall, the system works very well. What can set Abode apart is a reimagined app.","updated":"2019-10-24T22:07:53-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"2234070225","userName":"SamsocaI","userUrl":"https://itunes.apple.com/us/reviews/id387145161","version":"4.0.3","score":4,"title":"Very good","text":"I am very happy with the Abode alarm system. It was easy to install and set up. I like that it integrates seamlessly with Alexa and IFTTT. The iOS phone app works well. I don't have any of the battery drain issues that others have complained about. I rarely open the phone app. I love the widget. It allows me to perform the basic arm/disarm functions on a daily basis. My only suggestion for improvement would be that home mode should enable any group of devices that I select, including some motion sensors. This should not be difficult to implement in firmware.  I recommend Abode hardware and software to everyone.","updated":"2018-02-21T21:08:00-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6044587502","userName":"Jrfount","userUrl":"https://itunes.apple.com/us/reviews/id509352381","version":"5.0","score":2,"title":"Big changes but loss of location services","text":"After uninstalling and reinstalling the app and my existing cuts I’m still receiving an error stating that location services are not turned on. Pretty major breakdown to let that slip through the cracks during testing. \n\nOne small item also, who’s idea was it to change the layout from standby, home, away to home away standby?  The years of muscle memory going up in smoke with new icons to boot. A small item to be sure but a huge annoyance until I get used to it. \n\nAll in all this looks like an attempt at a huge leap forward but location services need to be addressed before it’s anything but a step backwards.","updated":"2020-06-06T17:27:13-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"2363982544","userName":"Schicker263","userUrl":"https://itunes.apple.com/us/reviews/id378793927","version":"4.0.3","score":4,"title":"Saved us from water damage!","text":"I would rate our Abode System a 5 except that we have to leave a lamp on in the room were our video camera is set up in order to see live streaming at night. We recently had a huge snow storm followed by rain and  a basement window started to leak.  Our moisture sensor alarm went off. (we were in another state for the winter). We were able to contact a neighbor who ran over and negated the issue before damage was done.  So happy we have the moisture sensors!!  We have 2 door alarms, two cameras, and 3 moisture sensors.  Love the system!","updated":"2018-03-30T08:23:59-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6042728474","userName":"KilgoreTuna","userUrl":"https://itunes.apple.com/us/reviews/id37946553","version":"5.0","score":2,"title":"Version 5.0 looks good, but broke location services","text":"Every time my wife or I enter or leave the geofence, we both get notifications that the other phone has location services turned off despite the fact that they both are turned on. Most importantly, the auto arm Automation when the last phone leaves does not arm the system.  From other similar reviews, it sounds like this is a systemic issue.  No response from Abode support so far.  \n\nOne positive is that it looks like they may have a finally fixed the background activity battery drain issue that had been killing my phone battery for years.","updated":"2020-06-06T06:32:10-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6056488307","userName":"wyodave","userUrl":"https://itunes.apple.com/us/reviews/id37948072","version":"5.0.1","score":4,"title":"Location services fixed!","text":"Lates update corrected the issue I was seeing with location services. Back to the way it was working with the previous app, which means it is working perfectly for my use case of two iPhones and setting the alarm based on leaving or coming home automatically. Nice job. Given the huge overhaul the app received not surprising to have an issue or two but well done on fixing it quickly.","updated":"2020-06-09T15:51:16-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"5462603928","userName":"Mad I wasted a dollar","userUrl":"https://itunes.apple.com/us/reviews/id42725892","version":"4.3.4","score":1,"title":"Don’t even try it.","text":"My experience with Abode has been horrible.  The customer service is terrible.  It is, hands down, the worst customer experience I have ever had.  \n\nThe app is glitchy.  The equipment doesn’t work consistently.  And the pricing is confusing.  They charged me for the same service twice and won’t refund the money.  The sensors don’t stay linked to the main gateway.  I use a eero mesh network and get better than 100mbps in every corner of my home... yet the cameras (which are also the main motion detectors for the security system) either won’t connect or take forever to load.  It’s difficult, near impossible to get anyone on the phone.  When you send emails to them, it takes days to respond.  \n\nThis is a home security company.  Let that sink in for a minute.... when there is an issue with the performance of their equipment or service... it takes DAYS to resolve.  \n\nDoes that make you feel secure?  \n\nTotal waste of time and money.  Worst customer experience I’ve ever had in my life.","updated":"2020-01-29T06:57:41-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6051073869","userName":"ArnontPoly","userUrl":"https://itunes.apple.com/us/reviews/id28205596","version":"5.0","score":1,"title":"Looks nice but not working properly","text":"Like the newest review said location service is not working. I am having the same issue. Either my fiancé phone or my phone get a notification from abode saying location service turned off but in the app and on the phone setting location service is turned on. Also I’m having issues with the cue automation. Some of the automation I program keeps disappearing I.e. set abode to standby in the morning. So lately my alarm keeps getting trigger when I open the door to leave for work. Very frustrating when that happens. No matter how many time I reprogram the cue automation it keeps disappearing.","updated":"2020-06-08T07:43:34-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"4374458292","userName":"Pumpintuner","userUrl":"https://itunes.apple.com/us/reviews/id170468564","version":"4.2.0","score":4,"title":"Great security but with a cost to your phone","text":"I chose this security system because of the IFTT integration and its own automation process. Is smart system that works well with your home. I leave and it arms itself then disarms when I arrive home. Only reason why it loses a star is because it drains your battery pretty badly. I noticed it uses over 40% as it sits in the background for location services, so an update is necessary to correct this issue. Overall good app","updated":"2019-06-26T17:25:09-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"5365990943","userName":"Earnestblimp","userUrl":"https://itunes.apple.com/us/reviews/id12150325","version":"4.3.3","score":1,"title":"Hardware is mostly good, software is junk","text":"I’ve had this system for a year now, and installed just about every sensor they sell. The quality of most of the hardware is decent, but the app is just junk. It’s so bad that I can’t even use it sometimes to turn off the alarm when I get home, so I have to run inside quickly to disarm via the keypad, just incredibly frustrating. The app rarely shows the right status, takes forever to open, yeah it’s just garbage, written by beginner programmers, and it rarely gets updated. Abode should be embarrassed by the quality of the app honestly, it’s really holding the product back.","updated":"2020-01-05T15:21:32-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6104583538","userName":"umwmike","userUrl":"https://itunes.apple.com/us/reviews/id34183234","version":"5.0.1","score":2,"title":"Good update but buggy","text":"I didn’t have the old app long before it upgraded to this one so for me it looked like a long overdue GUI update; however, the app itself is buggy and now it doesn’t show any of my devices online even though they are and I can confirm with the web version that they are. \n\nIt’s really annoying to not be able to see the status of my devices. I’ve tried uninstalling / logging out and it still won’t pick up my devices. Can’t really recommend this app or company until the bugs are fixed.","updated":"2020-06-21T07:03:35-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6102356076","userName":"bberg user","userUrl":"https://itunes.apple.com/us/reviews/id43399320","version":"5.0.1","score":1,"title":"Forget this","text":"That’s not the right F word but I want this review to post. This new app is absolute garbage. My alarm system which worked perfectly for almost 2 years has been rendered, well worse than useless. If it just didn’t work that wouldn’t be one thing. But it is setting off my alarm all the time because the geofencing doesn’t work anymore. \nIt is deafening and frightening to my family and our pets. \nMy phone connects instantly to my wifi and once open the app still takes ~20 seconds to register me hitting standby mode. \nThey should throw it out and go back to the old app. This is not working.","updated":"2020-06-20T17:57:17-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1314698500","userName":"shred_86","userUrl":"https://itunes.apple.com/us/reviews/id43563074","version":"2.2","score":5,"title":"Promising home security system","text":"Abode is a brand new and promising home security system with a lot of potential to be the best choice for home owners and small businesses. The iOS app is well organized and easy to use. There’s a couple minor bugs and features the app could use, but this is just the beginning for Abode and the developers are actively listening to customer inputs to continue improving the app experience.","updated":"2016-01-10T22:27:00-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"2016490725","userName":"Gabriel B","userUrl":"https://itunes.apple.com/us/reviews/id37569940","version":"3.98","score":4,"title":"One little thing","text":"Loving the system so far, but I find it strange that the widget doesn’t require Touch ID or a passcode to use. If someone stole my phone and new my house, they could easily disable my alarm. I have a similar issue with the keychain - folks should be required to use a passcode or some form of authentication to disable the alarm. Fix this (the Touch ID with widget) and you’ve got a much smarter product.","updated":"2017-12-21T21:25:17-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1592108596","userName":"Jimmyz64","userUrl":"https://itunes.apple.com/us/reviews/id36825924","version":"3.88","score":5,"title":"Top Notch Security System !!","text":"I had just received my Adobe System and had it up and running in about an hour. I install commercial security systems for a living. I must say, for this being a wireless system, it is far better than some of the wired systems I've worked with. Plus there are so many possibilities for My Adobe protected Home !!!!!  Best purchase I have made in a long time !!!!!!!!!!!!!!!!","updated":"2017-04-18T17:07:28-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1453974759","userName":"gatti956","userUrl":"https://itunes.apple.com/us/reviews/id110621920","version":"3.80","score":1,"title":"automation now broken","text":"The app was just updated and  now the automation is touch and go.  Prior to the update, both phones tied to the automation correctly set the alarm when the phones left the house and turned off the alarm when the first phone arrived home.  Now it works when it wants to, i have to pretty much be at my door before the app turns off the alarm, and other times it doesn't turn it off at all and i have to manually do it.  I've emailed them and no response.  Please change it back! One of the reasons i got this alarm was to never have to set or turn off the alarm....","updated":"2016-09-22T06:45:05-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6009589849","userName":"Rebecca K. 2013","userUrl":"https://itunes.apple.com/us/reviews/id100665310","version":"5.0","score":2,"title":"Glitches","text":"This new app has a lot of issues when it comes to the geolocation and automations. The app does not recognize that my phones location services are turned on so none of the automations or geolocation day work for me. Very disappointed as everything worked right before the new app was released. The app has also disarmed my “home” alarm at night because my husbands phone was in the house 😑. That is not safe or practical. \n\nPlease fix these glitches.","updated":"2020-05-29T07:48:53-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"5297745091","userName":"JW0000001","userUrl":"https://itunes.apple.com/us/reviews/id86810719","version":"4.3.3","score":5,"title":"Awesome with HomeKit.","text":"Works great with HomeKit and location based automations. App is great for viewing the status of alarm, sensors, etc. Only thing lacking is being able to change the notifications within the app as opposed to the web based login. Aside from that, everything else is awesome.","updated":"2019-12-20T17:31:23-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1960990628","userName":"GrantMN","userUrl":"https://itunes.apple.com/us/reviews/id33079683","version":"3.97.1","score":3,"title":"Good, could be better","text":"I like the Abode system so far.  It was easy to setup.  My only gripes so far are with the web admin and app.  The web admin doesn’t work on my phone for all areas of the admin, some features don’t fit on the screen so I have to switch to my laptop or iPad to change those setttings.  And not all functions work in the app.  Plus the app only works in portrait mode.  I rarely use portrait mode on my iPad so having to switch is annoying.","updated":"2017-11-30T17:26:28-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"5177191091","userName":"nvee3","userUrl":"https://itunes.apple.com/us/reviews/id33480773","version":"4.3.2","score":4,"title":"HomeKit! So happy now","text":"Thank for all the programmers and people that worked on this! We finally have HomeKit! Have all my sensors, cameras and locks in one place. I wasn’t going to renew my subscription but now I am. This is so great. Only 4 stars because I’m still learning. Really easy integration with HomeKit. Good job. \n\nPS can we get HomeKit secure video? I’ll buy more cameras from you 👍","updated":"2019-11-21T07:37:33-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"5205978602","userName":"mellenhead81","userUrl":"https://itunes.apple.com/us/reviews/id156471808","version":"4.3.2","score":5,"title":"Best DIY Security System do your research!!","text":"We’ve had this for several years now and it’s awesome.  Long range door and window sensors are top notch and always give instant alerts to your smart phone via the Abode App.  Motion cameras are a great feature and will keep expanding with future products and updates.","updated":"2019-11-27T19:19:06-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"2307097112","userName":"PRAppReview","userUrl":"https://itunes.apple.com/us/reviews/id28321741","version":"4.0.3","score":4,"title":"Sometimes","text":"Good app overall.  Lots of functionality that seems to work.  I have, almost daily, had to restart the app to get it to continue what I wanted to do.  Adding a device, load my devices, look at the history, etc.  Sometimes it works and sometimes it doesn’t.  Consistency would bump it up to 5 star.","updated":"2018-03-14T20:11:18-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6009920763","userName":"Emarko88","userUrl":"https://itunes.apple.com/us/reviews/id279730521","version":"5.0","score":1,"title":"Location Assistant is Still Bad","text":"My biggest issue with the previous iteration of the app was the location assistant. Too often, I’d open the door and have to scramble to disarm the system before the alarm went off because it didn’t go to standby based on my location. Now I still have the same issue, but occasionally it will switch to away mode randomly. It’s woken me up a couple times. I don’t have this issue with other location based apps.","updated":"2020-05-29T09:25:45-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1412148047","userName":"LookIntoMyEyees","userUrl":"https://itunes.apple.com/us/reviews/id143273466","version":"3.77","score":5,"title":"Bright future ahead!","text":"This system is great, the name \"Abode\" could easily become a household name. Everything works flawlessly. They should work on outdoor streaming cameras and Better features and implementations. Not everything is perfect but for what it is now, it is solid. Like I said, they have so many potentials.","updated":"2016-07-14T21:03:48-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6041069417","userName":"Jay\"snooks\"","userUrl":"https://itunes.apple.com/us/reviews/id145657179","version":"5.0","score":3,"title":"Location service broken","text":"I don’t like to leave reviews but a key features that made me love this system besides HomeKit , was the auto away and auto home .... new update is beautiful and I enjoy the appeal of it but I notice my auto away was not working. \nI deleted the app\nI reset the location services\nStill not working. \nLove abode please fix this issue","updated":"2020-06-05T21:03:22-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"4673879246","userName":"machead85","userUrl":"https://itunes.apple.com/us/reviews/id15112355","version":"4.2.6","score":3,"title":"Pretty good but needs some work","text":"Number of settings you have to do on a web browser which is a bummer versus in the app. The automations are really easy to use although I’m hoping for more functionality in the future. My biggest issue which is why it’s a three star rating is how much this app hurts my battery life on my iPhone. The background usage is too high in my opinion.","updated":"2019-08-25T14:32:45-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1539375959","userName":"oasullivan","userUrl":"https://itunes.apple.com/us/reviews/id11364954","version":"3.85","score":2,"title":"Battery killer","text":"My battery started dying quickly over the last few days.  I finally went into the battery settings menu to look at usage and this app had used 41% of my battery usage over the past three days.  It appears to be misusing location services.  This is a new issue with the app as I have had it on my phone for six months or more and have never had this issue before.","updated":"2017-02-07T09:03:25-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1822681619","userName":"noahhurst","userUrl":"https://itunes.apple.com/us/reviews/id38273378","version":"3.95","score":1,"title":"Things they don’t tell you.","text":"1.) The abode app has a pretty intrusive ad if you don’t pay for the monitoring service. You can’t close it or hide it.  If you can hide it they make it incredibly descreet.\n\n2.) The camera resolution is awful in the dark. If someone comes by in a dark room it would do you no good. Since you are forced to get it what can you do.\n\n3.) The stickie things will destroy your wall when you take them off.\n\n4.) you can’t turn off SOME of the email alerts.  I don’t understand why they prevent you from doing this.  Every time you set the alarm you get an alert and an email.  It was really annoying.\n\nI returned mine and had to pay a % restocking fee.  Which is silly.  I understand a flat rate.\n\nAll in all I would not buy again and would advise others not to buy.","updated":"2017-10-02T06:15:41-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1387927553","userName":"Chicago Mike617","userUrl":"https://itunes.apple.com/us/reviews/id23435589","version":"3.75","score":4,"title":"Outstanding product from beginning","text":"Products and app have both been super easy to work with (including set up) and am very excited at the level of quality. Abode offers impressive capabilities and can't wait for more as they prepare to roll out additional features.","updated":"2016-06-02T10:24:26-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1463885877","userName":"bhawk22","userUrl":"https://itunes.apple.com/us/reviews/id42885563","version":"3.81","score":5,"title":"Excellent. Reliable. It just works","text":"I tried Scout. It was bad. I tried SmartThings. Devices kept disconnecting. I was skeptical of another DIY security system. But I decided to give Abode a try. And I couldn't be happier. It integrates with Nest. It has home automation features. I get security and automation in one app. It's reliable. It just works.","updated":"2016-10-09T08:58:17-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"5993546605","userName":"Devin Mz","userUrl":"https://itunes.apple.com/us/reviews/id86481986","version":"4.4.0","score":3,"title":"Live Stream Doesn’t Work","text":"App is great in regards to setting and disarming. \n\nHowever, getting live feed for the 1080p streaming camera is non-existent. It will work in the Safari browser, as well as on the web app. I have installed and reinstalled the app multiple times, as well as restarting gateway, restating camera, and even factory resetting the camera.","updated":"2020-05-25T14:26:27-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1653795717","userName":"Daddyrockyou","userUrl":"https://itunes.apple.com/us/reviews/id358639734","version":"3.91","score":3,"title":"Unintuitive app and won't stop advertising","text":"I really like the abode system. It was very easy to purchase and set up. However the app is not very intuitive to me and I find myself searching for things.\n\nThe app is also very limited. Many times it tells me to go to the desktop website to perform actions.\n\nMy biggest complaint though is that it keeps trying to sell me monitoring even though I already have the connect plan. There's no way to disable the advertisement that I can find.\n\nUpdate: adding a star as I realized the connect plan doesn't come with monitoring. However it would be nice to disable the advert and enable on demand monitoring elsewhere in the app.","updated":"2017-06-22T13:12:10-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"5245691590","userName":"mjbryan8","userUrl":"https://itunes.apple.com/us/reviews/id104180748","version":"4.3.2","score":5,"title":"Great!","text":"Abode is amazing for home automation and security and can tie into a lot of other products and apps with zwave and other types of tech. \n\nHighly recommend for anyone looking for a la carte style home automation and security. The leak detectors are a life saver.\n\nApp works great no complaints here with the app.","updated":"2019-12-07T12:39:37-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1989501263","userName":"Vv_bad habit_vV","userUrl":"https://itunes.apple.com/us/reviews/id672612957","version":"3.98","score":4,"title":"Fantastic","text":"I’m an owner for over a year. The system is fantastic. New features and a hard working team. Taking a star off for limited support and a few features which have been requested for a while yet not implemented (2 factor for example).","updated":"2017-12-11T19:09:47-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1454748937","userName":"Honor9875","userUrl":"https://itunes.apple.com/us/reviews/id307421796","version":"3.78","score":5,"title":"Love it","text":"Phenomenal system. Initially I had some issues with the adhesive on the monitoring devices. I recommend picking up some heavy duty double sided tape for installation. Application works just as it should. I've been talking about it so much that my friend just purchased one as well.","updated":"2016-09-23T17:53:17-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6065591502","userName":"Cuboy531","userUrl":"https://itunes.apple.com/us/reviews/id218615336","version":"5.0.1","score":5,"title":"Geofencing fixed with 5.0.1","text":"Geofencing works now. Update your app and give it a go. Abode is listening to our concerns and I have only purchased the unit about 2 weeks ago. Awesome home security system. A+","updated":"2020-06-11T22:11:03-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"5366014510","userName":"jj2476!!","userUrl":"https://itunes.apple.com/us/reviews/id28702336","version":"4.3.3","score":2,"title":"Just not reliable","text":"This thing was fine for a while now it doesn’t turn on or turn off. Today it wouldn’t turn off and of course the siren went off and we had to turn the alarm off altogether, totally defeating the purpose of it. The cameras and sensors are finnicky and the app is slow and cumbersome. I will be moving on to another proprietor.","updated":"2020-01-05T15:30:42-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6018813816","userName":"Dr.Gregory.Lopez","userUrl":"https://itunes.apple.com/us/reviews/id36195728","version":"5.0","score":1,"title":"Don’t release junk - test it first","text":"The new app killed the ability to control non-abode switches from my phone.  Now I have to create a QuickAction to turn-on and another to turn-off my smart switch?!  The ability to control a non-abode device from the device list is gone!  Please fix ASAP.  \n\nAlso Apple Smart Home integration doesn’t work despite their claim and doesn’t even show on the web app.","updated":"2020-05-31T12:04:11-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"4477178609","userName":"Baqar22","userUrl":"https://itunes.apple.com/us/reviews/id384475964","version":"4.2.1","score":1,"title":"Draining battery so fast","text":"Since I installed this app my battery started draining within 6 hours, I had new battery but problem persists. Then I did some research and figured out Abode app had location service set as always. I reset it to while using app, and problem solved. My phone is working fine now but now abode is unable to detect if I am inside home or not, but I will live with that instead of having my phone on charger most of the time.","updated":"2019-07-17T17:24:13-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6051289461","userName":"ecam10","userUrl":"https://itunes.apple.com/us/reviews/id177998643","version":"5.0","score":1,"title":"Terrible Update","text":"How this app got through QA is a mystery to me. As other have mentioned, location services don’t work with two people. If one leaves and the other is still in the geofence it will still trigger away. Also, notifications won’t stay. Tried to shut off my “front door opens” notification in the app, and once I leave the page, it reverts back to on! Complete garbage","updated":"2020-06-08T08:48:33-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"2803466152","userName":"Trivia Eddie","userUrl":"https://itunes.apple.com/us/reviews/id101041256","version":"4.1.1","score":3,"title":"App crashes upon opening with Face ID enabled","text":"The product is great, but app needs some work. Not everything is available through the app and if you enable Touch ID on an iPhone X it crashes on load. If you delete the app, reinstall it works again until you enable this feature. Must not be ready for Face ID.","updated":"2018-06-30T04:28:26-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1674698385","userName":"mikee1680","userUrl":"https://itunes.apple.com/us/reviews/id26662670","version":"3.92","score":4,"title":"Works great!","text":"App works great!   Wish everything could be set through the app, instead, of having to go through the browser.  \n\nPlease release an Apple Watch app soon.","updated":"2017-07-08T18:55:27-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6105141285","userName":"theyoungestones","userUrl":"https://itunes.apple.com/us/reviews/id42405506","version":"5.0.1","score":5,"title":"Geofencing","text":"Seems like they fixed the things in the latest update. It’s nice to also see Google Nest Cam support, first 3rd party group I’ve seen to support it since Google ended “Works with Nest”","updated":"2020-06-21T10:06:47-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"3837229160","userName":"Honeybun74","userUrl":"https://itunes.apple.com/us/reviews/id478230680","version":"4.1.8","score":3,"title":"Where Is It?","text":"The app does the basic functions of arming and disarming the security system. \nMy biggest problem with it is organization- WHERE to find all the many functions. I’m STILL poking around trying to find the SMS/email switches for notifications. I know they’re in there somewhere, I saw them two days ago...","updated":"2019-03-03T05:06:54-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6024121490","userName":"pup975","userUrl":"https://itunes.apple.com/us/reviews/id21979929","version":"5.0","score":1,"title":"Don’t download this. It’s super buggy","text":"Did they even test this app before they released it? Location services broken. Notifications are broken. Naming devices is broken. This is highly disappointing as this is a security system. It needs to work properly for me to think it’s reliable and protecting my property. No acknowledgement from the company that they screwed up.","updated":"2020-06-01T20:06:29-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6016641087","userName":"rovingdan","userUrl":"https://itunes.apple.com/us/reviews/id41987823","version":"5.0","score":2,"title":"New design better except camera view","text":"Better overall design except now I can not have the camera feed full screen on my phone and it’s too small to see what’s going on.  Kinda pointless having a camera now.  Do you actually test your software?","updated":"2020-05-30T23:56:50-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6009453478","userName":"Chappydave","userUrl":"https://itunes.apple.com/us/reviews/id437485128","version":"5.0","score":1,"title":"Buuugggyyy","text":"Previous app was great. This app looks great but is NOT working correctly. Generating problems on all of my cue automations. Will not allow manual turning on/ off of smart outlets from device menu while automation is running. Even when disabling cue automation! Not refreshing when moving between menus and dashboard. Not recognizing on dashboard when you have entered/exited geofence. But notifications work!","updated":"2020-05-29T07:11:59-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1702763562","userName":"PuraVidas","userUrl":"https://itunes.apple.com/us/reviews/id121276903","version":"3.93","score":5,"title":"Love it","text":"Arm disarm geofence technology is awesome. Set it up and forget about it. Works 99% of the time now. Been a long time customer and that hasn't always been the case, but they finally figured it out.","updated":"2017-07-28T20:02:10-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1524497043","userName":"jordino","userUrl":"https://itunes.apple.com/us/reviews/id42747753","version":"3.84","score":5,"title":"Great Security System","text":"Thus far, we're loving the Abode system. Auto arm/disarm feature works great and the alerts are really helpful. Can't wait to see what comes in the future but I'd love to see some sort of HomeKit integration.","updated":"2017-01-17T16:10:16-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1946039978","userName":"gueritaverde","userUrl":"https://itunes.apple.com/us/reviews/id27551192","version":"3.97.1","score":5,"title":"Cannot reccomend enough!","text":"Economical, easy to set up and easy app. Had it for a year and no complaints. Great customer service and easy enough that I just set it up for my in laws!","updated":"2017-11-24T12:16:24-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1407962297","userName":"Mnyates","userUrl":"https://itunes.apple.com/us/reviews/id28138069","version":"3.75","score":5,"title":"Great product and the future is bright for the app","text":"Very satisfied with the system and looking forward to updates for the app to improve hardware capabilities with the IP camera and to further tweak the app!","updated":"2016-07-08T16:54:37-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6053471248","userName":"MikeS77724","userUrl":"https://itunes.apple.com/us/reviews/id32132434","version":"5.0","score":1,"title":"BROKEN","text":"After downloading the new update the location services stopped working. You caused TWO false alarms today. I will be sending you the bill I get from the city unnecessarily having to dispatch the police. How can you release this without testing the single most important feature, and then go MIA for weeks on Twitter? Terrible.","updated":"2020-06-08T22:28:00-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6007422671","userName":"Kegsofduff","userUrl":"https://itunes.apple.com/us/reviews/id25012224","version":"5.0","score":2,"title":"Buggy app","text":"The new update has a lot of nice features but the location function is very buggy thinking one of the phones is not home or not knowing where it is. Since this is how we are the house 99% of this time this is a big issue.","updated":"2020-05-28T19:48:18-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"3428852277","userName":"Iphone user 235683","userUrl":"https://itunes.apple.com/us/reviews/id20894224","version":"4.1.5","score":2,"title":"High battery drain","text":"Using geofence automation features for alarm system activation significantly drains battery (~25% battery usage over 24 hours with all of it in the background).  This app is consistently at the top for battery usage out of all my other apps.  Convenient feature but at a significant cost to your phone's usage.","updated":"2018-11-17T08:26:00-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1575017898","userName":"Deth23","userUrl":"https://itunes.apple.com/us/reviews/id85759254","version":"3.88","score":2,"title":"Terrible battery life","text":"Ever since iOS 10.3 has come out this app is using 25-46% of my battery! I understand it needs to use location services regularly in the background, but it wasn't this bad before. Please guys, test on the new IOS and fix the app! Other than this glaring issue, it's a great app and product.","updated":"2017-03-28T19:00:00-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1277627616","userName":"Lawyer App","userUrl":"https://itunes.apple.com/us/reviews/id37386464","version":"2.0","score":5,"title":"Awesome","text":"Been looking for something to control everything in my house with a great interface for a while. Found it.","updated":"2015-10-26T17:48:20-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6035985075","userName":"Michael LD","userUrl":"https://itunes.apple.com/us/reviews/id661556647","version":"5.0","score":1,"title":"Geofencing no longer works right.","text":"This updated app has some good features, but unfortunately one of the most important features (geofencing) doesn’t work properly with my family’s iPhones. Please let us download the OLD app and use that one until you can get the geofencing to work properly on the new app.","updated":"2020-06-04T16:22:07-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"5264826433","userName":"TheGamingArt","userUrl":"https://itunes.apple.com/us/reviews/id158271774","version":"4.3.2","score":1,"title":"The app is missing functionality","text":"Ignoring the fact that basic features like renaming the sensors are missing from the app and the application almost acts as bad as a hybrid/web app (horrible interaction and UI/UX), ai never thought I’d see a security app with more basic features on the website over the mobile app. These guys need to invest in this app badly.","updated":"2019-12-12T11:52:05-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6011524726","userName":"RxInfoMan","userUrl":"https://itunes.apple.com/us/reviews/id38191726","version":"5.0","score":1,"title":"Old app was functional","text":"For some reason the new app did not take my password...so I simply clicked reset password.  An email was sent and when I click the link, it takes me to the sign in page....I have been a customer for several years.  This is a circle of stupidity in this version.","updated":"2020-05-29T18:46:57-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"5365898037","userName":"runnoft","userUrl":"https://itunes.apple.com/us/reviews/id28166596","version":"4.3.3","score":2,"title":"App is garbage... STAY AWAY","text":"Not really sure if we’ll end up keeping the Abode security system, but for now I’m not impressed. \n\nThe App frequency freaks out and stops working. \n\nThis is extremely frustrating, especially when the alarm is going off and you can’t login to the app or stop the alarm.\n\nOverall customer service is extremely poor and Abode isn’t doing anything to make my purchase feel like a worthy expense. \n\nNo wonder Apple doesn’t highlight them on their HomeKit website. \n\nSTAY AWAY. You’ve been warned.","updated":"2020-01-05T14:45:33-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6014692735","userName":"Rayne_360","userUrl":"https://itunes.apple.com/us/reviews/id30570927","version":"5.0","score":2,"title":"Lost Lamp Functionality","text":"We used to use the app to turn lamps on and off. That functionality was removed with the new update. We can’t turn lamps on or off anymore from the app nor can we adjust the brightness on them anymore. Please fix!!!","updated":"2020-05-30T11:58:11-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"5404123024","userName":"Mbierman","userUrl":"https://itunes.apple.com/us/reviews/id31343353","version":"4.3.4","score":1,"title":"Alarm is good, app needs work","text":"I have spent 6 weeks trying to figure out why my iOS devices aren’t showing up properly in abode and trying to figure out HomeKit integration.\n\nAbode support is slow and not giving helpful answers. Pointing me at documents that don’t answer the question at hand. \n\nExtremely disappointing.","updated":"2020-01-14T14:46:38-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6024411749","userName":"A76sA5","userUrl":"https://itunes.apple.com/us/reviews/id695063034","version":"5.0","score":1,"title":"Test an app before releasing it","text":"This is an unbelievable business decision to release an app that has less functionality than the app its replacing. \n\nThe only five star reviews were clearly written by the developer.\n\nAt least roll back till you make this app fit for purpose. Please remember you are dealing with peoples security here, its not a toy.","updated":"2020-06-01T21:59:24-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1687967865","userName":"Ndrocks96","userUrl":"https://itunes.apple.com/us/reviews/id85113736","version":"3.93","score":5,"title":"Great app and system","text":"The app gives the system the usability I have been looking for.  Everything works flawlessly","updated":"2017-07-18T15:57:05-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6023541152","userName":"Diggsdan","userUrl":"https://itunes.apple.com/us/reviews/id127704906","version":"5.0","score":1,"title":"New look, more bugs","text":"The app makes my Abode basically non-functional. We rely heavily on location services which is very buggy with this version. It says location services is turned off when it is not. Worked perfectly fine before the update.","updated":"2020-06-01T16:16:29-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"5382759664","userName":"NYC_UPSTATE_Driver","userUrl":"https://itunes.apple.com/us/reviews/id110375316","version":"4.3.4","score":5,"title":"Love Abode","text":"Improvements are slow, but steadily delivered. The system right now is near perfect. The only one that works with HomeKit. No complaints!","updated":"2020-01-09T16:33:30-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6083447093","userName":"Hammer669","userUrl":"https://itunes.apple.com/us/reviews/id122253400","version":"5.0.1","score":1,"title":"Blackout Period Error","text":"I keep getting blackout period errors when it’s suppose to are with location. Worst part is you don’t even know it didn’t arm! I found out by accident and it left my home unsecured. When I contacted Abode they told to reinstall app, yea that didn’t work. They need to do this fix right away.","updated":"2020-06-16T08:25:03-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1646548561","userName":"jdstacy159","userUrl":"https://itunes.apple.com/us/reviews/id43446288","version":"3.91","score":4,"title":"Love the system - battery drain","text":"So far, love the system and the app is beautiful. Drains phone battery, needs to be fixed before geofencing will be something I utilize (hopefully soon).","updated":"2017-06-16T07:41:28-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6040230182","userName":"Kenpat Erie","userUrl":"https://itunes.apple.com/us/reviews/id547980901","version":"5.0","score":1,"title":"Location services broken","text":"This app looks great but location services do not work with two iPhones. The app reports my spouse location services are not turned on when in fact they are. \n\nI turned in a support ticket and have not heard back 24 hours later","updated":"2020-06-05T16:22:16-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6001906040","userName":"BluRAGE","userUrl":"https://itunes.apple.com/us/reviews/id37729057","version":"5.0","score":3,"title":"Current Update","text":"It looks great and I like the arm/dearm on the dashboard. But now I can’t turn my light on/off from the device, it still works on the website and through Alexa but not the app.","updated":"2020-05-27T13:07:27-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6084384744","userName":"Yodl","userUrl":"https://itunes.apple.com/us/reviews/id162996587","version":"5.0.1","score":1,"title":"Version 5.0","text":"The new app looks great however functionality is lacking. The old app would show cameras full screen when turned to landscape. Now the view is tiny. What use is a view of the camera when it is half the size of your screen.","updated":"2020-06-16T13:26:58-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1656090038","userName":"Winnj1987","userUrl":"https://itunes.apple.com/us/reviews/id236745267","version":"3.92","score":5,"title":"Great service","text":"Great service and an awesome dev team... I only wish they would work faster or hire more engineers to release new updates and integrations.","updated":"2017-06-24T08:38:12-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6025681570","userName":"jakubcalabek","userUrl":"https://itunes.apple.com/us/reviews/id49778436","version":"5.0","score":1,"title":"New app version bugs","text":"I really like the new redesign! Unfortunately, the location services portion including auto arm when existing my home is completely busted on the 5.0 release. Please fix this, previous version of the app always worked flawlessly.\n\nFeel free to reach out.\n\nJakub","updated":"2020-06-02T05:35:27-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1316533298","userName":"Jason Abro","userUrl":"https://itunes.apple.com/us/reviews/id15392814","version":"2.3","score":5,"title":"Top Notch Security","text":"I'm ecstatic to get rid of my SimpliSafe system and upgrade to something well-designed, well-made, easy to use, and logical. Well done abode.","updated":"2016-01-14T15:56:54-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6000177379","userName":"GT","userUrl":"https://itunes.apple.com/us/reviews/id28772078","version":"5.0","score":5,"title":"Version 5 is a new app","text":"Great job with version 5! Should win an award for quality and polish - it’s a pleasure to use!","updated":"2020-05-27T04:47:22-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"2010815300","userName":"AAA","userUrl":"https://itunes.apple.com/us/reviews/id41072982","version":"3.98","score":5,"title":"Great app!","text":"App works and doesn’t crash. Just what I was looking for. Parents have simplisafe and their options are much limited to Abodes.","updated":"2017-12-19T20:45:53-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1670033651","userName":"smanzanor","userUrl":"https://itunes.apple.com/us/reviews/id85527957","version":"3.92","score":5,"title":"Works well","text":"Works well I've been using for half a year now with no issues. I love how there is a widget. Lay out is minimal clean and simple.","updated":"2017-07-05T08:57:35-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1760384849","userName":"Yes! ZL!!","userUrl":"https://itunes.apple.com/us/reviews/id20861774","version":"3.95","score":1,"title":"No Panic Button","text":"Why is there no panic button on the app? This makes no sense, other than trying to drive sales of a physical button to do it. It's either poor execution or poor treatment of customers. \n\nIt doesn't even appear that I can make setting off the alarm a quick action. \n\nMust fix immediately.","updated":"2017-08-29T18:27:35-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1482215927","userName":"smharm","userUrl":"https://itunes.apple.com/us/reviews/id35360424","version":"3.81","score":4,"title":"Improving every time!","text":"The hardware is excellent. Easy install and set up. I love the on demand professional monitoring. Would love to see 3-d touch for home/away/standby as well as a watch app.","updated":"2016-11-10T15:59:42-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6108552725","userName":"PresidentSkroob","userUrl":"https://itunes.apple.com/us/reviews/id1121986088","version":"5.0.1","score":5,"title":"Huge Improvemnt","text":"Love the new app design. Widget has made everything so much easier.","updated":"2020-06-22T07:31:49-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6043620287","userName":"Lorantd","userUrl":"https://itunes.apple.com/us/reviews/id385530767","version":"5.0","score":1,"title":"Location services broken in v5","text":"I have tried disabling and reenabling, turning gps access off then on, reinstall. Nothing works to get location services working. And that is on all our devices. What kind of new fancy app is that? I want the previous one back!","updated":"2020-06-06T11:02:51-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6017350258","userName":"Flyer894","userUrl":"https://itunes.apple.com/us/reviews/id155184793","version":"5.0","score":2,"title":"A for effort","text":"Very cosmetically appealing redesign of the App, however  lots of  functionality is broken on the new version (5.0).  This is understandable with a complete redesign, but now you have had over a week and no update to patch any of it.","updated":"2020-05-31T04:08:46-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1907601884","userName":"Kelly McDonald","userUrl":"https://itunes.apple.com/us/reviews/id5316405","version":"3.97.1","score":2,"title":"Slow to load to disarm alarm","text":"If the fobs aren’t going to work (mine won’t disarm the alarm) at least make the app quicker to load so I can disarm the alarm when it goes off. Would also like all devices and settings available to be edited in the app.","updated":"2017-11-08T20:26:47-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"3526386532","userName":"dj1051","userUrl":"https://itunes.apple.com/us/reviews/id241084318","version":"4.1.6","score":2,"title":"Bugs","text":"There’s been bugs lately and the alarm sets off and I can’t turn it off with my phone because of an “unknown error” that is stated when I open the app. It’s happened twice this week and really annoying.","updated":"2018-12-13T06:58:02-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6027912779","userName":"PapaJ190","userUrl":"https://itunes.apple.com/us/reviews/id479065445","version":"5.0","score":1,"title":"Alarm apps should be better tested","text":"Not too many complaints about abode but very annoying that new version released has no sound on our phones when alarm is triggered. Wont know until abode monitoring calls. Very annoying for an alarm app.","updated":"2020-06-02T18:22:51-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"5549794392","userName":"rcbooth14","userUrl":"https://itunes.apple.com/us/reviews/id39367201","version":"4.3.7","score":1,"title":"App is really buggy","text":"I just started using the system but I am really put off by this app. Text is overlapping, I have had to force quit it due to stalls and text is impossible to enter. I don’t know if it’s enough to stop me from using the system but it’s not a great start.","updated":"2020-02-18T16:05:51-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"2361263969","userName":"Ranger093","userUrl":"https://itunes.apple.com/us/reviews/id196032463","version":"4.0.3","score":3,"title":"Love the system hate the app","text":"The fact that you can’t change ANY settings on the app is extremely annoying.  Especially notifications.","updated":"2018-03-29T16:54:50-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"2397811671","userName":"Kapazza","userUrl":"https://itunes.apple.com/us/reviews/id140168109","version":"4.0.4","score":4,"title":"Just needs HomeKit support","text":"With iOS 11.3, HomeKit can be added via software integration (no special hardware required). Hoping my system will be updated!","updated":"2018-04-08T03:52:45-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1277635592","userName":"HtownCLong","userUrl":"https://itunes.apple.com/us/reviews/id203031918","version":"2.0","score":5,"title":"Smooth","text":"Sharp looking app. Very user friendly and intuitive.","updated":"2015-10-26T18:10:34-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6052670564","userName":"Cloverleaf69","userUrl":"https://itunes.apple.com/us/reviews/id24749958","version":"5.0","score":1,"title":"DO NOT RUN THIS UPDATE","text":"Unless you don’t care about location services working anymore. Like everyone else said, good intentions, poor execution. Makes me wonder if the company has a QA process in their development lifecycle. Support told me to wait for the next update to resolve these issues 🙄","updated":"2020-06-08T17:30:58-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"4626559065","userName":"johnnyfox321","userUrl":"https://itunes.apple.com/us/reviews/id158104173","version":"4.2.5","score":5,"title":"10/10 Would Recommend","text":"Totally belive in this product. Keep up the good work 👍","updated":"2019-08-16T12:55:57-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1590492375","userName":"bryan1up","userUrl":"https://itunes.apple.com/us/reviews/id28287837","version":"3.88","score":1,"title":"Drains battery like no other","text":"I just bought an Abode system. Haven't installed the hardware but I've installed the app. I have not linked it with my system and yet this thing is draining my battery like no other app. It is a total power hog. For some reason not all the time but when it does it drains big time.","updated":"2017-04-16T13:46:56-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6055423732","userName":"Andrew Jing","userUrl":"https://itunes.apple.com/us/reviews/id165362775","version":"5.0","score":2,"title":"\"Auto away when last phone exits\" broke","text":"The location assistant shows my phone is in the geofence; but my wife's phone still activates the away mode when she's out.","updated":"2020-06-09T09:19:48-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6002968999","userName":"Ammmmmyyyyyy","userUrl":"https://itunes.apple.com/us/reviews/id193398834","version":"5.0","score":1,"title":"Newest update is a huge disappointment!","text":"The app looks fantastic but doesn’t function well. Using the updated app, you can no longer turn on devices such as outdoor lights. It’s a big oversight and one that makes Abode unnecessary for my needs.","updated":"2020-05-27T19:40:32-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"5882414405","userName":"Toute","userUrl":"https://itunes.apple.com/us/reviews/id21763285","version":"4.4.0","score":4,"title":"Apple Watch support missing","text":"It would be really useful to have an Apple Watch companion app.","updated":"2020-04-29T22:28:38-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"3575817301","userName":"Beeper66","userUrl":"https://itunes.apple.com/us/reviews/id320892915","version":"4.1.7","score":5,"title":"Excellent system!","text":"The system is awesome. No monthly fees, fully integratabtle to your home automation.\nEasy setup, and excellent customer service.","updated":"2018-12-26T07:52:43-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6043582274","userName":"hydester83","userUrl":"https://itunes.apple.com/us/reviews/id157439661","version":"5.0","score":2,"title":"Location services","text":"I’m in the same boat as others. The location services don’t work with the last update. Is there an ETA on the fix?","updated":"2020-06-06T10:49:26-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"2005131490","userName":"Joseph Ike","userUrl":"https://itunes.apple.com/us/reviews/id188232474","version":"3.98","score":4,"title":"Good, could be great","text":"Love the price point, love the features - would’ve loved it even more if it allowed integration with Alexa, Siri or some other industry wide ecosystem","updated":"2017-12-17T17:47:25-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6098085327","userName":"eichst","userUrl":"https://itunes.apple.com/us/reviews/id176568842","version":"5.0.1","score":1,"title":"New app stinks","text":"Devices will only show first time logging in after deleting app and reloading ridiculous. What are we paying for. Can’t control my home when away or home. Get it fixed!!!!","updated":"2020-06-19T17:21:18-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1727659239","userName":"HVAC Eric","userUrl":"https://itunes.apple.com/us/reviews/id20909988","version":"3.93","score":4,"title":"Apple Watch","text":"Please provide at least arming and disarming via Apple Watch.","updated":"2017-08-14T10:42:24-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6058624390","userName":"lyndon60","userUrl":"https://itunes.apple.com/us/reviews/id3501663","version":"5.0.1","score":1,"title":"Location Services Still Not Working","text":"New release on June 9th 2020 did NOT fix the issues. CUE automation for arming system based on last phone to exit and first phone to enter is NOT working. System arms when FIRST phone exits - big problem!","updated":"2020-06-10T04:57:08-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6009147907","userName":"Lester Moore 44","userUrl":"https://itunes.apple.com/us/reviews/id148946836","version":"5.0","score":1,"title":"Great new app.","text":"I can no longer communicate with and control my ecobee thermostat. Kudos. Wondering what else doesn’t work any longer.\n\nIn a larger sense, the greatest number of reviews are one star. Think long and hard before jumping down this rabbit hole.","updated":"2020-05-29T05:50:21-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"2920558040","userName":"12uben","userUrl":"https://itunes.apple.com/us/reviews/id104666092","version":"4.1.1","score":1,"title":"App crashes Everytime!","text":"App continues to crash. It works when I uninstall and reinstall but as soon as I close out for at least 5 minutes I can’t reopen it. It goes to the main loading screen, turns black, and then force closes.","updated":"2018-07-16T20:40:51-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"2248016985","userName":"Zzjkauwhhf","userUrl":"https://itunes.apple.com/us/reviews/id538713618","version":"4.0.3","score":2,"title":"Worked fine until recently","text":"Cannot add new devices in the app or in the web from the mobile device... annoying as hell","updated":"2018-02-25T20:08:05-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1631966935","userName":"Bubba5062","userUrl":"https://itunes.apple.com/us/reviews/id201448581","version":"3.89","score":5,"title":"Great app","text":"Has never crashed on me. Always connects to my system.","updated":"2017-06-02T20:48:05-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6054575311","userName":"Martin Kaczor","userUrl":"https://itunes.apple.com/us/reviews/id149925931","version":"5.0","score":1,"title":"Location service broken in latest update","text":"Triggered many false alarms before realized the issue. Tried to redo Auto Away, but still arms when only one phone leaves geofence.","updated":"2020-06-09T05:14:09-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"4679675939","userName":"jdparki","userUrl":"https://itunes.apple.com/us/reviews/id1065295094","version":"4.2.6","score":2,"title":"Recent update deleted all my cue automations","text":"Why did it delete all my cue automations. Very frustrating... Now I have to spend time and remember all the automations I had and recreate them. Sorry Abode but you lost points on this one.","updated":"2019-08-26T19:55:36-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6109587482","userName":"MostlyMeg","userUrl":"https://itunes.apple.com/us/reviews/id27602826","version":"5.0.1","score":1,"title":"Why did they change a good thing???","text":"The previous app worked well. The new widget is slow and seems to turn the alarm off while in process of arming.","updated":"2020-06-22T13:24:15-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6055090407","userName":"DeltaP42 (AKA Mike Wehner)","userUrl":"https://itunes.apple.com/us/reviews/id41895407","version":"5.0","score":1,"title":"Ugh","text":"Camera no longer goes full screen. Why would you remove that, it worked great. Now I have to squint to see anything on the camera feed.","updated":"2020-06-09T07:39:54-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6012254463","userName":"Eric CE","userUrl":"https://itunes.apple.com/us/reviews/id100383096","version":"5.0","score":1,"title":"Unreliable","text":"The new update looks nice but that is about it. Location based automations don’t work, and renaming phones from the app doesn’t stick. \n\nI’d rather have the old app, it was extremely reliable.","updated":"2020-05-29T22:49:22-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6047372266","userName":"RobotFauxBot","userUrl":"https://itunes.apple.com/us/reviews/id35908883","version":"5.0","score":1,"title":"Location no longer works correctly","text":"Location no longer works correctly","updated":"2020-06-07T08:53:51-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6049056803","userName":"jdk410","userUrl":"https://itunes.apple.com/us/reviews/id100121637","version":"5.0","score":1,"title":"Ecobee device no longer working!","text":"Ecobee returning error. Everything worked great for many years - upgrade software is garbage!  \n\nCan’t delete my ecobee device?  From a big fan - Not a good software update!","updated":"2020-06-07T19:43:22-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6048784227","userName":"skijosh","userUrl":"https://itunes.apple.com/us/reviews/id36934978","version":"5.0","score":1,"title":"Broken location","text":"Location services are now broken which makes this useless","updated":"2020-06-07T17:47:26-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6032340389","userName":"Anonymous ):D","userUrl":"https://itunes.apple.com/us/reviews/id509430091","version":"5.0","score":1,"title":"Doesn’t work anymore!","text":"All the location services stuff is messed up with this new update, please put it back to the old version!","updated":"2020-06-03T19:29:24-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"3970307917","userName":"Cupcake19th","userUrl":"https://itunes.apple.com/us/reviews/id40297726","version":"4.2.0","score":3,"title":"Update","text":"Just did an update and none of my cameras will connect. Keeps telling me to reboot the gateway. Already done 3 times. Please fix.","updated":"2019-04-04T16:48:38-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1649056951","userName":"Mickyward83","userUrl":"https://itunes.apple.com/us/reviews/id276171490","version":"3.91","score":4,"title":"Great system and app but drains battery","text":"Great system and app but drains battery","updated":"2017-06-18T11:31:17-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6047863730","userName":"batmanbegin","userUrl":"https://itunes.apple.com/us/reviews/id880882411","version":"5.0","score":1,"title":"Zero star","text":"Look like this company didn’t even test their app before releasing. Super disappointed. The new app auto arm doesn’t work anymore.","updated":"2020-06-07T11:33:18-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1277684912","userName":"Mitbackwards21","userUrl":"https://itunes.apple.com/us/reviews/id8506452","version":"2.0","score":5,"title":"Awesome App!","text":"Great player in the home security space","updated":"2015-10-26T20:25:42-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1970367031","userName":"Fr3shMint","userUrl":"https://itunes.apple.com/us/reviews/id14544486","version":"3.98","score":1,"title":"Needs geofence option","text":"This app is great but the developers need to change the location services usage from \"full time\" that kills batteries to \"geofence\"","updated":"2017-12-04T09:22:40-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1441970969","userName":"gronguyen","userUrl":"https://itunes.apple.com/us/reviews/id13677376","version":"3.78","score":5,"title":"Can't login with Touch ID or password","text":"Works great.   Love Abode!!","updated":"2016-08-30T17:23:42-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6015569836","userName":"lead37","userUrl":"https://itunes.apple.com/us/reviews/id430831915","version":"5.0","score":1,"title":"Poor implementation","text":"I cannot even login and password reset says that I dont have an account","updated":"2020-05-30T17:37:57-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"5432363876","userName":"Gladiator","userUrl":"https://itunes.apple.com/us/reviews/id34883178","version":"4.3.4","score":2,"title":"Weak","text":"App is cumbersome, can’t view camera in landscape on mobile so it’s very small.","updated":"2020-01-21T13:52:44-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1970593181","userName":"Brian-Star","userUrl":"https://itunes.apple.com/us/reviews/id40548254","version":"3.98","score":4,"title":"iPhone X","text":"I wish they’d update the app with resolution for iPhone X and an Apple Watch app to arm/disarm.","updated":"2017-12-04T11:33:49-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"2881394194","userName":"Walkerqa","userUrl":"https://itunes.apple.com/us/reviews/id113541765","version":"4.1.1","score":1,"title":"Crashes on Load","text":"As others have mentioned there’s a defect in which on enabling Touch ID the app will crash on load with the iPhone X.","updated":"2018-07-10T18:56:52-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"3334336283","userName":"JoshofHB","userUrl":"https://itunes.apple.com/us/reviews/id41073817","version":"4.1.5","score":3,"title":"Still no Home Kit","text":"Still no home kit compatibility. Company communication is limited to vague posts on Medium.","updated":"2018-10-23T05:01:32-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6040619525","userName":"Jsarellano2","userUrl":"https://itunes.apple.com/us/reviews/id210899429","version":"5.0","score":1,"title":"Nooo","text":"First location is bad then I cannot go full screen. It’s really hard to see my cameras","updated":"2020-06-05T18:33:08-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"3765203998","userName":"Lashldu","userUrl":"https://itunes.apple.com/us/reviews/id175920016","version":"4.1.8","score":1,"title":"Reliability has significantly diminished","text":"App doesn’t open or just says loading. Reliability is paramount to having an app based security system.","updated":"2019-02-13T05:04:24-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"2846172488","userName":"Jessi M. 1","userUrl":"https://itunes.apple.com/us/reviews/id258169960","version":"4.1.1","score":1,"title":"Terrible","text":"Just got our new system. The app is terrible and won’t stop crashing . Very disappointed.","updated":"2018-07-05T20:46:01-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1730991773","userName":"Coinc","userUrl":"https://itunes.apple.com/us/reviews/id40197743","version":"3.93","score":4,"title":"System works as expected, app is under developed","text":"The Abode system itself has been working just as expected. I haven't had any issues with the sensors, and the ability to have a cellular backup in the case of a power outage far outweighs the struggles of the growing brand. \n\nThe app and the user interface of the system is complex and confusing so it takes awhile to learn. \n1- The arm and disarm functions in the app is a very tiny icon in the upper corner. Easy to overlook and hard to access. \n2- There is no way to set off the alarm in the case of an emergency. For example, if someone breaks through your window while you are home and you don't have the glass break sensors on that window, you'd have to arm your system and then go set off one of your sensors to make the alarm go off. They do have a way to set a button on your keyfob to a panic button, but you run into the same issue. If you are unable to reach your keyfob, or if you aren't even home but can see someone lurking around outside the house through a camera, you're out of luck. The only work around is creating a \"action\" where you can click the button on your app and it can be set to send a specific message to an emergency contact, or you personally can call the police. But most people have a DIY alarm system to scare off intruders, so the alarm itself does the grunt work. \n3- As other users have mentioned, the app itself has a lot of buttons that give you a pop up to \"go to the browser\" and no actual app functionality. Then the browser on a smaller screen is just as useless. They have buttons on the far edge of lines that you can't see from a phone, so you are forced to use a tablet or computer.\n4- It would be a huge benefit to have a larger selection of arm modes similar to how ismartalarm has set it up. I usually prefer to have an Away (everything armed with delayed entry), Home (back door unarmed to let dogs in and out), Sleep (immediately alarms), Maintenance (notification if someone enters but no alarm), and a Standby. Right now Abode only gives you 3 options which can be customized to your preference \"standby\", \"home\", \"away\". \n5- This may be more my fault than Abode, but I still haven't figured out how to make Abode call me if the alarm is triggered. I know you can do it through the IFTTT, but testing it hasn't been successful yet. **update** you can set it up the IFTTT and it works just as expected!\n6- If you exit the app screen it automatically locks you out. I have my phone fingerprint protected so the only one able to access the app is me. It would be helpful to choose how long you'd stay logged in. **update** to fix this you can disable Touch ID in the settings. Then you will no longer have to login each time you re-enter the app. \n7- Automations are wonderful. I haven't experienced any downfall or issues with them, other than you can't edit them in the app (see line item 3). **update** the location services drained my batter (like abode alone used of 44%) so some automations are a battery killer. \n8- No way to give feedback to the developers of the app. **update** you can email support center and they can forward to the developers. \n\nOverall I would still recommend Abode. It is a great system that I think will only get better. Hopefully some of the functionalities, like the panic button in the app, that are standard in other systems will will be added in soon. **update** I'm still very happy with my purchase!","updated":"2017-08-16T20:10:32-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"2776575022","userName":"Welcome?","userUrl":"https://itunes.apple.com/us/reviews/id259280952","version":"4.1.0","score":1,"title":"Widget is missing in 4.1.0 update","text":"Widget is missing in 4.1.0 update. It is very inconvenient to open the app every time to arm and disarm it. The app is slow to open.","updated":"2018-06-26T13:27:18-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6046726502","userName":"DocBob","userUrl":"https://itunes.apple.com/us/reviews/id24532876","version":"5.0","score":1,"title":"HomeKit?","text":"Previously seemed to integrate well with HomeKit but now in Home app says updating then can’t connect most of the time.","updated":"2020-06-07T05:49:17-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6003656921","userName":"JaRule1","userUrl":"https://itunes.apple.com/us/reviews/id107015175","version":"5.0","score":2,"title":"The app is horrible at initial install","text":"I received my kit today and started setting up the hardware around the house. I launched up the Abode app since the thank you email said so. I set up my gateway and the sensors. I got this system since its the only one that’s HomeKit compatible (without hassle, that is). Well, after a glitchy update from the hardware, I went to adjust the motion sensors and door sensors for the Away and Home scenes. I could not get them to stay at the setting I wanted! After 20 minutes I gave up. I noticed that the app said I had to upgrade to the pro plan to use some features. I knew I purchased it with the bundle online. Every time I kept pressing the plan button in the app, it sent me to safari. Customer service takes a millennia to reach you. They could not figure out why my pro plan wasn’t activated to my account. 6 hours later, I went to their sign-in web page online. They made me redo all the naming for my sensors. I thought I was going to crash it since I had already done it. With much distress, I just continued to see what would happen. After renaming all my sensors, the giant activate pro plan page came up! Woo!!! I deleted my sensors in the Home app, reset the Abode app, then re-linked my sensors to Home app. BAM! Everything works fine now. All the scenes do what they are suppose to, and my sensors are fully functioning. I went back to the web app and adjusted my sensors and now the settings stay. I do not touch anything on the app only to disarm and arm if my internet is down. \nOverall, this app needs a lot of adjustments and bug squishing for new customers like me. I did get very stressed but I got everything working. I was very close to returning everything back if I could not get it working. Pro Plans and other subscriptions NEED to be accessible from the app. I gave this app two stars for all the headaches it caused me.","updated":"2020-05-28T00:05:54-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6056135003","userName":"WJKramer","userUrl":"https://itunes.apple.com/us/reviews/id34356693","version":"5.0.1","score":1,"title":"No geofence anymore.","text":"5.0 and 5.0.1 don’t work with location services.","updated":"2020-06-09T13:27:39-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6034330627","userName":"Ned__C61","userUrl":"https://itunes.apple.com/us/reviews/id182583285","version":"5.0","score":1,"title":"Location automations broke","text":"New release broke all my location automations.","updated":"2020-06-04T07:00:10-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"2946173040","userName":"ekh321","userUrl":"https://itunes.apple.com/us/reviews/id520287165","version":"4.1.1","score":1,"title":"Crashes!!!!!!","text":"Crashes when opening","updated":"2018-07-21T15:09:53-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"2793326696","userName":"Nfccc","userUrl":"https://itunes.apple.com/us/reviews/id186572101","version":"4.1.1","score":1,"title":"App crashing","text":"Can’t turn off alarm. This is crazy.","updated":"2018-06-28T22:25:21-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7795960456","userName":"Amac1022","userUrl":"https://itunes.apple.com/us/reviews/id470610373","version":"5.3.5","score":4,"title":"Cameras","text":"Everything working great right now.Best deals in cameras and24/7 recording!","updated":"2021-09-11T13:12:10-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6026682500","userName":"bobzemuda","userUrl":"https://itunes.apple.com/us/reviews/id3645910","version":"5.0","score":1,"title":"Geofencing Broken","text":"A key abode feature wiped away.","updated":"2020-06-02T10:28:42-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6007441260","userName":"abigmonster","userUrl":"https://itunes.apple.com/us/reviews/id230553433","version":"5.0","score":1,"title":"Presets wiped out","text":"New app completely wiped out all my presets","updated":"2020-05-28T19:55:07-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6002752336","userName":"Disappointedwith5.0","userUrl":"https://itunes.apple.com/us/reviews/id171209101","version":"5.0","score":1,"title":"5.0","text":"Does not work with Philips hue bulb.","updated":"2020-05-27T18:23:16-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8027563082","userName":"bugfreeworld","userUrl":"https://itunes.apple.com/us/reviews/id33233536","version":"5.3.8","score":1,"title":"Geofencing is very unreliable","text":"I have had this system for several years now and I’m the last couple of months the app cannot figure out where all the connected users are. I tried customer service but they just kept saying they were busy and would get back to me- well that was over a month ago. Consider another system. This used to be a very good company with a great response time but I’ve been very disappointed as of late. Problems with both iPhones and android phones.","updated":"2021-11-15T10:56:03-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"8021721552","userName":"SapphiAkash","userUrl":"https://itunes.apple.com/us/reviews/id253333868","version":"5.3.8","score":2,"title":"Honestly, just bad","text":"I had to redwood the app because it kept crashing each time I would open it.\n\nBut what really gets frustrating is the product itself. I have the Iota set.\n\nThe key fob never works past two weeks. I had it replaced twice and both stopped working, even when I swapped new batteries. I gave up.\n\nThe program would flicker and lag after turning the alarm on. And even no sounds will come from it.\n\nThe video quality is HORRIBLE. I bought this for the camera and I feel like I am watching a video on YT from 2008. 480p, blurry, laggy, audio bugs and skips.\n\nIt takes FOREVER to load up the stream. If it even does load up. And once you got it going, sometimes, it stops the stream a few second or two minutes in.\n\nDon't recommend. I rather spend the 500+ for a better quality product. What a waste of 230 bucks.","updated":"2021-11-13T19:34:52-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7881807881","userName":"Josiah539","userUrl":"https://itunes.apple.com/us/reviews/id379454252","version":"5.3.7","score":1,"title":"Horrible Customer Service","text":"Ok until something goes wrong and then it takes months to get a solution. Ticket 228907","updated":"2021-10-05T11:49:06-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7815062288","userName":"RJC77","userUrl":"https://itunes.apple.com/us/reviews/id37189683","version":"5.3.5","score":3,"title":"Okay","text":"The functionality of the app from a features perspective is good. The problem is the performance. \n\nFor example, the Amazon Alexa App will pull up video on my camera, every time, quickly, without fail.  More than half the time, the Abode app fails to even start the stream and when it does it takes 3x longer to do so. That’s incomprehensible given this is an Abode camera!!","updated":"2021-09-17T03:49:28-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6830942893","userName":"Yesheadlou","userUrl":"https://itunes.apple.com/us/reviews/id17960486","version":"5.1.5","score":4,"title":"Turn off battery saver","text":"I have had a geofencing problem with this app since the big update in the spring of 20. Finally working flawlessly now that we turned off the battery saver for the app on the Android system. It is back to working how it is intended. If you have geofencing problems try this widely unknown fix.","updated":"2021-01-04T11:08:56-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7775009167","userName":"andrewjbram","userUrl":"https://itunes.apple.com/us/reviews/id232012960","version":"5.3.5","score":1,"title":"Constantly loses connection, Keypad delays and alarm goes off","text":"My Abode constantly loses connection and regains it, so I cannot arm or disarm from the app or view the camera while away. When I do get home, if alarm had been set prior to leaving, keypad has a delay after putting in the alarm code and attempting to disarm, leading to false alarms going off on many occasions as well as charges from municipality for such false alarms.","updated":"2021-09-05T12:22:57-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7763658786","userName":"ahogaijin","userUrl":"https://itunes.apple.com/us/reviews/id27172371","version":"5.3.5","score":1,"title":"Absolutely useless","text":"I have an iota that’s less than a year old, and within 6 months began having issues with the camera not recording. I’ve been in touch with support since May when it stopped working altogether. Now sensors are no longer reading as open/closed even after rebooting the iota, including a brand new sensor I replaced just this week. I’ve been waiting for a replacement iota since late June when I was told one would be sent but was just told AGAIN that they don’t have any in stock to send. This entire system is a waste of money.","updated":"2021-09-02T12:33:18-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7753855725","userName":"Law dog Larry","userUrl":"https://itunes.apple.com/us/reviews/id394568112","version":"5.3.5","score":5,"title":"A+++","text":"This app is easy to use. The alarm system is easy to set with the push of one key. To disarm you use you 4 digit code. Again very easy. When an alarm has gone off, the response of the monitors is very quick. Being able to arm and disarm any where using your cell phone is an added benefit.","updated":"2021-08-30T21:18:35-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7711633786","userName":"gholdentrinity","userUrl":"https://itunes.apple.com/us/reviews/id1239504292","version":"5.3.5","score":5,"title":"Device Setup & sound no verbal notification","text":"Had difficulty setting up cameras, still have one camera to setup that isn’t being detected yet. Although cameras are indoor/outdoor they must be plugged in to work. There’s no batteries which would’ve been helpful for outdoor setup. All other sensor devices setup easily including 3rd party CO smoke detectors was a breeze.  However, the count down to enter device code is too short. I missed entering code in time allotted and can’t seem to go back to reset and enter again. So the device is showing up red. Will do the usual uninstall/reinstall app to see if that clears the device for entering as new. What really would be nice is an integration that spoke the location of the device notification instead of just a beep so you don’t always have to look at the app to see which device is triggered. Also arming with faults should notify what device has a fault and why so the issue can be remedied. All in all I really like Abode system because of the flexibility of integration for outside devices. Kudos Abode!","updated":"2021-08-19T10:58:32-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7676555365","userName":"jeremyd1777","userUrl":"https://itunes.apple.com/us/reviews/id452911563","version":"5.3.5","score":2,"title":"Just ok","text":"Setup was easy though the software often froze up during the process and needed started again. Only one of two cameras will stream. I’ve requested to move from the pro monitoring plan down to self monitoring three times beginning the first day of installation. Expected more for the high price I paid.\n\nEdit: per request, support ticket numbers 219653, 219683","updated":"2021-08-10T05:06:21-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7509699044","userName":"TO1002","userUrl":"https://itunes.apple.com/us/reviews/id33730947","version":"5.3.2","score":1,"title":"Hot Garbage","text":"This app is horrible. Want to set up a new system?  Won’t work on iOS. Want to add HomeKit integration?  Won’t work on iOS. You’ll need an android device.","updated":"2021-06-26T16:22:40-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"7498779562","userName":"ctx143","userUrl":"https://itunes.apple.com/us/reviews/id140588907","version":"5.3.2","score":1,"title":"I Downloaded This App but can’t use it…","text":"… because I preordered the Cam 2 on March 13 2021 and still haven’t received my order.\nConcerning that the app doesn’t even work either because it’s too buggy!","updated":"2021-06-23T17:16:51-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6010593236","userName":"AEM_630","userUrl":"https://itunes.apple.com/us/reviews/id1151820184","version":"5.0","score":3,"title":"Nicer New App... Buggy Location Assistant","text":"Nice layout however I've experienced problems that I haven't experienced with the old app. Location assistant does not work correctly so our automations are not working. I have an iPhone and my husband has an Android. It is constantly claiming one of our phones location permissions are off when an automated function did not run. Please fix this issue.","updated":"2020-05-29T13:13:56-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6731920605","userName":"Tett slime","userUrl":"https://itunes.apple.com/us/reviews/id352241109","version":"5.1.5","score":1,"title":"Need a subscription to use hardware???","text":"Why do I need to pay for a subscription to use the motion camera that I already purchased? It doesnt require professional monitoring. It is a feature that has been remotely disabled. \n\nWhy cant I use automatic/ proximity triggers without paying for a subscription? The hardware/ software that I paid for is fully capable of doing this without professional monitoring.\n\nNone of this was made clear before I purchased and set up your product. I purchased your product because I do not need professional monitoring to run my hardware. \n\nIt does not make sense that I have to pay for automatic features that my hardware is fully capable of without professional monitoring. \n\nI have a $30 motion camera from Amazon that senses movement and sends video and audio right to my phone without a subscription.","updated":"2020-12-08T13:49:55-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6090003774","userName":"Kayak Prime","userUrl":"https://itunes.apple.com/us/reviews/id140462144","version":"5.0.1","score":1,"title":"Throw it away","text":"We’ve had the abode system for 2 1/2 years now. It is the only thing I have ever owned that with each and every upgrade it gets worse.Just as you get the bugs and idiosyncrasies of the current version figured out they go and screw it up even worse. If they would stop trying to fix it I may not have to throw it away","updated":"2020-06-17T21:15:35-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6061364354","userName":"Gina Teague","userUrl":"https://itunes.apple.com/us/reviews/id127251851","version":"5.0.1","score":1,"title":"Update still doesn’t work for iPhone 10","text":"I have uninstalled and reinstalled several times.  It works on my husband’s Android phone but not on my iPhone. Frustrating. Buttons display incorrectly and I get service error messages when trying to change a device.","updated":"2020-06-10T20:35:41-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6036036910","userName":"Fishgirl68","userUrl":"https://itunes.apple.com/us/reviews/id85649401","version":"5.0","score":1,"title":"Do not update","text":"Unless you know the exact location of the access code card that came with the original box, do not update!  Update logged me out and lost all my information the whole system is unusable by phone after update.","updated":"2020-06-04T16:41:32-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"6014014116","userName":"sty Ted dchughjhhxzdgbbzxdf","userUrl":"https://itunes.apple.com/us/reviews/id357879309","version":"5.0","score":1,"title":"Still worthless!","text":"Wish I could give zero or negative stars. I’ve had an Abode system for years. While the hardware is okay, the software just keeps getting worse. Now they’ve put “lipstick on a pig”. \n\nAutomations and Location awareness have been problematic for awhile on both Android and IOS. Now they’ve stopped working completely. Tech support is useless and after a few exchanges, they just ignore you. \n\nI paid a lot for a “smart” system that has no smarts and has to be used manually. Save your money and go elsewhere.","updated":"2020-05-30T08:16:23-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"5541645165","userName":"MonkeyDeathSonic","userUrl":"https://itunes.apple.com/us/reviews/id34377945","version":"4.3.7","score":3,"title":"Three stars may be too generous","text":"I bought Abode Iota because of the HomeKit integration. So far that is working well with simple triggers like turning on lights when a door opens. The recessed door sensors are great because you can’t see them at all when installed. \n\nOn the downside, Abode suffered a cloud outage today Feb 16 2020 and during this outage that last for about an hour, I couldn’t pair devices or really do much of anything. So it appears this thing is very much dependent on the cloud being online. The app is pretty buggy even when their cloud is working. It needs quite a bit of work. When you reboot the gateway, it takes a while for it to see the statuses of the various sensors. So if you reboot and try to arm it will think the doors are all open until it can get a status on them. Oddly, HomeKit can see the proper status way before the abode app.","updated":"2020-02-16T19:34:11-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"5938994579","userName":"rscrscrscrsc","userUrl":"https://itunes.apple.com/us/reviews/id182664567","version":"4.4.0","score":1,"title":"Boring alert asking to enable location","text":"Every time you open the app you get an alert asking you to enable background location. \n\nAlso the Home Kit integration doesn’t work (you type the code and the abode doesn't appear in the screen)","updated":"2020-05-13T00:39:12-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"2798914451","userName":"Anarchosalvo","userUrl":"https://itunes.apple.com/us/reviews/id137432576","version":"4.0.7","score":5,"title":"Excellent equipment - clean performance","text":"Purchased and installed 2/2017. As of 6/29/2018 I've yet to change a battery on any of the equipment. Everything continues to execute as described.\n The app DID drain my iPhone battery at first, but maybe an update or something I changed halted that. I'm hopeful they can create new innovative products.\nIt's more than a security system- I like it can be programmed with IFTTT compatible products (i.e. Arlo, Schlage keyless door locks, Phillips light)","updated":"2018-06-29T14:16:04-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"3262154578","userName":"MProbus","userUrl":"https://itunes.apple.com/us/reviews/id326080057","version":"4.1.4","score":2,"title":"App Lacks Features","text":"I like the system, but the IOS app needs some work.  I just recently switched from a different security system and am already missing their app.\n\nWhat I would like to do with the app is use an old iPad as a dedicated console.  This part is easy as I enable Guided Access through IOS.  However the part that is missing is the keypad part of arming and disarming the system.  Ideally, there would be a keypad where each user can input they code and then arm or disarm.  Currently, you don’t even have to log into the app since the iPad doesn’t have touch.  So if anyone comes in the front door, they can easily disable it.\n\nAlso, should the scenario arise, the keypad would also accept the duress code.","updated":"2018-10-04T02:53:20-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"3084158454","userName":"xChadeus","userUrl":"https://itunes.apple.com/us/reviews/id195226036","version":"4.1.4","score":2,"title":"Good app for normal use — beware new battery drain","text":"The abode app is a good medium for running a smart home/alarm system without the confusion and excessive features needed for adding new devices. Those should (and are) done with web interface. \n\nBiggest issue with newest release as of 8-16-2018 is the new drain in the battery. The location features doubled the battery co symptom on my device. This needs to be addressed.\n\nUpdate: I reached out to Abode about power consumption concerns and it was stated that up to 21% of battery consumption is considered acceptable (mine hit 23%). This is inconsiderate of users’ cellular batteries and a step backwards for without noticeable gain in accuracy or function. Please consider rollback or improvement of cellular battery abuse. Stars adjusted from 4 to 2.","updated":"2018-08-18T18:52:46-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"},{"id":"1524712857","userName":"cyrus ghahremani","userUrl":"https://itunes.apple.com/us/reviews/id18134872","version":"3.84","score":5,"title":"The best automation/alarm and a constantly improving app","text":"The piss poor reviews for Scout are the singular reason i did not buy that system. On the other hand, hit \"all reviews\" and see how good Abode is. I am so psyched on my system. Unlike my previous bouts with SimpliSafe and Piper, this system actually works and is beautifully modern. \n\nthe geofencing in this app works so well! i don't miss our old alarm keypad at all. it just flawlessly arms when neither my wife or myself are home, and disarms when one of us comes back. \n\nwe just added a nice schlage z-wave keypad deadbolt to our front door and when it is unlocked by us or our guests, the alarm automatically disarms if it hasn't already & a nest camera snapshot logs the person onto our timeline, the lights turn on, and the AC adjusts. this is so futuristic to me. \n\nalso, i had a great experience with one of the abode creators when i called with some questions before i committed to the system.","updated":"2017-01-17T22:32:32-07:00","url":"https://itunes.apple.com/us/review?id=828260682&type=Purple%20Software"}]