[{"id":"4872813357","userName":"MilargaDR","userUrl":"https://itunes.apple.com/us/reviews/id276997111","version":"4.1.1","score":2,"title":"App is the problem...","text":"Great sound that usually connects via Bluetooth to my iPhone. However, despite connection and sound, the app stays on ‘search’ mode which doesn’t allow the lights or volume to be controlled via the app. At least I can control volume with my phone but unfortunately not the lights. Very annoying. Glad I only purchased two of these speaker sets at a low price. That should have been a tip off. Next time I’ll read the reviews first.","updated":"2019-10-02T03:17:01-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"2661738081","userName":"Cegit","userUrl":"https://itunes.apple.com/us/reviews/id529842990","version":"4.1.1","score":4,"title":"Fixing connection issues","text":"I love these lights/speakers, but I did just recently open my app to discover it was completely blank, it didn’t show anything.  The speakers still connected via Bluetooth and still worked but the ability to dim, shut off, or just control the light aspect using the app was just not there.  I uninstalled the app and made my Bluetooth forget the device and then just started fresh.  I re-downloaded the app and followed the prompts, which instructed you to reconnect the Bluetooth device through settings and when I came back to the app I was able to continue through the set up and now everything works again.  I had tried it different ways before this but, for me, treating it like it was brand new again and acting like I had no idea how to set it up other than how the app instructed is what worked.  Hope this helps :)","updated":"2018-06-08T08:10:17-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"2559116178","userName":"J J V","userUrl":"https://itunes.apple.com/us/reviews/id519691497","version":"4.1.1","score":3,"title":"Hmmm isn’t worth it","text":"This speakers do the job, for wireless sound down from above, there will never be anything like a physical dimmer,\nAnalog controls. If they would have added that option as physical buttons, hard reset pin hole?  Who hasn’t time to scroll through every app for every different device, We all know that wireless is not reliable. By the time you get the connection if you lucky, you already moved onto something other than music. The thing it annoys me the most, is I can hear the frequency it emits, not a dead flat tone in the back of your head, even when the sound is off. I really wanted them for my room, \n\nIf you thinking about something better if the NFC technology that just just touch the speaker with phone and boom, connected! That is plausible, for the pricing, NOT SAYING BRANDS","updated":"2018-05-17T05:37:17-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"4454850051","userName":"Silverquill","userUrl":"https://itunes.apple.com/us/reviews/id41558824","version":"4.1.1","score":1,"title":"Love it “when” it works. Keyword when.","text":"It’s an awesome concept and I love it when it works. Majority of the time you can’t get the app to work correctly. It will sync with the Bluetooth. The music comes on but I can’t get to the screen where I can control the dimmer and volume. It always leaves me at the “Help” screen to connect the light. I sometimes have to turn off the lights and back on to get the speaker working again. Sometimes it syncs but the majority of the time it try’s to connect to no avail. Again leaving me at the “Help” screen. \n\nI will say I am using my phone to connect to the speakers. If you leave it connected to a more dedicated source. I.E. laptop it seems to work well. \n\nI/we use this in our spa and the ability to control the light dimmer and speaker volume is ideal for our needs and wants. However, it’s very frustrating when we can’t even use this product and app.","updated":"2019-07-13T10:10:44-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"2145498534","userName":"Mrs.Bennett1030","userUrl":"https://itunes.apple.com/us/reviews/id251930547","version":"4.0.10","score":3,"title":"Not finding my bulb via app😡😡😡","text":"I was really happy with this bulb I’ve had it about 3-4 months I use it on occasion via Bluetooth but as a regular bulb daily. I just used this like 2 days ago and now my bulb is stuck on a low light setting because this friggin app is refusing to acknowledge my Bluetooth is on it just continues to say finding bulbs I’ve deleted and reinstalled app I’ve turned off Bluetooth forgot device and tried all over again. The bulb IS beeping acknowledging my Bluetooth connection but the app isn’t so I can’t change the light/sound settings 😡","updated":"2018-01-30T04:49:26-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"6391824865","userName":"Kuluz","userUrl":"https://itunes.apple.com/us/reviews/id14479309","version":"4.2.6","score":1,"title":"Why can’t the app find my speakers??","text":"I’ve had these speakers for a few months now and they work great!...but the ability to adjust the volume, the color, and the dimness isn’t there. The app doesn’t connect to the speakers and it’s kinda a bummer. Please fix this issue. Also, when it did connect at first, it was great but sometimes I don’t want to use BOTH speakers and just want to use one and it wouldn’t connect because of that issue. Or, maybe I want to use the satellite speaker by itself, but i am forced to use the main...cant there be a way to turn off one??","updated":"2020-09-03T12:16:35-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"5564378702","userName":"Al.iskandar","userUrl":"https://itunes.apple.com/us/reviews/id208637815","version":"4.1.1","score":1,"title":"Product is great! App, not so much...","text":"The speakers themselves work pretty good! Maybe not as high quality as I had hoped; a bit muffled. The app is what’s worthy of such a trash rating. It’s very simple: you pair, and then you control volume and light intensity. However, the issue is that the speakers won’t always show as paired in the app. You can be paired via Bluetooth, but the app will have no idea 90% of the time and you’ll be stuck without being able to control anything. There are many reviews just like this, but nothing has yet to be done about it. 22Feb2020","updated":"2020-02-22T00:08:16-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"2967012883","userName":"Dee7Mom","userUrl":"https://itunes.apple.com/us/reviews/id568213736","version":"4.1.1","score":5,"title":"First time user","text":"I just started using the single bulb. It took me about 10 seconds to install and connect. The app synced well. I was able to dim the bulb for day time use. If things continue as they are now I am going to order more for other rooms in my house. The sound is superb quality. However, it’s a light bulb!  Not a sound system. I love it!!!","updated":"2018-07-25T05:50:35-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"5089397555","userName":"USSAmerican","userUrl":"https://itunes.apple.com/us/reviews/id252288587","version":"4.1.1","score":2,"title":"Still has bugs.","text":"It takes a while for me to get the app to connect with my Bluetooth speakers but eventually I’m able to get it to work. When opening up the app it takes a long time before it connects. It keeps “spinning” in search mode. \n\nHope the programmers can get a fix for this because it does make life a little bit easier for music lovers.","updated":"2019-11-05T06:46:56-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"2642844683","userName":"Sphinx2512","userUrl":"https://itunes.apple.com/us/reviews/id485337336","version":"4.1.1","score":1,"title":"Seriously JBL ❗️My first review in five years.","text":"I would not bother and make the effort of writing this critique, If \nJBL BRAND was not involved. 1) Quality of sound it's below ZERO, to make my self-clear I could not find any benchmark to run a comparison. 2) The App and it's Bluetooth synchronization, disaster by all means, especially if there any other appliance controlled via Bluetooth from the same iOS device that runs the two bulbs... Immediately connection is lost and you have to reboot the light switch in order to connect again to the bulb. Enough, seriously JBL!","updated":"2018-06-04T17:45:35-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"3546640333","userName":"DYarboro","userUrl":"https://itunes.apple.com/us/reviews/id229497351","version":"4.1.1","score":3,"title":"Loving My Bulb, But...","text":"Installed my third Pulse speaker bulb, first Pro. I love it but the app doesn’t work like it did before.  I keep getting this intrusive pop-up that says, “Pulse would like to communicate with Zhejiang Shenghui Lighting Co. LTD Sengled Solo Pro.  It pops up every twenty seconds and I cannot find a way to stop it from happening.  Can we have the Pulse/Pro where it can be on a timer?  I’d love to be able to program the light bulb to turn off and on.","updated":"2018-12-18T17:32:40-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"6465647358","userName":"dhirajtinani","userUrl":"https://itunes.apple.com/us/reviews/id563861105","version":"4.2.6","score":5,"title":"Connect master bulb first","text":"Bulb has label on the side\nMake sure you connect the master first, try connecting through Bluetooth settings\nOnce first bulb is paired just connect another one, it will automatically connect\nI bought it for 10 bucks not bad","updated":"2020-09-24T20:38:05-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"7547008252","userName":"Fross-T","userUrl":"https://itunes.apple.com/us/reviews/id161514123","version":"4.2.6","score":5,"title":"Just installed today.. great so far","text":"It’s so easy…even my husband could do it. Haha \nLook for it under Bluetooth and connect. If you want more features, download this app. I will update you later after more use","updated":"2021-07-06T14:30:50-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1983838065","userName":"Tuna neck","userUrl":"https://itunes.apple.com/us/reviews/id234305209","version":"4.0.7","score":1,"title":"Garbage, the app no longer finds the bulbs. Sengled doesn’t care.","text":"Complete TRASH. Don’t buy any products from Sengled, read forums and Facebook, everyone hates Sengled now. The app no longer finds the speakers. People have been having this issue for months and Sengled does nothing. I heard they may be filing for chapter 11. I had these for over a year, no longer able to use the app to adjust the volume or light brightness because it doesn’t find the bulbs. Sengled told everyone I know that it’s not their problem. What a scam.","updated":"2017-12-09T14:39:26-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"2089827122","userName":"NC User 2016","userUrl":"https://itunes.apple.com/us/reviews/id228402559","version":"4.0.7","score":2,"title":"App no longer working after recent update","text":"I got the bulbs as a Christmas gift last year and they’ve been great (app has also been okay)! But the most-recent update has rendered the app inoperable (blank screen on iOS). Hopefully this will be corrected soon.","updated":"2018-01-14T16:18:18-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"3627132603","userName":"CarrieWTF","userUrl":"https://itunes.apple.com/us/reviews/id843739267","version":"4.1.1","score":4,"title":"Smart bulbs","text":"I Love the app and bulbs. I love that I can control the music and lighting from my phone. My house becomes a large sound system. I can keep the volume up or down all thru my house for each individual bulb. My music doesn’t affect the comfort of my family or neighbors and I get to whistle while I work.","updated":"2019-01-08T09:35:05-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"2204957345","userName":"Sun trot","userUrl":"https://itunes.apple.com/us/reviews/id286874051","version":"4.1.1","score":5,"title":"Great app and light!","text":"I bought the solo bulb speaker and I gotta say, I love it! I love the app control, the only thing that could make it better is if there was an option for the bulb to turn on with a timer or alarm. I think it'd be cool to have this turn on with an alarm. But so far I love it!","updated":"2018-02-13T17:10:12-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"2103646915","userName":"Highly_insAnE","userUrl":"https://itunes.apple.com/us/reviews/id488152469","version":"4.0.7","score":5,"title":"Speaker and light work fine now!","text":"At first it didn’t work when I bought it but after just turning off the bulb and force closing the app it eventually work and it’s been good for a couple hours now so yea I love the bulb!","updated":"2018-01-18T22:59:55-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"4472675374","userName":"Hox506","userUrl":"https://itunes.apple.com/us/reviews/id120149912","version":"4.1.1","score":1,"title":"Crap","text":"Thought it would be nice to have a few extra speakers throughout my house but the app makes it nearly impossible to use. The first time downloading it worked, I moved the light bulb and suddenly it won’t connect. Also it won’t connect my satellite bulbs. However, I can connect to the bulbs via Bluetooth but the app is completely worthless. I’d save your money and look elsewhere, this app makes it a horrible experience.","updated":"2019-07-16T20:14:44-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"6272517963","userName":"Whoownsdis","userUrl":"https://itunes.apple.com/us/reviews/id124792818","version":"4.2.6","score":5,"title":"Not a terrible product","text":"It has a decent sound. Connected easily to my phone and my Echo Dot. (Not at the same time, of course)","updated":"2020-08-02T14:23:17-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"7940510531","userName":"Anthonyoo","userUrl":"https://itunes.apple.com/us/reviews/id336568324","version":"4.2.6","score":4,"title":"Needs update","text":"Takes forever to find bulbs, but when it does it works great! \nPlease update this app to make it find the bulbs faster if possible. Bluetooth finds it no problem.  Thanks.","updated":"2021-10-21T22:54:21-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"6641704737","userName":"Kdcs","userUrl":"https://itunes.apple.com/us/reviews/id23646346","version":"4.2.6","score":1,"title":"Lights/speakers work great, the app is useless","text":"The lights arrives and installed quickly and lit up promptly. Then the issues began. I couldn’t get the app to discover the speaker to pair it. My phone and iPad had no issue finding it. I finally managed to get the app to work, briefly, but that was long enough to pair it to my Alexa. So I can stream music but there is zero light control.","updated":"2020-11-13T13:15:31-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1922973582","userName":"Heatherp-s7plus","userUrl":"https://itunes.apple.com/us/reviews/id544806343","version":"4.0.7","score":1,"title":"Can’t even find the bulb","text":"Recently added another master bulb to another room to manage separately on phone and it cannot even find the bulb. The application does not even have the device management button, and the screen is constantly “searching”. There is not even a a scan QR option. The iPad app is better.","updated":"2017-11-15T07:42:17-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"2301988055","userName":"Cimicata","userUrl":"https://itunes.apple.com/us/reviews/id43562657","version":"4.1.1","score":1,"title":"Why isn’t there a default volume setting?","text":"The app lets you save a default brightness, but for some reason the same option is not available for volume. You are forced to launch the app every time, wait to connect to the bulbs, and navigate through the app if you prefer anything other than 80%.","updated":"2018-03-13T07:52:34-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"6446729125","userName":"Romanotrax","userUrl":"https://itunes.apple.com/us/reviews/id34232690","version":"4.2.6","score":1,"title":"Failing to find.","text":"I used to be able to find the bulbs with my iPhone or iPad with a little bit of work.  Today I tried it after updating to iOS 14 for both phone and iPad and it will not connect through the app or even trying to connect with Bluetooth","updated":"2020-09-19T13:46:49-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"4895835014","userName":"PAC MAN STINKS","userUrl":"https://itunes.apple.com/us/reviews/id39512651","version":"4.1.1","score":1,"title":"App is USELESS","text":"you can’t control the brightness of the lights due to the fact that their own app can’t find their own lightbulbs. Oh, but the whole time the app is “searching for bulbs”, I’m playing music through them. ALREADY CONNECTED TO MY DEVICE!!  I will return the product, the sound is great but if I can’t control The. Ulna they are worth nothing to me.","updated":"2019-10-05T20:34:16-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"2498318088","userName":"vane-69","userUrl":"https://itunes.apple.com/us/reviews/id792372101","version":"4.1.1","score":3,"title":"Update app!!","text":"Seriously, this app needs updates. It’s cool and all, but the fact that it glitches when you’re trying to start it up not letting you dim the light or lower the volume setting.","updated":"2018-05-02T21:38:30-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1807992176","userName":"ddtape","userUrl":"https://itunes.apple.com/us/reviews/id24730139","version":"3.0.1","score":2,"title":"Good enough","text":"The latest version has a bug where the bulbs do not store their last brightness or EQ setting. \n\nIt be nice if the bulbs have a smoother brightness transition similar to how the “identify bulb” dims smoothly. \n\nOther than that, the app works but should be upgraded to the native resolution of newer iPhones.","updated":"2017-09-24T14:30:59-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1869437030","userName":"SoNotARapeEr","userUrl":"https://itunes.apple.com/us/reviews/id177923967","version":"4.0.5","score":1,"title":"Fix brightness storage!","text":"If you give a bulb a brightness setting in the app, then turn the bulb off, then turn it back on, the bulb goes back to 100% brightness even though on the app it says it is saved as a dimmer setting.  Please fix this for $50/bulb it needs to save the setting or the user experience is not good.","updated":"2017-10-23T07:25:13-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1845999703","userName":"FUSIONry","userUrl":"https://itunes.apple.com/us/reviews/id135982396","version":"4.0.5","score":1,"title":"The Speakers works but the App Don’t!","text":"I connected the bulbs as instructed via the app, now the bulbs worked fine and sound comes out from the speaker, except I don't see my bulbs in the app!\n\nContact Us and Support is a shame.\nThey keep postponing the trouble after a very long communications with no hope to fix nor to replace!","updated":"2017-10-13T06:07:42-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"6257956324","userName":"77bfd","userUrl":"https://itunes.apple.com/us/reviews/id439269047","version":"4.2.6","score":3,"title":"Doesn’t pair with second set of bulbs","text":"I really like how it works with the first set of bulbs.  Can’t get the app to pair with the second set.","updated":"2020-07-29T21:35:30-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"3571533685","userName":"Qhisky","userUrl":"https://itunes.apple.com/us/reviews/id416586809","version":"4.1.1","score":4,"title":"Light","text":"Little disappointed. Could have been a multiple color light but over all very good","updated":"2018-12-25T06:39:11-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1967761458","userName":"Minion2012","userUrl":"https://itunes.apple.com/us/reviews/id15251604","version":"4.0.7","score":1,"title":"Doesn’t work anymore","text":"The app use to connect very easily and I could change the brightness and volume. Now the app won’t even find the bulbs.. which makes them basically worthless. I’ll call the company on Monday but previous experience tells me it will be futile.","updated":"2017-12-03T08:46:19-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"5757242773","userName":"fmfan3780","userUrl":"https://itunes.apple.com/us/reviews/id190279501","version":"4.1.1","score":5,"title":"Please provide a custom equalizer function!","text":"Love these speakers but would LOVE a custom equalizer function.","updated":"2020-04-03T11:40:50-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"4534394446","userName":"Kiddddd12321231","userUrl":"https://itunes.apple.com/us/reviews/id182866758","version":"4.1.1","score":1,"title":"The app doesn’t work!","text":"Time and time again I’ve tried to connect the app to the master and satellite bulbs. The bulbs are never found in the app. I can play audio through them but I cannot adjust the brightness of the lights. The bulbs only serve half their purpose.","updated":"2019-07-28T18:16:50-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"3149343280","userName":"Just.me.123","userUrl":"https://itunes.apple.com/us/reviews/id246789906","version":"4.1.1","score":1,"title":"Recommend using a different brand","text":"This is a great concept and sometimes works well. Other times, I can only connect Bluetooth but the app controlling the lights and volume to does not connect. THIS IS VERY FRUSTRATING... to the makers, please address this issue, the bulbs are not cheap 😡","updated":"2018-09-03T10:12:39-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"2167614477","userName":"BarrowFull","userUrl":"https://itunes.apple.com/us/reviews/id41468836","version":"4.0.10","score":4,"title":"please Please PLEASE....","text":"Why is there no Alexa Skill?? Sengled Element Home is awesome with Alexa, I would REALLY like to have all my sengled bulbs operable within one app, why separate Sengled? Then I can manage all through Alexa! :)","updated":"2018-02-04T12:47:26-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"6771637408","userName":"Bigboy23142314","userUrl":"https://itunes.apple.com/us/reviews/id114409490","version":"4.2.6","score":3,"title":"Help!!","text":"Dish network came to install the new hopper and the sound synced with the bulb. I’ve tried everything pls help!","updated":"2020-12-19T12:20:22-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"6053480612","userName":"atl4life","userUrl":"https://itunes.apple.com/us/reviews/id32818892","version":"4.1.1","score":3,"title":"Alexa won’t connect","text":"Everything works greet and great sound but I can not get it to connect with the Alexa","updated":"2020-06-08T22:31:42-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"6962115733","userName":"Loric U","userUrl":"https://itunes.apple.com/us/reviews/id108617750","version":"4.2.6","score":4,"title":"A Windows app would be nice","text":"To add to a computer for extra speakers would be nice.","updated":"2021-02-06T10:17:32-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"4060675301","userName":"mjl317","userUrl":"https://itunes.apple.com/us/reviews/id19815818","version":"4.1.1","score":3,"title":"Ok app","text":"Make it so you can set a time for the might to turn on. App looks nothing like pictures in App Store.","updated":"2019-04-25T19:20:33-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"4383553877","userName":"Greek Woman","userUrl":"https://itunes.apple.com/us/reviews/id307154467","version":"4.1.1","score":5,"title":"Great","text":"I love it. It does what it’s supposed to do. Why others are not happy?","updated":"2019-06-28T18:11:46-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"6990814881","userName":"Darrinf15e","userUrl":"https://itunes.apple.com/us/reviews/id193316242","version":"4.2.6","score":1,"title":"Sharing data","text":"It won’t stop asking me to share data... it requests it every 60 seconds and will not stop... I’m sending these back!","updated":"2021-02-13T13:56:31-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"2066370823","userName":"sengled costumer","userUrl":"https://itunes.apple.com/us/reviews/id693051826","version":"4.0.7","score":1,"title":"APP IS TRASH","text":"I have had the bulb for two days and the app no longer finds it. I can still control the brightness from the light switch, but it is always at 100%. The bulb works sound wise, but the app is useless.","updated":"2018-01-07T08:50:31-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"5310872083","userName":"Nerf lol","userUrl":"https://itunes.apple.com/us/reviews/id29649781","version":"4.1.1","score":1,"title":"Search Mode","text":"You are unable to control the light or volume by app literally stay on search mode","updated":"2019-12-23T17:20:34-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1812347718","userName":"Catzeye6","userUrl":"https://itunes.apple.com/us/reviews/id219585846","version":"3.0.1","score":1,"title":"Not playing music","text":"I was able to connect it to Bluetooth and control the light thru the app on my phone but when I played music from my phone, the speakers dint work!","updated":"2017-09-26T23:54:01-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1714481130","userName":"Dickiebradford","userUrl":"https://itunes.apple.com/us/reviews/id85423151","version":"3.0.1","score":1,"title":"Not as advertised!  No way to toggle AMP input/output","text":"Purchased create a surround sound system but no way to toggle from input to output in the amp. Major Bummer!!  They should update the description in the link kit description....  $200 down the drain...","updated":"2017-08-05T10:16:46-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"2063250372","userName":"Producerflie","userUrl":"https://itunes.apple.com/us/reviews/id35001464","version":"4.0.7","score":1,"title":"Pure trash","text":"No longer works. Won’t even pair with iOS anymore. Light works but speaker is worthless. Company won’t respond to support messages. There is zero support for this product.","updated":"2018-01-06T09:52:14-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"7367966935","userName":"VovanAtb","userUrl":"https://itunes.apple.com/us/reviews/id203495821","version":"4.2.6","score":1,"title":"Not working","text":"Pretty much its just regular bulb with no extra functionality, its “still searching for the bulb” forever…","updated":"2021-05-20T17:52:32-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"3569729672","userName":"Yesminster","userUrl":"https://itunes.apple.com/us/reviews/id267195017","version":"4.1.1","score":1,"title":"Worthless software","text":"Lost link with all my satellite and master is t detected anymore although the music plays. I can no longer controls the lights.","updated":"2018-12-24T20:48:13-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"2728737809","userName":"Southshore rocker","userUrl":"https://itunes.apple.com/us/reviews/id14031267","version":"4.1.1","score":2,"title":"Meh","text":"Great lights / horrible app. Most of the time the app won’t connect. It’s up to date and close to master light but won’t connect. FIX YOUR APP AND YOU’ll HAVE A GREAT PRODUCT GUYS!!","updated":"2018-06-19T21:14:35-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"2596745152","userName":"Salley1518","userUrl":"https://itunes.apple.com/us/reviews/id140725751","version":"4.1.1","score":1,"title":"Doesn’t work most of the time.","text":"80% of the time the app doesn’t work. It doesn’t connect or it doesn’t load correctly.","updated":"2018-05-25T19:48:34-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"2522813235","userName":"Aaron Cortez V","userUrl":"https://itunes.apple.com/us/reviews/id701170680","version":"4.1.1","score":1,"title":"Horrible technology","text":"Doesn't recognize my bulb is on!!!! Waiting for this to be fixed it’s extremely annoying.","updated":"2018-05-08T23:53:53-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1849535782","userName":"bdisssatissfied","userUrl":"https://itunes.apple.com/us/reviews/id33558426","version":"4.0.5","score":1,"title":"No connectivity","text":"New version won’t let me connect to bulbs. I was a huge fan until now. Would rather put an 80’s boom box out than fight with this mess,,","updated":"2017-10-14T19:27:15-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"6574541795","userName":"Istacio","userUrl":"https://itunes.apple.com/us/reviews/id199380862","version":"4.2.6","score":1,"title":"Won’t Connect to my phone","text":"Lights won’t connect or even be discovered by my phone.","updated":"2020-10-25T19:33:30-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1391197216","userName":"Ryanjames486","userUrl":"https://itunes.apple.com/us/reviews/id100104760","version":"2.6.2","score":2,"title":"Extremely slow to turn on lights","text":"In order to connect to the lights/speakers, you must go in to settings > bluetooth and connect to the device EVERY time you leave range. It does not automatically reconnect after leaving range. That is just to use the speakers.\n\nTo control the lights, you have to download and open the Pulse app. Ok, no big deal. But if I want to turn on the lights, I have to go to settings > bluetooth, connect to the lights. Then I have to open the Pulse app (I usually wait 10 or so seconds before opening it, because I find if I open the app immediately after connecting to bluetooth, I end up waiting indefinitely), and then the Pulse app needs to do its own connection to the lights. From there, you can control the lights. Turning on the lights generally takes ~35 seconds (I timed it). To me, this is completely impractical as a primary light source in any space.\n\nOnly one device can be connected to the lights/speakers at any time, so if my husband wants to turn out his light while we're in bed, it can only be done on my phone.\n\nThere is a no Apple Watch compatibility.","updated":"2016-06-08T16:37:03-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"5239585326","userName":"Thisappsuckapple","userUrl":"https://itunes.apple.com/us/reviews/id350225041","version":"4.1.1","score":1,"title":"Needs an update","text":"App doesn’t work anymore","updated":"2019-12-06T02:36:56-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"4374497078","userName":"Bamaxwer","userUrl":"https://itunes.apple.com/us/reviews/id565142439","version":"4.1.1","score":1,"title":"Ugh!","text":"App won’t connect to my bulbs, therefore I’m playing with the lights on in the daytime. Can’t control lighting or volume!","updated":"2019-06-26T17:39:25-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"7309972111","userName":"CakiUL","userUrl":"https://itunes.apple.com/us/reviews/id786013696","version":"4.2.6","score":1,"title":"Don’t buy","text":"Don’t by/ scammers and very low quality","updated":"2021-05-07T14:50:44-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1818484204","userName":"nicholasroig","userUrl":"https://itunes.apple.com/us/reviews/id208543979","version":"4.0.5","score":1,"title":"Pulse Solo no longer functions with iOS 11","text":"Bluetooth is connected, application does not want to find the light bulb","updated":"2017-09-30T03:15:48-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"6930640334","userName":"Korn4u","userUrl":"https://itunes.apple.com/us/reviews/id105292800","version":"4.2.6","score":1,"title":"Add device","text":"The add device bottoms are almost untouchable will not recognize the Bluetooth adapter at all","updated":"2021-01-29T19:33:34-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"3386150943","userName":"prettychef","userUrl":"https://itunes.apple.com/us/reviews/id157318620","version":"4.1.1","score":1,"title":"Waste of money!","text":"My speakers worked for like a month.... \nnow they wont even connect.... \nat \nall.... \nwaste of money!","updated":"2018-11-05T21:49:01-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"5327814116","userName":"Shush sherbets","userUrl":"https://itunes.apple.com/us/reviews/id453303198","version":"4.1.1","score":1,"title":"DO. NOT. WASTE. YOUR. TIME.","text":"When was this app last updated?? Absolutely trash product.","updated":"2019-12-27T13:55:15-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"5877565498","userName":"thisdickinyagutz","userUrl":"https://itunes.apple.com/us/reviews/id1162764917","version":"4.1.1","score":1,"title":"...","text":"this app takes way too long to pick up on my speaker. also the app is so old, needs updating.","updated":"2020-04-28T18:52:29-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"4988299441","userName":"Geo Gap","userUrl":"https://itunes.apple.com/us/reviews/id172783943","version":"4.1.1","score":3,"title":"Nice product and app but a few limitations","text":"The product itself is a neat ideas.\nSound quality is decent for such a small speaker.\nHowever, there are a few annoying features or limitations.\n1). Every time you switch the bulb on, there is an audible beep for the speaker Bluetooth.  If you happen to turn in the light at night when someone is sleeping, even from another room it can be heard.  There is no option that I could find to disable this audible beep.  This should be fixable if Sengled were to choose to change this.\n2). When you shut off the light switch, the last persons device that was connected to Bluetooth speaker remains ready to connect the next time the slight switch, preventing another family meme bet to connect unless the previous person deliberately disconnects their device before shutting off the switch.  I think this should be made an option in the app so that the owner can choose to administer the setting for last connected or next to connect.\n3). The lightbulb has a warm white light in its default.  While the maker claims millions of colors are achievable, I have not been able to achieve a cool white white if 5000k to match the other regular LED bulbs that this Sengled bulb is installed on.  I think that this is a programming shortcoming that should be correctable yo be able to choose a cool white or warm white for default.\n\nI hope that Sengled is paying attention to the ratings and comments and can fix these shortcomings, which in my opinion would I trade the rating to five stars.","updated":"2019-10-20T12:48:25-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1970746454","userName":"LabRatQueen","userUrl":"https://itunes.apple.com/us/reviews/id227379816","version":"4.0.7","score":1,"title":"Um fix it.","text":"It can’t EVER find my bulbs. Yet I can still play music out of them. New UPDATE PLEASE","updated":"2017-12-04T13:08:49-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1310100954","userName":"Dr. Oops","userUrl":"https://itunes.apple.com/us/reviews/id107476807","version":"2.4.6","score":4,"title":"Easy to use","text":"This app is very well designed with an intuitive interface. Controlling the speaker volume and light dimming is easy. Adding new speakers or a subwoofer is also straightforward. You don't need this app to use your Pulse lights, but it makes certain things easier. Volume and equalization can be controlled using whatever app you play music from. So the main uses of the Pulse app are controlling the light level, configuring new speakers, and setting the speakers to stereo or mono. It does these things well. \n\nThe app is very simple. As the technology evolves, I'd like to see more features added. One missing feature that seems important is the ability to control the volume of individual speakers. I have the Pulse lights in a room with a sloped ceiling. So the lower ones seem much louder than the upper ones. A volume control for each speaker would completely fix this.","updated":"2016-01-02T07:33:27-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1179875174","userName":"Mouse1979","userUrl":"https://itunes.apple.com/us/reviews/id29452218","version":"2.2.10","score":3,"title":"Interface issues","text":"I feel like the app should have both audio and lighting controls on the very first page. No flipping back and forth, no going to the upper right for settings for lights or sounds. All choices for settings and lights should be made to fit the first page you land on.  Also, it appears that my sound coming from the system if I turn the physical light switch off is defaulted to 80%. I'd like to see this turned into and option instead . Like the record last brightness feature. Most of us would prefer to use our devices to control the max volume and not the app.  Efficiency makes the app better. Not having to use the app, makes the experience even better. :)","updated":"2015-04-08T12:13:32-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1499581872","userName":"TU DMD","userUrl":"https://itunes.apple.com/us/reviews/id106932741","version":"2.7.8","score":1,"title":"Big potential if company is willing to listen","text":"My review is about Pulse link speaker/light bulb product. I love the idea of having speakers inside the bulb and I initially bought it to replace my speaker system for the living room. I am no audiophile so I am not comparing this with other high end sound system. My biggest annoyance is sound setting does not get saved but every time you turn off/on sound is set to 80% and unless you are a sprinter or have the app ready to adjust the volume, you will blow off your hearing cells. I see no reason why sound settings can not be saved just like the brightness other than forcing users to upgrade the entire system. At this point I do not recommend it to anyone. All my guests get super impressed when they see it but with this annoyances I can't recommend this product.","updated":"2016-12-10T14:44:13-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1493091419","userName":"Rdshrd","userUrl":"https://itunes.apple.com/us/reviews/id86884047","version":"2.7.7","score":2,"title":"Don't update","text":"New update brings you an ad for their products, when I pay for something, and rely on its usability, it's really annoying having to wait 3 seconds to skip whatever ad is in the way of my app. Will change when it's removed.","updated":"2016-11-29T15:16:41-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1175531316","userName":"Silver Surfer II","userUrl":"https://itunes.apple.com/us/reviews/id38872255","version":"2.2.10","score":5,"title":"Awesome, reliable product","text":"Ever since I heard of this product I have been hooked!!!  It was soo easy to install and the sound was as quality as my $1000 Bose System.... And the Pulse is a lot cheaper! This app helped me figure out the different uses of the Pulse and it provided me with the means of using the Pulse from the comforts of my couch! :)  I am very pleased with Sengled and the Pulse app...  I would recommend it to any home for any use!","updated":"2015-03-30T13:48:17-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1370785575","userName":"Semprincess","userUrl":"https://itunes.apple.com/us/reviews/id109269564","version":"2.6.2","score":4,"title":"App loads slowly","text":"While being an impressive device, it is not without it's flaws. When loading up the app, sometimes the screen will load, but the ability to adjust anything will not. You then have to rely on the phone/ iPad/tablet volume to make adjustments. Then later try to reload the app to see if it's in the mood to work for you.","updated":"2016-04-29T10:34:15-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1152098265","userName":"billpsu","userUrl":"https://itunes.apple.com/us/reviews/id142518087","version":"2.2.10","score":5,"title":"Awesome sound","text":"Great sound from such a small package!  The sounds was strong, crisp, clean and clear.  I tried the Pulse in many place, but I liked it best in my bedroom night stand lamp.  It was nice to have great audio, in that room.  Turning the volume up did not distort the sound.  I tried Alternative, Rock, Techno, Jazz and Classical – all sound great!","updated":"2015-02-17T19:01:45-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1337666673","userName":"Keepn-upw/kids","userUrl":"https://itunes.apple.com/us/reviews/id464805683","version":"2.5.1","score":5,"title":"New ways to wake up the kiddos","text":"I love it... I have 3 teens and getting them up for school is always challenging. But after adding a Wemo to this guy and an iftt recipe... Perfection! I can stream one channel and have the entire house wake up to what ever song Mom feels like that morning... Well done!","updated":"2016-02-23T15:03:15-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1503240633","userName":"Duartt","userUrl":"https://itunes.apple.com/us/reviews/id158980855","version":"2.7.8","score":1,"title":"No ADS please!!!!","text":"Well. Just got the iPhone 7 Plus. \nThe app looks horrible. Also they have included an ad on the app (what?!) every time you OPEN the app an ad comes!!!! Feel like you have just spent $120 on lightbulbs and it has ads. It's like getting an iPhone and every time you want to make a call it says, hey! Have you heard about the new device from apple? It is very very annoying. \nI love the hardware, but the software is not on the track!\nI have the pulse though","updated":"2016-12-16T18:48:52-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1199512671","userName":"HuntieGirl","userUrl":"https://itunes.apple.com/us/reviews/id213439000","version":"2.2.10","score":5,"title":"Amazing App for Amazing Product","text":"Coolest, easiest, most innovative product out there for consumer surround sound. App is very easy to use, works well and pairs easily with the lightbulbs. The sound is incredible, so impressed. - Hunter E.","updated":"2015-05-19T00:43:48-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1319290312","userName":"sinceyouasked","userUrl":"https://itunes.apple.com/us/reviews/id4010754","version":"2.5.1","score":5,"title":"Pulse","text":"Very easy to pair the bulbs with the iPhone app. Great product. I like being able to dim the lights and control volume from my phone.","updated":"2016-01-20T00:18:45-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1593132035","userName":"PKP Vlogs","userUrl":"https://itunes.apple.com/us/reviews/id465303740","version":"2.7.9","score":2,"title":"Can't connect to the light","text":"Updated the app, and I can connect to the light through Bluetooth, but when I use the app it acts like I'm not connected to anything. So there for, I can't adjust the brightness of the light, or how loud the light is.","updated":"2017-04-19T23:52:29-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1307338800","userName":"Hextor2040","userUrl":"https://itunes.apple.com/us/reviews/id41982378","version":"2.4.6","score":5,"title":"Apple TV support","text":"Love the speakers. Use them on a daily basis. However, I really hope they r working on an app for the new Apple TV. Would love to have the speakers work with my Apple TV.","updated":"2015-12-27T21:33:23-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1288479797","userName":"Andriau","userUrl":"https://itunes.apple.com/us/reviews/id467538899","version":"2.4.6","score":4,"title":"One app","text":"I have purchased a wifi Boost bulb and a Pulse bulb, and I need two apps to use them both. It would be nice if Sengled came out with a single app that could control all its bulbs :)","updated":"2015-11-18T16:57:32-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1493219069","userName":"IrieNest","userUrl":"https://itunes.apple.com/us/reviews/id21145682","version":"2.7.7","score":1,"title":"Ads every time I open the app","text":"I purchased this bulb and loved it until the most recent update. Every time I open the app, there is an add for discounts. I paid for this device and should not have to put up with an annoying ad every time I open the app. Please fix this ASAP!!!","updated":"2016-11-29T21:32:40-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1280638609","userName":"TSmith47","userUrl":"https://itunes.apple.com/us/reviews/id125970826","version":"2.4.6","score":4,"title":"Apple Watch support?","text":"It would be nice to be able to control from the watch.","updated":"2015-11-01T14:34:15-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1553843397","userName":"Micaheldotu","userUrl":"https://itunes.apple.com/us/reviews/id49588858","version":"2.7.9","score":2,"title":"Can't connect","text":"Ever since updating to the latest version, I can't connect to the light bulb, which is literally the only purpose of this app","updated":"2017-02-27T07:55:26-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1308778934","userName":"Jimbo440","userUrl":"https://itunes.apple.com/us/reviews/id39603521","version":"2.4.6","score":4,"title":"Needs Apple Watch support","text":"Great app, interface is good. Just wish it had Apple Watch support!","updated":"2015-12-30T16:46:02-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1493125293","userName":"Rinni33","userUrl":"https://itunes.apple.com/us/reviews/id111099077","version":"2.7.7","score":2,"title":"Ads? Seriously?","text":"You must see an ad before they let you use the app each time. Worst update ever.","updated":"2016-11-29T17:23:02-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1445190294","userName":"Amitkudtarkar","userUrl":"https://itunes.apple.com/us/reviews/id340552841","version":"2.6.2","score":1,"title":"Okay for music-can't connect to app","text":"Tried for about 15 minutes. Unable to connect to the app but was able to through bluetooth settings. It's meh.","updated":"2016-09-05T18:49:15-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1286131870","userName":"Richkid14140","userUrl":"https://itunes.apple.com/us/reviews/id242141063","version":"2.4.6","score":5,"title":"LOVE IT😍😍😍","text":"Just brought one from lowes and laying on the couch listening to my 🎼🎼🎼. Great idea. Love the app","updated":"2015-11-13T11:35:11-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1513526135","userName":"Texas Artisan","userUrl":"https://itunes.apple.com/us/reviews/id102741571","version":"2.7.8","score":1,"title":"Advertisement","text":"Why do I have to look at your dumb advertisements in order to use my product. This is ridiculous, remove your adds.","updated":"2017-01-01T16:17:56-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1412240401","userName":"Dedushka Lemon","userUrl":"https://itunes.apple.com/us/reviews/id491025563","version":"2.6.2","score":2,"title":"no","text":"It takes too long to opperate in app with simple task you can do by your hands","updated":"2016-07-14T23:43:36-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1427920779","userName":"Luna6064","userUrl":"https://itunes.apple.com/us/reviews/id352861226","version":"2.6.2","score":1,"title":"Won't connect","text":"App loads and tried to find Pulse Solo. Can't find the bulb and the app keeps turning my Bluetooth on and off trying to load and never does.","updated":"2016-08-06T04:50:32-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1431881661","userName":"auriAZ","userUrl":"https://itunes.apple.com/us/reviews/id251188083","version":"2.6.2","score":2,"title":"I hate the app","text":"The app Is very slow, I have a lot interference I need to put the iPad in special angle if not the music crack.","updated":"2016-08-12T17:03:56-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1498524724","userName":"Arianna Vacio","userUrl":"https://itunes.apple.com/us/reviews/id144666359","version":"2.7.8","score":5,"title":"perfect bulb/ app","text":"it's amazing & incredible. the sound is crisp and clear the lighting can go as bright or as dim as you'd like. 100% recommend","updated":"2016-12-08T21:41:58-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1466379864","userName":"BlakeBrindle","userUrl":"https://itunes.apple.com/us/reviews/id36717170","version":"2.7.3","score":2,"title":"Great Concept...  needs a little work","text":"The app can literally take up to one (1) minute to fully connect hardware once you select a product to control. There needs to be a way to \"bump\" a connected device if trying to connect a different device. Currently you have to disconnect (turn off) the \"Master\" device, turn off Bluetooth of connected device, turn the Master back on, then connect to the master through the Bluetooth of the other device. Just to dim a light?!...  there are 3 in household with iPhones and iPads for all. That's at least 6 devices that try to use the system. It can get very confusing. First world problems I know but usually you get what you pay for. A dimmer switch might be cheaper and more efficient. \n\nThe device \"bluetoothing\" to the Master must be VERY close to the Master.  Don't venture to far  otherwise there is a lot of static. This is even when using an iPhone 7 Plus. So the device is not outdated as of 10/14/16. \n\nIf some of these things could be addressed this would be a dream come true for whole home music and light control connectivity.","updated":"2016-10-13T23:11:46-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1581609618","userName":"C33pays","userUrl":"https://itunes.apple.com/us/reviews/id39460645","version":"2.7.9","score":1,"title":"Update broke this","text":"Same as prior reviews can't connect to my  bulbs","updated":"2017-04-05T17:43:59-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1378135188","userName":"4amq","userUrl":"https://itunes.apple.com/us/reviews/id481673806","version":"2.6.2","score":1,"title":"Apple watch","text":"Why don't u have an apple watch app???????","updated":"2016-05-13T15:08:06-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"1700700116","userName":"Jay elatab","userUrl":"https://itunes.apple.com/us/reviews/id248179114","version":"2.7.9","score":1,"title":"Stupid app","text":"Worse lightbulb ever","updated":"2017-07-27T08:13:37-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"7580398546","userName":"tootitoottoot","userUrl":"https://itunes.apple.com/us/reviews/id1131718704","version":"4.2.6","score":1,"title":"Unsuccessful,and worthless as a three legged chair","text":"If this app had a grade, it will get a d(development needed)!Reason:it loads so long and so slow, it tries to help but nothing is helped, it even took a long time to load on settings to. This app developer needs to do and update.If you won’t listen, fine suffer the consequences and waste of money.🤑🤑🤑 will later be you asking for money 👥🗣💰💰💰💴💵💵💵💰💰👎.I need a developer response about this in a couple of days.","updated":"2021-07-15T12:24:27-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"},{"id":"3819309823","userName":"Swthart","userUrl":"https://itunes.apple.com/us/reviews/id113653185","version":"4.1.1","score":1,"title":"Pain in the butt!","text":"Love having a bulb for my bedside that I can control from my phone... when it works. Usually I have to open and close the app 5+ times to make it connect. 😡 this app hasn’t been updated in a year. Make some improvements already!!! Such a disappointment.","updated":"2019-02-26T20:56:13-07:00","url":"https://itunes.apple.com/us/review?id=840052462&type=Purple%20Software"}]