[{"id":"2467560338","userName":"Aeiou247","userUrl":"https://itunes.apple.com/us/reviews/id147909556","version":"1.442.220","score":4,"title":"Great looking and sounding products, but the app needs 1 thing","text":"I have the 5 in my bedroom and also two 3’s and the sub grouped as a 2.1 system in my garage and they all sound amazing!  I’ll admit I had my doubts at first to the spotty/connectivity issues I had. I decided to upgrade my WiFi network to a whole house Eero Pro 3 router system and haven’t had a problem since. As others have said, most if not all negative reviews probably stem from a poor WiFi network. It’s nice that you can hardwire the devices to completely eliminate that from ever being an issue. If there is one thing I could ask for though, it would be an easier access to the EQ and sub level settings while playing music. As recordings and sources vary, I find myself having to navigate excessive steps to make a minor adjustment to the sub level.  PLEASE add an independent sub level (for grouped devices like my 2.1 system) at the music page!","updated":"2018-04-25T13:18:42-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"1997098826","userName":"Nitrodamus","userUrl":"https://itunes.apple.com/us/reviews/id28067455","version":"1.430.180","score":1,"title":"Heos App is horrible!!","text":"This is the worst music app ever.  I have two HEOS 1 Series 2 speakers with go packs that look and sound amazing when they work.  The problem is the app.  Everytime I use them I have to go into the app and find the devices and reconnect them to Bluetooth.  The app will  come up and say \"searching for devices\" but won't find them, even if I am standing right next to them until I do it multiple times.  Then I have to go back into Bluetooth and connect to the devices all over again.  If you then try linking the two devices to play together which they call \"pairing the devices\" it takes multiple tries as well.  I have to toggle back and forth between Bluetooth trying to connect and the HEOS app trying to pair until they finally work. This takes a minimum of 10 minutes and has to be done everytime you use them.  The app doesn't remember anything you have done before and the devices constantly lose Bluetooth connection.   The app is also very basic with no real features at all.\n I have had these for over a year praying for the day that Denon would try to save their reputation by updating this app with a new awesome version.   NOT!!  Very disappointed in Denon that they don't care enough to put a decent app out there to run an otherwise awesome product.  They look good, sound great and the go pack is phenomenal.  How could they package this together with such and archaid grade school level app?  Go figure?","updated":"2017-12-14T18:02:44-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7953820899","userName":"jbh2phd","userUrl":"https://itunes.apple.com/us/reviews/id33951269","version":"2.1.562","score":3,"title":"App has issues with Denon Home product line (in my case, a mixture of Home250 and Home350 speakers)","text":"Issue 1: poor user interface (UI). This looks like an app that development engineers hacked up to get the system working. UI organization is horrible with many redundancies and non-intuitive paths to what you want to accomplish. I can live with issue 1, but … Issue 2: some units will not upgrade firmware to latest version. They “think” they’re updated but they’re not. As a result, units have different firmware revisions, which breaks your ability to group speakers to, for example, get them all playing the same music.  After about 48 hours, the culprit speakers do update to latest firmware, but there’s no apparent way to control this other than leaving it up to the auto update feature and waiting until it does its thing in the background. \nIssue 3:  I’m sure it’s a big challenge to make the app interface well with all the music streaming services out there. The app doesn’t allow for search in Pandora, which is a major pain. The app also doesn’t show or give access to any content on my iPhone.","updated":"2021-10-25T15:28:26-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3446870796","userName":"geojunkie in OKC","userUrl":"https://itunes.apple.com/us/reviews/id221473093","version":"1.481.130","score":5,"title":"Heos in new Marantz AV preamp is fantastic","text":"I have been an audio and home theatre enthusiast for many decades.  We also have a wired whole house sound system. We added the streaming music source to it via a PC with a remote control PC app and streaming has become our main source. The problem is that using the remote app for the PC with security log ins and navigating the various music sources was really clunky and inconvenient.  I ended up being the only one who understood it well.  HEOS in the new Marantz home threatre preamp has changed everything for the better. The audio quality is far superior.  The variety and easy access to streaming sources is amazingly comprehensive. Control is super easy and intuitive.  Our local radio stations streaming feeds allow us to enjoy local programming with the same ease. The Home theatre sources are all available as well. My wife and children love being able to use it as well as I can. I can’t tell you how much of a game changer this has been.  We love HEOS.  Note: We do have strong WiFi everywhere.","updated":"2018-11-22T03:57:34-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5493725695","userName":"Rshide","userUrl":"https://itunes.apple.com/us/reviews/id10791255","version":"1.544.150","score":5,"title":"Wired Center Channel","text":"I have had this for about six months now and absolutely love it. I built a new house and spent allot of time researching what I would put in. My wife was insistent that we not have speaker enclosures visible so i needed to support in wall and in ceiling speakers. After some research I quickly discovered that heos was the only system that supported a wired center channel. I was nervous considering so many negative reviews of the app. After using it for six months I can honestly say I have no idea what the negative reviews are talkinG about. The app is intuitive. There are 3 steps 1) select what you are controlling, where you can easily combine zones to create a multi zone sync. 2) select your source, which can be any streaming service or any input on any of your physical devices and 3) control, volume, pause, skip. One thing that took a bit to find was how to expand the volume control so you can set individual zone volume. It is right under the master volume.","updated":"2020-02-05T21:17:40-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4033664434","userName":"WAEMario","userUrl":"https://itunes.apple.com/us/reviews/id599103088","version":"1.505.130","score":1,"title":"WORST...APP...EVER....IN THE HISTORY OF APPS","text":"Selected Denon over Sonos because the speakers have a lot of ways to connect music. All supposed experts reviews I read wrote that the Sonos speakers sounded better specially in large spaces. My space is not that big and I already had a Denon receiver so it made sense that I would just buy HEOS speakers to pair them along. Have a HEOS 1, 2, and 7. When the speakers emit sound they are great. Rich and profound sound comes out of them. The problem, and I’ve should have listen to the different blogs on the internet is the App. I feel like I am back at 1989 trying endlessly for any basic computer application to work. It’s insane the amount of time to pair the speakers, the countless times speakers do not appear, the countless times the speakers do not pair. I have probably one of the best internet connections ever but that’s not it. Unfortunately, Denon has applied all of their research and resources into sound quality but have not figure out that is 2019 when it comes to connectivity and wireless applications. If you want a one off speaker that sounds great, HEOS are excellent, if you want a cohesive sound system all over your house, don’t make the same mistake I did. This is not the system you want.","updated":"2019-04-19T10:49:20-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5351853063","userName":"glpdrum","userUrl":"https://itunes.apple.com/us/reviews/id336143420","version":"1.520.320","score":5,"title":"What am I missing?","text":"The people that rate this app poorly must be holding their mouth wrong or something. It puts everything you want in one location to witch you can control everything. As those who have it know Airplay is almost better than money and I put HEOS right by it. Instead of going to the network pc (Windows) and pushing music to my AVR I can grab it with this app. I have total access to my wav files on the flash drive and can make a queue or play track by track whatever I want. If there’s a music source connected to the network or online it will find it on its own and access it. Those of you who are having problems finding something you know is on the network turn that device off and back on again and HEOS will find it. Be patient and learn the app and you’ll love it.","updated":"2020-01-02T09:08:33-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2335721297","userName":"Samindalnac","userUrl":"https://itunes.apple.com/us/reviews/id32407810","version":"1.442.220","score":4,"title":"I’m a Systems Architect and Audiophile","text":"Half of the people reviewing this application are complaining about Bluetooth while the Heos devices are primarily WiFi speakers and that is how this application communicates. The other half are complaining about issues which are clearly caused by poor WiFi coverage and connectivity within their homes. \n\nIs this app aesthetically pleasing? No, and that’s a shame, but it is for the most part functional. For those speaking to issues with individual receivers and zone configuration try ensuring your firmware is up to date. I’m not saying that fixes everything, but give it a shot","updated":"2018-03-22T20:03:10-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5406287458","userName":"MysticNord","userUrl":"https://itunes.apple.com/us/reviews/id116079649","version":"1.520.320","score":3,"title":"Wonky","text":"Well, when it works it’s great. I’ve a Denon HEOS AVR and the app works with that each and every time, maybe because it’s hardwired to my network. I also have two HEOS 3 HS2 speakers (which sound amazing) stereo paired in the kitchen, and with them, the app is just plain finicky, but they are WiFi connected to my network. The connection is solid so I doubt that it’s a connection issue that sometimes causes various problems, such as dropping a speaker, failure to play from one of the in app streaming providers after having connected to the service, and in the case of my wife’s app, random crashes. This is after having deleted and reinstalled the app, reconnecting and configuring the speakers, resetting the app controller and standing on one foot while swinging my black-cat-mojo-bone in a brown paper bag over my head. Anyway, I look forward to future updates resolving these issues, and when that happens, it will be a five star app.","updated":"2020-01-15T03:39:36-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3375893791","userName":"BirchwoodBill","userUrl":"https://itunes.apple.com/us/reviews/id6161886","version":"1.481.130","score":5,"title":"Good sound, requires a good connection","text":"I have 2 HEOS 1 and 3 HEOS Amps connected to Boston acoustics speakers.  Have owned them for 2-3 years.  The app works in coordinating the sound.   The biggest problem has been with intermittent WiFi.  On the heos 1 speakers they sometime just drop off the network and fail to reconnect.   I have to remove the battery base and the power cord then reconnect the power.   Then the speakers come back online.   So the firmware in the speakers probably needs to be reviewed so they reconnect to the WiFi better.  I hope they add a sleep timer to the firmware so the speakers turn off after streaming.   However you can just play an album or a play list.\n2019-nov-03 \nUpgrading the mesh network and the internet gateway has helped the connection problem.   I have also moved all the connections from a managed switch to an unmanaged switch.","updated":"2018-11-03T04:58:25-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6154254611","userName":"utachi","userUrl":"https://itunes.apple.com/us/reviews/id33767397","version":"1.562.200","score":2,"title":"HEOS flaws to control the ND8006-PM8006 pair","text":"HEOS miss one important opportunity: making the duo PM/ND8006 operate as one integrated device. I explain: while you can turn both devices on using the HEOS app, you cannot do that in one click. That’s a shame. The switch to turn the amp (PM8006) on is almost hidden in the “music” session of the app! Also, because of that, when you connect Alexa to HEOS, you cannot turn the streamer and the amp with one command. That’s frustrating, it seems an easy fix. Marantz, please fix that and let us enjoy the full integration of our wonderful audio system (PM+ND) with simple voice or app commands.\nUpdate: I need to add that this is a highly unstable app. It crashes often and is often left “hanging” without connection. When is Denon/Marantz going to finally pay attention to the app????? I hate to have exceptional sound and horrible user experience.","updated":"2020-07-03T16:28:00-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5476268576","userName":"hijacks your system","userUrl":"https://itunes.apple.com/us/reviews/id12878525","version":"1.544.150","score":1,"title":"Hijacks the whole system","text":"It’s great when it works but often hijacks the whole system and intermittently kills the sound when just watching TV.  It also switches randomly to other inputs. We know this is the culprit as when we delete the app (off all devices which is annoying) and sign out completely and sign back in..it seems to work. My husband has nostalgia for the brand as it was his first stereo and he thinks the sound is nice. But to come out with an app to compete without being functional is irresponsible. There is nothing worse than having company over, music on and your stereo decides it has other plans. Or watching a movie and it decides its will switch to a different input. I went to the App Store to make sure we weren’t missing an update. Sadly over and over not the case. I am not one for reviews but hope you can use this to get the resources needed to fix these major glitches.","updated":"2020-02-01T15:15:00-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6800810343","userName":"MunchieRun","userUrl":"https://itunes.apple.com/us/reviews/id32083563","version":"1.583.161","score":5,"title":"Near 5* Can’t Have EVERYTHING","text":"Near totally satisfied. After reading reviews, hope that others will check network connections before submitting negative reviews as this app is amazing considering it works with so many different platforms involved. \n\nI began utilizing it after setting up my Denon home theater 9.2 system. It would be great as mentioned in other reviews to have a more fluid avenue to adjust even just the bass and treble but the menu for channel adjustment would be a dream. \n\nOverall the apps they’ve made available to us are beyond my level of acceptance (especially because they’re FREE) and doesn’t make me question buying the other one they offer for my setup.","updated":"2020-12-27T14:05:42-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3769821947","userName":"Stephchern","userUrl":"https://itunes.apple.com/us/reviews/id305458238","version":"1.493.170","score":2,"title":"HEOS App Needs a Major Upgrade.","text":"We built a new house and did built in speakers in several rooms including surround sound in our basement rec room and outdoor speakers for the pool. I do like the quality of the speakers, but the app needs a major overhaul. \n\nThe app is tricky to learn, it took quiet awhile for me to catch on to. My husband pretty much refuses to use it. Also, with the last update the app keeps trying to update the speakers, which was just done not long ago. I keep hitting “update tonight” but it overrides my choice and tries to “update now” anyway. Our internet is not the greatest so this is super annoying and prevents me from getting to use the system when I want!\n\nEvery time I see there is a HEOS app update I hope that it’s a major one. Hopefully it happens sooner than later. We have a $6,000 audio system that should have came with an app that is much better quality than it is.","updated":"2019-02-14T11:30:22-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5304512470","userName":"HS2012","userUrl":"https://itunes.apple.com/us/reviews/id150035015","version":"1.520.320","score":3,"title":"Wasted potential","text":"HEOS has/had so much potential from design and hardware point of view. However, software support is seriously lacking. On a paper, HEOS has HiRes support, various input options including Bluetooth, aux in, USB, airplay etc, extensive lineup with AVRs, many standard support DTS etc.\n\nHowever, no Roon support, no Apple Music, AirPlay didn’t get added to expensive Heosbar nor on second gen HEOS speakers.\n\nDenon is now releasing Denon home series and therefore trying to get into smart speaker market. This is a great move from hardware perspective to add another device on their extensive line up. But they seem to be always years after SONOS. \n\nThe biggest issue and trend here is; however, the lack of support on existing customers from software stand point of view. App has looked the same despite all the negativity its receiving on online reviews. Even now still no support on major stream service like Apple Music.\n\nI believe Sonos devices retain relative values because each device sees upgrade via software and firmware. Please make App better, more professional looking and easier navigation, and most importantly speed up software update process e.g. Apple Music Support.","updated":"2019-12-22T05:24:13-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7482691274","userName":"dario argento907","userUrl":"https://itunes.apple.com/us/reviews/id33644594","version":"1.583.490","score":2,"title":"Just okay.","text":"The functionality of choosing which speakers and system works great, and it’s nice to have one app that gets your streaming services all in one place...BUT, in this day and age it is simply unacceptable to have such a poor interface. The search functionality of Tidal is so freaking bad they should be ashamed of themselves. If you don’t spell the name of the artist or song perfectly, the search won’t recognize what you’re looking for. In this day and age that is just completely unacceptable. That technology is almost 30 years old at this point and HEOS couldn’t bother to put it in their app. Also the way the song queue works is a mess. It’s great to use the app from your phone to control your system but the HEOS app is a mess. Had I known how lame it was I might have chosen a different receiver. HEOS needs","updated":"2021-06-19T08:40:24-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5529710355","userName":"BUBearsFan","userUrl":"https://itunes.apple.com/us/reviews/id490932247","version":"1.544.150","score":1,"title":"Doesn’t touch Sonos","text":"Don’t waste your money! I owned a Sonos system and now invested in the latest HEOS Home with playbar, sub, 4 150’s and a 250 for a total of 3 rooms. Setup via the app is terrible!! Setup with Sonos is 1000 times easier and everything just works. Good luck tuning the home entertainment room for surround sound. Speakers drop. TV input drops. Sometimes no sound from a room even though blue light is on. Difficulty getting sound from all rooms when grouping. No it’s not the WIFI. No it’s not the size of the apartment which is 80m2. App is not intuitive at all!! Doesn’t work with Apple Music. The place where I bought it says Denon is coming with an app update in May. That’s 3 months from now and based on previous reviews with same/similar problems, I expect no solutions. Will probably return today and replace with Sonos. Because Sonos works and Sonos is supported.","updated":"2020-02-14T03:19:26-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6997923560","userName":"Fchixon","userUrl":"https://itunes.apple.com/us/reviews/id16245269","version":"1.583.431","score":2,"title":"Clunky awkward login and control","text":"This app is medium and clunky. I find that it keeps trying to play stuff and my Marantz receivers(1 and 2 year old models) keep trying to play tracks after I have paused them and switched to a different input (cable etc). It takes a few tries and settles down. \nNavigating a larger collection of music on my server is tedious and has yet another way of selecting favorites and playlists. \nPlaying higher resolution music is nice but there is not much info if it can’t play a format other than skipping the tracks and sometime giving me message. Some formats won’t play on this app but play fine when played directly on the device. \nYou cannot manage much on the receivers since it only looks at a subset of features on them. \nSometimes it finds the receivers, other times it is searching for them. \nSince there is no web log in it is very hard to find your password and it’s unclear what benefit I get from logging in to the system. \n\nIt can be made into a nice app, but it is primitive and unintegratrd at this time. Since the company owns all of the receivers they should be much more tightly integrated that they are. \n\nSonos is a good model to copy.","updated":"2021-02-15T09:08:15-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6256545817","userName":"Josh Karp","userUrl":"https://itunes.apple.com/us/reviews/id39596845","version":"1.562.280","score":2,"title":"App is horrible","text":"I’ve had my HEOS bar for a couple of years now. For some reason, despite having a flawless home MESH network, the HEOS bar and subwoofer have trouble staying connected to each other and the network. And the app is so archaic that it really is no help at all. In order to fix the problem you have to physically plug your phone into the sound bar and do a bunch of steps that seems very Y2K. \n\nLast night, about 8 hours after the app updated, the HEOS bar started flashing yellow/green and woke us up. I’m assuming this was a software update but now, once again, the app can’t find the speaker! My god is 2020. This stuff should JUST WORK!\n\nAll in all I would avoid this App and Denon in general. Try Sonos or BlueSound or anything else....","updated":"2020-07-29T12:14:54-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5419385557","userName":"Mikethe3","userUrl":"https://itunes.apple.com/us/reviews/id107688545","version":"1.520.320","score":3,"title":"Half baked","text":"The HEOS setup basically works, but has several flaws. Despite having Bluetooth, I am required to hook my mobile device up to the HEOS speaker using a custom cable. Guess I better not ever loose that or I won’t be able to set my speaker up again. Secondly, the app wants to name the HEOS devices by room name. For those of us who have other smart devices, a basic room name isn’t specific enough, and conflicts when trying to pair with the Alexa skill. I have several smart plugs already grouped under “Living Room.” What I need is to name my receiver “Receiver” and my remote speakers “Speaker 1,” “Speaker 2,” etc. The app should give us the ability to customize the names.","updated":"2020-01-18T07:26:32-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3226832305","userName":"Ghetdjc","userUrl":"https://itunes.apple.com/us/reviews/id102234290","version":"1.466.240","score":5,"title":"Have to have a solid network","text":"The app and the HEOS system in general work great and the sound quality is superior to that of sonos. That being said, you must have a rock solid network for this to work reliably. No network extenders that plug into the wall, no dual router setups, no service provider routers. You need consistent internet service, a solid router and wired access points if you home is  large. Also, hardwiring your HEOS devices is the way to go unless it's not possible. If you have a router that does 5g and 2.4g but uses the same name for both (eg ATT) it will cause problems like “searching for devices”.","updated":"2018-09-24T18:51:01-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5457062950","userName":"mjmjmkjjmmkiim","userUrl":"https://itunes.apple.com/us/reviews/id307922889","version":"1.544.150","score":2,"title":"Marantz7011 w HEOS app recent problem","text":"Since the latest update, my Marantz will literally turn on without guidance and HEOS will play music online.  This just started happening, it’s the most confusing and haunting thing all at the same time.. Imagine walking into your home with your music on when no one is home... This morning at 5am once again it decided to just switch on, wonderful timing.. This has happened 4 times in the last week, no clue, however I have narrowed it down to something within this application.  Please work on an update HEOS to fix this! I’ve been using this application and the Marantz app for the last 3 years with livable issues, this is not one of them.","updated":"2020-01-27T19:45:29-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3559762481","userName":"PF_16","userUrl":"https://itunes.apple.com/us/reviews/id158712183","version":"1.481.160","score":1,"title":"Zero Development - STAY AWAY","text":"I’ve owned my speakers for over three years now. During that time, there has been no features added to compete with other wifi speaker systems. The amount of music platforms is very minimal, there is no crossfade option, no sleep timer, no desktop app for your computer, and playing local music from your mobile device is hit or miss. \n\nAll of these issues are leading me to selling these speakers and moving over to SONOS, who spend time continuously developing their platform for their customers. There are so many music services available on SONOS, including Apple Music and Plex! Sleep timer? No problem! Crossfade to enjoy seamless playback? No problem! Get it together Denon. HEOS is getting blown out out of the water and all you need is a couple developers to fix it.","updated":"2018-12-22T06:45:11-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3697287329","userName":"Allen34345655","userUrl":"https://itunes.apple.com/us/reviews/id510324174","version":"1.481.160","score":5,"title":"January 2019 works, as supposed","text":"I witnessed no real problems with this application, I would say it is really useful and cool way to manage home sound system. I think there is one missing functionality (not an issue, but opportunity to improve) and that is memorizing several different setups. For example for louder party music in living room only, opposing to smooth background music in all rooms. With pushing memorized setting button to change all together at once. HEOS is truly revolutionary way to manage music at home and this app is nice cream on the cake to CEOL + Soundbar. Thank you Denon!","updated":"2019-01-26T08:19:33-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7896464399","userName":"Bigstymie","userUrl":"https://itunes.apple.com/us/reviews/id110692096","version":"2.1.561","score":3,"title":"Great When It Works (but buggy)","text":"I bought a new Denon receiver last December at least in part because the updated technology allows me to play music via WiFi connection from my phone and iPad. The software enabling this functionality (HEOS) works well for most of my music, but I have experienced increasing issues with the app being “unable to play” media from my wireless devices. It’s ironic because the app stops working in the middle of songs and then attempts other songs from the same playlist. Clearly not a network connectivity issue. Hope the developers fix the bugs….","updated":"2021-10-09T12:51:08-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2212833498","userName":"Citizenearth","userUrl":"https://itunes.apple.com/us/reviews/id42189029","version":"1.442.190","score":5,"title":"AV guy using this with minimal issues","text":"Read lots of bad reviews, but as an installer, and user in my own home, if you have strong wifi, and did the updates, no problems.  Tested Sonos here as I do with all products I sell and install, my wife told me to get it out of here.  User interface is super easy.  If you are having issues, 1. close the app completely, 2. reopen, 3. check your wifi, 4.cold boot, 5.tech support, 6. worst case swap out for a new unit.  Sometimes you get a bad part.  I have worked on several systems, Sonos, Bose, Samsung, Polk, B&W.  I prefer HEOS.    Good luck and God bless.","updated":"2018-02-15T18:25:56-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6397920316","userName":"rob01!","userUrl":"https://itunes.apple.com/us/reviews/id464054220","version":"1.562.280","score":5,"title":"Great app and Great DENON receivers!","text":"I really enjoy the app on my phone and Alexa, I Can turn on or off any of my 3 DENON receivers from anywhere (obviously 99.9 percent from within home) and choose any station or type of music.\nI have 2 of the 3500 and 1 of the 1609 series and of course you have to pair them with good speakers, the sound is amazing.\nI use the “MULTI CHANNEL STEREO “ setting, red switch on the bottom of the control, when listening to music, this way you can enjoy the stereo music in all the channels/speakers, not just the front speakers.","updated":"2020-09-05T07:02:24-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6804662859","userName":"DiJoProd","userUrl":"https://itunes.apple.com/us/reviews/id194527804","version":"1.583.161","score":4,"title":"Well done","text":"The HEOS app is reasonably well done.  Simple, straight forward to use, and reliable.  My only complaint is that the log in tended to be a bit finicky but once I overcame that with no small effort it’s smooth sailing.  Love that I can use my iPad to explore and play through the receiver as I’m doing it.  I’ve got 2 Apple Homepods and they sound great for their size, and certainly are convenient, but when I really want quality of sound I use my Denon receiver - hands down.  Using the HEOS app for exploring music and streaming options is a huge bonus in my opinion.","updated":"2020-12-28T15:15:18-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8094306125","userName":"Streaming ...","userUrl":"https://itunes.apple.com/us/reviews/id202077356","version":"2.1.680","score":1,"title":"Denon HEOS App not finding AVR","text":"This is the FIFTH of FIVE reviews (they apparently aren’t posting them) that I have written in the last several days and I’m giving it a one star. I don’t know how the review of average of 4.2 stars is really being calculated because if you look down through posts, you’ll see a one star review one or two times a day, and reviews that are most favorable and you’ll find about one a month over the last number of months so, I think this 4.2 number is false. To be fair to the manufacturer, when HEOS works it’s nice, but why do they keep fouling it up? Makes me wonder is the HEOS app even necessary as the Denon 2016 app is really driving the system sufficiently.\n\nStill not working.  My wife deleted it from IPad.","updated":"2021-12-04T06:51:16-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5138057429","userName":"rifer123","userUrl":"https://itunes.apple.com/us/reviews/id206454998","version":"1.520.320","score":4,"title":"Squandered","text":"Nice speakers, but the software is horrible. You can’t get to the setup menu half the time, you can’t address a password problem w/o closing the app and signing back in, or using another phone to tell Denon you’ve forgotten the password.  Once you change the password other devices may or may recognize it— insisting your new password is invalid!\n\nGetting to the hardware edit page takes too long, then if you do make changes it’s too long to update, or it may just lock up\n\nThey need to hire some real programs.","updated":"2019-11-14T10:24:08-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2102500010","userName":"helmsz","userUrl":"https://itunes.apple.com/us/reviews/id700977640","version":"1.430.180","score":4,"title":"Works good","text":"After reading all the negatives i was a little leary. But must say this works pretty well on the heos amp 2 so far. I have yet to connect it to my whole system with the denon receiver. Once i do that i will update this.  One thing i will that i dont like is that you cannot use the volume buttons on the side of an iphone se when the phone goes to sleep or when your not in the app.  Kind of annoying to have to open the app every time. But not sure if thats an app thing or a user thing 😂.","updated":"2018-01-18T14:31:23-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4666271168","userName":"jkillian","userUrl":"https://itunes.apple.com/us/reviews/id119419057","version":"1.520.140","score":5,"title":"Best in class","text":"We would be hard pressed to number the Heos products that we’ve installed.  Our clients sell them for us.  We have never had a request to take them back and sell a Sonos system.  While Sonos is the closest operating system to Heos, it is also where the similarities end.  The Heos platform is far and away more advanced and intuitive, is continually updating features and functionality, and is supremely constructed to deliver the very best in sound reproduction possible for a portable streaming solution.\n\nThere seems to be a disproportionate amount of negative feedback in the above reviews.  \n\nThere are really only two main criteria for complete satisfaction with the Heos line: 1) A comfortable working knowledge of your smart device, and 2) A rock-solid wireless network.  The latter is much more easy and affordable to achieve today.\n\nMore of the world needs to experience the product.\n\nJKL","updated":"2019-08-24T07:43:33-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2472095760","userName":"choppersrule","userUrl":"https://itunes.apple.com/us/reviews/id15736926","version":"1.442.220","score":1,"title":"Terrible app","text":"Do not waste your time and money with HEOS. The app keep “losing” the speaker and then you have to rejoin them. I have had this problem for well over a year and it never gets better. I bought one speaker with the intention of adding more in the future, but with the problems I did not and will not purchase any more. The speaker sounds great when you are finally able to get everything connected. Initially I was deciding between HEOS and So*os and went with Denon based on their reputation, sound, and quality of other components I own. I regret my decision now and wish I had went with the other one. I am now left with a speaker that is not good for much else than a paperweight. I would rate this app in the negatives if allowed. Denon, you have lost a loyal customer.","updated":"2018-04-26T15:27:26-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2285630592","userName":"MT7272","userUrl":"https://itunes.apple.com/us/reviews/id225457639","version":"1.442.220","score":5,"title":"Excellent Streaming App","text":"I have 2 HEOS HS2 Links.  They were easy to setup and the music streaming is awesome.  They do not integrate to my Savant control system, but it still works great.  The Links allow me to consolidate all of my streaming music services including a few of my wife’s favorite radio stations into one app.  And the fact that they are hard wired to my network make the music bulletproof. \n\nHEOS is highly recommended....I have no idea what some of these other reviews are talking about.  My experience has been smooth and seamless.","updated":"2018-03-08T16:47:03-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4605070643","userName":"JamesRoy","userUrl":"https://itunes.apple.com/us/reviews/id35218456","version":"1.505.130","score":1,"title":"Terrible","text":"If I was a VP or CEO for Denon, I would be ashamed of how poorly the software inhibits the ability to use the hardware. When I find one failure mode in the SW, I optimistically try a different method to see if that can bypass the bug.  When your product is an audio system, the essential performance is to play audio. Unfortunately, there are many times the Denon software (including this app, but also the software on the receiver) simply won’t play music. “Unable to play media” is the common error. Funny that it can throw this error even when I’m trying to play music off a USB flash drive that is directly connected to the receiver and it worked an hour ago! I truly wish I could return all Denon products and start over.","updated":"2019-08-11T21:24:15-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7750056065","userName":"Angry Abe L","userUrl":"https://itunes.apple.com/us/reviews/id149061238","version":"1.583.490","score":1,"title":"I can’t tell a lie…. I wouldn’t buy.","text":"I have an SR7010.  This unit has nothing to do with Heos.  Except that when the most recent app update for the nearly useless Marantz app I normally use came out, everything stopped working and it told me to download this app…. and provided me a nice link to the Google Play store (from my iPad app). ..before erroring out while trying to send the error report. This is just the latest trend in a long line of disappointments to audio amateurs whom have mistakenly purchased a Marantz product.  Maybe you should return what you bought and find a company that understands the ways the world started shifting from copper and capacitance to silicon and streaming.","updated":"2021-08-29T20:03:59-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2252434605","userName":"The Stereo Guy","userUrl":"https://itunes.apple.com/us/reviews/id71033182","version":"1.442.190","score":5,"title":"You need a robust network!","text":"Full disclosure I’m a Heos dealer. I have been in the electronics industry for 30 years.\nHeos is 95% of my networkable audio installs........why? because it’s the best!\nPeople like me look for low call backs, Heos delivers! We look for product innovation, Heos delivers!\nOut of all the products I could have in my own home, my wife and I choose Heos!\nThe customers that do have problems have some things in common.\n1: Low performing network(discount routers are for checking email).\n2: Low cost phones and tablets(these discount devices are for basic use not A/V or control systems).\nI have many VERY happy customers that when my phone rings it’s for more fun goodies not Heos service.\nBeware of some of these DIY comments, sometimes there’s more to the story! Some people do not posses the skills to trouble shoot the big picture!\nHope this is helpful to someone.","updated":"2018-02-27T04:17:27-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5767785407","userName":"tim edge","userUrl":"https://itunes.apple.com/us/reviews/id39087912","version":"1.544.240","score":2,"title":"Functional (barely)","text":"This app has so many shortcomings I don’t even know where to start. It is full of latency and rarely displays what is actually playing currently. It does all kinds of unexpected things and has many “dead ends” that force you to back to the main menu and pick from EVERY single music service (I only want to see the ones that I use!). I gave it 2 stars because it works and it is cool to control music streaming services directly in my Marantz receiver without any other device, but the app itself is really terrible and barley passes for a beta version to me. Sonos is much better.","updated":"2020-04-05T13:32:11-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3324435347","userName":"Name is already takes 18462701","userUrl":"https://itunes.apple.com/us/reviews/id204045082","version":"1.466.240","score":1,"title":"Poorly Programmed. Incompatible","text":"Bought a $1000 Denon receiver on the advice of some of my more tech savvy friends. The receiver isn’t the most exquisitely designed piece of technology but it works for what it’s supposed to do. Except work with HEOS. It’s a big selling point, it’s even branded on the receiver. The step by step instructions in the HEOS app were inadequate to get the app to recognize a receiver from a phone with both already connected on the same WiFi. Tried trouble shooting for hours and the stupid app can’t find the receiver. Called my tech friends over to help and it looks like the app just doesn’t work with my receiver. The receiver works for literally everything else I wanted for. I think the app is just not very well made.","updated":"2018-10-20T13:24:33-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7865147035","userName":"M Craw","userUrl":"https://itunes.apple.com/us/reviews/id1334571236","version":"2.1.561","score":3,"title":"Great, but lacks in music options/playback","text":"I use this app to stream to my Marantz SR7011 AVR and it’s great for playing albums, but if you want to listen to a playlist you’ve created and used on other streaming devices/platforms, you can’t.  Nor can you create a playlist on the fly or “add to queue” like so many others can offer with their services.  It’s little nuances like this that keep me going back to, and sticking with tried and true, Sonos.  Keep trying, Denon/Marantz. Hopefully you figure it all out much sooner than later.","updated":"2021-10-01T04:44:38-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3725655715","userName":"RSVideo","userUrl":"https://itunes.apple.com/us/reviews/id19306588","version":"1.481.160","score":1,"title":"Network Shares keep resetting","text":"For the most part the HEOS app works for me. EXCEPT, when it comes to “Network Sharing”. In another room, I have a MacBook Pro, with a music folder setup for network sharing. With the proper PATH to the folder set, the proper computer name in “network bios”, it is seen in the HEOS APP, I let it index. All seems good the first 24 hours, I can play music files via HEOS app, or using the remote. \n\nThen the next day, within the HEOS app, the share is no longer seen, instead, in the HEOS preference, is listed an OLD share PATH, one that I already deleted, as I moved the music folder on the Mac serving the share. That old path should have been deleted, but this keeps happening. Now I close HEOS APP, run Heos directly on the Denon 3500, and the proper share works fine, and I’m streaming my shared music. But I can’t do this via this IOS HEOS app. \n\nI may try deleting the app, and reinstalling it, but this of course means losing all the saved favorites and setting up the account again, and reindexing a large shared music folder again. \n\nPLEASE FIX THIS!!!","updated":"2019-02-02T12:13:51-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3502186720","userName":"Jamesjcostello","userUrl":"https://itunes.apple.com/us/reviews/id35160462","version":"1.481.130","score":3,"title":"Hopefully it will play all my songs","text":"It’s not the easiest to get ahold of customer service, but when you do it is helpful. The one thing that I am hoping they will fix: the 300 song limit in the queue. I have around 7000 songs on a hard drive that is shared on HEOS. I like to be able to randomly play from all 7000, but that doesn’t seem possible. Or even if it could randomly select 300 of those 7000 (it’s not like i ever listen to that many, i just like to hear random songs from my entire collection) to add to the playlist, that would work too.","updated":"2018-12-06T19:41:45-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4349392981","userName":"K@ydo","userUrl":"https://itunes.apple.com/us/reviews/id149815842","version":"1.505.130","score":5,"title":"Pretty smooth","text":"I have always bought Sony products for my household and recently I purchased a Sony receiver for upgrading to dolby Atmos and the receiver was defective. Was advised by several sales people who have had Denon  and swore by it so i traded the Sony for the AVR-x1500h and have been satisfied ever since with this app i can turn on my tunes from anywhere near wifi sound is great and couldn't be more pleased. I can set up the play list and let it play.","updated":"2019-06-21T13:35:09-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3740202153","userName":"HeosFan1973","userUrl":"https://itunes.apple.com/us/reviews/id138414603","version":"1.493.170","score":5,"title":"Works Great","text":"I’ve been using the app for about 2 years now with only a couple of minor glitches.  If you have more than one WiFi band you have to make sure that your phone is logged on to the same one as the receiver.  I’ve had to call Denon service twice, but they were very helpful and got me up and running again in a few minutes.  Heos is a great product and value.","updated":"2019-02-06T09:07:15-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7060748214","userName":"Nebba2","userUrl":"https://itunes.apple.com/us/reviews/id363611763","version":"1.583.490","score":2,"title":"Much better in concept than execution","text":"For me the major attraction of this app was to set up playing all the music files I’ve collected through component audio equipment. In theory, HEOS supports this. In theory.\n\nAfter a challenging series of attempts, I managed to get this to work—the challenges included figuring out, by trial and error, that the network path syntax presented in the documentation was simply incorrect.\n\nWhile it was working, it was adequate, with much less functionality than PLEX. And then it just stopped. My assumption was that the ancient Mac that had my library on it was too slow, and the connection timed out. \n\nBut I have been unable to get a brand new Windows computer connected either, as I am back to guessing what the syntax should be. \n\nI’d be much happier if Denon simply supported PLEX, or some other full-function media server. I’d be happier if they got their documentation right.","updated":"2021-03-03T07:21:49-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6789469139","userName":"RoguesNtheHouse","userUrl":"https://itunes.apple.com/us/reviews/id128312068","version":"1.583.161","score":1,"title":"App has me locked out of my music services","text":"This app worked great for awhile, and then one day it just broke. I reinstalled it and after about an hour, was able to get back into my HEOS account. Now 1/2 the time, the online music services are missing from the app. When they are there, I’m logged out of all of them. When I click on one, I get an error or a no data message. I called Denon support. Automated message states higher than normal call volume, goodbye, then it hangs up. I was an avid Denon customer for years, but this has been so frustrating, it will likely be my last product from them.","updated":"2020-12-24T12:07:57-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3395079705","userName":"No ethernet","userUrl":"https://itunes.apple.com/us/reviews/id932266431","version":"1.481.130","score":1,"title":"App Doesn’t work with wired Ethernet","text":"I have a system with several Heos amps and several in-wall iPads with the Heos app and wired Gigabit Ethernet for the apps and amps. WiFi is not an option with this system. I also have a separate system with 1 amp that uses WiFi for the app and wired Ethernet for the amp. The amps have always worked well with wired Ethernet, but the apps have always been buggy with Ethernet (switching rooms for no reason, taking a long time to reconnect to the amps). Since the latest update, the apps won’t even open on the iPads that use wired Ethernet, so the system is effectively worthless. All other apps on the iPads work fine with wired Ethernet, so it is a bug specific to Heos.","updated":"2018-11-08T07:44:48-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3447467365","userName":"Man e man","userUrl":"https://itunes.apple.com/us/reviews/id33649981","version":"1.481.130","score":2,"title":"The hardware is Great, but...","text":"Finally we thought we had a solution for competing with Sonos. As a system integration company we’ve specified Denon and Marantz for years. We’d love to sell the HEOS products, but the interface is simply not intuitive enough. I wonder if they performed usability studies or if they just released it because it was functional. I personally have been in the industry for over 2 decades, designing user interfaces and working with pre-designed ones. I get confused navigating it, so naturally my clients, who aren’t tech savvy, do. I’d be willing to work with D and M Holdings on a redesign, but as is, this software falls way short.","updated":"2018-11-22T07:19:27-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5747480328","userName":"Ak_intl","userUrl":"https://itunes.apple.com/us/reviews/id474289456","version":"1.544.240","score":1,"title":"Ruins the Marantz experience","text":"This app, with its Windows 95 design and very limited functionality, absolutely ruins my  high end receiver. It randomly doesn't connect for days at a time, despite restarting and other troubleshooting steps. When it does connect, the interface is so half-heartedly designed, it's a struggle to do basic things. \n\nI'm disappointed that the good folks at Marantz made this app the only way to listen to internet radio on their receiver. For such a high end product to bundle such an amateurish app is mind boggling. I'd return the receiver if I had kept the box, but now I'm just stuck with it.","updated":"2020-04-01T12:57:02-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3923552576","userName":"Ryandinho14","userUrl":"https://itunes.apple.com/us/reviews/id161157664","version":"1.493.170","score":1,"title":"So bad it's funny - just wait another ten years!","text":"This app is so poorly thought out it would almost be funny if, you know, its users weren't paying hundreds of dollars for the hardware to run it. If you asked me to design an app for the pure purpose of vexing its users, I still couldn't design a worse app. But just wait! They'll say it's a work in progress, and always getting better. That's what the salesman told me two years ago, that's what the developer says in all their replies, and guess what? The app is exactly the same. Counterintuitive and slow. At this rate maybe by 2029 they'll have an app up to 2019 standards. Do yourself a favor and get Sonos.","updated":"2019-03-24T19:36:26-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7506299506","userName":"kjl01","userUrl":"https://itunes.apple.com/us/reviews/id22102691","version":"1.583.490","score":4,"title":"Would love it if we could advance","text":"I have been using HEOS for several years. My main complaint is that one cannot advance through audio. If I start a podcast on my phone and want to switch to my speakers,\nI have to start at the beginning, which is annoying. Why not have a fast forward, or skip 15-30 seconds ahead?","updated":"2021-06-25T18:32:43-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7967156425","userName":"Silence117 gogogo","userUrl":"https://itunes.apple.com/us/reviews/id122575036","version":"2.1.562","score":1,"title":"Impossible to use, update turned my speakers to door stoppers","text":"I was forced to try to disconnect and reconnect my speakers to the HEOS app. It is currently impossible to connect HEOS 5 speakers to the app even though they are apparently connected to the internet. I have tried deleting and reinstalling the app and have reset the speakers multiple times without success. The speakers show a steady blue light indicating they’re connected to the internet but the app won’t recognize them. I’ve basically got a pair of door stoppers that are not usable for anything else. They sounded great when the app actually worked.","updated":"2021-10-29T11:26:03-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6898607881","userName":"Perfect for travelers","userUrl":"https://itunes.apple.com/us/reviews/id311852235","version":"1.583.161","score":1,"title":"Worst App on my Phone","text":"Do not recommend this at all. The absolute worst app on my phone. Loses connection to my phone even though it is supposed to be playing my Pandora music, the HEOS constantly never finds my device, the HEOS app even has a limit on the amount of Pandora playlists listed in their app. Another frustrating thing is that in mid play of any given song it will just skip to the next. I’ve opened tickets with both HEOS and Pandora and this is a HEOS issue. Worthless. Do not buy Denon products thinking you will get something decent with their app as a bypass to Sonos.","updated":"2021-01-21T20:35:05-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2503252927","userName":"gtmil44","userUrl":"https://itunes.apple.com/us/reviews/id37776726","version":"1.442.220","score":5,"title":"Horrible over WiFi.","text":"I’ve had the HEOS sound bar hard wired for months and love it.  Bought a HEOS 3 for the kitchen, connected it to my WiFi, router is 25 ft away in the office, and needed to reconnect it almost every time I used it.  I bought a $20 WiFi range extender just to connect the HEOS 3 with a Ethernet cable and works perfectly now.  Never drops and no longer need to reconnect each time.  App is great - when connected via Ethernet.","updated":"2018-05-04T03:36:19-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"1930711336","userName":"SharkBites","userUrl":"https://itunes.apple.com/us/reviews/id19480437","version":"1.421.150","score":1,"title":"Why Two Apps???","text":"Again, this is mind-bogglingly complicated for something that should be really simple. I don't need another streaming option. I don't need two apps. I just want to listen to online radio, stream music from my phone and watch TV/movies using the same services that I'm used to from Apple, Chromecast, etc. It should be really easy to design ONE app that my grandmother can figure out how to use. And the UX is just appalling. If you have UX people responsible for this mess, fire them all! It's as if you needed to cram every possibility under the sun into this without thinking about how 99.9% of your users are going to use it. Simplify!!!!","updated":"2017-11-18T11:37:52-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5664887831","userName":"SurferSteven","userUrl":"https://itunes.apple.com/us/reviews/id156795325","version":"1.544.240","score":2,"title":"New App Update not working","text":"This is a mediocre App and was working OK until today with the latest update.  Now I can’t even access my account.  I tried to create a new account and the app would not let me access the location selection page.  One should not need an account to use the features of this app.  It isn’t possible to select radio stations without an account.  The developers aren’t doing a good job when checking if the system is working after updates.","updated":"2020-03-15T10:11:22-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3871100426","userName":"Fllman","userUrl":"https://itunes.apple.com/us/reviews/id31136484","version":"1.493.170","score":1,"title":"Worst App I Ever Used","text":"This app is the most horrible I ever used. I have over 100 iOS apps, and am very tech friendly, but this app is so non-intuitive and confusing it seems like it was devolved by middle school students with a $300 budget. I still can’t figure out how to use all my speakers or select just some. Also, speakers would not connect while using the app; the only way to connect was manually with the actual wireless router. I hope Denon actually invests in improving this horrible app and makes an update. If I would have known the app was so bad, I would have considered Pioneer or Yamaha products instead.","updated":"2019-03-11T17:17:42-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3175951050","userName":"Porschefile","userUrl":"https://itunes.apple.com/us/reviews/id39362302","version":"1.466.240","score":5,"title":"Not sure what all the complaints are about! 😀","text":"Works great for me. Just connected my new Denon AVR S740H to my WiFi network and the app automatically connected to it. Allows you to play various streaming services and control basic things like volume and skipping songs. Could it be better? Of course! But is it fully functional unlike all the complaints in other reviews? Yes!","updated":"2018-09-10T14:41:24-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2368011344","userName":"tmpafford","userUrl":"https://itunes.apple.com/us/reviews/id264920781","version":"1.442.220","score":2,"title":"Bring back the old version!","text":"The updated app is horrible. Groups don’t work anymore. We are constantly having to unpair and repair zones to get them to play together. The old app had one volume control for the group. You could adjust the volume in each zone individually, but there was one master control. Now you now have to adjust every single zone individually if you want to turn up the sound. It’s a huge pain. I have no idea why they changed something that was working perfectly. Please roll back the app to the old controls!!","updated":"2018-03-31T09:08:02-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8112571063","userName":"Blatxch","userUrl":"https://itunes.apple.com/us/reviews/id191109514","version":"2.1.680","score":3,"title":"Needs an update badly","text":"There are quite a few functionality issues or user interface issues that I would like addressed, such as not having a home screen widget of some sort to start and stop the music from the lock screen, also I wish my Denon home AV receiver would recognize the streaming service Account user information right from the app because to try to enter it on the unit is horrendous!","updated":"2021-12-09T12:01:21-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7904431125","userName":"A customer for way too long...","userUrl":"https://itunes.apple.com/us/reviews/id9762672","version":"2.1.561","score":1,"title":"What did you guys do??","text":"App was working great until the update. My app connects to the network according to the blue steady light. App says go to rooms, click rooms and it takes you back to setup.  If there was a way to manually enter in a wireless network that would be great, however if you can’t get the app to recognize the network there is no way to enter.  Audio cable doesn’t work nor the Ethernet cable    What a waist of time and effort.  For the amount of money you charge for your appliances one would think it was truly plug and play.   If you want to know more please do not hesitate to contact me.   I will certainly give you some advice on how to program your app.  At this point it’s going on the dead shelf and I’m buying something that works, I doubt it will be from anything that Sound United owns. That being:\nMarantz\nBowers and Wilkins\nDefinitive Technology\nClasse\nDenon\nPolk\nHEOS\nBoston Acoustics","updated":"2021-10-11T16:54:18-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5240799088","userName":"Sws1967","userUrl":"https://itunes.apple.com/us/reviews/id348830379","version":"1.520.320","score":1,"title":"Works about 20% of the time after 5 years of upgrades!","text":"I’ve had HEOS units for about 5 years now along with this painful app, which is the only way to operate them.  You would think that over 5 years someone could figure out how to make this simple app reliable, but ...nope. \n\nThis is the least reliable app I use.  It fails to work more often than it actually works.  I have found various work arounds such as pulling a room out and dropping it back in and skipping songs until it finally connects - this is no longer acceptable.","updated":"2019-12-06T08:42:16-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3930757428","userName":"Moken403","userUrl":"https://itunes.apple.com/us/reviews/id42903769","version":"1.493.170","score":1,"title":"HEOS app ruins great products","text":"My HEOS speakers are wonderful when they work. The HEOS app requires constant maintenance to keep everything working. \nSpeakers refuse to group together sometimes and randomly ungroup. The HEOS AVR will randomly decide I no longer need a subwoofer so I have to turn subwoofer on and off in the app and sometimes reset the whole receiver to make it work again. \nThe app needs the ability to use different volume settings for different inputs. Ideal game settings are different than TV, Movies etc. Having to constantly make adjustments because the app doesn’t store any settings ruins otherwise great products.","updated":"2019-03-26T15:59:49-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6745534207","userName":"davidbassett","userUrl":"https://itunes.apple.com/us/reviews/id19706480","version":"1.583.161","score":5,"title":"Better than Sonos","text":"I put up with compatibility issues between my Sonos system and my Mac components forever. If there was the slightest glitch in Wi-Fi, Sonos was unable to find my music on my Mac or iPhone. All I was able to play consistently was SiriusXM. This system, however, gets along perfectly with my iPhone, Mac, Wi-Fi and Bluetooth. Love it!","updated":"2020-12-12T08:00:10-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2865987265","userName":"xxnfxx","userUrl":"https://itunes.apple.com/us/reviews/id41094757","version":"1.454.280","score":5,"title":"Probably one of the best app for marantz.","text":"This app is amazing and the sound it produces through my marantz sr8012 and sr7012. Just amazing. I have tried other DACs but nothing comes close to this when you play music through HEOS. Super super high quality and huge difference as if you are playing super high def res tracks. Just amazing. I’m really happy with this. Don’t use AirPlay. That will reduce the sound quality.","updated":"2018-07-08T13:53:57-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7141311844","userName":"Ray in Key West","userUrl":"https://itunes.apple.com/us/reviews/id261041302","version":"1.583.490","score":4,"title":"Glad the refresh bug is fixed","text":"After 5 years of loving Heos, I was ready to rip it out and replace it with Sonos when we had to live with the refresh issue for over a month when none of our devices really knew what was playing. It’s working like a charm now. Happy again. Thanks folks.\n\nPS only 4 stars because I hate the Denon home speakers. Bring back the Heos series.","updated":"2021-03-24T19:06:28-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6855600473","userName":"NoVA audiophile","userUrl":"https://itunes.apple.com/us/reviews/id565125446","version":"1.583.161","score":4,"title":"Heos in Marantz ND 8006","text":"Just installed the app and syncd with Network CD player. Initially not able to install, not intuitive, got the impression that a receiver or amp required but somehow was able to complete install. So far seems to work as intended. Nice controller allowing to switch between music sources quickly. Hard to find podcasts on TuneIn app, no search function that I’ m aware of or is not intuitive.","updated":"2021-01-10T19:56:21-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7034440056","userName":"Rocktdg","userUrl":"https://itunes.apple.com/us/reviews/id32489541","version":"1.583.490","score":4,"title":"Denon AVR-X3700H","text":"I’m using HEOS to play music to wired speakers and the AVR is connected to my network via wifi. The only sources I really use at this point are a connected USB hard drive (WAV and FLAC files) and Tidal. The app is pretty basic but sounds really good and I haven’t had any problems with it. If you could fast forward and rewind or it had a better user interface, I’d probably give it 5 stars.","updated":"2021-02-24T14:10:15-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3738250146","userName":"J wattsamillion","userUrl":"https://itunes.apple.com/us/reviews/id209359823","version":"1.493.170","score":2,"title":"When it works. Its good","text":"Heres my problem. I’m using the brand universal remote. It controlled the sound bar value for 2 months. Then the IR wont read. We go back to TV for a month or so and magically one day the IR in sound bar reads again. I replaced 3 remotes and 2 sound bars. Same issue. Works on and off. Only way to control volume is with app all of the time. My kids dont have access to cell phone or tablets. So the blazing TV at 6:30am is not fun. Previous update made it work a bit longer. But in time, stopped reading again.","updated":"2019-02-05T20:38:20-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7640318517","userName":"006 half","userUrl":"https://itunes.apple.com/us/reviews/id15931263","version":"1.583.490","score":1,"title":"Utterly rubbishy app","text":"This app is just junk. FeaTures appear snd disappear each time I turn on. This app is also linked to the denon app. I got both when I bought a decent $1000 denon amp. When the amp works it’s sublime but mostly when I want to listen to music, I just end up spending time trying to get these two crap apps to do even the simplest things. The most frustrating waste of money ever. I work In Software development abd this app just wasn’t tested at all - junk. Avoid at all costs if you are slightly depressed- it will finish you off.","updated":"2021-07-31T13:59:22-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5651736030","userName":"PianoPusher","userUrl":"https://itunes.apple.com/us/reviews/id113547102","version":"1.544.240","score":2,"title":"Version Blah and 2020","text":"The app was just updated in 2020 and continues as an afterthought by Denon.  Ugly as ever, dumb navigation, and the inability to remember your last few searches.   \n\nI use it with the HEOS 3 speaker and it allows the speaker to play music.  It will be interesting to see if the new line of products negates the need for this dumb app.... \n\nFinally as a side note, this is an opportunity to remind ourselves that technology is designed to have a defined useful short life. Support Doesn’t last for even a decade any longer.","updated":"2020-03-12T13:52:19-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5339760329","userName":"Branetraveler","userUrl":"https://itunes.apple.com/us/reviews/id597625501","version":"1.520.320","score":5,"title":"Good Selections","text":"Morning tradition is to start up the espresso machine and choose a station or album, depending on my mood, to play throughout the house. The fidelity is ok for background music and helps set the background for the day.  The app is easy to use and navigate and I can navigate through Alexa from anywhere in my house.","updated":"2019-12-30T11:04:24-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7922195735","userName":"Rugg - Boston","userUrl":"https://itunes.apple.com/us/reviews/id122085164","version":"2.1.562","score":1,"title":"Leaves much to be desired","text":"This app just leaves a LOT to be desired. I’ve been a HEOS user for a few years now… Denon user for longer. This app has always left pockets of “why can’t it do this??”. Amps and speakers… why do we need a separate app as a Denon remote? Can’t use your phone as an Audessey setup device? Some applications have the amp very far from speakers…\n\nLately, the basics have been an issue. Combining rooms and playing music that’s stored on my iPhone never seem to work. Honestly…. I wish I had gone Sonos. Growing tired of HEOS lack of functionality","updated":"2021-10-16T13:34:42-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7295130374","userName":"Jdog122797","userUrl":"https://itunes.apple.com/us/reviews/id370194029","version":"1.583.490","score":4,"title":"Huge Fan of the HEOS Platform but...","text":"So I’m a huge fan of the HEOS Platform, I’ve installed it in my 3 of my family’s homes including my own. Each home has between 4 & 8 HEOS devices. \n\nI’ve been complaining about 1 thing since the first HEOS purchase in 2017... I pay for unlimited Skips on Pandora and the HEOS Application doesn’t honor this feature. \n\nThey claim it’s Pandora’s fault and Pandora claims it’s Denons fault. \n\nEither way if this issue was resolved it would be the best in home music solution I’ve used. \n\nD&M Holdings, please get this resolved with Pandora as it affects users and several clients I’ve installed this solution in for work greatly. \n\nThanks","updated":"2021-05-03T17:58:18-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7874445827","userName":"parot161","userUrl":"https://itunes.apple.com/us/reviews/id3766996","version":"2.1.561","score":2,"title":"Yikes!","text":"Great app as far as functionality goes (great Airplay 2, can control multiple Marantz units, etc.). But the color scheme of the newest update (updated about September 2021), is horrible!  If you love black and white (lots and lots of white), with a tiny bit of red thrown in, then this update is for you.  Otherwise, please please switch back to the old color scheme.  At least change the all white background to something else.  Then I’ll gladly give it five stars.  Thank you.","updated":"2021-10-03T13:46:52-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3939770952","userName":"Roseatrockies","userUrl":"https://itunes.apple.com/us/reviews/id103627604","version":"1.493.170","score":1,"title":"Can’t connect after changed WiFi network","text":"This speaker sounds amazing when it works.  We have had for years with limited problems until recently I changed our WiFi router and now it will not connect.  The problem is that is has to be on the same network as my phone but the app will not let me update my HEOS network.  Troubleshooting article says simply “go to network” but there is no option on the app under settings to do that.  Please help, we have been without a decent speaker for 3 weeks now and have tried everything.","updated":"2019-03-28T21:39:48-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5692808118","userName":"verdun8791","userUrl":"https://itunes.apple.com/us/reviews/id31064411","version":"1.544.240","score":2,"title":"So far, kind of buggy...","text":"Sounds great when it’a working, but twice in two weeks it just cut off and said it was unable to stream from (insert multiple streaming sources here).  The first time was because of an update that they didn’t warn anyone about - completely screwed my automation server up.  Second time (i.e., currently), it just shut off again.  Internet is working for every other device.  Neither phone app or server will work.  Sigh.","updated":"2020-03-21T10:31:32-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7479914089","userName":"Mesparzame","userUrl":"https://itunes.apple.com/us/reviews/id114688854","version":"1.583.490","score":1,"title":"Heos App","text":"This has got to be the worst piece of crap app I have ever down loaded. I have two Heos speakers, 3 & 1. I can never get them to be setup via the app. The speakers are of great quality and sound. If only the app get get fixed. I have wasted so much time trying to get the speakers setup. I keep getting “cannot find device” message. \n\nI tried submitting an issue ticket via their app but even that was a problem… giving me a server error and ticket could not be delivered. They should remove this app from the App Store as it is worthless.","updated":"2021-06-18T15:03:42-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3215329197","userName":"Mr5150","userUrl":"https://itunes.apple.com/us/reviews/id19473122","version":"1.466.240","score":5,"title":"FANTASTIC!","text":"Works way BETTER than expected. I’m using  it with my Denin in AVR-X 4400 H. I’m not using with Bluetooth at all. Only over Wi-Fi.  I have total control over all four zones in my house. I couldn’t ask for anything more. It’s capable of doing so many things, sometimes I do forget how to access certain components such as surroundsound mode or playlists. But overall 5+","updated":"2018-09-21T17:28:29-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7678224126","userName":"ian33333333333333333","userUrl":"https://itunes.apple.com/us/reviews/id299751200","version":"1.583.490","score":3,"title":"Room for growth","text":"Yes this allows me to turn on my receiver and perform extremely basic music controls. Good start, but no signs of improvement have been made.\n\nThis app needs to turn into a virtual remote for our Denon receivers! It would allow much quicker navigation. Trying to rest my HEOS password with the slow Denon remote was BRUTAL, phone control would make everything easier. \n\nYou also must allow for deeper remote integration with smart devices. It’s not enough that I can turn it on and change the volume with voice command. I need to be able to change source and sound settings through voice as well. Please put some more development into this app with great potential!\n\nThanks,\nIan","updated":"2021-08-10T14:46:24-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7874687066","userName":"opera and classical music fan","userUrl":"https://itunes.apple.com/us/reviews/id968448184","version":"2.1.561","score":2,"title":"Updated app has bugs","text":"The HEOS app was recently upgraded on my iPhone but when i direct it to play an album from my Music folder on the phone it plays only the first track and then won’t play another track until i restart the app.  This was something it did without difficulty before the upgrade. Without this it is impossible to play an opera or album stored on your iPhone and needs to be fixed.","updated":"2021-10-03T15:39:51-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7921421331","userName":"Valarin1","userUrl":"https://itunes.apple.com/us/reviews/id22859934","version":"2.1.562","score":1,"title":"Very disappointed","text":"I have had nothing but problems with this app and my Denon HEOS AVR over the last couple years since I bought it.  Recently I spent several days wiping and reconfiguring everything and it worked perfectly. I even purchased a dedicated 5ghz WAP just for this system which worked flawlessly, but with the latest app/system updates once again the AVR is constantly flaky, rebooting itself, and disconnecting from speakers, and I’ve made no new changes.  I hate this system","updated":"2021-10-16T08:43:08-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7863047255","userName":"ashokt","userUrl":"https://itunes.apple.com/us/reviews/id8444157","version":"2.1.561","score":5,"title":"Much improved look!","text":"As a Denon dealer this refresh helps a lot!  Fixes app appearance complaints and other issues my clients have had when comparing to Sonos and other available options.  Much improved user interface, thank you!","updated":"2021-09-30T14:56:34-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2624177936","userName":"wkcienal","userUrl":"https://itunes.apple.com/us/reviews/id22638966","version":"1.454.230","score":4,"title":"HEOS app not bad","text":"It took some getting used to. But the app has worked well.  Especially once you setup every speaker and download the new firmware for all your devices. Once that was done the app has worked smoothly. Also Denon has updated the app substantially in the past year. It works with each device and has a full set of controls of my Denon receiver. .... which is very nice.","updated":"2018-05-31T18:32:54-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2608652155","userName":"slorente85","userUrl":"https://itunes.apple.com/us/reviews/id282530813","version":"1.442.220","score":4,"title":"Minor but Huge Improvements in last release","text":"The app seems to not stall or temporarily lose connectivity as much in the latest release. Also, now there is a “master” volume for combined zones where it adjusts the volume for all of them relatively...similar to Sonos. The app is getting much better and I think I actually prefer it to Sonos (at least the last version I used).","updated":"2018-05-28T09:42:48-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7875030126","userName":"Baseballjk10","userUrl":"https://itunes.apple.com/us/reviews/id4790891","version":"2.1.561","score":4,"title":"Update issue","text":"I am also having issues using HEOS with my Denon receiver.  When I stream music through my iTunes through the app the second I start doing something else HEOS stops the streaming music.  Never did it before but now that it’s updated I can’t get through a full song with it stopping.","updated":"2021-10-03T18:14:58-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4819701002","userName":"Msna","userUrl":"https://itunes.apple.com/us/reviews/id110982466","version":"1.520.200","score":4,"title":"Please make the SoundCloud  track progress bar handle bigger - Good App","text":"It’s a great app and connect to my Marantz boxes with no issues. The biggest complain I have is how tiny is the button on the track progress bar for SoundCloud. It’s almost impossible to grab it to go to a certain part of a track. Can you please make that easier to grab!!","updated":"2019-09-21T13:41:13-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2845107763","userName":"ThornMa","userUrl":"https://itunes.apple.com/us/reviews/id25434038","version":"1.454.280","score":5,"title":"Fabulous System","text":"We had the wireless system expertly installed and have enjoyed it for over 4 years. It is installed in 4 rooms. We highly recommend this product. We are able to connect our streaming music. \nThere can be some spotty connections but that is usually due to the WiFi.","updated":"2018-07-05T16:07:26-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5358827286","userName":"Orang3crush","userUrl":"https://itunes.apple.com/us/reviews/id253628051","version":"1.520.320","score":1,"title":"HEOS in Denon is what’s wrong with Denon","text":"Worst app!!! Not user or device friendly. Bluetooth and Internet interface between the app and Denon receiver is just terrible, whatever I stream or even play downloaded songs -I have a skip/cut out worst than a scratched vinyl. I’m returning the Denon and getting something that doesn’t use HEOS. Why can’t Denon use a technology where they can just Bluetooth signals in like a Bluetooth Earphone but instead use this crap app to go through the internet is beyond comprehension (Denon lost a loyal customer)","updated":"2020-01-04T00:04:27-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"1945303730","userName":"milesfam","userUrl":"https://itunes.apple.com/us/reviews/id580237066","version":"1.430.160","score":1,"title":"Horribly Unreliable Communication","text":"Hemos has got to be one of the least reliable apps when communicating with Denon receivers!!!  It’s a crap shoot to have the app report accurately.  Example...when switching zones or turning another zone on it should be as simple as toggling the on/off icons on the app.  But not with this crappy app!!  Toggling the virtual buttons work, however the ACTUAL results only work about 40% of the time.  You guys REALLY need to perform some extensive testing in the labs before releasing this garbage, whether it’s Heos Software or Denon Hardware neither of you are in sync!!","updated":"2017-11-24T05:52:08-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4656530882","userName":"JoeGubby","userUrl":"https://itunes.apple.com/us/reviews/id161415637","version":"1.520.140","score":5,"title":"HEOS is Top Notch!!","text":"Take it from an audio fanatic and perfectionist, the HEOS app is excellent, easy to use, reliable and superior to Sonos and all others I’ve tried over the years. \n\nIn addition, I could be any more pleased with the overall experience and performance of the speakers. \n\nBest solution for wireless whole home sound!","updated":"2019-08-22T14:26:08-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6855390055","userName":"msc lover","userUrl":"https://itunes.apple.com/us/reviews/id117706985","version":"1.583.161","score":5,"title":"App is great. One suggestion","text":"I love HEOS! I have all versions of HEOS speakers and two versions now of the new Denon Home. Music playing is amazing and pure. For sleeping I use my HEOS 3 and wish I had a sleep timer so I could have it shut off automatically after an hour or so. Just a thought!","updated":"2021-01-10T18:31:43-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6256604096","userName":"danegeld","userUrl":"https://itunes.apple.com/us/reviews/id109926229","version":"1.562.280","score":2,"title":"Works, but no scrubbing through tracks","text":"How can you make a music app in 2020 that doesn’t allow scrubbing through tracks? I only play music from an attached USB drive on a Marantz  CR612 receiver and there are tracks in my collection where I like to skip through intros or whatever. HEOS won’t let me. I cannot fathom why such basic functionality isn’t supported. Believe it or not, everyone doesn’t solely use un-scrubbable streaming services.","updated":"2020-07-29T12:38:06-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2213049455","userName":"Vining_","userUrl":"https://itunes.apple.com/us/reviews/id169047934","version":"1.442.190","score":4,"title":"DRV","text":"It’s improved a lot.  A better network product then Sonos since that doesn’t work properly on anything but a simple network.  I’ve systems with 26 zones and it performs well and I can connect every zone to a wired network jack instead of wi-fi if I choose.  Sonos prefers only one device wired ethernet and all others on their own Sonosnet which screws up your own wifinetwork.","updated":"2018-02-15T19:45:40-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4203891117","userName":"bslaye","userUrl":"https://itunes.apple.com/us/reviews/id86432189","version":"1.505.130","score":1,"title":"It just does not work","text":"Thousand of dollars in equipment between speaker bars, wired speakers with receivers and bridges and high internet speed service are wasted when grouping rooms fails regularly, certain speakers are not found at some times and show up at others, etc. If I could get my AV professional to come and take it all without having to pay him thousands more to remove it all, I would. It’s a complete waste with this app. Be warned! Do not buy HEOS products expecting to use the app to control them with any consistent success.","updated":"2019-05-24T16:48:28-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5443839359","userName":"Ben-dizzy","userUrl":"https://itunes.apple.com/us/reviews/id43116723","version":"1.544.150","score":3,"title":"UI is so lame","text":"HeOS is great. Have 3 zones down stairs. One in theater. I have one sonos setup on front porch and would love to swap out the sonos connect for new M-CR612 but the UI in HeOS is soooo bad and sonos is so much cleaner. Please update. You are still using UI elements from 10 years ago. HeOS has the advantage of being built into our home theater receivers, giving it a huge advantage over Sonos but the app needs a major update.","updated":"2020-01-24T11:11:50-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2061087116","userName":"Ysroq","userUrl":"https://itunes.apple.com/us/reviews/id146369900","version":"1.430.180","score":1,"title":"Great speakers. Horrible app.","text":"The sound quality of the speakers is great but the app is one of the worst I’ve experienced. I frequently have to uninstall and reinstall the app (4-5 times per week) or reboot my phone to get it to work at all. When it does work, it will play 3-4 songs before it quits and either can’t find the speakers or can’t connect to a music source (and this is with me setting my phone down in a stationary, central location. I keep hoping someday they will fix the app, but it’s been terrible for at least 3 years.","updated":"2018-01-05T18:54:32-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6132130152","userName":"ranj5","userUrl":"https://itunes.apple.com/us/reviews/id35078285","version":"1.562.200","score":3,"title":"Update Issue","text":"Since the recent update a few days ago I am not able to connect to any streaming services. The songs and artwork show up but say there is not network connectivity when I try to play the song. I am hardwired to the internet so not sure issue. I got it working by resetting the internet, but only lasted for one day.","updated":"2020-06-28T07:08:06-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6206473453","userName":"DCroy","userUrl":"https://itunes.apple.com/us/reviews/id296447947","version":"1.562.200","score":1,"title":"Wish there was more documentation..","text":"I was able to attach my iPad and iPhone to my Denon Home 350 speaker, but I cannot get Heos to see my Denon Heos AVR X4500H Heos receiver.  I would like to gain more control over Heos and my Alexa Echo devices plus of course utilize my Denon Home Bluetooth Speaker more effectively.  A straight forword way to add a Heos receiver would be much better.  My Call with Denon and also a Heos tech support merely told me my Heos app should see the receiver if it is on the same network (which it is), but I only see my Denon Home Speaker.","updated":"2020-07-16T15:39:56-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2264320108","userName":"JCMc1111","userUrl":"https://itunes.apple.com/us/reviews/id23565599","version":"1.442.220","score":1,"title":"HEOS app NEVER connects","text":"I have a Denon AVR-X4300H receiver that powers 3 zones. This was a new construction home that was professionally installed.\n\nI’d say of the 20+ times I’ve tried to connect to the system using the HEOS app, it’s MAYBE actually worked 2 times max. I try to connect literally standing right by the receiver and it never works.\n\nEven more frustrating is the lack of effort to try to fix the app from Denon. This is a well documented bug in the app. I love Denon but I’m seriously now considering replacing it with 3 Sonos Connects so I can direct traffic to the zones via my iPhone.","updated":"2018-03-02T15:43:24-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5212300610","userName":"Coryb113","userUrl":"https://itunes.apple.com/us/reviews/id730382623","version":"1.520.320","score":4,"title":"Pretty decent","text":"It works well. I have a Yamaha receiver also. And that music cast is easier to use. You don’t need the second Denon app. But it seems like you can do a bit more with these apps so pick your poison. 4 stars because of 2 apps could be a bit more user friendly.","updated":"2019-11-29T07:16:25-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6552313242","userName":"Anya's Dad","userUrl":"https://itunes.apple.com/us/reviews/id217710601","version":"1.562.280","score":5,"title":"I think it’s really good...","text":"Having used several other companies music apps, I find the HEOS app user-friendly and easy to navigate.  Compared to the NAIM app, it’s amazing.  My only complaint is I would like to add Tidal to the favorites list but I can’t find a way, yet.","updated":"2020-10-19T11:04:59-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5237170259","userName":"newsy482","userUrl":"https://itunes.apple.com/us/reviews/id138644201","version":"1.520.320","score":3,"title":"Menus and Tidal interface need improvement","text":"I use Tidal music often and my music collection is only available alphabetically. Please adapt the sorting options that the Tidal music app makes available which is the ability to sort by date added, alphabetical, artist or release date.  \nOn the plus side the sound quality is good.","updated":"2019-12-05T10:31:58-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4856925583","userName":"Juz Don","userUrl":"https://itunes.apple.com/us/reviews/id8817438","version":"1.520.200","score":1,"title":"HEOS App is the worst music app ever!","text":"This app is the buggiest piece of software I have ever dealt with! Wow! It is so bad using either Wi-Fi or Bluetooth. It loses connection all the time and then skips to the next song and I have very strong and reliable Wi-Fi. It will display different art work for a song than what is actually playing! Sometimes it won’t connect to either of my devices when starting it up until I close the app several times. I have a X4400H receiver and a HEOS Amp. Denon fix this app! Make it work and reliable!","updated":"2019-09-28T19:25:46-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4570577200","userName":"SpecialK76","userUrl":"https://itunes.apple.com/us/reviews/id104760600","version":"1.505.130","score":5,"title":"Great quality sound!","text":"Great quality sound! I wasn’t too happy at first until I realized it was my Wifi that was the problem.\n\nSuggestion....add an intercom feature so I can select a room, tap a button to make an announcement. It would be great for parties  and events","updated":"2019-08-04T18:47:57-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3171712737","userName":"Clayton Richards","userUrl":"https://itunes.apple.com/us/reviews/id258200232","version":"1.466.240","score":1,"title":"DAMAGES SPEAKERS","text":"I have several Denon receivers powering speakers and several wireless HEOS speakers. The current HEOS app decides to turn volume to 100% on all of your speakers randomly, which in my situation damaged speakers that cost more than the receiver itself!\n UPDATE: This happens if you are using the HEOS app and then connect to Bluetooth (like connecting to your car). The volume on every one of your zones is then changed to 100% (typically, this would not be possible because all zones adjust according to the zone that has the highest volume percentage since it reaches max first).","updated":"2018-09-09T08:24:57-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3117876581","userName":"smarthomegeek","userUrl":"https://itunes.apple.com/us/reviews/id629804560","version":"1.466.200","score":5,"title":"Awesome System","text":"I have a Denon AVR, HEOS 3, and HEOS link that all work great. The app isn’t as nice looking as sonos but it still functions good most of the time. Rooms are easy to group together and adjusting sound quality is a breeze. Only thing I would like to see better in the future is support with home automation platforms.","updated":"2018-08-26T13:39:42-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5342826010","userName":"Mark1776","userUrl":"https://itunes.apple.com/us/reviews/id181754346","version":"1.520.320","score":4,"title":"Daily enjoyment","text":"We use Heos to play all of our music and favorite radio programs throughout our home. The only downside is it does not play well with Apple Music. We have a subscription to Apple but Heos will not allow us to play our playlists over the system.","updated":"2019-12-31T06:04:16-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7919534916","userName":"Jgold9411","userUrl":"https://itunes.apple.com/us/reviews/id411128630","version":"2.1.562","score":1,"title":"Sound bar and Subwoofer never connect","text":"When the device finally connects the sound is great, however, the subwoofer never consistently connects with the sound bar. This app constantly crashes, is unable to identify devices, and retains connection for max a couple of hours. The fact that the subwoofer and sound bar are on the same network but never identifiable is incredibly frustrating. Please fix app","updated":"2021-10-15T21:25:14-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5957808105","userName":"BobDeRosa","userUrl":"https://itunes.apple.com/us/reviews/id1169703804","version":"1.544.240","score":5,"title":"Nice app","text":"I use the app to control a pair of Denon HEOS 7 speakers as well as a single HEOS 5. Setup was quick and simple. I like the layout of the app. There are 3 main screens. One to select speakers, one to select music, and a third to control playback. Simple and effective with no problems.","updated":"2020-05-17T09:15:38-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5368527709","userName":"CCM6911","userUrl":"https://itunes.apple.com/us/reviews/id774181247","version":"1.520.320","score":3,"title":"Great features, good functionality","text":"We’ve been using demon HEOS stuff for years now.   Sound is really good but operation is quirky at times.   You’ll sometimes get full volume when you turn something on even though the last time you had it on low.    Volume is rarely or never started at where you \nAST left it.","updated":"2020-01-06T07:06:12-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2364065273","userName":"Fsppjtxbsjepp","userUrl":"https://itunes.apple.com/us/reviews/id25987780","version":"1.442.220","score":4,"title":"Good, not great","text":"It works as intended but could be more polished and include more features like...\n- IFTTT integration\n- Favorites on the home page for device/stream source/station/volume level so you can open the app and tap one button to turn on music (streaming service and station) in a specific room with one tap","updated":"2018-03-30T08:49:12-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3228695429","userName":"LbkTX","userUrl":"https://itunes.apple.com/us/reviews/id451765746","version":"1.466.240","score":1,"title":"Most recent update doesn’t work!","text":"I thought things had gotten better with this app.  Songs were playing, controls were responding quicker...then I updated the app :(.  Now When I launch the app and it looks like it’s playing a song but I don’t hear anything for a good 30-40 minutes.  Then all of a sudden when I am least expecting it the music starts playing.  After that I can roll all day with it.  Weird.  Can y’all please fix this!!!  I love these speakers but they are\nso darn quirky.","updated":"2018-09-25T06:52:05-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8006107378","userName":"DonKin74","userUrl":"https://itunes.apple.com/us/reviews/id101690866","version":"2.1.562","score":5,"title":"Great App","text":"I have been using this app with my Marantz PM 7000N integrated amp. Works perfectly. No issues at all. It does everything it’s supposed to do. If you have issues it may not be the app but rather your hardware… whatever speaker or amp, etc.","updated":"2021-11-09T09:52:27-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6789332512","userName":"meajmal","userUrl":"https://itunes.apple.com/us/reviews/id416934582","version":"1.583.161","score":1,"title":"Why don’t you spend a few dollars improving your app","text":"For a brand like Denon, your HEOS app is so crappy. There is so much to improve starting with your tidal integration. The whole purpose of getting an expensive HiFI system with a denon receiver as the base is the ability to play the highest quality sources of which Tidal is one. The app is just plain slow and in most cases just returns some error codes, which feels like bugs more than anything sensible.","updated":"2020-12-24T11:10:13-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6063386768","userName":"Inkedalloverson","userUrl":"https://itunes.apple.com/us/reviews/id714848317","version":"1.544.240","score":1,"title":"Aggravated","text":"The amplifier itself is great, however the app is horrendous. Can only listen to Pandora, Sirius Xm and Apple Music don’t work. Even with listening to Pandora after every song I have to switch to a different station because the music stops. Every other time I have to force close the app and reopen to get it working again. I’m getting a Bluetooth adapter so I can listen to music that way. This app needs a total rebuild.","updated":"2020-06-11T08:02:16-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5726486280","userName":"jduejfbfhiwjw","userUrl":"https://itunes.apple.com/us/reviews/id864267650","version":"1.544.240","score":3,"title":"Sound is great, app is fussy","text":"I’ve had the HEOS system for a few years. The denon sound equipment is great but the HEOS app is finicky. Sometimes certain rooms won’t connect and grouping and in grouping rooms is harder than it should be. \nOverall I like the system but would like to see denon work to improve the interface and stability","updated":"2020-03-28T08:11:14-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3362967525","userName":"hermiteer","userUrl":"https://itunes.apple.com/us/reviews/id26811356","version":"1.466.240","score":1,"title":"Not compatible with iOS 12 and iPhone XS","text":"My wife begged me to pull this out of storage and try again to set up and use.  Since I first tried, I've changed phones and OS, and unfortunately was still not able to set it up.  The app was smart enough to realize I needed the Lightning-to-headphone adapter and suggested using it, but it never seemed to recognize it and the \"Next\" button stayed disabled.\n\nTo be fair, this is the Gen 1 model without Bluetooth so this Aux In set up process is understandably awkward.","updated":"2018-10-30T17:59:42-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5365062695","userName":"cas452","userUrl":"https://itunes.apple.com/us/reviews/id725675213","version":"1.520.320","score":4,"title":"So-so App","text":"Hard to navigate. Needs easier ways to return to previous menus.  When in music mode, have to exit app to return to tv mode. When you pause tv you have to exit app to restart sound. Hard to reset settings.","updated":"2020-01-05T09:48:11-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7880390526","userName":"050872@Hhp","userUrl":"https://itunes.apple.com/us/reviews/id147551026","version":"2.1.561","score":5,"title":"App doesn’t work","text":"After upgrade new version. It doesn’t work, just play a half song then it stop. Never happened before upgraded.","updated":"2021-10-05T04:02:37-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7863532457","userName":"Swivel09452","userUrl":"https://itunes.apple.com/us/reviews/id270067696","version":"2.1.561","score":5,"title":"Playlist","text":"Great app, I use it all the time. Typically I queue up songs I think of on the fly. Over time the queue gets to be done of my best music. Could you please make a ‘convert queue to playlist’ function?","updated":"2021-09-30T18:21:30-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5162774922","userName":"TheLordJohn","userUrl":"https://itunes.apple.com/us/reviews/id102097308","version":"1.520.320","score":3,"title":"Not intuitive / music stops","text":"Ladies have been known to say I’m good with my hands. I always took that to mean I’m savvy with the iPhone apps. Funny I can never find the feature I’m looking for, or figure out how to keep the music from cutting out after 30 secs of streaming. \nWe’re they just stroking my ego?\n\nHEOS app running a Denon AVRS-950 surround sound receiver.","updated":"2019-11-17T21:51:31-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4321263059","userName":"dad316","userUrl":"https://itunes.apple.com/us/reviews/id138263727","version":"1.505.130","score":5,"title":"7zones setup works perfect","text":"I love my music and set up 7 zones in my house and outside on my deck, patio, yard . System works great!  Have had it for a year now , just added to more speakers in our screened in porch.  I can turn zones on and off as needed , adjust volume and music by zone \n\nLove my system","updated":"2019-06-15T14:02:18-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7355596920","userName":"Opus2270","userUrl":"https://itunes.apple.com/us/reviews/id316728714","version":"1.583.490","score":1,"title":"Great sound, terrible app","text":"Owner of a great Denon receiver and HEOS 2s all over the house. My fault for not reading closer that Apple Music isn’t supported. Ridiculous that after all this time, that functionality hasn’t been added. \n\nI specifically purchased Denon because the sound (in my opinion) was superior, and for less $ than Sonos.  Guess I have to decide whether to leave the Apple environment or sell the Denon system. \n\nAnybody ever find a work around?","updated":"2021-05-18T06:08:42-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5596672300","userName":"EdXabs","userUrl":"https://itunes.apple.com/us/reviews/id671578643","version":"1.544.150","score":5,"title":"Amazing streamer with only a few quirks","text":"The onboard DAC brings all music to life My only hope is that either through the App or the player it would display the bit rate. Icing on the cake if this happens!","updated":"2020-02-29T05:06:24-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3624609997","userName":"kurtmc","userUrl":"https://itunes.apple.com/us/reviews/id27283824","version":"1.481.160","score":5,"title":"Huge Improvement","text":"My previous rating was low but ever since I switched to a new internet provider and a new router ( Thanks AT&T) my HEOS syncs up super fast to my WiFi network. It’s been working flawlessly for the last month.  Old provider was Spectrum.","updated":"2019-01-07T17:40:03-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4934751530","userName":"fthissystem","userUrl":"https://itunes.apple.com/us/reviews/id190706715","version":"1.520.200","score":1,"title":"This system is garbage","text":"I have a 30$ echo dot that set up in less than 2min. I have an excellent mesh wifi system that recognizes everything instantly and I have several smart devices that I set up with ease! This system won’t recognize the wifi wirelessly and it’s near impossible to set up!!! The most frustrating wi-Fi connection System Ever made!!!!! I’m sending back for a refund Sonos blows it away!\ncomplete garbage!!!! Could not be more disappointed","updated":"2019-10-12T16:11:48-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2223348741","userName":"MacFloat","userUrl":"https://itunes.apple.com/us/reviews/id29418539","version":"1.442.190","score":5,"title":"What’s with all the negativity?","text":"I’ve got 2Heos5’s and 5Heos2’s., all version 2’s. Very happy with speakers and the app works fine. As with any app I’m sure they will be refining and adding new features. Works great with my Denon speakers and also drive speakers with music content from a hard drive.","updated":"2018-02-18T16:19:24-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3042316408","userName":"Bozobrains69","userUrl":"https://itunes.apple.com/us/reviews/id169131295","version":"1.466.200","score":1,"title":"Not user friendly","text":"There is a ton of issues with this app. It is difficult to navigate as the layout is awful when it comes to settings. Subwoofer always unpairs when there is an update & always has issues trying to pair up with the sound bar. There are always a ton of errors even when following instructions. Many bugs & glitches. Great products but the app is absolutely unusable. Very disappointed with this app.","updated":"2018-08-09T17:37:45-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6538039987","userName":"AV-UP","userUrl":"https://itunes.apple.com/us/reviews/id296356167","version":"1.562.280","score":5,"title":"Works great","text":"Work great - this is mainly WiFi based and if you have unstable WiFi then you will have issues.\n\nFix your WiFi with a (mesh system) and then it will work if setup properly.","updated":"2020-10-15T08:23:13-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"1994702731","userName":"frnz571","userUrl":"https://itunes.apple.com/us/reviews/id18204392","version":"1.430.180","score":5,"title":"it works","text":"At first I hated it. But when you figure out all the little quirks it will work just fine for you.\nWhen I was having problems it was actually the streaming service Tidal having problems and not HEOS","updated":"2017-12-13T19:16:31-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2150778767","userName":"Mike S 987","userUrl":"https://itunes.apple.com/us/reviews/id213867301","version":"1.430.180","score":5,"title":"Modern Music Control","text":"My wife and I have been using the HEOS app since May of 2017. Warning...  We love the HEOS functionality so much that we added a second receiver and a HEOS Drive amp so that we could use it all over our home. We now have 10 HEOS zones that we use all the time.","updated":"2018-01-31T11:23:28-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6793129943","userName":"Joey Doanz","userUrl":"https://itunes.apple.com/us/reviews/id140499406","version":"1.583.161","score":1,"title":"Once again Sonos works Heos does not","text":"It’s Christmas. Dinner is in the oven and friends are here celebrating.   We are listening to our music with the parts of my sound system that are made by Sonos.  Why? Because the Heos, once again, will not work properly. It’s is absolutely ridiculous how often this happens. Don’t waste your money on Heos equipment until Denon can get this working properly, instead of just once in awhile.","updated":"2020-12-25T13:02:39-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5836860118","userName":"SSN689EM1","userUrl":"https://itunes.apple.com/us/reviews/id39565802","version":"1.544.240","score":5,"title":"Loving it","text":"Audiophile sound quality with convenience, ease of use and self-made playlists, far beyond what I can get from Air-Play. Anyone with a decent WiFi will have zero dropouts and easy startup.","updated":"2020-04-19T19:37:52-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2042031334","userName":"Art fern","userUrl":"https://itunes.apple.com/us/reviews/id24349244","version":"1.430.180","score":2,"title":"Great sound/horrible function / dead App","text":"Just like many others, I found the sound to be outstanding however the system is virtually unusable. The speakers and the app constantly disconnect from each other and I have to continually Reset the speakers and reload the app.\nThis has made the system virtually useless for me and I have a severe regret about buying two Dnon HEOS speakers , based upon some quality only","updated":"2017-12-30T12:21:45-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7904435989","userName":"Rrex!","userUrl":"https://itunes.apple.com/us/reviews/id175952973","version":"2.1.561","score":1,"title":"Update a week ago causing room speakers to disappear","text":"Love the app until a week ago, the update is causing a problem where one of my room speakers just goes aways after playing for a few minutes.  It’s the room that does not have the on and off toggle button.  \n\nIf I separate the rooms and then drag them back together it sometimes fixes it.  But sometimes the room without the toggle completely disappears.  \n\nBefore this had no problems for 6 months, we made no internet changes.  It happened almost immediately after the last update for we noticed the icon change colors and the problem started.  \n\nPlease please fix.","updated":"2021-10-11T16:56:32-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3068256768","userName":"Soto-b","userUrl":"https://itunes.apple.com/us/reviews/id453001183","version":"1.466.200","score":5,"title":"Nice app","text":"I use this with 5.1 inside and zone 2 outside. After a little time you figure things just like when something is new. My wifi needed improvement, so I got a booster and the rest is history.","updated":"2018-08-15T07:18:39-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5032889521","userName":"Ahahahahahaj","userUrl":"https://itunes.apple.com/us/reviews/id136376943","version":"1.520.200","score":1,"title":"App operations","text":"It’s the most frustrating app to try to get into, it takes an average 10 mins for it to respond and it is not always given that it works even with a gig WiFi it still breaks off , one speaker works others not, it’s an all day battle to get a smooth listening time. The more time you have have the more the frustration! I love the sound though that’s if it works","updated":"2019-10-27T05:52:50-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4193371625","userName":"alantingle","userUrl":"https://itunes.apple.com/us/reviews/id23926046","version":"1.505.130","score":1,"title":"Cannot create an account through the app","text":"I am using the Heos App on my iPhone 8 running IOS 12.3, to connect with the ARS-S740H. I cannot create an account using the app. The app accepts my email and password to create the account. Then I go to the next screen to choose locations, there are no locations displayed, and I cannot proceed with account creation. Attempting to create account on the ARS-S740H front display or attached monitor is not successful either. Heos is not ready for prime time on app or receiver.","updated":"2019-05-22T17:27:46-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3313806111","userName":"Yankee23","userUrl":"https://itunes.apple.com/us/reviews/id103931204","version":"1.466.240","score":1,"title":"Hate hate hate this app. Terrible.","text":"Doesn’t work most of the time. Pull app up today and it only shows 1 room of the 4 I have setup. What happened to other 3. Only way I can use my home audio system is with Alexa because the HEOS app is a piece of garbage. \nDoes not integrate with Apple Music or Apple Watch.  \nApple Watch integration is a no brainer. I don’t keep my iPhone on me in house but always have my Apple Watch.\n\nAre you doing anything to address integration with Apple Music and Watch?","updated":"2018-10-17T17:13:57-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8080037759","userName":"LER98","userUrl":"https://itunes.apple.com/us/reviews/id20461398","version":"2.1.680","score":2,"title":"Pretty bad and difficult to use compared to SONOS App","text":"I recently purchased a PM7000N and have installed HEOS APP on my iPad.  I have a Pandora account and it works just fine.  EXCEPT, when using the HEOS App and selecting PANDORA, …. And then Alphabetical listing of stations …. It only shows stations from A through F.    What am I doing wrong/.??  Or is it a problem with the HEOS App?\n\nAlso … absolutely NO support for Apple Music.???","updated":"2021-11-30T06:50:49-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3957524044","userName":"DGDoran","userUrl":"https://itunes.apple.com/us/reviews/id217723704","version":"1.493.170","score":2,"title":"When it works it’s great","text":"I am starting to have a lot of problems connecting to my system with the app...especially on my iPad but on my iPhone as well. I always make sure I am on the same network as my system. It seems like the app keeps getting worse and worse. It also does not update the “now playing” correctly.  Very frustrating for tha mount I spent on it!","updated":"2019-04-01T16:30:24-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6141881160","userName":"ShreddedPork","userUrl":"https://itunes.apple.com/us/reviews/id115138228","version":"1.562.200","score":1,"title":"Alexa no longer works with HEOS","text":"I love the HEOS/Denon hardware.  This app has been nothing but garbage since i went with Denon 2 years ago.  There sound quality is great when it works.  After there recent update it no longer works with Alexa.  Come on Denon, this is expensive gear! Get someone that knows how to do a user interface, redo this garbage and give us something that works well.  This is not a big ask in todays world.","updated":"2020-06-30T17:10:56-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4650689239","userName":"jwwPhotos","userUrl":"https://itunes.apple.com/us/reviews/id230305118","version":"1.520.140","score":3,"title":"Needs more love","text":"I love the concept and when it works, it is great. However it seems to stumble over itself, causing horrible amounts of frustration to find one of your amps missing, or the off and on issue of not working in XM streaming, or suddenly zones refuse to group. Just a bit fiddle still in the interface under the guise of looking cool.","updated":"2019-08-21T09:30:45-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4639514144","userName":"Swingin' Siena","userUrl":"https://itunes.apple.com/us/reviews/id27284663","version":"1.505.130","score":3,"title":"Hardware beats Sonos, App does not","text":"I love the sound of the hardware and the price provides terrific value, but the app is clumsy and lacks some helpful and simple features, like sleep timer, alarm clock and AirPlay.  A watch version would be great too.  Maybe now that the litigation with Sonos is over, Denon will start investing in improving the HEOS technology.  I am hoping for better soon.","updated":"2019-08-18T20:47:11-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2240995496","userName":"MikeZiteUser","userUrl":"https://itunes.apple.com/us/reviews/id27643870","version":"1.442.190","score":1,"title":"Problem With Alexa Now","text":"Updated today and all of sudden every time I use my Alexa, for anything, it mutes the connected Marantz device and then when done with Alexa it raises the volume on Marantz all the way to full. Does not matter what I say to Alexa. Wasn’t even giving it commands for the Marantz. Now afraid it is going to blow out my speakers. Help! Even if setting is for ducking when volume come back on its full blast and does not go back to where the volume was before.","updated":"2018-02-23T21:00:11-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3344857386","userName":"esheff6868","userUrl":"https://itunes.apple.com/us/reviews/id39669172","version":"1.466.240","score":2,"title":"Great sound but horrible app and connectivity","text":"My HEOS speakers sound fantastic, and the different components give me exactly what I want from a multi-room audio system. However, the app’s performance is disappointing and incongruous with what is otherwise high quality Audi equipment. Different zones regularly drop out of synch, music from my phone plays somewhat reliably but getting sound from my TV is hit or miss.","updated":"2018-10-26T00:25:09-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6646668094","userName":"VPopolizio","userUrl":"https://itunes.apple.com/us/reviews/id247582139","version":"1.583.161","score":5,"title":"Great compatibility with my Denon AVR1600H","text":"This app is AWESOME! Once you get used to it, it’s got great control of the zones and music playing from those zones. You can control your receiver through this app as well!","updated":"2020-11-14T20:41:48-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7911977356","userName":"S. Sanoski","userUrl":"https://itunes.apple.com/us/reviews/id102404356","version":"2.1.561","score":2,"title":"New update is buggy","text":"Old version was better. Now it has cooler features and a more pleasing layout, but bought demon and marantz to combine my 2 systems and the app won’t do it. Also, a few issues getting things to load on internet radio. Fix the issues and 5* all day!!! Loved it until now","updated":"2021-10-13T18:12:17-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6510944912","userName":"fricknfrat","userUrl":"https://itunes.apple.com/us/reviews/id900593676","version":"1.562.280","score":5,"title":"No problems at all","text":"I don’t know what everyone is complaining about. I have had zero problems and it is super easy to use.","updated":"2020-10-07T11:07:41-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6474781011","userName":"CESJR86","userUrl":"https://itunes.apple.com/us/reviews/id416945328","version":"1.562.280","score":4,"title":"Excellent App","text":"Works well just could use a few small things that would make it better can’t really complain though.","updated":"2020-09-27T10:09:09-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5728379162","userName":"nicktutorial007","userUrl":"https://itunes.apple.com/us/reviews/id28496051","version":"1.544.240","score":5,"title":"It’s very good but can have some issues","text":"Sometimes separating speakers can be difficult.\nIt appears to cut off songs when played from an iPad","updated":"2020-03-28T17:27:01-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4178608087","userName":"JSA3K3","userUrl":"https://itunes.apple.com/us/reviews/id229762005","version":"1.505.130","score":5,"title":"HEOS Is My Hero!","text":"Wow!  It is amazing to me that there are so many musical tricks and treasures the HEOS app unlocks!  I love it!  There is nothing it won’t do when paired with all my favorite services and servers.  It streams incredibly well from my hi-def iTunes library via the Twonky Server.\n\nThanks for building such a great tool!!!","updated":"2019-05-19T20:21:53-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5028474600","userName":"pumpumcabbage","userUrl":"https://itunes.apple.com/us/reviews/id692262473","version":"1.520.200","score":2,"title":"Inconsistent","text":"The HEOS app is inconsistent at best. I just started using it and out of the dozen or so times I was listening to music it crashed four times and had to be rebooted.\nI have a large music library and it is difficult to easily access music with this app without scrolling and scrolling through the long list of artist.","updated":"2019-10-26T19:49:53-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3146297273","userName":"ARSJ42519","userUrl":"https://itunes.apple.com/us/reviews/id545852600","version":"1.466.200","score":1,"title":"Get it together!!","text":"This is quite possibly the worst, most pathetic app I have ever used. My husband owns a smart home business and he sold your equipment to a lot of people and stopped shortly after because your app is completely inoperable. I think it gets worse with every single update. Definitely going to switch over to Sonos ASAP. I can’t even hear my own freaking TV because your app won’t let me use my sound bar. Again, PATHETIC.","updated":"2018-09-02T15:23:18-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5732214663","userName":"Ms mirrormate","userUrl":"https://itunes.apple.com/us/reviews/id220036627","version":"1.544.240","score":2,"title":"But if it has a problem, there is NO help","text":"When this works it’s fine. Look out if something breaks. Any time I try to email for help I get kicked out of the form, which is ridiculously long and detailed. You are basically left on your own. So if you are a super-geeky techie, get this. Otherwise, you are SOL with this company.","updated":"2020-03-29T12:09:26-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5444388323","userName":"Alexcb1988","userUrl":"https://itunes.apple.com/us/reviews/id115677842","version":"1.544.150","score":3,"title":"Pandora Premium Features","text":"Love the app and speakers but hate that it won’t detect my Pandora premium features or let me just use my Pandora app. Annoying because I’m paying extra for those features that I can’t use on this system.","updated":"2020-01-24T14:51:20-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4696141897","userName":"Aniket I","userUrl":"https://itunes.apple.com/us/reviews/id1054315412","version":"1.520.140","score":5,"title":"Anazing sound, could have better software","text":"This software is amazing but its kinda buggy, there are a few bugs and it crashes every now and then, but i LOVE the sound on the devon speakers","updated":"2019-08-30T06:52:58-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5868712171","userName":"Yetanother old guy","userUrl":"https://itunes.apple.com/us/reviews/id293662483","version":"1.544.240","score":3,"title":"Mostly works well but organization not intuitive.","text":"Took me more time to understand the organization of this app on my iPad than I think it should have.\n\nThe version of the app that appears on my iPhone is more difficult to use.","updated":"2020-04-26T18:27:33-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3481629429","userName":"Denon Doug","userUrl":"https://itunes.apple.com/us/reviews/id498124372","version":"1.481.130","score":3,"title":"Room for improvement","text":"App works fine but isn't the most user friendly.  Voice enhancer is basic with no adjustment, have to flip back and forth between volume and treble bass adjustments.  Love the demon hardware and hoping for the app to be updated.\n  If users rate it 2.4, it's time for the manufacturer to pay attention.","updated":"2018-12-01T07:04:31-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2305354452","userName":"ALBI1320","userUrl":"https://itunes.apple.com/us/reviews/id276344782","version":"1.442.220","score":1,"title":"Subpar app for an amazing product!","text":"The app itself is disappointing! If it’s not having a hard time finding devices, it’s crashing altogether. Trying to pair two rooms in to one, to stream the same type of music can be frustrating as well. It also has delays in starting up and shutting down. You never know when the app is going to work! Which, detracts from the performance of the product! Step up your game HEOS!","updated":"2018-03-14T07:08:54-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6618743009","userName":"cindyny9","userUrl":"https://itunes.apple.com/us/reviews/id123472353","version":"1.583.160","score":1,"title":"App won’t work for me now","text":"I’ve had this app on my iPhone for 3 years. With the new iPhone 11, I can’t get the app to work. I’ve deleted and reinstalled the app several times but keep getting a hardware message. No one else in my office has this problem. I’ve deleted and reinstalled their apps and they work fine. What is it with my iPhone 11 that won’t work with this app??","updated":"2020-11-07T05:43:20-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5051847332","userName":"ikeawhile","userUrl":"https://itunes.apple.com/us/reviews/id288730538","version":"1.520.200","score":5,"title":"Great App easy to Use","text":"This App makes playing music in our house a pleasure. easy to use and relaxes the cat. Able to use it from my phone or IPAD\n5 Stars rating for me","updated":"2019-10-30T11:02:18-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3697446653","userName":"Elaine_Love","userUrl":"https://itunes.apple.com/us/reviews/id230060089","version":"1.481.160","score":1,"title":"This App is garbage","text":"Had to download this app in order for my music to play over the in-Ceiling speakers. Music plays ok when connected to Pandora but when I want to listen to music on my phone, it either repeats the same song or jumps to another music source that I did not select. Not to mention after deactivating the app, the music continues to play over the speakers. Wished I did my research on Denon before purchasing","updated":"2019-01-26T09:08:16-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8122593411","userName":"EdmondLow","userUrl":"https://itunes.apple.com/us/reviews/id16394231","version":"2.1.680","score":5,"title":"Great App","text":"This app works great when married with the Marantz PM7000N network receiver.\n\nA little tricky and time consuming to initially set up, or at least the way I went about it.","updated":"2021-12-12T07:00:59-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5609264092","userName":"Carlgaray","userUrl":"https://itunes.apple.com/us/reviews/id285636874","version":"1.544.150","score":5,"title":"Nice App Denon Team","text":"I like this app so far. Needs a few improvements but very easy to use and useful. This is the first time I use it and all I can say is that I really like it.","updated":"2020-03-02T22:16:13-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4799919436","userName":"HeartGroup","userUrl":"https://itunes.apple.com/us/reviews/id1075217791","version":"1.520.200","score":1,"title":"Time consuming","text":"We purchased 5 HEOS speakers for a physicians office and I constantly have to reconnect the devices. They do not continuously stay connected so I have to reconnect throughout the day. I get errors that the log in is incorrect even though I’m logged in.  I spend entirely too much time trying to get music to play everyday and some days we just go without it. Would love for this app to work efficiently.","updated":"2019-09-18T06:15:18-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7387626940","userName":"Bhjfdchjgdxbjk","userUrl":"https://itunes.apple.com/us/reviews/id296858908","version":"1.583.490","score":5,"title":"Great work music","text":"I now work at home and the sound of sirens and silence was hard to take. HEOS changed all that! Any kind of music 24/7 with great reception and ease of use!","updated":"2021-05-25T11:34:51-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6039880437","userName":"Upherinthe603","userUrl":"https://itunes.apple.com/us/reviews/id18993532","version":"1.544.240","score":5,"title":"Great addition to my whole house system","text":"I have a Russound system throughout my house which I liked a lot but adding HEOS makes the system perfect.","updated":"2020-06-05T14:03:55-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5661724759","userName":"DP Tomball","userUrl":"https://itunes.apple.com/us/reviews/id18933954","version":"1.544.240","score":1,"title":"Terrible and Not User Friendly","text":"Software is buggy, hangs up, and is not user friendly. The simple main function of playing music is convoluted. Now my streamer wont connect after we changed our wifi network. Lastly, Qobuz is not on the streaming services listed, which is why I bought the streamer in the first place! \n\nCrap!","updated":"2020-03-14T17:02:19-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5218710189","userName":"Verditec","userUrl":"https://itunes.apple.com/us/reviews/id31902762","version":"1.520.320","score":2,"title":"Just not that great","text":"I’m not great at explaining what makes apps better.  This app works but is not very user friendly or intuitive.  I think some of it is the issue with the services we subscribe too. I want to see what I’m streaming at ie: 24bit vs 16bit.  I pay for tidal and amazonhd and want to see that I’m getting what I paid for.","updated":"2019-11-30T17:05:30-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3624840139","userName":"my favorite neighbor","userUrl":"https://itunes.apple.com/us/reviews/id35030020","version":"1.481.160","score":1,"title":"suddenly the devices disappear","text":"To date, my investment in the heos environment has grown to include the following:\n\nHEOS BAR\nHEOS SUB\nHEOS 3\nHEOS AMP\nHEOS 1\n\nOverall, we’re well over 2 grand in speakers, and I wish I would have stuck with SONOS. why didn’t I?\n\nBecause I have been a fan of denon stuff for decades. how hard can an app be?\n\nHard apparently. when it works, the UI is a mess. when it doesn’t, i have to take the soundbar off the wall to reconnect it, and then run around the house with a headphone cable and an old ipad to get them connected again.\n\nThis has happened 3 times now in the last two weeks, and tech support is less than helpful in finding a resolution.\n\nHooray for bad decisions and closed systems!","updated":"2019-01-07T19:15:51-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5853680713","userName":"Marks Audio","userUrl":"https://itunes.apple.com/us/reviews/id505261359","version":"1.544.240","score":4,"title":"Update interface","text":"Every song you choose goes to que. look at node 2i interface.  And create a better user friendly operating system like theres.","updated":"2020-04-23T10:26:58-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2089983214","userName":"Poltronetti","userUrl":"https://itunes.apple.com/us/reviews/id101764775","version":"1.430.180","score":4,"title":"Clean UI for the most important functions","text":"I like the simple room grouping and ungrouping. Works well except for the occasional crash. Does what you needs, which is better than everything possible.","updated":"2018-01-14T17:37:49-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5113971063","userName":"Ftasner","userUrl":"https://itunes.apple.com/us/reviews/id216794200","version":"1.520.200","score":2,"title":"Glitches all the time","text":"Super frustrating user experience. It’ll skip midway through some songs. Sometimes it just doesn’t allow us to set all our rooms into a single group. Our A/V guy recommended this to us but I really wish we’d gone with a different system.","updated":"2019-11-09T14:27:20-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3463965954","userName":"Archetart","userUrl":"https://itunes.apple.com/us/reviews/id144767156","version":"1.481.130","score":2,"title":"The imprecision is baffling","text":"Denon is known for precision audio. The idea that they could produce such an app is baffling. Two main gripes:\n\n1. Volume control – the slider is imprecise. Simple toggle up/down added to the slider would allow more precise control of individual and grouped speakers\n\n2. Why must one be on the same wifi network as the speakers for control? My thermostat allows me control from anywhere. My lights do the same thing. Why is my audio so special that one can’t even get into the app without being on the same network as the speakers?\n\nAudio quality out of these speakers is great. This app is horrendous.","updated":"2018-11-26T14:02:36-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2216232980","userName":"stevenandpeter","userUrl":"https://itunes.apple.com/us/reviews/id164236165","version":"1.442.190","score":4,"title":"Master volume gone","text":"What happened to the master volume control. Now I have to turn down each speaker individually? Ridiculous to remove an often used feature.","updated":"2018-02-16T16:32:29-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4409598040","userName":"ccritzer","userUrl":"https://itunes.apple.com/us/reviews/id184769462","version":"1.505.130","score":4,"title":"HEOS VS Sonos","text":"Much better sound quality with amplifier.  Not as intuitive in user interface.  Really wish it also had connectivity with Apple Music.  Bit clunky between interfaces and challenged by backward compatibility.","updated":"2019-07-04T06:13:12-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8028344685","userName":"rag1979","userUrl":"https://itunes.apple.com/us/reviews/id32417069","version":"2.1.680","score":1,"title":"Russell","text":"The app is horrible!  Only thing worse than the app is the tech support.  I am getting some more speakers for around the house.  It is going to be Sonos.  Heos maybe hi-Res, but what good is it if it doesn’t work.  At least Sonos is noted for its outstanding app.  It may not be hi-res, but at least it works.  I wanted music at dinner.  No luck, so I turned on the music channel.  Don’t think Denon tech really cares.","updated":"2021-11-15T16:57:12-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7874298797","userName":"CrewMFjones","userUrl":"https://itunes.apple.com/us/reviews/id205921237","version":"2.1.561","score":3,"title":"the last update messed it up.","text":"Glitch glitch since latest update with the dark/light mode.  Used to be easy and great now it’s like we just went back in time.  Disappointing.","updated":"2021-10-03T12:44:21-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5753737615","userName":"BWG-PG","userUrl":"https://itunes.apple.com/us/reviews/id19193373","version":"1.544.240","score":1,"title":"Will this app ever get their (profanity of your choice) together?","text":"When it works it’s great.  I have SiriusXM on my phone and have no problem signing in and listening to their app.  When I go to HEOS and try to listen to SXM there they tell me it’s the wrong user information.  It’s not the wrong user information.  It’s always something.\nAdditional.  IT IS STILL S%^%$!","updated":"2020-04-02T19:29:26-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8087744344","userName":"Luciaskillia","userUrl":"https://itunes.apple.com/us/reviews/id306646357","version":"2.1.680","score":3,"title":"I can only see from the letter “A” to the letter “M”","text":"I thought the text size might be affecting it, but I can’t find it in settings. My husband sees up to the letter “R”. Beats us?? Maybe a bug, hopefully it gets fixed. Otherwise I’d give it 5 Stars!!! Please fix!!","updated":"2021-12-02T10:33:50-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7879540205","userName":"Maronfan","userUrl":"https://itunes.apple.com/us/reviews/id19288962","version":"2.1.561","score":1,"title":"Dumpster fire","text":"Newest app update is a complete dumpster fire and song stop a minute in with our Marantz system. Doesn’t even have ability to have playlists with more than 300 songs in newest update. Not that it matters since doesn’t play anyway.\n\nEither bring your tech up to 2017, or I’m switching to Sonos soon. What a mess.","updated":"2021-10-04T22:11:04-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6190696215","userName":"Hydrant34","userUrl":"https://itunes.apple.com/us/reviews/id109462126","version":"1.562.200","score":1,"title":"Alexa skill does not support Sirius XM radio","text":"It’s crazy that there would be a music service that is not supported. Even though you can connect your XM in the app and command to play.  The Alexa HEOS skill still does not support XM. I have been waiting almost a year before writing this review. Update after update, it is not delivered yet.  HEOS would be a five star app if this was fixed!","updated":"2020-07-12T15:28:06-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7744214416","userName":"jdb-texas","userUrl":"https://itunes.apple.com/us/reviews/id34412991","version":"1.583.490","score":2,"title":"Wasted potential","text":"The HEOS app is just kind of a mess. Clunky, very dated user interface, meager features. May have been OK in 2009 or so. Using it with a nice Marantz music streamer and the hardware quality is light years ahead of the mediocre app experience. I think Denon can and should do much better for their customers.","updated":"2021-08-28T05:54:27-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5665101116","userName":"mcneil181","userUrl":"https://itunes.apple.com/us/reviews/id383016066","version":"1.544.240","score":1,"title":"Terrible App","text":"Do NOT purchase HEOS / Dennon speakers! The app used to operate them is absolutely terrible. Even as I’m writing this the music I was listening to just decided to stop for no reason. Connectivity issues, music not playing etc is a common theme. Again, if you’re looking to purchase speakers do NOT buy Heos / Dennon. Heos / Dennon, get your business together and fix this app.","updated":"2020-03-15T11:19:30-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7715787542","userName":"kevjs","userUrl":"https://itunes.apple.com/us/reviews/id11334309","version":"1.583.490","score":5,"title":"This app works just fine","text":"I don’t necessarily like using 2 apps to do different things but both this HEOS and the Denon AVR-Remote app together work great.","updated":"2021-08-20T13:57:48-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3546855573","userName":"Hccucdhchcxyc","userUrl":"https://itunes.apple.com/us/reviews/id415483575","version":"1.481.160","score":2,"title":"PLEASE FIX","text":"-Unable to connect after 1 song\n-after song finishes, it shuffles like crazy \n-cannot fast forward or rewind songs (little red bar to forward/rewind disappears 95% of the time)\n-cannot select desired song because it selects random songs from list. Pressing one song and gives error then plays a different song. \n-keeps trying to connect to Tidal over and over. After it connects, after 1 song it gives another error trying to connect again. \n-During music playback, it goes to a full screen heos logo saying “obtaining IP Address “\nEtc...","updated":"2018-12-18T18:57:46-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7878638682","userName":"picklesjackson","userUrl":"https://itunes.apple.com/us/reviews/id184046626","version":"2.1.561","score":1,"title":"Sarita","text":"New app version is unusable, constantly asks you if you want to use Alexa. App glitches out sometime during the first song being played. If you have the old version do not update till this glitch is fixed. App was poor to begin with, but this issue makes it non functional","updated":"2021-10-04T16:11:27-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8092393211","userName":"firebladeharsha","userUrl":"https://itunes.apple.com/us/reviews/id113888408","version":"2.1.680","score":5,"title":"Perfect companion for the AVR","text":"Perfect companion to the Denon app. UX could be little more intuitive but once you know where things are, they work well.","updated":"2021-12-03T18:53:05-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4837589069","userName":"QB Cats Fan","userUrl":"https://itunes.apple.com/us/reviews/id472207536","version":"1.520.200","score":3,"title":"Not a smooth set up","text":"The app and set up process is not that smooth. Be prepared to spend more time than you think and if you have an iPhone make sure you have the single adapter ready as you probably will not set up without it.","updated":"2019-09-25T14:39:04-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2246214664","userName":"BBM5020","userUrl":"https://itunes.apple.com/us/reviews/id35855014","version":"1.442.190","score":1,"title":"New Update","text":"I love the app in general but the update lacks the ability to adjust the volume for all the rooms at the same time. I have 12 different rooms and I really enjoyed the ability to turn them all down at the same time if needed. Now you must go in and adjust the volume in each room individually. The master volume control option was very useful.","updated":"2018-02-25T07:01:10-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2002240392","userName":"Drikanna","userUrl":"https://itunes.apple.com/us/reviews/id26032103","version":"1.430.180","score":1,"title":"Cannot find device","text":"Cannot connect to my Marantz AV receiver after this weeks update.  Seems like the app forgot my devices.  Tried to add it again, and it wants me to find a 3.5mm audio cable and connect my phone to the “HEOS audio jack in back” (which isn’t readily accessible).  It shouldn’t be this hard, since both my phone and AV receiver are still on the same WiFi network.","updated":"2017-12-16T16:16:04-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3118537453","userName":"HomesoundD","userUrl":"https://itunes.apple.com/us/reviews/id18040987","version":"1.466.200","score":2,"title":"Great sound terrible app","text":"We purchased a new home that had HEOS system built into it. The sound is great but the app is terrible. Every streaming service you use isn’t the same in the Heos app. You are better off buying a receiver you can connect to wirelessly or through blue tooth that streams directly from your streaming app or music.","updated":"2018-08-26T18:21:10-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7945951862","userName":"Palomar Skies","userUrl":"https://itunes.apple.com/us/reviews/id31846706","version":"2.1.562","score":1,"title":"Broken & Useless","text":"App was updated in September which rendered it useless for playing my music files,  It was supposedly fixed with the October update, but it now “plays” on my iOS devices, but no sound comes out of the system. It is very annoying that they broke a system that used to work.","updated":"2021-10-23T09:56:15-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7621957622","userName":"TheVeu","userUrl":"https://itunes.apple.com/us/reviews/id85266530","version":"1.583.490","score":1,"title":"Unreliable on a LAN","text":"The app routinely cannot find my Marantz, even when running MDNS and bonjour services. The vendor needs to invest in mobile app bug fixing and support. 1-star/F foe rhis product. Will have to buy a new receiver technology in the future solely due to poor apps support and presumably planned obsolesce. Do not buy from this vendor. 30-40 yrs ago they were a good amp mfg, but not in this day in age","updated":"2021-07-26T18:24:49-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5311174426","userName":"Seluraved","userUrl":"https://itunes.apple.com/us/reviews/id20702941","version":"1.520.320","score":1,"title":"This app is horrible","text":"Don’t get it. Nothing works. The interface is garbage. It is extremely difficult to understand how the sound bar interacts with the surround sound speakers. Every time i want to watch a movie it takes 30 minutes to set everything up. Avoid at all costs!","updated":"2019-12-23T19:12:23-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7907984960","userName":"Krispyc","userUrl":"https://itunes.apple.com/us/reviews/id18373771","version":"2.1.561","score":2,"title":"Poor Connectivity Continuity","text":"Nice new visuals in the update, but does now it NOT play well with other apps. I’d rather have the old visuals. The connectivity is WORSE. The minute I open another app while listening to music on my IPhone it shuts off. Please fix this problem ASAP!","updated":"2021-10-12T15:45:14-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2700380596","userName":"StevenLehmann","userUrl":"https://itunes.apple.com/us/reviews/id37095339","version":"1.454.230","score":1,"title":"Please bring back Master Volume control","text":"I have 11 HEOS speakers throughout my home and 90% of the time they are providing whole-home ‘background music’. No longer can I raise or lower the complete group as a whole. I need to individually select each room and adjust the volume, then go to the next room, and the next....\n\nAre you going to remove the ‘master’ volume control on your AV Receivers too?  Maybe just put 7+ little volume controls on the front. One for each of the mains and surrounds and subs and Atmos, etc. See how THAT would go over!\n\nReally a dumb move.\n\n6/18\nThanks for the update and bringing the Master Volume control back to the HEOS app. MUCH NICER!","updated":"2018-06-15T09:29:24-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7873801768","userName":"Ad66de","userUrl":"https://itunes.apple.com/us/reviews/id210650203","version":"2.1.561","score":2,"title":"Horrible update","text":"After auto update it just doesn’t work. Terrible. Keeps cutting off mid song. When does play a pop up says cat play media…when it is playing.  WiFi is robust and phone is new and updated.","updated":"2021-10-03T09:44:36-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5494026090","userName":"JC&ER","userUrl":"https://itunes.apple.com/us/reviews/id168609403","version":"1.544.150","score":4,"title":"4 out of 5","text":"I love that I can play pandora. I really wish I could view the previous song if I missed the artist.","updated":"2020-02-05T23:02:48-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6398106019","userName":"Ornot Majestic","userUrl":"https://itunes.apple.com/us/reviews/id11712828","version":"1.562.280","score":2,"title":"Good, when it works","text":"Crashes multiple times per use.  Every update it gets worse.  Sometime I have to exit out of app or even reinstall to get it to connect.  It’s a frustrating experience about 70% of the time.  When it works, it’s great!","updated":"2020-09-05T08:04:12-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6375931927","userName":"Searobot","userUrl":"https://itunes.apple.com/us/reviews/id853597150","version":"1.562.280","score":5,"title":"Very enjoyable app","text":"I use it with my Denon X6500H and it work very good.\nAmazing music quality and use friendly.\nI enjoyed it a lot.\nThank you.","updated":"2020-08-29T20:22:44-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5733842730","userName":"Lentaculum","userUrl":"https://itunes.apple.com/us/reviews/id26038753","version":"1.544.240","score":5,"title":"I’m loving it...","text":"But I would like to be able to download like I using the pandora app.  Everything else is great!","updated":"2020-03-29T20:47:58-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3100831853","userName":"NotSoSimplisafe","userUrl":"https://itunes.apple.com/us/reviews/id472570067","version":"1.466.200","score":1,"title":"Usually doesn’t work...","text":"App will usually attempt to open/load, but will just crash each time.  I have to restart the whole phone in order to get it working. However, when it does work, it starts immediately playing some Tennessee sports channel from TuneIn radio...I’ve never used TuneIn, never listened to sports radio, and have nothing to do with Tennessee.","updated":"2018-08-22T15:31:12-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3046930014","userName":"One dad's review","userUrl":"https://itunes.apple.com/us/reviews/id10448533","version":"1.466.200","score":1,"title":"Great sound, intolerable interface","text":"The app only connects with my phone/Ipad about half the time. \nSometimes no music, other times I can’t control my music. \nThis app has dementia, I never know if it is going to work or not. \nDenon should start from scratch and rewrite this app. \nThe sound is wonderful, but I could never recommend it because the controls are undependable.","updated":"2018-08-10T15:57:27-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2301053047","userName":"Acro66","userUrl":"https://itunes.apple.com/us/reviews/id112981895","version":"1.442.220","score":3,"title":"Bring back master volume","text":"After updating I found out that the master volume slider is gone. You have to select in menu what slider to use. \nWant and need a master volume one slider that rules them all. \nPossible to go back to earlier version?\n\nMuch appreciated.","updated":"2018-03-13T01:45:56-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"1917049430","userName":"Fish man 22","userUrl":"https://itunes.apple.com/us/reviews/id21857608","version":"1.421.150","score":1,"title":"No longer plays SiriusXM","text":"This app is extremely unstable.  In the past week, it no longer recognizes SiriusXM.  At first I thought it was my iPad, but I have the same issue with the iPhone.  It worked fine until a week ago.  I reset the account Info and relogged into SiriusXM with no luck. I checked my account and it plays fine thru the SiriusXM app, just not thru Heos.  Please fix this bug.......","updated":"2017-11-12T19:05:08-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6015342763","userName":"Enriquebras","userUrl":"https://itunes.apple.com/us/reviews/id539671251","version":"1.544.240","score":3,"title":"Mixed review","text":"Works very well for me only down fall is I can’t use it with apple music . I hope they can work that out or add the feature in . But other than that no complaints","updated":"2020-05-30T16:10:06-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5848738104","userName":"JRutttTheFirst","userUrl":"https://itunes.apple.com/us/reviews/id26898830","version":"1.544.240","score":2,"title":"Speakers are great, app is terrible","text":"Love the actual HEOS Speakers but the HEOS app is glitchy and hardly ever works. Volume always goes up and down on its own. Also doesn’t allow groupings s of home speakers to stay online. Constantly re-syncing speakers. Very frustrating for how expensive the speakers were.","updated":"2020-04-22T08:51:34-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5694574613","userName":"M@thTeacher","userUrl":"https://itunes.apple.com/us/reviews/id4098646","version":"1.544.240","score":5,"title":"Hey it works and it’s free","text":"I now have two Marantz setups and my single iPhone app lets me send two streams of Tidal and/or Pandora or my Iranian religious music over them","updated":"2020-03-21T19:50:01-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7907511384","userName":"kevin devin","userUrl":"https://itunes.apple.com/us/reviews/id246411639","version":"2.1.561","score":2,"title":"Buggy","text":"It just doesn’t work all that well. My receiver is hardwired to LAN and it still takes forever to recognize. The TuneIn feature doesn’t seem to work sometimes. It’s just not as intuitive and smooth as the Yamaha app.","updated":"2021-10-12T11:59:52-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7893355289","userName":"swtrps","userUrl":"https://itunes.apple.com/us/reviews/id34362325","version":"2.1.561","score":1,"title":"Awful","text":"This app is awful for numerous reasons which reflects extremely poorly on denon products in general considering the requirement to use HEOS.  If it were a matter of a choice between using my iTunes app or the HEOS app to control music it’d be one thing. Unfortunately you are required to use HEOS and it’s functionality is finicky at best.","updated":"2021-10-08T17:23:01-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7187229961","userName":"disatified customer 1001","userUrl":"https://itunes.apple.com/us/reviews/id34464898","version":"1.583.490","score":1,"title":"not Working","text":"Hasn’t worked since last update, ridiculous.  Worked great for two years and then nothing, same message every time that “HEOS unable to play music from this source at this time.  Try again later”\nNo answer to my emails from support either.","updated":"2021-04-05T09:40:48-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4068822678","userName":"cheezeskrice","userUrl":"https://itunes.apple.com/us/reviews/id28843118","version":"1.505.130","score":1,"title":"Absolute Junk","text":"App has never worked correctly! Continuously needs maintenance and generally never works. Developers go back and start over. The user should not have to battle the app every time it’s used. Other media apps used have no trouble with network identity. Heos however does. Drops network can’t find it even when  a few inches from AVR.","updated":"2019-04-27T13:41:14-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2158113696","userName":"fatspatula","userUrl":"https://itunes.apple.com/us/reviews/id85254277","version":"1.430.180","score":1,"title":"Great speakers, Horrible App","text":"Demon really needs to fire their App development team or whoever made it. It is very frustrating, music cuts in and out, sometimes certain speakers won’t play music, Etc. It’s just a buggy app, sometimes it works fine and other times I spend 10-15 futzing around with and then all of a sudden they start working. But the speakers do sound great.","updated":"2018-02-02T06:08:35-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5479909158","userName":"takennickename","userUrl":"https://itunes.apple.com/us/reviews/id255724871","version":"1.544.150","score":5,"title":"Forgets who I am","text":"Only complaint is I always have to re enter my password","updated":"2020-02-02T11:00:53-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4760031027","userName":"ArJunaBug","userUrl":"https://itunes.apple.com/us/reviews/id41558722","version":"1.520.145","score":1,"title":"Apps are not Denon’s forté","text":"Denon might make a decent AVR, but they have obviously not seen the value and producing quality apps. This app and the Denon AVR app seem like afterthought and a conglomeration of disparate thoughts they’ve had across the years. Denon needs to seriously start over with their apps and try to build in some intelligence and ease-of-use, not to mention they need to be much faster.","updated":"2019-09-11T00:49:38-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2038693636","userName":"Young768","userUrl":"https://itunes.apple.com/us/reviews/id24469214","version":"1.430.180","score":1,"title":"Horrible Connectivity","text":"The app itself is not the worst out there, but the random connection problems are horrible. I have 5 HEOS speakers in my house and Each time I open the app you can never count on which speakers will show up.  I checked my network and I can see all the speakers on my network, it is an app problem.  So far Denon has not been very much help.","updated":"2017-12-29T09:50:36-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"1994804614","userName":"Racer 1027","userUrl":"https://itunes.apple.com/us/reviews/id335162886","version":"1.430.160","score":1,"title":"New update extremely unreliable.","text":"The new version only allows one change before becoming unresponsive or crashing. For example, you can open the app and choose a station to stream. But when you want to change the station or turn it off, the app won’t accept any input. You have to close the app and reopen it.","updated":"2017-12-13T20:14:02-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7407976411","userName":"Then1354","userUrl":"https://itunes.apple.com/us/reviews/id34180263","version":"1.583.490","score":2,"title":"Great when it works","text":"But it doesn’t work very often when you group speakers together. I’m $1500 into speakers for this system and thoroughly disappointed. I hope the system improves over time, it is a great concept but just poor execution.","updated":"2021-05-30T18:08:49-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6983086420","userName":"diskdehaan","userUrl":"https://itunes.apple.com/us/reviews/id762649500","version":"1.583.431","score":2,"title":"Sound","text":"You can very easily damage your speakers with the sound bar in the app. Increase volume very dramatically with small sound bar adjustment. Do not leave this app open as even a minor touch may send a huge increase in volume.","updated":"2021-02-11T15:23:52-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4688765331","userName":"amodxb","userUrl":"https://itunes.apple.com/us/reviews/id121439201","version":"1.520.140","score":5,"title":"Device not found","text":"The app is unable to find the device. Needs a major overhaul!","updated":"2019-08-28T23:46:46-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3215201218","userName":"Cpaul91","userUrl":"https://itunes.apple.com/us/reviews/id160983578","version":"1.466.240","score":1,"title":"No functionality","text":"The app simply does not work. I would love to access its features so I can stream music over WiFi to my Marantz receiver, but the app is completely useless. \n\nIt is far too buggy, and crashes constantly. I cannot even begin the setup process without the app force closing. I’ve attempted to restart my device, force close the app, and completely reinstall the app. No improvement. \n\nThis is a huge inconvenience and removes so much functionality from my receiver. This needs to be fixed. \n\nI’m running the newest iOS 12 on an iPhone X.  (It was crashing prior to the iOS update, too).","updated":"2018-09-21T16:34:11-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6877964058","userName":"Shawn T. S.","userUrl":"https://itunes.apple.com/us/reviews/id377539330","version":"1.583.161","score":1,"title":"If I could give zero stars, I would.","text":"People need to write their reviews based off of the performance of the app, NOT THE SPEAKERS. This app is messy, confusing, and the polar opposite of user friendly. The navigation through the app is not fluid. The directions are unhelpful. The troubleshooting section is worthless. Don’t use HEOS, use SONOS instead. \nTerrible app. 0/10","updated":"2021-01-16T12:15:46-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5826568468","userName":"mnoo7","userUrl":"https://itunes.apple.com/us/reviews/id237615774","version":"1.544.240","score":1,"title":"I didn’t believe the bad reviews!","text":"I thought these bad reviews couldn’t be true.  After all Denon is a big name in a/v equipment.  Boy was I wrong. The app is terrible: slow, clunky and services are not integrated fully.   I may return the sr8012 I just purchased and go back to Yamaha and build upon their music cast system instead.","updated":"2020-04-17T14:43:51-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5475548561","userName":"Turbonics","userUrl":"https://itunes.apple.com/us/reviews/id38423090","version":"1.544.150","score":4,"title":"Heos","text":"I have over 300 speed internet but the process time of heos played music is slow but I love the flexibility and numerous options available.","updated":"2020-02-01T10:31:41-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4261050288","userName":"Daniel\\TobyMac lover","userUrl":"https://itunes.apple.com/us/reviews/id462384872","version":"1.505.130","score":2,"title":"Crashes","text":"This app was working great for a long time, then all of a sudden when I went to try to play some music it keeps crashing I can’t even choose which music source I want to play without it crashing, please make an update and fix this.","updated":"2019-06-03T22:54:31-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3516704734","userName":"Cartercentral","userUrl":"https://itunes.apple.com/us/reviews/id30878979","version":"1.481.130","score":1,"title":"Totally regret moving to Denon & their HEOS crap","text":"App fails in so many ways.  Ping the problems it does not sync rooms no matter what the source is selected, software update continually fails, can never get it to login to HEOS account.  Practically worthless except for remote control of HEOS link.  \n\nDenon Amp is not much better.  Moved from Yamaha to Denon about a year ago and have had nothing but regrets since I changed.","updated":"2018-12-10T12:31:46-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3384255531","userName":"winsloot","userUrl":"https://itunes.apple.com/us/reviews/id431222099","version":"1.481.130","score":5,"title":"Awesome","text":"This app works perfectly and I enjoy being able to listen to music of great quality","updated":"2018-11-05T08:34:17-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7921566432","userName":"alanbear","userUrl":"https://itunes.apple.com/us/reviews/id27310616","version":"2.1.562","score":1,"title":"Lazy","text":"This app should receive the participation award for music apps.  It’s actually become less useful over time rather than improve.  It doesn’t even show up on the iPhone Lock Screen any longer. One is better off using the HEOS speakers as a airplay speaker and be done with this lame app.","updated":"2021-10-16T09:29:11-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7569358394","userName":"Yesim1","userUrl":"https://itunes.apple.com/us/reviews/id79012999","version":"1.583.490","score":3,"title":"When it works, it is great","text":"When it somehow loses the connection to your phone or tablet, we found the only way to make it work again is to reboot the router.","updated":"2021-07-12T14:25:50-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6669659829","userName":"KarlRacki","userUrl":"https://itunes.apple.com/us/reviews/id15550816","version":"1.583.161","score":2,"title":"Tidal Library Organization","text":"HEOS is an ok app but you can only view your Tidal albums alphabetically, which is very much of a pain. They need to add functionality so that you can view your Tidal albums by most recently added/oldest, etc. How difficult is that?","updated":"2020-11-21T04:24:41-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2211583628","userName":"romantic egoist","userUrl":"https://itunes.apple.com/us/reviews/id38404249","version":"1.442.190","score":4,"title":"Getting better","text":"App is getting better — still looks a little tired but functionally complete-ish and not the buggy garbage fire it was for the first two years","updated":"2018-02-15T09:46:24-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4087742019","userName":"Darths Raiders","userUrl":"https://itunes.apple.com/us/reviews/id310814195","version":"1.505.130","score":2,"title":"Terrible","text":"I have had this product for years now and I can count on one hand the amount of times I’ve been able to connect to it without waiting 30+ minutes to connect. Complete waste of money. Would not recommend.","updated":"2019-05-01T19:01:10-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2310064856","userName":"GoldenFeatherRunningBear","userUrl":"https://itunes.apple.com/us/reviews/id34929324","version":"1.442.220","score":1,"title":"App Ruins Everything","text":"I have never seen such an awesome product paired with a Horrendous, Buggy app.  If you can actually get your speakers to play music it sounds beautiful.  However it’s nearly impossible to get the app to work rendering the speakers useless. It seems like they keep releasing updates, but hasn’t made much of a difference. Unfortunately I recommend just buying Sonos speakers, the app is much better.\n\n-App randomly decides to not recognize speakers\n\n-App constantly fails to launch, it also randomly chooses when it wants to do that.\n\n-Constant App restarts, and physical speaker reboots needed for app to find speaker","updated":"2018-03-15T15:51:58-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5441516336","userName":"mickeythedart","userUrl":"https://itunes.apple.com/us/reviews/id109253604","version":"1.544.150","score":4,"title":"Sometimes erratic on connectivity...","text":"...BUT HEOS is a really nice device when working correctly with TIDAL. My cell phone is a library of music, using TIDAL FLAC files, set up with some Paradigm speakers and yeah, it’s a very good aurul salad.","updated":"2020-01-23T22:12:52-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7896766902","userName":"zxsaef","userUrl":"https://itunes.apple.com/us/reviews/id1239514923","version":"2.1.561","score":3,"title":"What is the point","text":"No features, it’s easier to connect my laptop and DAC up to my Marantz if I want to listen to hi Rez audio. Glad it came free with my Marantz I would be upset if I paid for an app as limited as this one","updated":"2021-10-09T15:06:15-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6375009596","userName":"brendanwww","userUrl":"https://itunes.apple.com/us/reviews/id483672389","version":"1.562.280","score":1,"title":"Annoyed","text":"Just buy a Bluetooth speaker. Every single time there is an update you will end up spending an hour setting everything back up. Officially throwing these in the trash today, beyond fed up. Also the app will just run you in circles during the whole process.","updated":"2020-08-29T13:14:51-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3642069897","userName":"Nightroller","userUrl":"https://itunes.apple.com/us/reviews/id26255103","version":"1.481.160","score":1,"title":"HEOS a big joke","text":"I recently updated my Marantz 5010 to a Marantz 7012 . I love the Marantz brand ,it’s rich in features and the look Separates it from other Receivers. My big problem is the HEOS APP is it’s shameful and painful to use . Can someone at HEOS please take a look at the SONOS APP. The SONOS APP by far is so much more superior than the HEOS APP . Much more Music services and easy to make playlist . HEOS please do something about your terrible APP.","updated":"2019-01-12T08:41:36-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3169341460","userName":"Netiptek","userUrl":"https://itunes.apple.com/us/reviews/id171101105","version":"1.466.240","score":5,"title":"Love the system","text":"I have my whole house wired with the HEOS devices. I love it. WAY better than Sonos. People complaining about the app simply don't know how to use it.","updated":"2018-09-08T18:00:04-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5705911456","userName":"Kk1616","userUrl":"https://itunes.apple.com/us/reviews/id214071722","version":"1.544.240","score":5,"title":"Love what it’s supposed to do but buggy","text":"I love HEOS when it’s working, but it resets itself a lot and I have to reset my speakers on a semi-regular basis","updated":"2020-03-24T05:23:57-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5693326151","userName":"Flares:)","userUrl":"https://itunes.apple.com/us/reviews/id232782434","version":"1.544.240","score":2,"title":"Can't log in after latest update 😡","text":"After loading latest firmware... I'm unable to log in to the Denon heos site so unable to stream online sources.  Multiple other reviews have commented the with same issue.  DENON TECH SUPPORT... fix this!!!!!!","updated":"2020-03-21T13:04:58-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5488020890","userName":"redbarnboutique","userUrl":"https://itunes.apple.com/us/reviews/id235583863","version":"1.544.150","score":1,"title":"Fails every few days","text":"We use heos in our store and it fails constantly for no apparent reason. It can take 1-3 days to get it going again. There is no rhyme or reason as to what causes it to fail or what helps it start again. We just have to wait out it’s crabby personality.","updated":"2020-02-04T11:04:46-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4003077954","userName":"Kee_Bee_The_Real","userUrl":"https://itunes.apple.com/us/reviews/id285723966","version":"1.493.170","score":5,"title":"Love it","text":"All my music apps in one space and i can connect to my Amplifier without moving from my seat! I’ll take it!","updated":"2019-04-12T06:45:22-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4072192517","userName":"toddfd","userUrl":"https://itunes.apple.com/us/reviews/id35981103","version":"1.505.130","score":1,"title":"A mess","text":"This app is a mess. The most unintuitive navigation I’ve ever seen. So easy to get lost and to miss important functionality. And why does it keep asking me to set up my sound bar, which has been set up for months, every time I play something other than my TV through it?  The bar sounds great, but the app is a disaster.","updated":"2019-04-28T07:20:20-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6998910435","userName":"MaxPlanc","userUrl":"https://itunes.apple.com/us/reviews/id21979720","version":"1.583.431","score":2,"title":"It works somewhat but needs improvement","text":"No search function. I haven’t figured out how to access or edit my queue.  I am using my Denon as a simple stereo with speakers in 2 rooms and that’s not bad to control.  Feels like Beta software","updated":"2021-02-15T15:24:29-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2212839988","userName":"Ever75","userUrl":"https://itunes.apple.com/us/reviews/id39249354","version":"1.442.190","score":1,"title":"Volume....update has made a bad app worse","text":"Can no longer adjust the volume on all the speakers at the same time? Are you kidding me? My husband wants to return the whole system based on this new factor alone. What's the point of connecting all the speakers if you have to go in & change each individual volume?????","updated":"2018-02-15T18:28:17-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7911795006","userName":"Sad to see new App Version","userUrl":"https://itunes.apple.com/us/reviews/id27444512","version":"2.1.561","score":1,"title":"Poor App version upgrade","text":"So far with the latest version update, our Denon receiver is not recognizable and our HEOS 5 speaker is no longer controllable from the app. Both items worked with the prior app version. Have sent a “support” email to customer service for help.","updated":"2021-10-13T16:52:16-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7300742491","userName":"rickyc0620","userUrl":"https://itunes.apple.com/us/reviews/id107974128","version":"1.583.490","score":1,"title":"Pandora","text":"It won’t work properly with your Pandora app. Some of the stations in your Pandora app won’t be displayed in the Heos app. Also when you search for songs you won’t be able to find all that normally you will in the app and tech support don’t answer.","updated":"2021-05-05T05:01:45-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2913992735","userName":"Txhntr","userUrl":"https://itunes.apple.com/us/reviews/id13282712","version":"1.454.280","score":4,"title":"Love Heos - App is ok","text":"The app is functional.  It works and the Heos wireless speakers are great.  The app could have more functionality and user experience isn’t great but it works fine. I would buy again.","updated":"2018-07-15T14:53:52-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6120969410","userName":"Sam_Marcus","userUrl":"https://itunes.apple.com/us/reviews/id39568426","version":"1.562.200","score":2,"title":"Incredible how bad it is","text":"I was deciding between a Denon and Yamaha AVR. I had looked at the app reviews ahead of time as I usually do before I buy any hardware that uses an app, and sure wish I had picked Yamaha. Hopefully this can persuade someone else to not make the same mistake I did.","updated":"2020-06-25T10:20:46-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2213034438","userName":"RickyBan007","userUrl":"https://itunes.apple.com/us/reviews/id372774683","version":"1.442.190","score":1,"title":"Poor UX and no functional update","text":"I regret spending money on Heos over Sonos. Sonos still upgrades the playbar with significant updates including Alexa support and Smartthings whereas the Heos HomeCinema experience is never upgraded. The number of music streaming app also in unchanged for a long time and has no support for music apps for other languages. \nThe software is implemented in a poor manner.","updated":"2018-02-15T19:39:59-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"1924254833","userName":"Interview777","userUrl":"https://itunes.apple.com/us/reviews/id176792201","version":"1.421.150","score":1,"title":"Worst App","text":"November 2017. This App crashes. One minute plays Pandora. Then doesn’t. Played Siriusxm. Then locked out. Bluetooth issues.  Problem problems problems.  I don’t remember who owns Denon—yet, one would think it’s reasonable to make it function correctly for a company that relies on electronics to make money.  Geez. Yet, it’s not that complicated Denon. Get it together. Please!","updated":"2017-11-15T21:01:06-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8144118988","userName":"AA-Ron805","userUrl":"https://itunes.apple.com/us/reviews/id635145580","version":"2.1.680","score":2,"title":"Glitches","text":"Sometimes this app just starts freaking out and scrolling through songs super fast while you’re trying to make a selection or search.","updated":"2021-12-18T11:08:08-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4077752100","userName":"Mosart23","userUrl":"https://itunes.apple.com/us/reviews/id490482558","version":"1.505.130","score":1,"title":"Worse app ever!!","text":"App never can find the device even if you’re standing right next to it. And what stinks is that this is the only app for HEOS. Had I know this before I wouldn’t have purchased. App is the worse. It appears that the developers don’t care about our concerns as many have stated the same problem.","updated":"2019-04-29T12:08:28-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3578419843","userName":"dattepo","userUrl":"https://itunes.apple.com/us/reviews/id211930907","version":"1.481.160","score":4,"title":"It’s ok not too bad","text":"The app is good, it just takes a while to connect which is frustrating most of the times","updated":"2018-12-26T22:57:22-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6542947966","userName":"ALH posey","userUrl":"https://itunes.apple.com/us/reviews/id25376294","version":"1.562.280","score":2,"title":"Pathetic","text":"Really pathetic app that barely works. It attempts to work and then pauses and or is impossible to stop playing in your house. Why anyone would pick this for their house is only because they had their idiots install it","updated":"2020-10-16T18:11:37-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3639957710","userName":"coreyowilson","userUrl":"https://itunes.apple.com/us/reviews/id163491501","version":"1.481.160","score":2,"title":"Frustrating","text":"I have tried to reset my HEOS password several times with no luck. Don’t understand why this is so difficult. Even reset on Denon website but still getting an error. Love my Marantz receiver but this app has always been a nightmare to deal with.","updated":"2019-01-11T20:50:15-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2866028835","userName":"Jetlagpeter","userUrl":"https://itunes.apple.com/us/reviews/id345620458","version":"1.454.280","score":1,"title":"Worse app ever","text":"The app keeps trying to download the latest version to my soundbar and other Heos speakers. Even after it completes it then tries to update again and again. I have to keep closing and opening the app just to change songs or the volume before it starts updating again.\nDenon wake up!!!","updated":"2018-07-08T14:06:17-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8048991673","userName":"Posh Dog","userUrl":"https://itunes.apple.com/us/reviews/id265383575","version":"2.1.680","score":1,"title":"Garbage","text":"It does not work. I’m sick and tired of companies putting more layers of software and misconnected resources between me and my music. This is a total hassle. No number of software updates ever fixes the issues. Marantz - you’ve been at it FOREVER. Start by getting the simple things RIGHT.","updated":"2021-11-21T12:55:52-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7892832990","userName":"Prneum","userUrl":"https://itunes.apple.com/us/reviews/id433166141","version":"2.1.561","score":2,"title":"Constant Disconnect","text":"This latest update has made my Home 150’s useless. I cannot connect with my Denon receiver 90% of the time. The 10% of the time, it only stays connected for 5 minutes. Please resolve this issue. It’s money wasted.","updated":"2021-10-08T13:11:53-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7150900006","userName":"jkinzer1","userUrl":"https://itunes.apple.com/us/reviews/id159766626","version":"1.583.490","score":5,"title":"When I got the app to work it’s great.","text":"Now that everything is working this is a great app.","updated":"2021-03-27T07:30:01-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6846195531","userName":"JuJuBe1963","userUrl":"https://itunes.apple.com/us/reviews/id37278463","version":"1.583.161","score":1,"title":"Garbage","text":"Doesn’t work. I logged in multiple times set up multiple accounts and when you try and play it on my Denon AVR750It does nothing. Thankfully I have a fire cube which I could use to stream the music I would normally get from this crappy application.","updated":"2021-01-08T10:47:40-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5811934436","userName":"Marantz ND8006 user","userUrl":"https://itunes.apple.com/us/reviews/id679209704","version":"1.544.240","score":1,"title":"Marantz ND8006 user","text":"This app is just stupid.  It takes at least 15 minutes to search and connect to the device which is right next to my phone.  Whoever wrote this app needs to do something about it or be fired!!!\nI would rate this app zero star if i could.","updated":"2020-04-14T14:16:38-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5472454906","userName":"Wallylefty","userUrl":"https://itunes.apple.com/us/reviews/id32493574","version":"1.544.150","score":1,"title":"Poor performance","text":"Constantly having issues with getting the turntable work. Second time in less than two months that we have to get the installer out to fix it. My advice is to get a traditional system.","updated":"2020-01-31T18:40:21-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3050307697","userName":"Essica Goddess","userUrl":"https://itunes.apple.com/us/reviews/id15178667","version":"1.466.200","score":4,"title":"Bypass HEOS App","text":"For those who hate the app, you can bypass the app entirely by adding a Bluetooth chip to the back of the speaker. It allows you to use the speakers for any program, not just what the app offers.","updated":"2018-08-11T08:29:56-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2858498186","userName":"Sammy Boy9","userUrl":"https://itunes.apple.com/us/reviews/id37740041","version":"1.454.280","score":1,"title":"Inconsistent","text":"The whole experience is inconsistent. Sometimes it works - sometimes it does not. Streaming music is the same. Very frustrating. Great concept, great sound but.....\n\nBTW - still have not been able to get customer service. It randomly disconnects you or says 18min wait and I hang up after 55 minutes. Ugh","updated":"2018-07-07T11:33:36-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5694019871","userName":"FiberNutATL","userUrl":"https://itunes.apple.com/us/reviews/id201589099","version":"1.544.240","score":5,"title":"UPDATE BROKE IT","text":"Will not allow signin to HEOS account anymore- An unspecified error has occurred error -2000. Before the update, was a totally kickass app.","updated":"2020-03-21T16:53:52-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3996653074","userName":"Jhstod","userUrl":"https://itunes.apple.com/us/reviews/id16653118","version":"1.493.170","score":1,"title":"App randomly doesn’t work","text":"I have this app on iPhones and iPads and sometimes it will work on one iPhone but not another or on one iPad but not another and then the next day a completely different device will work and others won’t. It’s so random and frustrating.","updated":"2019-04-10T18:43:14-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3522854902","userName":"Desert balloonatic","userUrl":"https://itunes.apple.com/us/reviews/id277694314","version":"1.481.130","score":1,"title":"Nonsense","text":"The app is useless, and there’s no alternative. Doesn’t support Apple Music, unless you use it with the jack cable and play straight from your music app. Using the app with the WiFi doesn’t work properly, it stops suddenly...and can’t sincronize two different speakers either. The speaker works great, the rest is nonsense.","updated":"2018-12-12T06:49:10-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3347426262","userName":"sprickles","userUrl":"https://itunes.apple.com/us/reviews/id37025833","version":"1.466.240","score":2,"title":"Just fix it!!!!","text":"So frustrating. So frustrating. Turn on the music. Jump in the shower. Music stops. Get out. Reboot 2 drives ($$$$) and update the app. Still. Won’t. Keep. Playing. Ahhhh! Can’t play anything from “this device”. No Apple Music. No sleep timer. So frustrating. Just fix it.","updated":"2018-10-26T15:14:29-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6680936514","userName":"art_memory","userUrl":"https://itunes.apple.com/us/reviews/id243337773","version":"1.583.161","score":4,"title":"Wonderful app except no Tidal MQA","text":"Works great in terms of playing music from thumb drive and music apps but such a shame it can’t play Tidal’s hi quality albums.","updated":"2020-11-24T07:09:17-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8147497354","userName":"T1250","userUrl":"https://itunes.apple.com/us/reviews/id17925392","version":"2.1.680","score":1,"title":"Horrible app","text":"If I could give this app negative stars I would. Will not stay connected to my streaming services which makes the app and system practically useless. Everything about this app is terrible. Horrible UI and terrible functionality.","updated":"2021-12-19T09:49:10-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4651668411","userName":"kbaegis","userUrl":"https://itunes.apple.com/us/reviews/id491032923","version":"1.520.140","score":4,"title":"Great app; new ux designer might be appropriate","text":"The app gets five stars for functionality. A couple of critical features are awkwardly placed or effectively hidden, so they definitely lose a star for that.","updated":"2019-08-21T14:37:01-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5731259364","userName":"River james","userUrl":"https://itunes.apple.com/us/reviews/id116880850","version":"1.544.240","score":4,"title":"Down time","text":"Your servers go down at key listening times","updated":"2020-03-29T07:51:38-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7041146842","userName":"rcs949","userUrl":"https://itunes.apple.com/us/reviews/id167761779","version":"1.583.490","score":1,"title":"Absolutely the worst App!!","text":"Everything worked great for a few weeks, then the app updated, now the sound cuts out intermittently and will not connect to all speakers.\nI have to remove the speakers and reconnect them every time. \nDeleting the app....worthless.","updated":"2021-02-26T06:54:35-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6343264555","userName":"Sprachnroll","userUrl":"https://itunes.apple.com/us/reviews/id107864136","version":"1.562.280","score":1,"title":"Months Later Still Not Working","text":"DENON proves they just don’t do software.  The most non-intuitive app ever.  A month later and I still can’t get my DENON receiver to communicate to my HEOS speaker.  And just how is it a wireless speaker when you still have to plug it into a power source.  Load of crap.","updated":"2020-08-20T19:24:57-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5361487384","userName":"wisconsinsquidly","userUrl":"https://itunes.apple.com/us/reviews/id26330534","version":"1.520.320","score":4,"title":"Random","text":"Need to be able to random all songs in iPhone...not limited to first 300","updated":"2020-01-04T13:49:55-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4282878339","userName":"Eldoctore1","userUrl":"https://itunes.apple.com/us/reviews/id284939173","version":"1.505.130","score":4,"title":"When it works, it's great","text":"It's a bit temperamental and the denon software does reset my speaker setup and get buggy but man oh man, when it works, it's just great.","updated":"2019-06-08T03:35:08-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4935604863","userName":"DavidKoz","userUrl":"https://itunes.apple.com/us/reviews/id24370296","version":"1.520.200","score":1,"title":"Glitches Everywhere!","text":"Ive wasted enough time trying get my HEOS system to work as advertised. I’m not wasting more time describing all the problems in this review. Suffice to say, avoid this system. It really is as problematic as other reviewers have stated and a real waste of money. There is something systemically wrong with whole heos ecosystem.","updated":"2019-10-12T18:57:33-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8066822569","userName":"Ready to move to AT&T","userUrl":"https://itunes.apple.com/us/reviews/id10763175","version":"2.1.680","score":5,"title":"The Best!","text":"HEOS has changed my life! Thank you for\nadding all day music to my days… and nights!","updated":"2021-11-26T15:40:17-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4487058216","userName":"cough2","userUrl":"https://itunes.apple.com/us/reviews/id173932087","version":"1.505.130","score":5,"title":"Easy to use","text":"I principally use the app to connect with the patio WiFi. \nIt’s reliable and easily set up and works great.","updated":"2019-07-19T12:20:50-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4599441425","userName":"Abebekebese","userUrl":"https://itunes.apple.com/us/reviews/id452985280","version":"1.505.130","score":1,"title":"So frustrating","text":"I got the heos sound bar with woofer and i have been having issues with the speaker and the app since day one. It disconnects on its own and reconnecting is a pain. Right now after 6 months I changed a wifi and here i am Sitting here without darn speaker bc it won’t reconnect and the app is useless.","updated":"2019-08-10T19:37:17-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6044958176","userName":"DAN-DARE-09","userUrl":"https://itunes.apple.com/us/reviews/id103165554","version":"1.544.240","score":1,"title":"Great hardware, Poor Software","text":"The app is terrible, from the user interface through, the relay/response, to the setup it’s is really very bad. It’s a shame because the speakers are amazing... when the app doesn’t turn them to full volume unexpectedly that is","updated":"2020-06-06T19:29:24-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6029596128","userName":"8488484885584","userUrl":"https://itunes.apple.com/us/reviews/id33834710","version":"1.544.240","score":2,"title":"Zero Apple Music Support","text":"Denons response to use airplay or Bluetooth would be fine if either of those worked with Zone 2 play only! Major over-site on their design.","updated":"2020-06-03T04:31:19-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8131159515","userName":"birddogger5150","userUrl":"https://itunes.apple.com/us/reviews/id317791505","version":"2.1.680","score":2,"title":"Annoying bug","text":"Why is it playlists retrieved from my music server play in alphabetical order instead of the order I put them in??","updated":"2021-12-14T19:00:31-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5435453332","userName":"p.kusek","userUrl":"https://itunes.apple.com/us/reviews/id724028944","version":"1.520.320","score":5,"title":"Love it","text":"Did use onkyo before but app was terrible. \nNo complaints so far.","updated":"2020-01-22T08:34:44-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5330802201","userName":"tecww1","userUrl":"https://itunes.apple.com/us/reviews/id535998096","version":"1.520.320","score":3,"title":"Doesn’t support Pandora Premium","text":"Pandora Premium has been around for over a year and HEOS still doesn’t support it.","updated":"2019-12-28T07:06:18-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3195954949","userName":"CVS is awesome","userUrl":"https://itunes.apple.com/us/reviews/id132264978","version":"1.466.240","score":1,"title":"HEOS speakers were a mistake to buy","text":"To be fair, the physical speakers are impressive but when you need this app to use them; they become virtually unusable.\nAs a consumer who spent almost 1500 on speakers I regret the purchase. \nIf anyone is considering these I encourage you to test the app and read as many reviews as possible before purchasing.","updated":"2018-09-16T06:38:30-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2678138433","userName":"Macalby","userUrl":"https://itunes.apple.com/us/reviews/id37281033","version":"1.454.230","score":3,"title":"Needs Watch app","text":"Please make an AppleWatch app since you have to control the music from within the app. This would be most useful for controlling the music from outdoor speakers while in the pool","updated":"2018-06-11T12:19:07-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7602937752","userName":"DJSmev","userUrl":"https://itunes.apple.com/us/reviews/id16899607","version":"1.583.490","score":5,"title":"Works as it should","text":"Love controlling my Denon from this app. Many choices.","updated":"2021-07-21T14:41:59-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5343114752","userName":"'bekah","userUrl":"https://itunes.apple.com/us/reviews/id1059253401","version":"1.520.320","score":5,"title":"Better than Bose","text":"Best sound quality. Heos speaker rocks rally clear sound. Sub harmonics r truly beautiful.","updated":"2019-12-31T07:27:08-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2213913862","userName":"Burris","userUrl":"https://itunes.apple.com/us/reviews/id21923188","version":"1.442.190","score":2,"title":"Not Apple Music Supportive","text":"The speaker is great but the app is not user friendly. After a lot of trial and error I finally know how to use it. Apple Music is not one of the choices to stream you are forced to use different platforms. Very disappointed.","updated":"2018-02-16T01:40:45-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2137574774","userName":"win2kcharlie","userUrl":"https://itunes.apple.com/us/reviews/id582882263","version":"1.430.180","score":2,"title":"Worked great until iOS 11.2.5 update","text":"App worked great for controlling multiple zones from my receiver and selecting and streaming music.  Unfortunately after the iOS 11.2.5 update the app crashes on launch every time rendering it useless.","updated":"2018-01-28T12:00:25-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8042859154","userName":"ojammer","userUrl":"https://itunes.apple.com/us/reviews/id85006704","version":"2.1.680","score":1,"title":"Doesn’t work with SoundCloud","text":"Pretty terrible they can’t get this to work with SoundCloud. Server not found error. Spent an hour with tech support until they finally realized it’s a known issue that they have no solution for.","updated":"2021-11-19T22:38:40-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7930942971","userName":"Nick197406","userUrl":"https://itunes.apple.com/us/reviews/id367307002","version":"2.1.562","score":1,"title":"App is awful. Updates broke Alexa functionality","text":"As many other reviewers stated, this app continues to get worse. Latest update renders all Alexa functionality useless. It used to be paired with two alexas. Now it won’t sync. Useless Denon system","updated":"2021-10-19T04:23:36-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6436832608","userName":"Vinnymac","userUrl":"https://itunes.apple.com/us/reviews/id30319951","version":"1.562.280","score":3,"title":"Mediocre in most ways","text":"I went with Sonos instead - much better user interface.","updated":"2020-09-16T18:59:16-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7415448264","userName":"workerchimp","userUrl":"https://itunes.apple.com/us/reviews/id24736501","version":"1.583.490","score":1,"title":"Nothing works!","text":"Cannot get my HEOS5 speaker to link, cannot get my SiriusXM to link; they make it seem like it just plugs in and plays, but you need to be as moronically complicated as the coders that put this piece of garbage together!! Ever hear of field trials before releasing software!??","updated":"2021-06-01T15:36:41-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7410569579","userName":"Millertimehero","userUrl":"https://itunes.apple.com/us/reviews/id106004645","version":"1.583.490","score":1,"title":"Problems with Adding Devices/Speakers","text":"This setup has to be adjust from time to time which means i have to re-add the speakers and this always take hours and you never know you fixed the problem.","updated":"2021-05-31T10:23:02-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4732721376","userName":"Laukins","userUrl":"https://itunes.apple.com/us/reviews/id270889978","version":"1.520.140","score":4,"title":"Good not great","text":"The app isn’t as bad as reviewed but figuring out how to symch takes several attempts. But once up and running, the music pleasure unfolds! Great speakers, very versatile for a outdoor party.","updated":"2019-09-05T17:30:28-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7196745846","userName":"canidrinkyouabuy","userUrl":"https://itunes.apple.com/us/reviews/id137052974","version":"1.583.490","score":1,"title":"Wish it worked","text":"Pretty much malfunctions every time I use it. It seems to have a knack for knowing a song I like and half way thru it suddenly skips a few songs and gives an error message.","updated":"2021-04-07T20:48:48-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4652471746","userName":"Linvale115","userUrl":"https://itunes.apple.com/us/reviews/id660414909","version":"1.520.140","score":5,"title":"At last","text":"Seamless update. Now my  HS1 devices are found by Alexa and work!  \n\nI have a system with over 16 players and at last they all work with voice control 😊\n\nNot sure why this isn’t emphasized in the release notes but it makes the investment so much more worthwhile.\n\n...","updated":"2019-08-21T18:56:59-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2627750022","userName":"Bls20170","userUrl":"https://itunes.apple.com/us/reviews/id23166834","version":"1.454.230","score":5,"title":"Soooo easy!","text":"I love how I can connect to our family room, game room, or lanai speakers and stream through HEOS. Super easy to use!","updated":"2018-06-01T10:57:33-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2143210913","userName":"McMike315","userUrl":"https://itunes.apple.com/us/reviews/id280832841","version":"1.430.180","score":1,"title":"Constantly crashing app","text":"App crashes about 50% of the time. Once it opens it’s pretty user friendly and easy to navigate. Not sure why I thought this would work well when Denon’s AVR app is also pretty poor. \n\nCome on Denon...just fix your apps so I don’t have to sell and go with Sonos.","updated":"2018-01-29T16:46:39-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7538990800","userName":"PatientWolf","userUrl":"https://itunes.apple.com/us/reviews/id116163789","version":"1.583.490","score":1,"title":"Terrible support and much to complex connection for Denon","text":"After not using for a few weeks I found that it lost connection to my Denon AVR. There are no clear instructions on reconnection. I tried deleting and reinstalling the app and now it is like a brick.","updated":"2021-07-04T10:07:26-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5717578924","userName":"Linkmiester","userUrl":"https://itunes.apple.com/us/reviews/id39136052","version":"1.544.240","score":5,"title":"Great App","text":"Works flawlessly with Denon 4500 avr\nLots of music to select and well integrated with new iPhones.","updated":"2020-03-26T12:32:14-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3327815274","userName":"bearcatfan3","userUrl":"https://itunes.apple.com/us/reviews/id103630061","version":"1.466.240","score":4,"title":"Confusing","text":"This app while the functionality is great but its confusing","updated":"2018-10-21T09:51:47-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3805998525","userName":"mark3119","userUrl":"https://itunes.apple.com/us/reviews/id31677254","version":"1.493.170","score":1,"title":"Unstable garbage.","text":"It’s really a shame as the speakers have excellent sound quality (I have 5x Heos7) but the app is terribly unstable, requires frequent re-booting and often has grouping errors. I’m using a very strong WiFi network in the home and all components are in the same room. Save your investment of time and money.","updated":"2019-02-23T10:42:26-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3279641999","userName":"Sd411","userUrl":"https://itunes.apple.com/us/reviews/id31382973","version":"1.466.240","score":1,"title":"Terrible instructions","text":"I just bought the HEOS 7 and a Denon AVR. I was told the HEOS could be linked to the Denon receiver to use as a surround speaker.  After 3 days of searching the Denon and HEOS websites, looking at every FAQ I could find and trying all the settings I give up.  I would not recommend the HEOS speaker or Denon receiver after this experience.","updated":"2018-10-08T16:36:13-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7857794935","userName":"comeoneyeahhaaaaa","userUrl":"https://itunes.apple.com/us/reviews/id33446361","version":"1.583.490","score":3,"title":"Needs a massive improvement to iTunes","text":"Fix your interface with iTunes!","updated":"2021-09-29T05:16:58-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7287163816","userName":"arkphi","userUrl":"https://itunes.apple.com/us/reviews/id169353933","version":"1.583.490","score":3,"title":"Clunky compared to Sonos","text":"I’ve had this system for years. The speakers are great, but the app connectivity is challenging. Constant reconnecting and speaker outages. Three stars","updated":"2021-05-01T18:30:23-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7241832523","userName":"Desert AV Nut","userUrl":"https://itunes.apple.com/us/reviews/id410009944","version":"1.583.490","score":5,"title":"Flawless for me!","text":"Love it. Never had even a single hiccup with it!","updated":"2021-04-19T18:36:32-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6638700020","userName":"fucharlie","userUrl":"https://itunes.apple.com/us/reviews/id626538523","version":"1.583.161","score":5,"title":"Enjoying HEOS","text":"I love running my Sirius XM through my receiver. It is quick and easy to use.","updated":"2020-11-12T17:30:52-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3583102789","userName":"Happyface: )","userUrl":"https://itunes.apple.com/us/reviews/id107445625","version":"1.481.160","score":1,"title":"Horrible","text":"This app is so horrible! It makes me feel that they designed it to be difficult for the users. Songs jump everywhere. Shuffle is a hassle. Goes back and forth... doesn’t support Apple Music in my phone. Considering returning my HEOS 7 speaker. Huge disappointment.","updated":"2018-12-28T02:07:54-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3049342980","userName":"audipilot1","userUrl":"https://itunes.apple.com/us/reviews/id119919730","version":"1.466.200","score":5,"title":"Master Volume Control is Back!","text":"Thanks for fixing the only thing that made the app unenjoyable.  Awesome app, awesome sound equipment!","updated":"2018-08-11T04:25:58-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5735748833","userName":"Mike11981","userUrl":"https://itunes.apple.com/us/reviews/id101687438","version":"1.544.240","score":1,"title":"Terrible app","text":"This app is so bad it makes me regret buying Denon. For my $1100 Denon 3600 receiver, I have an app that is a total failure. I can’t reliably get speakers to work in the zones the app shows are on. I have to toggle them on and off and hope it eventually works. Fail, Denon!","updated":"2020-03-30T06:27:13-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5713698832","userName":"Toddvickimelkel","userUrl":"https://itunes.apple.com/us/reviews/id390253396","version":"1.544.240","score":2,"title":"Heos Problems","text":"My HEOS software has been working fine for 11 months and suddenly it will not stay connected to Marantz AVR’s. Every few days I have to reconnect to both AVR’s.  Anyone have any suggestions?","updated":"2020-03-25T18:12:23-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5493436223","userName":"Ac9969","userUrl":"https://itunes.apple.com/us/reviews/id158061357","version":"1.544.150","score":3,"title":"I wouldn’t recommend.","text":"Very sensitive. Have to be on the same WiFi and even then it’s a hit or miss if the app works.","updated":"2020-02-05T19:37:13-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"1794923328","userName":"Catticornicopia","userUrl":"https://itunes.apple.com/us/reviews/id374208597","version":"1.421.150","score":1,"title":"Mandatory but terrible!","text":"The HEOS app is the only way to access most streaming media via Marantz and Denon systems, but OMG is it dreadful!  Can't choose to shuffle at obvious points, can't add the favorites you'd expect, and playback stops without any clear reason why.\n\nIt's nice to have something, but really this shouldn't be it.","updated":"2017-09-17T10:47:36-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6323962040","userName":"Ww34L","userUrl":"https://itunes.apple.com/us/reviews/id259473457","version":"1.562.280","score":1,"title":"Connectivity","text":"Super glitchy. Sometimes it finds devices sometimes it doesn’t and the sometimes it finds one or two devices but not the others. Very frustrating!","updated":"2020-08-15T16:26:52-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5634484356","userName":"Terminabitor","userUrl":"https://itunes.apple.com/us/reviews/id37232308","version":"1.544.150","score":1,"title":"Horrible","text":"This app is the worse I ever used.\nIt’s a pain to connect Alexa to other speakers etc..\nWon’t buy Denon Amplifier again because of that..\nThey say Alexa compatible but than items only from this app and this app is terrible...","updated":"2020-03-08T15:41:16-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4837857241","userName":"Budhrani","userUrl":"https://itunes.apple.com/us/reviews/id17413401","version":"1.520.200","score":2,"title":"New iOS issues","text":"Loved the app until I upgraded my phone to iOS 13.1.  None of my devices will connect.  I’ve tried several work arounds, but continue to sit in silence in my home. Please help!","updated":"2019-09-25T16:15:42-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3149329292","userName":"finnsref","userUrl":"https://itunes.apple.com/us/reviews/id276565582","version":"1.466.200","score":1,"title":"Won’t stay open","text":"I just download the app and I’m try to connect it to the new receiver I purchased.  The only problem is the app won’t stay open long enough to do anything.  It keeps shutting down.  I have already deleted it and reloaded it.","updated":"2018-09-03T10:07:20-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"1797452112","userName":"JHiportland","userUrl":"https://itunes.apple.com/us/reviews/id34795992","version":"1.421.150","score":1,"title":"Had for 3 years these last two updates terrible.","text":"I have loved using Denon And the speaker sound great. But the app is gotten worse every version they put out. I think they're trying to get rid of this system. Do not buy!  Is there a third party app? Please?","updated":"2017-09-18T20:10:20-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5980880538","userName":"yuleetide","userUrl":"https://itunes.apple.com/us/reviews/id1171681298","version":"1.544.240","score":2,"title":"Ehh","text":"When it’s works it’s ok\nMostly doesn’t work or consistently \nHad for 5 yrs no improvement \nYamaha works better  every way\nMarantz needs to listen to customers","updated":"2020-05-22T15:04:32-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3519980471","userName":"DtmpowerM5","userUrl":"https://itunes.apple.com/us/reviews/id42674692","version":"1.481.130","score":1,"title":"Account?","text":"Why do I have to use this app to create a HEOS account? It doesn’t even let me get to settings without setting up a new speaker. I don’t have HEOS speakers. I just want Alexa control for my Marantz. Why does this app have to be so bad? Look at all the bad reviews and do something about it!!","updated":"2018-12-11T10:57:32-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3371890287","userName":"Killian, Ph.D.","userUrl":"https://itunes.apple.com/us/reviews/id223795044","version":"1.481.130","score":5,"title":"We love our HEOS speakers","text":"We love our HEOS speakers which seemlessly integrates with my surroundsound system. The speakers are a significant improvement with the last system we had which was over 15 years ago. Currently there are a number of systems available but both my wife and I agreed along with the manager that this would be the better system and sound to go with if I We wanted to add something wireless that could be moved around. Most everything in the 5,000 square foot house is wired. There are places we can not get to wire, the 180 foot dock, the second floor, around the pool, etc. There is no way that I or others can tell that the system is wireless. Patients will sometimes come to the house and they even have recognize the improvement in the waiting room over the older system. My wife and I have been so pleased we are going to get additional speakers. I do not know why some of these individuals have been so unhappy, my entire system with the 75 inch Sony TV was extremely expensive. The HEOS are the least expensive items and have given us the greatest joy for what they accomplish and what we paid. It took my wife and myself awhile to understand the app we are 68, but computer sophisticated as it integrated with the rest of the systems. We wish there were simple online instructions. Having the music shut off is not a big issue for us at all. Our system also never fails and is always integrated with the surroundsound amplifier. We strongly recommend the HEOS system over all the other options. We have now had the system for two years and there hasn’t been a problem. Thank you so much he HEOS for beating the competition.","updated":"2018-11-02T04:10:26-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2033637046","userName":"Beautybuster","userUrl":"https://itunes.apple.com/us/reviews/id166632825","version":"1.430.180","score":1,"title":"Worst ever.","text":"I purchased the heos speaker a year ago and really thought I wasn't working the app properly. It wasn't cheap! $500+. Then I got a sonos for another room and it's so easy to navigate and sounds beautiful through out the whole house. What a waste of$500. I will now stick to Sonos speakers.","updated":"2017-12-27T18:22:53-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5344838546","userName":"n rye","userUrl":"https://itunes.apple.com/us/reviews/id263802575","version":"1.520.320","score":3,"title":"It’s great when working properly","text":"Sometimes the program disconnects","updated":"2019-12-31T17:52:58-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4438878533","userName":"barballen9","userUrl":"https://itunes.apple.com/us/reviews/id158445138","version":"1.505.130","score":1,"title":"Terrible!!","text":"He disconnects all the time. And then you have to pull your Marantz amplifier out of the holder that’s in in your complete stereo wall and it’s a huge pain in the neck and then you can’t even find a hole to stick it into it’s just a horrible horrible system. Get Sonos","updated":"2019-07-10T08:49:51-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4029803501","userName":"TomasofWarsaw","userUrl":"https://itunes.apple.com/us/reviews/id27177456","version":"1.505.130","score":1,"title":"No sleep timer:-(","text":"Dear Development team, this is basic feature, and very important in day to day use of a music system - please at least integrate IOS function. It is really sad looking that such a good product has such an under developed app:-(","updated":"2019-04-18T14:27:49-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5985086211","userName":"Chicago6932054","userUrl":"https://itunes.apple.com/us/reviews/id296660855","version":"1.544.240","score":4,"title":"Works fine","text":"Works fine","updated":"2020-05-23T13:55:51-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5762804685","userName":"Carpenter Carl","userUrl":"https://itunes.apple.com/us/reviews/id386777470","version":"1.544.240","score":4,"title":"Enjoy it!","text":"I really like the way that the song are grouped by genre. They do a good job with that!","updated":"2020-04-04T12:53:48-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5664550172","userName":"Henry Sewell","userUrl":"https://itunes.apple.com/us/reviews/id40535205","version":"1.544.240","score":1,"title":"Stopped working","text":"This suddenly would not let access streaming sites this am.   Now it will not let me log back in.   No guidance on the web site.   They need to fix this ASAP","updated":"2020-03-15T08:30:16-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5508967838","userName":"kibling","userUrl":"https://itunes.apple.com/us/reviews/id335955253","version":"1.544.150","score":2,"title":"Challenges since day 1. Would not buy again","text":"Would not buy again","updated":"2020-02-09T08:28:50-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4467441719","userName":"KrisCo34321","userUrl":"https://itunes.apple.com/us/reviews/id138185541","version":"1.505.130","score":1,"title":"AVRX6500H Streaming interruption","text":"On a service like Sirius XM the stream will stop and I must exit HEOS and return to start streaming again.  This is unacceptable even if there is an internet interruption undetectable by all other devices.  The software should be smart enough to resume the stream. Ridiculous!","updated":"2019-07-15T17:07:31-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3944582799","userName":"WendysFrostyCarlos","userUrl":"https://itunes.apple.com/us/reviews/id8554845","version":"1.493.170","score":5,"title":"The HEOS app works like a charm!","text":"Follow the instructions provided and everything works like it should.","updated":"2019-03-29T21:21:51-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2941456504","userName":"Bellorusha","userUrl":"https://itunes.apple.com/us/reviews/id42424956","version":"1.454.280","score":5,"title":"All fixed.","text":"Good job. Finally volume is fixed","updated":"2018-07-20T16:12:00-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7816023867","userName":"Timberscotch","userUrl":"https://itunes.apple.com/us/reviews/id213896997","version":"1.583.490","score":1,"title":"Bad","text":"Heos just stops communicating every couple days.  Amp is wired to network.  No error, no nothing, have to do a restart every couple days.  Please fix this app, Marantz has a status rating that is declining due to this app.","updated":"2021-09-17T09:10:39-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5673387339","userName":"MAF iOS","userUrl":"https://itunes.apple.com/us/reviews/id1145300557","version":"1.544.240","score":1,"title":"Latest update broke device grouping","text":"Grouping HEOS devices allows them all to play the same thing. The latest update ungrouped all of my rooms and any attempt to regroup them with the Marantz SR-7011 results in a “Rooms could not be grouped” error.","updated":"2020-03-17T08:58:26-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2804646436","userName":"butc0023","userUrl":"https://itunes.apple.com/us/reviews/id575353462","version":"1.454.230","score":1,"title":"Terrible app","text":"Agree with others that this app is horrendous. Difficult to pair devices, and once you do it randomly stops working and you have to repair. Would not have purchased Denon speakers had I know how terrible this product would be.","updated":"2018-06-30T07:10:31-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"1926651611","userName":"Dennis 215","userUrl":"https://itunes.apple.com/us/reviews/id31537614","version":"1.421.150","score":1,"title":"Don’t even bother","text":"This is the worst app in the history of apps. For an app to control an amp with only a volume control this is so lacking it is laughable. Yes there are a bass and treble slider but that’s about it. You can change inputs but try renaming them. No room eq sweep? Or even a power toggle. I sent my HEOS AVR and speakers back.","updated":"2017-11-16T20:03:54-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8120487936","userName":"dl-reviews","userUrl":"https://itunes.apple.com/us/reviews/id245958421","version":"2.1.680","score":1,"title":"Will not connect to wifi","text":"Loved this app when it worked. Unfortunately it will no longer connect to our wifi. Very sad.","updated":"2021-12-11T17:29:08-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7899566155","userName":"Stop spam calls","userUrl":"https://itunes.apple.com/us/reviews/id656919904","version":"2.1.561","score":1,"title":"App is crap","text":"The audio hardware produces some of the best sound that I’ve ever heard. \nThe app constantly crashes and you’re lucky to hear two songs in a row from an album. \nBy somebody else’s system; not Heos.","updated":"2021-10-10T08:55:13-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7461694939","userName":"sohyco","userUrl":"https://itunes.apple.com/us/reviews/id28379467","version":"1.583.490","score":2,"title":"Stability issues","text":"Seems to crash or not even connect a lot.","updated":"2021-06-13T16:19:50-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5693285425","userName":"Rt128","userUrl":"https://itunes.apple.com/us/reviews/id39519614","version":"1.544.240","score":1,"title":"This app ruins HEOS products","text":"This app is terrible - it crashes the heos system all the time seemingly randomly and after a year has not gotten any better. This ruins the whole heos product experience and demon should be ashamed.","updated":"2020-03-21T12:51:45-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8062247963","userName":"No to Heos","userUrl":"https://itunes.apple.com/us/reviews/id104114378","version":"2.1.680","score":1,"title":"Buggy extremely frustrating.","text":"Devices are quality but software is so bad it defies description.  One star only because no lower score","updated":"2021-11-25T09:06:15-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7882405930","userName":"Cmmiles","userUrl":"https://itunes.apple.com/us/reviews/id222496000","version":"2.1.561","score":5,"title":"Works Great. As it should","text":"The latest update is slick. Love using using my Denon AVR.","updated":"2021-10-05T16:24:04-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5934101384","userName":"485Gman","userUrl":"https://itunes.apple.com/us/reviews/id400527741","version":"1.544.240","score":2,"title":"App keeps loosing connection","text":"App keeps loosing connection and have to constantly keep manually reconnecting it. Very poor especially for a $2000 system!","updated":"2020-05-11T20:10:26-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8109649266","userName":"Bdjskofhzhxhz","userUrl":"https://itunes.apple.com/us/reviews/id555512887","version":"2.1.680","score":4,"title":"Works great","text":"But app seems to interfere with incoming phone calls.","updated":"2021-12-08T16:02:22-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5633958559","userName":"Mik Reklaw","userUrl":"https://itunes.apple.com/us/reviews/id184458384","version":"1.544.150","score":3,"title":"When it works . . .","text":"When it works, it’s great. Sometimes it fails to load.","updated":"2020-03-08T12:14:53-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4310922166","userName":"Lib25geo","userUrl":"https://itunes.apple.com/us/reviews/id274123134","version":"1.505.130","score":2,"title":"App updates awful","text":"When it works it’s great, but with every update I have to set the thing up again.  Why, I haven’t had to do that for five years on other apps!","updated":"2019-06-13T12:56:47-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2509655338","userName":"Love2RunNBike","userUrl":"https://itunes.apple.com/us/reviews/id37998714","version":"1.442.220","score":1,"title":"Sound quality great; app not. Consider Sonos.","text":"Sound quality is good. App is hard to navigate - they need clearer bottom row icons for what does what.  I like the sound quality and range of speakers better than Sonos but if Denon doesn’t figure out the app I may trade my stuff in.","updated":"2018-05-05T16:41:06-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"1940885341","userName":"Meli Mel Mel","userUrl":"https://itunes.apple.com/us/reviews/id265826080","version":"1.430.160","score":1,"title":"App Keeps Crashing","text":"The app will not stay open and continues to crash and close out. Unable to play music or load up the speakers on the app. I believe with the recent software update, it doesn’t seem to be compatible with the HEOS app. Please update.","updated":"2017-11-22T12:05:43-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8044417570","userName":"Boomer8965","userUrl":"https://itunes.apple.com/us/reviews/id30362579","version":"2.1.680","score":4,"title":"Nicely designed but…","text":"It takes a awhile to learn its ins and outs.","updated":"2021-11-20T07:46:51-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5664906899","userName":"JItri","userUrl":"https://itunes.apple.com/us/reviews/id31440552","version":"1.544.240","score":1,"title":"Latest update broke the app","text":"None of our devices connect or can play music to this $4000+ system after the latest update, fix it!!!","updated":"2020-03-15T10:16:28-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5353963212","userName":"B Spoon","userUrl":"https://itunes.apple.com/us/reviews/id379487008","version":"1.520.320","score":5,"title":"Great App","text":"Multi purpose app for music, podcast, workouts etc.  I love it!","updated":"2020-01-02T21:36:01-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3256107293","userName":"bgvfdty","userUrl":"https://itunes.apple.com/us/reviews/id37008263","version":"1.466.240","score":2,"title":"So so","text":"Always have to reconnect, sometimes it recognizes my devices and sometimes it doesn’t. Overall kind of a pain and frustrating.","updated":"2018-10-02T10:03:26-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2914232121","userName":"GuyDewald","userUrl":"https://itunes.apple.com/us/reviews/id792663933","version":"1.454.280","score":1,"title":"God awful","text":"These are top of the line speakers and very expensive...but the app is so awful that it makes the whole process so infuriating that I can barely stand to even write this review. If I could return these speakers I would avoid at all costs.","updated":"2018-07-15T16:18:06-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2828834518","userName":"extrafurious","userUrl":"https://itunes.apple.com/us/reviews/id168173825","version":"1.454.280","score":1,"title":"Worst app ever","text":"After fighting with this app for over a year, I am so close to throwing away everything Denon or HEOS that I own. How can a serious audio manufacturer ignore such fundamental issues with the interface? They aren’t paying attention or simply don’t care.","updated":"2018-07-03T09:16:34-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2288326224","userName":"Studio45Music","userUrl":"https://itunes.apple.com/us/reviews/id42738948","version":"1.442.220","score":1,"title":"Useless","text":"I’m unable to get the app to work anymore, it crashes every time I try to use it, I have yet to be able to stream Apple Music, and I cannot connect to my local Wi-Fi network to stream music from my phone now... useless","updated":"2018-03-09T11:12:14-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"1976503666","userName":"The IdolM@aster","userUrl":"https://itunes.apple.com/us/reviews/id7505841","version":"1.430.160","score":1,"title":"Horrible app-fire the designers!","text":"I just want to enable echo control but to do that i need a heos account. But to get an account i need to use this app. But to get to settings in the app to make an account i have to register a heos device i dont want/need to use with this app. Total crap.","updated":"2017-12-06T20:18:12-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8086989914","userName":"no more nicknames all taken","userUrl":"https://itunes.apple.com/us/reviews/id337995095","version":"2.1.680","score":1,"title":"Volume control is awful.","text":"Going from 0 to 1 might as well be 0 to 7.  Also half the time I turn on the volume jumps to 30 and blares. This system stinks","updated":"2021-12-02T06:00:39-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5268713227","userName":"Mnichols70","userUrl":"https://itunes.apple.com/us/reviews/id21279664","version":"1.520.320","score":1,"title":"Needs Major Redesign","text":"Unfortunately this app looks like it was hacked in just a couple weeks.  Solid apps should begin by defining requirements understand their systems they’re integrating with.  Such a great opportunity lost.","updated":"2019-12-13T11:46:30-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4058564535","userName":"23island","userUrl":"https://itunes.apple.com/us/reviews/id16389662","version":"1.505.130","score":2,"title":"Good speakers with a a clunky app","text":"Love the sound of these speakers, the app is terrible in my opinion. I can’t even skip forward or back when listening to podcasts.","updated":"2019-04-25T07:19:31-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3725740809","userName":"HestiaZ","userUrl":"https://itunes.apple.com/us/reviews/id344074859","version":"1.481.160","score":3,"title":"The worst app","text":"Doesn’t work ok!!!!!\nCan not connect WiFi sometime but have to use the internet cable to connect my router and Heos...\n\nImprove your app and firmware!","updated":"2019-02-02T12:47:46-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2319701223","userName":"Ryan0662","userUrl":"https://itunes.apple.com/us/reviews/id38455482","version":"1.442.220","score":2,"title":"Disappointed","text":"Not easy to use. Doesn’t seem to support Pandora Premium which is extremely annoying. Clunky with two identical Denon HEOS receivers in the house. Expected more from Denon.","updated":"2018-03-18T07:10:08-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"1893075823","userName":"Desperate4thisapp","userUrl":"https://itunes.apple.com/us/reviews/id137168610","version":"1.421.150","score":3,"title":"Airplay Shuffle!","text":"This app is not without its cons!\n\nThe “This Phone” AirPlay music player can’t seem to shuffle past my A-B songs. Fix this!\n\nCan’t search songs in Prime Music!","updated":"2017-11-02T16:39:36-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8122467403","userName":"Fhampsten","userUrl":"https://itunes.apple.com/us/reviews/id23399546","version":"2.1.680","score":3,"title":"Needs Apple","text":"If this could work with Apple Music it would be 5 stars","updated":"2021-12-12T06:21:27-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7898968286","userName":"Cycle2slow","userUrl":"https://itunes.apple.com/us/reviews/id30341775","version":"2.1.561","score":1,"title":"Update is horrible","text":"New update will not play Apple Music from IPhone. Can not join speakers over airplay, absolutely useless. Can not recommend using Denon for wireless speakers if you use an iPhone.","updated":"2021-10-10T05:50:21-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4521939075","userName":"moo moo mooooooooo","userUrl":"https://itunes.apple.com/us/reviews/id561436741","version":"1.505.130","score":1,"title":"can’t connect to apple music","text":"Overall all i’ve had is a bad experience. The device will not connect to apple music which it what I use to listen to music. Would rate zero stars if it was an option.","updated":"2019-07-26T13:54:37-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2708058680","userName":"Catbash","userUrl":"https://itunes.apple.com/us/reviews/id39792353","version":"1.454.230","score":1,"title":"Junk","text":"What a hunk of junk! I did the app update and speaker update! Now I have no the speaker doesn’t work! I can’t even usb in! Denon you would figure that with as much as people pay for your speakers. You would atleast keep a good update and app! Neither here.....","updated":"2018-06-16T15:26:52-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2083159708","userName":"FGDCGroup","userUrl":"https://itunes.apple.com/us/reviews/id19721481","version":"1.430.180","score":3,"title":"Pandora Premium features","text":"Please enhance app so I can play my playlist vs just station from pandora. Should be a simple enhancement.  \n\nThanks.","updated":"2018-01-12T16:32:12-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5250297144","userName":"Maximooooochicago","userUrl":"https://itunes.apple.com/us/reviews/id195432258","version":"1.520.320","score":4,"title":"Almost happy","text":"Why doesn’t work with iTunes????  That’s BS","updated":"2019-12-08T16:31:45-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5250769507","userName":"kcbark1","userUrl":"https://itunes.apple.com/us/reviews/id287095134","version":"1.520.320","score":5,"title":"Sounds great with Klipsch RP 9.2.2 Denon","text":"Easy control.  Seamless to work with.  Auro 3D setting sounds great.","updated":"2019-12-08T19:47:33-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3734254117","userName":"Capitán Ron","userUrl":"https://itunes.apple.com/us/reviews/id35138325","version":"1.481.160","score":2,"title":"Receiver reset","text":"While running this app I have had to reset receiver to get back to other functions. Regular remote doesn’t even work until reset.","updated":"2019-02-04T17:37:03-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2365100047","userName":"Heavy user 59","userUrl":"https://itunes.apple.com/us/reviews/id7386451","version":"1.442.220","score":1,"title":"Worst app and WORST customer (lack of) service","text":"If you have a problem they can arrange a call between Tuesday and Friday during a 4 hour block of time.  Seriously?\n\nApp continuously crashes.  This makes the speakers expensive paper weights.","updated":"2018-03-30T15:20:55-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7948660980","userName":"John__B_B","userUrl":"https://itunes.apple.com/us/reviews/id288290695","version":"2.1.562","score":1,"title":"Doesn’t work with Alexa","text":"Despite the supposed Alexa integration, the app will not work with my Denon AVR-S750. Get “unable to play music” over and over, handing the app and the receiver. \n\nDenon should be ashamed of themselves. You sell a receiver that supposedly works with Alexa and it simply doesn’t. \n\nGet this fixed, because the Alexa integration is useless. \n\nDid any engineer at Denon try this? If you did, why did you release this garbage app?","updated":"2021-10-24T04:45:38-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7402514609","userName":"fnghnjkggjm","userUrl":"https://itunes.apple.com/us/reviews/id643714339","version":"1.583.490","score":1,"title":"Horrible","text":"Never connects. Have to reset the system and each individual system about every week.  Don’t waste your money.","updated":"2021-05-29T07:40:14-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6225583163","userName":"GaiaLight","userUrl":"https://itunes.apple.com/us/reviews/id26795049","version":"1.562.200","score":2,"title":"Not intuitive.","text":"Frustrating.","updated":"2020-07-21T15:16:41-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3736273129","userName":"WhatBart","userUrl":"https://itunes.apple.com/us/reviews/id230803085","version":"1.481.160","score":2,"title":"Unresponsive","text":"This app is awful.  It gets stuck in any programming routine that is required.  I have had to delete and reload multiple times.  Demon needs to redo this pile of junk.","updated":"2019-02-05T06:50:52-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3596626375","userName":"JaceMace","userUrl":"https://itunes.apple.com/us/reviews/id157154220","version":"1.481.160","score":1,"title":"Always losing connection","text":"I’m not sure I can add more to what others have already said. The app continues to lose connection with my receiver no matter how far or close I am to it. It’s very spotty. This app needs to be updated.","updated":"2018-12-31T10:58:40-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5580309663","userName":"mrls2787","userUrl":"https://itunes.apple.com/us/reviews/id1138216293","version":"1.544.150","score":1,"title":"Not working","text":"I been trying to make it work but it’s stock on Pandora on 1 station and it’s not even playing anything can somebody help me to fix this thanks","updated":"2020-02-25T15:33:23-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5477036002","userName":"Azchdlr","userUrl":"https://itunes.apple.com/us/reviews/id46107737","version":"1.544.150","score":5,"title":"Love it","text":"Easy and convenient","updated":"2020-02-01T20:00:28-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5074988908","userName":"thyfudubdh","userUrl":"https://itunes.apple.com/us/reviews/id123893560","version":"1.520.200","score":1,"title":"Upgrade now","text":"Honestly one of the worst apps I’ve ever used. How is is it not possible to control your WiFi connection through the app?  Fix please, this is ridicules.","updated":"2019-11-02T17:40:40-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8134674414","userName":"Juwce","userUrl":"https://itunes.apple.com/us/reviews/id100579898","version":"2.1.680","score":3,"title":"Randomly logs me out","text":"Randomly freezes and logs me out of all my accounts","updated":"2021-12-15T19:22:43-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6472547215","userName":"Tigerdizzy","userUrl":"https://itunes.apple.com/us/reviews/id102046319","version":"1.562.280","score":2,"title":"App keeps crashing. iPhone 11.","text":"Can’t keep the app open for more than a couple min. Also, doesn’t support Apple Music.","updated":"2020-09-26T19:02:03-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3741742476","userName":"Gilforeman","userUrl":"https://itunes.apple.com/us/reviews/id132758812","version":"1.493.170","score":3,"title":"Alarm clock feature","text":"Surely adding an alarm clock feature and sleep timer isn't a stretch. Please do so.","updated":"2019-02-06T20:11:33-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2023533633","userName":"BDSouthAustin","userUrl":"https://itunes.apple.com/us/reviews/id483917390","version":"1.430.180","score":2,"title":"New Version Crashes","text":"It appears after the latest update, I can’t even get the ap to load. It just crashes. Very frustrating! Great speaker, garbage ap.","updated":"2017-12-24T06:47:25-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3026978008","userName":"MUVWUN","userUrl":"https://itunes.apple.com/us/reviews/id181582401","version":"1.454.280","score":1,"title":"Constant crashing","text":"Software constantly crashing in iOS, it’s unusable!\n\nAlso, how can I have no network connection in my Matantz receiver but the connection diagnostic says connection OK\n\nThe hardware sounds great but the software is regrettably terrible.","updated":"2018-08-06T12:02:01-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"1868032327","userName":"Kali1906","userUrl":"https://itunes.apple.com/us/reviews/id121201944","version":"1.421.150","score":2,"title":"Not good","text":"The app is good when working... which is not often. Crashes frequently and may not start at all at times. Do better Denon.","updated":"2017-10-22T18:44:13-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7573044988","userName":"SA7700","userUrl":"https://itunes.apple.com/us/reviews/id149823008","version":"1.583.490","score":1,"title":"Amazed","text":"Amazed and confused how this equipment and app get such good reviews. My finding is that this app and heos speakers are unreliable at best. Continually disconnects and is spotty.  EVERY other electronic app and elec. devise in the house works as advertised accept these.  Lots of disappointment with Heos.","updated":"2021-07-13T14:05:26-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7051437000","userName":"feverish","userUrl":"https://itunes.apple.com/us/reviews/id28772518","version":"1.583.490","score":1,"title":"Doesn’t work with Denon AVR receiver","text":"New receiver, upon set up, all the app says to do is read the manual, which only tells you to download the app and follow the setup instructions. Huge disappointment.","updated":"2021-02-28T21:14:27-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3956348497","userName":"miss-u-heos","userUrl":"https://itunes.apple.com/us/reviews/id997851495","version":"1.493.170","score":1,"title":"No longer works with my Denon AVR4300","text":"Used to work and I loved it. This latest version no longer finds my Denon AVR4300.  Doesn’t even go into a searching mode. Please release a version that still supports my device.","updated":"2019-04-01T09:26:50-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3829741980","userName":"Catamount1980","userUrl":"https://itunes.apple.com/us/reviews/id31262770","version":"1.493.170","score":1,"title":"The App blows","text":"The speakers are awesome but are difficult to pair - and won’t with iTunes- so the most popular phone and music are not available to play unless you buy them and then play. \n\nThanks to blue tooth they are used 24-7","updated":"2019-03-01T13:30:20-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3213440559","userName":"Matt987654321hdjddjxdbd","userUrl":"https://itunes.apple.com/us/reviews/id240128542","version":"1.466.240","score":1,"title":"Crash","text":"The latest version crashes every time I use it.  I even deleted it and downloaded it again and I can’t make it past the setup now button press.  Do they have any QA at all?","updated":"2018-09-21T05:25:17-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2264261988","userName":"Red bull racing #1","userUrl":"https://itunes.apple.com/us/reviews/id287870996","version":"1.442.220","score":1,"title":"No Marantz support","text":"Used to work with my 2k Marantz av receiver but not anymore. Asking me to connect a cable from my iPad to the back of my heos device.  Really it’s 1983 all of a sudden?! can’t set this up over Wi-Fi? Was gonna get the heos amp for my speakers in the kitchen but not anymore","updated":"2018-03-02T15:16:32-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8039801507","userName":"DrSchuster","userUrl":"https://itunes.apple.com/us/reviews/id31255408","version":"2.1.680","score":1,"title":"Won’t play music","text":"It had issues before the last update but now I can’t get it to play at all","updated":"2021-11-19T02:29:00-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5629828379","userName":"Gftfhtfut","userUrl":"https://itunes.apple.com/us/reviews/id142122374","version":"1.544.150","score":1,"title":"HEOS app just awful","text":"Always an issue pairing speakers, difficult to understand, can’t select speakers by room - why?  Such a shame as the sound is amazing and they look great.  Come on Denon?  Really?","updated":"2020-03-07T12:52:09-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6869413805","userName":"iizaman","userUrl":"https://itunes.apple.com/us/reviews/id1236026013","version":"1.583.161","score":4,"title":"Simple and easy but needs some more features","text":"I miss the deezer hi fi here. My deezer subscription is HI FI but I cannot stream in hi fi in HEOS.","updated":"2021-01-14T08:49:07-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3838665270","userName":"Me12345679090909","userUrl":"https://itunes.apple.com/us/reviews/id362342092","version":"1.493.170","score":1,"title":"Does not support Apple Music","text":"This app is worthless because it doesn’t support Apple Music. Everything is DRM protected, therefore you can’t play it on this app. How stupid! I buy a Denon 9.2 surround system, but I can’t listen to music on it? Brilliant!","updated":"2019-03-03T11:44:48-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2863252450","userName":"A user9876","userUrl":"https://itunes.apple.com/us/reviews/id154099264","version":"1.454.280","score":1,"title":"Get the basics right","text":"Loses password; loses default music; non intuitive way to pick another pandora station; no real integration with Alexa. makes me question Denon quality in general. Seems like the hired a middle school kid to write the UI.","updated":"2018-07-08T04:19:19-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"1899603884","userName":"Msok88","userUrl":"https://itunes.apple.com/us/reviews/id167031008","version":"1.421.150","score":1,"title":"Nothing but issues with their own products.","text":"Random disconnects, bugs and weird glitches. Buy a $2000 receiver and their overpriced speakers to have access to their terrible knowledge in their HEOS department customer service and horrendous products.","updated":"2017-11-05T08:49:17-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6949552974","userName":"VaDuckHunter","userUrl":"https://itunes.apple.com/us/reviews/id542221152","version":"1.583.431","score":4,"title":"Nice App but...","text":"It would be nice to have Apple Music as one of the services.","updated":"2021-02-03T09:52:23-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2626875765","userName":"Dogs911","userUrl":"https://itunes.apple.com/us/reviews/id34565620","version":"1.454.230","score":1,"title":"Terrible update","text":"I can not even get the app to open anymore. I’ve rebooted my phone, uninstalled and reinstalled the app and it still crashes when I try to open it. Please fix.","updated":"2018-06-01T06:48:00-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2094983352","userName":"Ggbcuatl","userUrl":"https://itunes.apple.com/us/reviews/id216654210","version":"1.430.180","score":1,"title":"Bad","text":"I bought a new receiver for my 4K tv and it claims to have HEOS functionality but when I open the app it says plug your phone into the aux in Jack on the receiver with the included audio cable. There is no aux in jack or included audio cable","updated":"2018-01-16T06:51:03-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7875489710","userName":"Only The Best Alternative","userUrl":"https://itunes.apple.com/us/reviews/id38736220","version":"2.1.561","score":1,"title":"Awful upgrade nothing works","text":"Nee v version doesn’t work. Music stops and starts and then you can’t play anything \n\nTerrible upgrade","updated":"2021-10-03T21:27:29-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2103016738","userName":"86camman85","userUrl":"https://itunes.apple.com/us/reviews/id553643151","version":"1.430.180","score":5,"title":"I love HEOS!","text":"I love HEOS! I’ve Always been a fan of Denon. I’m using a HEOS 4 ch super amp  to drive 8 speakers and the sound quality is unreal!","updated":"2018-01-18T18:32:20-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7237338200","userName":"trilife","userUrl":"https://itunes.apple.com/us/reviews/id39329001","version":"1.583.490","score":2,"title":"Spotty and inconsistent","text":"Unfortunately I committed to a Denon/Heos environment at home and now I’m stuck with this spotty app which works less often than not.","updated":"2021-04-18T12:02:23-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6986224589","userName":"JPC81","userUrl":"https://itunes.apple.com/us/reviews/id20006952","version":"1.583.431","score":1,"title":"Garbage","text":"This software is complete garbage don’t let the rating fool you. Check out Redit for a more accurate review of this app. I have 5 HEOS speakers and 98% of the time there is an issue with the software.","updated":"2021-02-12T10:22:56-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8053142901","userName":"Trout-Bum","userUrl":"https://itunes.apple.com/us/reviews/id630111351","version":"2.1.680","score":1,"title":"Poor User Interface","text":"I might not be the most tech savvy person in the world, but the Denon user interface might be the poorest piece of software I’ve ever used.","updated":"2021-11-22T18:09:39-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5237578273","userName":"MauiSBS","userUrl":"https://itunes.apple.com/us/reviews/id8385431","version":"1.520.320","score":4,"title":"Excellent & reliable BUT...","text":"Need more music streamer interfaces like Slacker + others!","updated":"2019-12-05T13:19:23-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5664287439","userName":"Musry","userUrl":"https://itunes.apple.com/us/reviews/id43253535","version":"1.544.240","score":2,"title":"Great idea. Terrible execution.","text":"This is the most unreliable app I have ever dealt with.  So sad to have so much invested with Denon. Speakers and sound are great when they work","updated":"2020-03-15T07:16:53-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5569923304","userName":"crewdegrass","userUrl":"https://itunes.apple.com/us/reviews/id35349420","version":"1.544.150","score":2,"title":"Great sound, poor network/app","text":"These speakers are terrific but regularly are balky on the app.  I have to re-pair, cajole and work to get them to simply work.","updated":"2020-02-23T05:07:06-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4185499078","userName":"rafa1953","userUrl":"https://itunes.apple.com/us/reviews/id284449250","version":"1.505.130","score":5,"title":"Apple Music","text":"You would get 5 Stars if Apple Music Dub","updated":"2019-05-21T03:58:14-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3601121416","userName":"joeltide","userUrl":"https://itunes.apple.com/us/reviews/id40421752","version":"1.481.160","score":1,"title":"Nothing but trouble","text":"I've had problems with the app ever since I got my Denon receiver. It can't find my receiver and I have to either restart the app or reconnect everything to the Wi-Fi. Extremely disappointing.","updated":"2019-01-01T15:39:49-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2993823916","userName":"Bobby_Todd","userUrl":"https://itunes.apple.com/us/reviews/id473769908","version":"1.454.280","score":1,"title":"Would give Zero stars if able!","text":"Crashes ALL the time, updates do not remedy. Interface is cumbersome, and overall this app is useless.  Love my sound bar, but this app is complete garbage!","updated":"2018-07-30T17:41:41-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5742484980","userName":"ImobstersAddme","userUrl":"https://itunes.apple.com/us/reviews/id116921808","version":"1.544.240","score":2,"title":"Has lots of problems","text":"Always stops play ... has problems a lot .... make listing not very fun .....","updated":"2020-03-31T13:16:40-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3917543331","userName":"tokjojjen","userUrl":"https://itunes.apple.com/us/reviews/id393745537","version":"1.493.170","score":1,"title":"Great speakers - terrible app...","text":"Love the speakers, but been close many times to toss them in the trash because of the sad app that’s supposed to run them. On a weekly basis I have to spend hours trying to reconnect the app and speakers...","updated":"2019-03-23T11:28:57-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2384034240","userName":"Wmdavidson96","userUrl":"https://itunes.apple.com/us/reviews/id271522752","version":"1.442.220","score":1,"title":"App crashes constantly","text":"Sadly, I can’t use my speakers without this App.  Often, like right now, you will click on the app and it will crash.  Time after time after time.\n\nRarely does the app work.\n\nI’ve tried everything from re-downloading it to closing it out completely, powering off my speakers, turning my phone off and back on...it’s crazy.\n\nSuch a disappointment.","updated":"2018-04-04T13:42:19-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5513183679","userName":"hateheos","userUrl":"https://itunes.apple.com/us/reviews/id548333706","version":"1.544.150","score":1,"title":"Terrible","text":"The worst av product \nCuts out \nUnreliable user interface is horrible \nSetting zones is tedious and can’t move the original room selected","updated":"2020-02-10T07:20:30-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6436700426","userName":"Hb2002","userUrl":"https://itunes.apple.com/us/reviews/id238299998","version":"1.562.280","score":4,"title":"Heos","text":"Works great after you get the hang of it.  Great High-Rez quality.","updated":"2020-09-16T18:00:32-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3712883798","userName":"jp hates heos","userUrl":"https://itunes.apple.com/us/reviews/id226228471","version":"1.481.160","score":1,"title":"Worst","text":"This app is horrible. Songs jump around in the middle of playing. Takes forever to connect. Get your act together heos! Your product connectivity is crap!","updated":"2019-01-30T07:05:29-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3393544893","userName":"thebarb00","userUrl":"https://itunes.apple.com/us/reviews/id731519639","version":"1.481.130","score":1,"title":"Cannot find receiver","text":"Receiver is connected to the network, able to stream via Denon remote, yet the app can’t find the receiver. It worked beautifully until today.","updated":"2018-11-07T22:15:37-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2556101378","userName":"War Buff","userUrl":"https://itunes.apple.com/us/reviews/id26270362","version":"1.442.220","score":1,"title":"Can give it 1/2 star?","text":"App works fine AS LONG AS I AM STREAMING FROM A DIFFERENT DEVICE?!!!?   It crashes every time if I stream pandora from this phone and then try to adjust the volume with HEOS.  I guess this why every one loves sonos.  That is my next investment.","updated":"2018-05-16T12:03:43-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2342200735","userName":"jeffrup","userUrl":"https://itunes.apple.com/us/reviews/id268728166","version":"1.442.220","score":1,"title":"Disappointing","text":"My speaker sounds great when I can get music to come out of it. I’m constantly having to power off/on or re-booting. Very expensive system and so unreliable.  I’m going to Sonos.","updated":"2018-03-24T12:08:54-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7874891693","userName":"ctoast","userUrl":"https://itunes.apple.com/us/reviews/id26360742","version":"2.1.561","score":1,"title":"problematic","text":"good when it works. frustrating when it doesnt. new version doesn’t function at all with my Marantz AVR.","updated":"2021-10-03T17:15:25-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7168565553","userName":"MattMan10!","userUrl":"https://itunes.apple.com/us/reviews/id636209358","version":"1.583.490","score":1,"title":"Very bad product","text":"Very little control! You can’t even control the volume with this preamp! Who’s ever heard of a preamp that you can’t control the volume?","updated":"2021-03-31T16:53:32-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2088891638","userName":"jadstep","userUrl":"https://itunes.apple.com/us/reviews/id38175327","version":"1.430.180","score":1,"title":"Worst app ever","text":"This app is horrible. I am constantly having to reset the sound bar. I wish for the days of just plugging a device in. \n\nOoh. Sound bar does not have a remote. Good luck with that.","updated":"2018-01-14T08:56:11-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7900399017","userName":"Goldbacon-TX","userUrl":"https://itunes.apple.com/us/reviews/id29376485","version":"2.1.561","score":1,"title":"Doesn’t support Apple Music","text":"This app is great except it doesn’t support Apple Music. Taking away 4 stars for that lack of functionality.","updated":"2021-10-10T14:12:11-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6157796273","userName":"2much42little","userUrl":"https://itunes.apple.com/us/reviews/id519795444","version":"1.562.200","score":2,"title":"HEOS broken","text":"HEOS stopped working with last update.  Does not work at all since last update.","updated":"2020-07-04T13:57:38-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8106599726","userName":"Paul in b\"ville","userUrl":"https://itunes.apple.com/us/reviews/id115376319","version":"2.1.680","score":2,"title":"Poorly documented","text":"Difficult to setup. Difficult to control.","updated":"2021-12-07T19:01:52-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5234380769","userName":"Gayve","userUrl":"https://itunes.apple.com/us/reviews/id116003067","version":"1.520.320","score":2,"title":"App is garbage","text":"Please fix the app so it’s useable. I’m beyond disappointed and frustrated. The system is a complete waste of money.","updated":"2019-12-04T18:24:39-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5053598781","userName":"Hungry girl subscriber","userUrl":"https://itunes.apple.com/us/reviews/id396906033","version":"1.520.200","score":1,"title":"Not accessible","text":"Most of the buttons are not labeled making this app useless to a person using voiceover.","updated":"2019-10-30T19:23:00-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3343420424","userName":"tomdfw1","userUrl":"https://itunes.apple.com/us/reviews/id34940053","version":"1.466.240","score":2,"title":"Horrible interface","text":"Whoever created the interface should be replaced","updated":"2018-10-25T14:19:37-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8116482108","userName":"KSKCT","userUrl":"https://itunes.apple.com/us/reviews/id890914481","version":"2.1.680","score":1,"title":"HEOS cutting out with streaking","text":"Disappointed because suddenly HEOS cuts out and says Streaming has been interrupted.  Please provide guidance whether it’s the app or another matter.","updated":"2021-12-10T15:18:54-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5337475710","userName":"Granny Doc","userUrl":"https://itunes.apple.com/us/reviews/id202261439","version":"1.520.320","score":1,"title":"Just as worthless...","text":"...as the other Marantz and D&M Holding apps. And as worthless as the Marantz itself, which suddenly, inexplicably and randomly quits sending sound. Sad.","updated":"2019-12-29T22:24:14-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4153139298","userName":"cheney gross","userUrl":"https://itunes.apple.com/us/reviews/id763883024","version":"1.505.130","score":1,"title":"Not user friendly","text":"The app is terrible and the devices refuse to connect via WiFi. Every step was followed and there was no logical reason for it to not work.","updated":"2019-05-15T03:17:30-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3901597808","userName":"NickGKDYPO","userUrl":"https://itunes.apple.com/us/reviews/id913372655","version":"1.493.170","score":1,"title":"Basic Functions Missing","text":"Needs a seek function.  A shame when I have to recommend Sonos for basic functionality.","updated":"2019-03-19T13:58:28-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8094794281","userName":"Ajm2015","userUrl":"https://itunes.apple.com/us/reviews/id459328878","version":"2.1.680","score":1,"title":"Not for Apple Music members","text":"There’s no way to play your Apple Music through here…I’m sure that’s Apples doing but still annoying.","updated":"2021-12-04T09:29:16-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6558944829","userName":"AJP1082","userUrl":"https://itunes.apple.com/us/reviews/id127794949","version":"1.583.160","score":2,"title":"Okay but....","text":"Will only play about 20 out of the 2000 songs on my iTunes. Very frustrating!","updated":"2020-10-21T08:31:02-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7501244677","userName":"screwed as usual","userUrl":"https://itunes.apple.com/us/reviews/id146927862","version":"1.583.490","score":5,"title":"REVIEW","text":"Sound is great. Very much enjoy the app..","updated":"2021-06-24T09:17:35-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4004641715","userName":"T Grasselli F","userUrl":"https://itunes.apple.com/us/reviews/id37529698","version":"1.493.170","score":1,"title":"Heos 5 - a waste of money","text":"Virtually impossible to use -never works. Auxiliary input complicated and clumsy to use. What does it matter how they theoretically sound when they don’t work?","updated":"2019-04-12T15:21:16-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"1936186930","userName":"Cpet2000","userUrl":"https://itunes.apple.com/us/reviews/id25101512","version":"1.430.160","score":1,"title":"Crashes constantly","text":"App crashes constantly. Works for a few seconds and then crashes. Fix it please.","updated":"2017-11-20T18:55:34-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3545180800","userName":"AndreLG","userUrl":"https://itunes.apple.com/us/reviews/id101398055","version":"1.481.160","score":2,"title":"Poor quality","text":"Great concept but the app so consistently doesn’t work that it becomes infuriating","updated":"2018-12-18T07:15:22-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4989473994","userName":"Walk my way","userUrl":"https://itunes.apple.com/us/reviews/id19934217","version":"1.520.200","score":1,"title":"Bare minimum. Rebuild the app","text":"Poor functionality and features. Would be nice to be able to que up music. Would be nice to easily build playlist and recall favorites.","updated":"2019-10-20T17:15:13-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4327583867","userName":"B2thep","userUrl":"https://itunes.apple.com/us/reviews/id105352579","version":"1.505.130","score":1,"title":"Bad, buggy app","text":"It has forgotten my device multiple times. Messed up the zones. Unintuitive UI. Just poorly designed and implemented. I used to love Denon. My next receiver will likely be a different brand.","updated":"2019-06-16T18:06:09-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"1965654235","userName":"Cal3418","userUrl":"https://itunes.apple.com/us/reviews/id141596993","version":"1.430.160","score":1,"title":"Lost Money","text":"App won’t open half the time, the other times it won’t play or loses rooms. My mistake , I have 4 HEOS 7’s.\nDon’t waste your money, you’ll spend all your time doing a reset.","updated":"2017-12-02T13:22:14-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4316741203","userName":"Higgs boson 2","userUrl":"https://itunes.apple.com/us/reviews/id282315045","version":"1.505.130","score":1,"title":"Nothing but trouble during setup. AVR X1400H","text":"The HEOS app has a slick setup procedure that is no way near accurate for my device.  My device has no amber or green lights, and no rear panel switch.  Hours of frustration with setup.","updated":"2019-06-14T17:10:20-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5443632145","userName":"joe 11223344789","userUrl":"https://itunes.apple.com/us/reviews/id101450124","version":"1.544.150","score":4,"title":"No Qobuz yet :-(","text":"Love the app, but waiting for Qobuz support...hopefully soon!","updated":"2020-01-24T09:59:02-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2418299202","userName":"mikeyp123","userUrl":"https://itunes.apple.com/us/reviews/id24106181","version":"1.442.220","score":5,"title":"Works great with Denon receiver","text":"Receiver connected via Ethernet. Stable good streaming with Pandora and TuneIn. 👌","updated":"2018-04-13T09:50:32-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5692781719","userName":"Artifacts disappear","userUrl":"https://itunes.apple.com/us/reviews/id137094638","version":"1.544.240","score":1,"title":"Upgraded yesterday & wont work at all!","text":"Won’t recognize any sign in on my apple devices. Thanks a lot.","updated":"2020-03-21T10:24:16-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5238124436","userName":"will15624","userUrl":"https://itunes.apple.com/us/reviews/id842759486","version":"1.520.320","score":3,"title":"Works... most of the time","text":"When it works it’s awesome!","updated":"2019-12-05T17:26:40-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3219144217","userName":"iJohnSmith","userUrl":"https://itunes.apple.com/us/reviews/id177392912","version":"1.466.240","score":1,"title":"Why can’t I just use AirPlay?!","text":"The fact that I spent $1200 on my receiver and I have to use this S app instead of the far superior AirPlay that my receiver claims to support is F ridiculous! Marantz you need to fix this!!!","updated":"2018-09-22T17:01:47-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2504739909","userName":"i <3 Zachary","userUrl":"https://itunes.apple.com/us/reviews/id101977918","version":"1.442.220","score":1,"title":"Worst app","text":"Doesn’t work with speakers it’s designed for. Just shuts down. If you don’t keep the app open on your phone it restarts. I hate this app. I’d give it a zero for user friendliness.","updated":"2018-05-04T11:10:14-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6565868219","userName":"Ramblur","userUrl":"https://itunes.apple.com/us/reviews/id86552055","version":"1.583.160","score":1,"title":"1.583 update","text":"The app worked fine until this October 2020 update now it can’t find my AVR S650H. Why  did you break it? Zero stars","updated":"2020-10-23T08:43:31-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5476004211","userName":"redemptionryder","userUrl":"https://itunes.apple.com/us/reviews/id501084344","version":"1.544.150","score":1,"title":"Connectivity issues , even on Super WiFi","text":"System Always","updated":"2020-02-01T13:22:54-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5306215445","userName":"Wayne531157","userUrl":"https://itunes.apple.com/us/reviews/id46143090","version":"1.520.320","score":1,"title":"Big thumbs down","text":"I would give this app minus stars if possible usb completely non functional","updated":"2019-12-22T14:09:12-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4132484489","userName":"crash IOS9.1","userUrl":"https://itunes.apple.com/us/reviews/id258234018","version":"1.505.130","score":1,"title":"A more stable app needed","text":"This one is just waste of time. Using it for two years and rarely connected to device","updated":"2019-05-11T00:58:52-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8055876737","userName":"whocares112","userUrl":"https://itunes.apple.com/us/reviews/id146551681","version":"2.1.680","score":1,"title":"Too difficult!","text":"I’ve spent months attempting to get all my speakers working at the Dane time… reset, reboot… it’s too complicated!","updated":"2021-11-23T12:59:33-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5698287444","userName":"hhgdttui","userUrl":"https://itunes.apple.com/us/reviews/id242404333","version":"1.544.240","score":1,"title":"Yep you broke it","text":"Latest update stinks. Yes, unknown error for me too. Keeps logging me out. I’ll tell what the error is  “ it was awesome, now annoying”.","updated":"2020-03-22T14:16:40-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3888017193","userName":"Greg with useless heos","userUrl":"https://itunes.apple.com/us/reviews/id192281910","version":"1.493.170","score":1,"title":"Couldn’t use in my new house.","text":"Horrible. I couldn’t set up the app and devices in my new house. They kept looking for my old WiFi.","updated":"2019-03-16T05:22:26-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3354773689","userName":"Freehorribleapp","userUrl":"https://itunes.apple.com/us/reviews/id127745808","version":"1.466.240","score":1,"title":"Worst app ever","text":"The app never works correctly. It’s at the point where we can’t even listen to music because it never plays.","updated":"2018-10-28T11:08:54-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2137779308","userName":"Rhs18101972","userUrl":"https://itunes.apple.com/us/reviews/id160328094","version":"1.430.180","score":2,"title":"Great sound, crapy app","text":"The sound of heos devices is really great. But... The heos app is really bad, need a lot of work. Its a shame that they miss on something as basic","updated":"2018-01-28T13:31:31-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7677494621","userName":"tmzacm","userUrl":"https://itunes.apple.com/us/reviews/id9868800","version":"1.583.490","score":2,"title":"Not enough Apps","text":"Not enough apps. Nothing current","updated":"2021-08-10T09:46:01-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6636986194","userName":"scribit doesnt work","userUrl":"https://itunes.apple.com/us/reviews/id177488933","version":"1.583.161","score":1,"title":"Pathetic app","text":"Had for 3 or 4 years now.  Great speakers, one of the worst apps I’ve ever used.  How and if it will work is always a mystery.  Spend your money on Sonos.","updated":"2020-11-12T06:30:46-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4030295048","userName":"Hecc1014","userUrl":"https://itunes.apple.com/us/reviews/id1007359811","version":"1.505.130","score":2,"title":"Music","text":"You need to add apple music and i cant get to options to put in my aux cord sense you guys dont have apple music","updated":"2019-04-18T17:44:12-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3741909515","userName":"TheBstar","userUrl":"https://itunes.apple.com/us/reviews/id21072893","version":"1.493.170","score":1,"title":"Should have bought Bluesound","text":"Save your money, SONOS and HEOS Sound terrible. Took everything out and put in BlueSound, sounds 1000x better and has a storage vault and a desktop app.","updated":"2019-02-06T21:23:13-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8147477544","userName":"Troy R. B.","userUrl":"https://itunes.apple.com/us/reviews/id151778351","version":"2.1.680","score":1,"title":"Bad update","text":"It worked great until the update now I can’t get it to work at all. Total crap.","updated":"2021-12-19T09:41:34-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2657265232","userName":"Pghnut","userUrl":"https://itunes.apple.com/us/reviews/id17719075","version":"1.454.230","score":1,"title":"Bad glitch","text":"App crashes when opened. Every time...  deleted and re-downloaded and the same thing happens..  FRUSTRATING","updated":"2018-06-07T13:06:16-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2323226271","userName":"Stillz_77","userUrl":"https://itunes.apple.com/us/reviews/id246014795","version":"1.442.220","score":1,"title":"Terrible App","text":"Crashes every time and can’t connect to my music server even though my Sonos app and flawlessly. This is Junk!","updated":"2018-03-19T06:49:07-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5912476143","userName":"Ant$","userUrl":"https://itunes.apple.com/us/reviews/id138197987","version":"1.544.240","score":1,"title":"Horrible","text":"Horrible app, never works right and never has any of my Music","updated":"2020-05-06T17:50:58-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5881265491","userName":"Yoni5555","userUrl":"https://itunes.apple.com/us/reviews/id139301847","version":"1.544.240","score":1,"title":"User","text":"App needs a lot of work\nKeeps disconnecting and has to be restated with new music library \nPain in the neck","updated":"2020-04-29T16:23:07-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5694069816","userName":"pmik49418","userUrl":"https://itunes.apple.com/us/reviews/id247335891","version":"1.544.240","score":1,"title":"Inconsistent","text":"Keeping streaming in and out. Don’t waste your time submitting help tickets - you get no response","updated":"2020-03-21T17:09:29-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5693736884","userName":"mike_psychle","userUrl":"https://itunes.apple.com/us/reviews/id279404989","version":"1.544.240","score":1,"title":"Why does it take hours to reset my password !?","text":"And why did the app sign me out !?!? Terrible!!","updated":"2020-03-21T15:19:14-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3830309872","userName":"T10000009346","userUrl":"https://itunes.apple.com/us/reviews/id216113538","version":"1.493.170","score":1,"title":"Apple Music users abort","text":"If you use Apple Music just skip this now. It will only work with maybe 1 out of 5 songs","updated":"2019-03-01T16:58:35-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3811361625","userName":"Seppl1.","userUrl":"https://itunes.apple.com/us/reviews/id202819093","version":"1.493.170","score":1,"title":"Heos app","text":"Remarkable that a reputable company would release such a nonworking app. Connection worked (once)! And then never again found the denon device","updated":"2019-02-24T17:31:21-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6162541690","userName":"rchiga","userUrl":"https://itunes.apple.com/us/reviews/id139249775","version":"1.562.200","score":1,"title":"Airplay 2 will not work if you update to this version.","text":"Horrible!!! Now my airplay won’t work.","updated":"2020-07-05T20:20:47-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6136679106","userName":"WRHoyle","userUrl":"https://itunes.apple.com/us/reviews/id86095966","version":"1.562.200","score":1,"title":"Update issue","text":"Since the update HEOS no longer works with Alexa. If I ask Alexa to play a song she says it’s not responding.","updated":"2020-06-29T10:08:35-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5321898665","userName":"NetworkGuy","userUrl":"https://itunes.apple.com/us/reviews/id43162456","version":"1.520.320","score":1,"title":"Can’t create a HEOS acct, “Wrong email format”","text":"I’ve tried several email accts and it doesn’t seem to like anything.","updated":"2019-12-26T05:36:22-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4025686788","userName":"gjbvddtukjbvxdd","userUrl":"https://itunes.apple.com/us/reviews/id345092336","version":"1.505.130","score":1,"title":"App connection problem","text":"This app is extremely bad I have to spend a lot of time to connect.","updated":"2019-04-17T14:46:38-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3718132956","userName":"ryanpw89","userUrl":"https://itunes.apple.com/us/reviews/id185027903","version":"1.481.160","score":1,"title":"Worked at first","text":"App will queue song but never actually play anything now","updated":"2019-01-31T15:31:55-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2099654626","userName":"Phuza11","userUrl":"https://itunes.apple.com/us/reviews/id30431436","version":"1.430.180","score":1,"title":"App Crash continiously","text":"I downloaded to test and the app crashes with 30 seconds. Please fix ASAP as it may deter me from buying the receiver","updated":"2018-01-17T18:14:23-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8063173930","userName":"geegkaol","userUrl":"https://itunes.apple.com/us/reviews/id28392270","version":"2.1.680","score":1,"title":"Cannot play my music that is stored on my iPhone","text":"Cannot play my music that is stored on my iPhone","updated":"2021-11-25T15:35:50-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"5688700708","userName":"Cablesplicer304","userUrl":"https://itunes.apple.com/us/reviews/id281436711","version":"1.544.240","score":1,"title":"HEOS","text":"I want to listen to music not spend 2 hours troubleshooting wifi connectivity.","updated":"2020-03-20T14:21:52-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"3901810331","userName":"SCM16046","userUrl":"https://itunes.apple.com/us/reviews/id184705282","version":"1.493.170","score":1,"title":"Plays 3 Songs in a Row and then....","text":"Errors errors and errors. Try flipping around your playlist after 3 songs and the app fails. Horrid. Avoid.","updated":"2019-03-19T15:33:49-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2216468236","userName":"ChadGaston","userUrl":"https://itunes.apple.com/us/reviews/id43689401","version":"1.442.190","score":1,"title":"Please Update","text":"Last 2 updates just crash on startup. Haven’t been able to use my Heos speaker in months.","updated":"2018-02-16T18:05:40-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8048869472","userName":"d clyde c","userUrl":"https://itunes.apple.com/us/reviews/id31467146","version":"2.1.680","score":2,"title":"Just get Sonos","text":"Too many bugs and inconsistency with the app","updated":"2021-11-21T12:03:58-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2657180790","userName":"Ohansen","userUrl":"https://itunes.apple.com/us/reviews/id182866382","version":"1.454.230","score":1,"title":"Latest update horrible","text":"App will not sync with my iPhone and WiFi rendering the device useless!","updated":"2018-06-07T12:39:35-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4134827518","userName":"okpinoloom","userUrl":"https://itunes.apple.com/us/reviews/id13473628","version":"1.505.130","score":1,"title":"Don’t buy Heos","text":"Can’t even build a functioning app. What’s the point of the speaker tech if you can’t even use it?","updated":"2019-05-11T10:37:44-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"2835286625","userName":"Anbuschguy","userUrl":"https://itunes.apple.com/us/reviews/id87034348","version":"1.454.280","score":1,"title":"Pretty Bad","text":"Works 50% of the time. Rarely the first time. \nSkips to next song 1/2 through the first song.","updated":"2018-07-04T06:29:14-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6838072016","userName":"Newf55","userUrl":"https://itunes.apple.com/us/reviews/id25785019","version":"1.583.161","score":1,"title":"Trash App","text":"What a trash app, doesn’t work most of the time. Just stick with AirPlay instead of this monstrosity.","updated":"2021-01-06T07:45:34-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6101706033","userName":"IM Toast","userUrl":"https://itunes.apple.com/us/reviews/id536420272","version":"1.544.240","score":1,"title":"Bugs bugs bugs","text":"Connectivity nightmares.","updated":"2020-06-20T13:28:35-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"4797510820","userName":"Smiles909","userUrl":"https://itunes.apple.com/us/reviews/id145306077","version":"1.520.200","score":1,"title":"App is unreliable","text":"Great hardware and speakers sound awesome, but they are useless when the app can’t connect to them. Works sometimes.","updated":"2019-09-17T16:30:38-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6653617018","userName":"Frtheloveofgolf","userUrl":"https://itunes.apple.com/us/reviews/id238968269","version":"1.583.161","score":1,"title":"Absolutely impossible to figure out","text":"Has to be the poorest engineering ever. \nHow does Denon associate it’s name with such a poor product?","updated":"2020-11-16T16:59:57-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"7081318500","userName":"Trsla17!","userUrl":"https://itunes.apple.com/us/reviews/id542913239","version":"1.583.490","score":1,"title":"Doesn’t work","text":"Can’t get anything to work.","updated":"2021-03-08T16:24:52-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"6122053384","userName":"hansjim","userUrl":"https://itunes.apple.com/us/reviews/id15546393","version":"1.562.200","score":1,"title":"Bugs Galore","text":"Connectivity problems","updated":"2020-06-25T17:42:04-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"1970546522","userName":"MacMeiCloud","userUrl":"https://itunes.apple.com/us/reviews/id42197576","version":"1.430.160","score":1,"title":"App on iOS 11.x quits","text":"Withing the last few days the app quits on startup or cannot connect to network/speakers without quitting. Please fix ASAP. iOS 11, iPhone 6s","updated":"2017-12-04T11:05:50-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"},{"id":"8092081678","userName":"cccccxxccccxx","userUrl":"https://itunes.apple.com/us/reviews/id185507377","version":"2.1.680","score":1,"title":"Not compatible with AppleMusic","text":"The entire system is not compatible with Apple Music.","updated":"2021-12-03T16:49:09-07:00","url":"https://itunes.apple.com/us/review?id=843129434&type=Purple%20Software"}]