[{"id":"8099948181","userName":"Slip Spine","userUrl":"https://itunes.apple.com/us/reviews/id128315383","version":"21.6.1","score":3,"title":"No Timer Switch Function?!","text":"I converted my entire home to the system. Over 40 switches. There are lots of things that are cool like schedules and being able to converge multiple lights into a single switch… Creating switches where no wires exist, and so on. \n\nBUT THERE ARE NO TIMERS! There are so many rooms that you need light for only a few minutes (pantry, laundry room, or a garage)… Lights that constantly get left on and that people often forget to turn off. You have schedules, but why no timers??? The system knows how many and which lights are on at all times, how simple would it be to program the server that if it sees the pantry light on to turn it off in a designated amount of time (5, 10, or 20 minutes). \n\nLord knows the switches are expensive enough, you would think that you could set it up as a timed switch, but you can’t… Not yet. And it wouldn’t require a different switch, just a feature in the app itself.","updated":"2021-12-05T19:39:00-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"4679794286","userName":"sbrunner","userUrl":"https://itunes.apple.com/us/reviews/id101990348","version":"6.5.3","score":5,"title":"Rock solid","text":"We have over 90 devices - on two bridges. The two accounts that are required are a bit of a hassle, Home brings them together - and this is what we use. After three years of service, the system has been running rock solid and dependable. The system deals perfectly with the many lightning related power outages we have in Texas. \n\nI am super excited about the new fan controllers and will replace my eight fans that are on the old on/off switch today. Thank you for the 75 device expansion, not enough, though. A really nice feature would be the merger of the RA Select and Caseta lines for more flexibility. I do not believe it would eat into revenue as both lines serve completely different markets. But it would allow tinkerer to spend more money that they otherwise would not spend. \n\nAn in-wall outlet is missing from the line, the plug-in model is no replacement. I am running a couple of Z-wave outlets today for these for various things such as pump controller, outside lighting, and holiday illumination. Z-wave has been running fairly stable, but compared to Clear Connect, no comparison. Z-wave so and so often fails to trigger, whereas Clear Connect works every single time.","updated":"2019-08-26T20:38:36-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2415602248","userName":"FranceUSA","userUrl":"https://itunes.apple.com/us/reviews/id21687782","version":"5.3","score":2,"title":"Siri phone works. Watch does not at first","text":"Alexa will work but not as well as Siri. But Siri only works well with the iPhone. The watch does download the app but does not let you control anything. I had to delete My Home in HomeKit and reload the bridges to get it working. That is crazy. Also, the app watch does not let you access devices. It only lets you access scenes. So unless you create a scene you will not see your device. So create a scene to turn on a light and create a 2nd scene to turn off the light. Not very smart. \n\nWith all that said, I don’t think there is a better hardware device for switches. Add Hue Lights to Caseta and you have an amazing system. \n\nThe 30ft Range is not a problem for me yet but at a minimum they should create a mesh of Bridges that could add 50 devices each. So that with 3 Bridges one could handle 150 devices. 2 Bridges with 2 separate accounts is not an acceptable solution. And the expensive custom “RA2” which is a premium to the “Caseta” system is not HomeKit ready which means that even for free no one would want that outdated expensive system.  Currently you can only do 50 switches on Caseta, which means you have to be selective on what to use Caseta. May be light switches using Caseta and use a different Brand to control power plugs.","updated":"2018-04-12T18:48:45-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"7269939583","userName":"Emawk05","userUrl":"https://itunes.apple.com/us/reviews/id16406398","version":"7.7.1","score":2,"title":"Use Application Without An Online Account","text":"Update**\nIs someone going to respond/look into this??\n\nI simply want to use this application without any online account. I am able to do this to an existent by configuring using the contractor mode and setting the IP of my hub manually. However, this setup timesout after a period of a few days.. The capability exists so why not make it a first class experience? There are many users who have no interest in using this application over the internet or creating an account online [for security reasons]. Outside of the occasional firmware update [which ideally I should be able to control when and how that occurs]. I don’t want critical infrastructure in my home talking to or being accessed from anything on the internet. In these days and times companies that take privacy and security seriously will continue to grow and thrive - those that do not adapt and address these issue, ultimately will loose market share to those that do. Quite a shame because Lutron has a very solid product; they just need to remove friction for the privacy and security minded.","updated":"2021-04-27T07:02:23-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1802822589","userName":"Sean702","userUrl":"https://itunes.apple.com/us/reviews/id42462267","version":"5.0","score":4,"title":"Simply. Awesome.","text":"The possibilities with this system are endless and I have a lot of different scenes set up and automatic scenes set as well.  The right lighting levels in your home make all the difference in the world, and I have dimmers set that ensure my plant lights with plant lights around the house receive adequate lighting while I'm at work.  \n\nI never have any issues with the app and I can easily adjust lighting from my iPhone, iPads, even my Apple Watch in a pinch. And I have a few wireless remotes in the remote cradles and remotes mounted on walls with regular switch plates that work just light regular dimming light switches.  I also have the hub which is key and it integrates with Apple HomeKit so you can let Siri adjust things for you too. \n\nWhen friends and family come over they're seriously blown away - it's professional-grade. It's not exactly cheap, but I'm not looking for cheap - I want something that works flawlessly and that doesn't cost an arm and a leg either.  \n\nSwitching lighting scenes couldn't be simpler.  Combine that with auto shade adjustments and even temperature control and jaws drop.  For me it's the ultimate convenience that I love, and being able to achieve the perfect lighting levels for every occasion.  \n\nI can't imagine going back to the days of constantly having to flip switches on and off around the house.  I've tried others and this is by far the BEST.  I love this system. I'd never go back - Look no further.","updated":"2017-09-21T19:33:38-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"4645308170","userName":"Jorizondo","userUrl":"https://itunes.apple.com/us/reviews/id140277190","version":"6.5.3","score":3,"title":"No support for multiple homes/locations","text":"The app is good and the wireless dimmers are great, I liked them so much that I added them to our vacation home.  To my surprise the app does not support multiple homes! Wow! I had other wireless switches in our second home which worked perfectly while being controlled by Google home and more importantly by voice commands as Google home DOES support multiple homes.  I switched to Lutron in order to have only one system and now I basically have lost my voice command ability as you can not set up multiple homes in Google home since you would have to set up two Lutron accounts and link them to Google home in order to accomplish it. Google home/Lutron does not allow for this.  So now I have lost my voice controls.  The app needs still needs to mature a lot.  Need to add multiple location support!!","updated":"2019-08-20T04:52:59-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1685524999","userName":"RCI86","userUrl":"https://itunes.apple.com/us/reviews/id10652224","version":"4.2","score":3,"title":"Loading time","text":"Takes a long time to load but otherwise works great. I like that you can set lights to turn off at a certain time in case you forget to turn them off. I also have my outside light set to turn on from sunset to sunrise. Works well with Alexa and customer service was awesome when I had some setup questions with the dimmers. Just wish the app would start up faster.\n\nUpdate: loads a bit faster now but still not fast enough. I figured out got to add the today widget which is much faster to use. I recommend using that for the lights you use the most instead of opening the app.\n\nFeature request: would love more flexibility in the schedule area, for one time needs (not repeating) such as: leave light on for the night (turn off at sunrise) and a timer like turn lights off in 3 hours. Thanks!","updated":"2017-07-16T22:10:52-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6206394239","userName":"Pkonczal","userUrl":"https://itunes.apple.com/us/reviews/id85246645","version":"7.1.0","score":4,"title":"Still no timer programming feature","text":"As I said in my previous review this app would be off the charts if it allowed the user to set up timer programming for any Lutron Caseta switch. Example: say you had an exhaust fan in the bathroom and you wanted to turn it on and have it stay on for a predetermined time. That’s where this would come in handy because you could program the switch so that if it is turned on manually, through the app, or even by Siri the switch would stay on until the programmed timer has run its course. The feature could be programmed in the app and operate similar to a schedule. The timer program feature would allow you to set the time in increments(5,10,15,20,25,30,.......60minutes).","updated":"2020-07-16T15:05:34-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6592449640","userName":"§hinobi","userUrl":"https://itunes.apple.com/us/reviews/id147850963","version":"7.3.2","score":3,"title":"Not as good as it used to be.","text":"I have most of my Caseta controlled lights on a schedule which not only turns on and off the lights at specific times but I also control the brightness of the lights depending on the time. And I liked the fact that I could override a given schedule by pressing another schedule item on the schedule list.\n\nBut it looks like with the recent updates to the Caseta app, this is no longer possible. When I called customer service to complain about this issue, I was told that the feature was removed on purpose by the developers of the app! Now why on earth would a useful feature like that be removed for no apparent reason????\n\nPlease bring this feature back. Pretty please!!!","updated":"2020-10-30T21:29:33-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3632515979","userName":"Azzedine","userUrl":"https://itunes.apple.com/us/reviews/id28197339","version":"6.3.0","score":5,"title":"Best home automation we have","text":"We’ve had Caséta fo about 3 years now.  We have two systems in two buildings.   This has been the most connected (to other companies systems) and most reliable home automation for us (also have nest, Honeywell, August/Yale, Liftmaster, and Orbit and some others that got thrown out).  It has worked when the others won’t (network issues).  Siri can be a bad at times with our other devices but it always manages to work with the lights.  Liftmaster is close but we’ve only had it for half a year.  I’m happy we got Caséta and will continue to build our system. My only wish for the app is that I could support both buildings in the app at the same time - HomeKit fills this gap though.","updated":"2019-01-09T21:17:34-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5353587814","userName":"LGB512","userUrl":"https://itunes.apple.com/us/reviews/id15394750","version":"6.6.2","score":5,"title":"Problem Resolved- Watch App Missing Pro Dimmer Light","text":"Update: Lutron’s suggested remedy was successful. For some reason the Pro Dimmer needed to be selected in the Apple Watch settings for it to be visible on the watch menu. Curiously the other 11 Dimmers in my house were automatically selected to appear on the watch menu. Easy fix. Five Star product!\n\nThe Lutron Caseta iPhone App works well but the Apple Watch App is missing one of my Wall Dimmers. It is the only Pro Dimmer in my home and is wired as a 3 way switch. I am using a Pro controller. HomeKit successfully shows the Pro Dimmer on it’s app on my Apple Watch. So why doesn’t the Pro Dimmer appear on Lutrons own app for the Apple Watch?","updated":"2020-01-02T19:17:04-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1811019659","userName":"hoping for my rainbow baby","userUrl":"https://itunes.apple.com/us/reviews/id85255877","version":"5.0","score":4,"title":"New update is more user friendly","text":"This app has potential. Still mixed whether I prefer home kit interface vs this app. The colors and layout are visually pleasing and they have continually improved in that area. The nice thing is their app hasn’t been to buggy with prior versions. I wish wish wish there was more customization. In specific for my theater Room I used to have a previous maestro switch that you could dim over 15 seconds for a subtle light change that was perfect. Now with the Caseta dimmer there is no options despite it being a smart dimmer. It takes about 5 seconds. Had to go with Caseta because I switched to LED bulbs. Would love to see them build that into the app. Thanks for your guys work on this.","updated":"2017-09-26T06:44:11-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2294318130","userName":"Dexter Davenport","userUrl":"https://itunes.apple.com/us/reviews/id34228746","version":"5.1.1","score":3,"title":"Adequate","text":"The app makes the process of adding devices simple enough. But I wish the scenes could have conditions. For example, I have a “night light” scene that dimly lights my way to the bathroom and kitchen at night when I don’t want bright light to make me too alert. But what if someone else is in one of the rooms in my path? If the lights are already on, I don’t want to dim them. So I’d like to say, if this light is off, set it to 10%. But maybe that’s a HomeKit failing. Line is kind of blurry. Also, there appears to be no good way for a Pico to trigger a non-Lutron device, except in HomeKit if it’s grouped with a Lutron dimmer. If the would allow the app to see non Luton HomeKit devices, we could map them to a Pico’s buttons, which would be nice for things like controlling a fan or a HomeKit light.","updated":"2018-03-11T04:32:44-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6304429208","userName":"Z2718","userUrl":"https://itunes.apple.com/us/reviews/id228490450","version":"7.1.0","score":4,"title":"Still loving it. . . .","text":"We have 4 homes. I started in our vacation home in the Hudson Valley and went crazy.   Next it started with 1 switch in Palm Beach and . . .  Again. . . Within a month every switch in the house. We just remodeled a home and changed to all black k units that look great and the long awaited support for multiple homes is awesome.   I’d like to be able to arrange the app rooms in something more logical than alphabetical order . . . But, it works and it’s stable and rock solid reliable. I have had 2 bad switches and a fellow a Home Depot told me I wasn’t familiar with them. I’ve installed over 150 and had a pretty fair sense these 2 were defective. No biggie. I love the system.","updated":"2020-08-10T18:50:19-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2345812692","userName":"SCJayj","userUrl":"https://itunes.apple.com/us/reviews/id24513412","version":"5.2","score":4,"title":"Now has iPad formatted version and but still lacking some cool features","text":"This is an updated review. They recent added iPad formatted version and added rooms.  The app works on both iPhone and iPad and is good. There are some features that are not include that are available in the Smart Bridge such as delay and fade rates. If I use a 3rd party app I can include those two features in scenes and then I can select those scenes in the Lutron app and they work so I’m assuming they are stored in the hub. Not sure if other features are missing that I’m not aware of. What is interesting is that HomeKit/Siri scenes are different than Lutron scenes and done use the scenes stored in the hub. Alexa uses the Lutron scenes. It is nice that developers responded to my initial review. Thanks Lutron!","updated":"2018-03-25T11:07:21-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6714413567","userName":"JasonRLee53","userUrl":"https://itunes.apple.com/us/reviews/id178684197","version":"7.4.2","score":3,"title":"Google Assistant Sync Bug","text":"Seems when you link the Lutron Caseta to Google Assistant, it takes both the device and room as its device name. For ie: I have a device called kitchen and set the room as kitchen. When you link it to Google Assistant, it shows the device name as Kitchen Kitchen, so now when I ask Google home to turn on Kitchen, it goes, “ok, turning on kitchen kitchen”. It had imported fine when I first got Google Assistant installed, but now has this weird bug.\n\nAlso while in the Lutron app, it freezes and lags when switching between menus. Now it has taken what I call Master Bedroom and added a room called Bedroom Bedroom because of the Google Assistant sync.","updated":"2020-12-03T15:18:58-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6458686520","userName":"gabriel.gonzaga","userUrl":"https://itunes.apple.com/us/reviews/id154427126","version":"7.2.1","score":4,"title":"Great app, but one suggestion!!","text":"I have Lutron all over my house, and it’s a great service. I often get migraines so having an app that can switch off all my lights when I need to be in the dark is very convenient, not to mention the general convenience of not needing to get up. Lutron is a solid system and doesn’t disappoint. \n\nMy one suggestion is rooted in with my migraine issue. I would love to see a dark mode on the app. The white box I see when opening the app is blinding almost and can worsen my headaches to another degree. If there was a dark mode that would be awesome. Developers, are you able to add this feature? If so, any timeline? Thanks!!","updated":"2020-09-22T22:14:26-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6390857609","userName":"antagron","userUrl":"https://itunes.apple.com/us/reviews/id411387396","version":"7.1.0","score":4,"title":"Very good.. but needs a few key features...","text":"Intuitive layout and connects quickly. Would like to see a few more things:\n\n1. Be able to turn on/off all lights in a room with one button press (maybe embed controls into the room name line?)\n\n2. Be able to arbitrarily group lights for control. Some default groups would be room (already have this) and floor. Each room is added to a floor.\n\n3. *new* move the enable slider on schedules outside of the edit/pencil menu so it’s immediately clear which schedules are in effect. The filled in schedule icons indicating which one is currently “on” is unintuitive. It should not be a control. I don’t want to invoke a schedule manually. I would use a scene for that. I’m not sure if you can schedule scenes but you should be able to. I also think that schedules should be able to include both an on and off time rather than needing 2 schedules to accomplish this (since they are managed independently, it’s easy to enable one and forget to enable the other).","updated":"2020-09-03T06:31:53-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1885855159","userName":"lazspazz","userUrl":"https://itunes.apple.com/us/reviews/id71006353","version":"5.0","score":5,"title":"Actually worth it","text":"I have several home lighting control systems and Lutron is by far the best.  After more than a month of use The lights are always ready to access in the home section. I have apps from Philips and TCP for controlling lights and it seems the lights are always in “updating” mode and take 10 seconds and dozens of taps to get them ready to turn on. Additionally I like the ability to set timers based on sunrise and sunset (which makes sense from a lighting perspective). The caseta system is well worth it and will use this in the future unless I really want a color-changing light. Philips Hue is a distant 2nd option.","updated":"2017-10-30T10:10:54-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1803806736","userName":"MacFerret","userUrl":"https://itunes.apple.com/us/reviews/id30252017","version":"5.0","score":1,"title":"Terrible UI practically unusable","text":"This is a huge step backwards in usability. In the old version, all the scenes and devices I use most were immediately available for one-handed operation when the app is first opened. That functionality is now gone, replaced by a weird  mess of scrolling tabbed panels that you have to dig through to find things. Scenes take several extra taps to even get to. Making matters worse, everything is organized alphabetically in these panels, a decision which makes no sense whatseover. I much preferred the dark appearance option, particularly in a dark room. Removal of the icon choices also hampers uasbility. Now, you have to look at every item name when navigating instead of quickly glancing at the app. Horrible choices all around. I can't find one thing this version actually improved to make the app more usable.","updated":"2017-09-22T08:12:00-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5460115923","userName":"Ray Gillette","userUrl":"https://itunes.apple.com/us/reviews/id571362652","version":"6.7.0","score":3,"title":"Okay but not right","text":"I’ve set this up for a few dozen clients and they all seem to like it. Therefore I recently put some switches at my place (mostly things left over from various jobs) and I like having the ability to do everything the app says it will do. Remotely on/off, dimmers, scenes and schedules are truly awesome.\n\nThe only thing that really irks me is the sunset/sunrise schedule. It’s entirely inaccurate for me and my clients. Perhaps it’s because I live/work in Phoenix (5th largest metro area in US) Arizona which is a state that doesn’t recognize daylight savings time and that fact confused the developer?\nPerhaps it’s because it’s terrible and the makers of the app don’t have access to a calendar/weather? I mean the weather app on my phone has sunrise sunset. Newsflash Lutron: rise/set changes throughout the year.\n\nHaving to program ‘an hour after sunrise’ or something similar negates the purpose of having this app and to be quite frank, a mechanical timer would be just as effective at this point. Get your act together.","updated":"2020-01-28T15:25:36-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1871724281","userName":"A Gerrard","userUrl":"https://itunes.apple.com/us/reviews/id357861186","version":"5.0","score":3,"title":"Convenient; needs improvement","text":"We have our kitchen and living room lights connected with the app: ceiling lights, a hanging lamp, in-cabinet lighting and a table lamp are hooked up. With that many switches (some not easily accessible) it’s a significant time saver to automate and we find we use/enjoy our accent lighting more.\n\nThe biggest issue for us is when two people in the household have the app; the Leaving Home function will shut off all lighting if one of us leaves while the other stays home. When this happens while I’m in the kitchen with my hands full - and it does - it’s both inconvenient and a hazard.\n\n As city apartment dwellers we often come and go with our hands full (groceries, trash, deliveries, etc) so having the function has proven to be a huge help and we don’t want to have to shut it off. Developers need to address this so the Leaving Home function deactivates if another app-owner is still home! I’m confident it will be taken into consideration and improved by Lutron’s team soon. \n\nOverall though, we are loving it.","updated":"2017-10-24T06:49:57-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3070514034","userName":"Carrie110","userUrl":"https://itunes.apple.com/us/reviews/id230814447","version":"5.6.2","score":4,"title":"Almost perfect","text":"This app works great to easily adjust all 22 shades in our home.  Several are set on a convenient timer.  My only criticism is that the app reports a closed shade in light gray, and an open shade in dark blue.  This is totally counterintuitive to what my brain expects, and I always have to remind myself that the lighter color means “closed,” when I naturally expect it to mean “open.”  Six months in, and I still have to remind myself of this every time I adjust the shades, so I think this is a natural cognitive expectation that the app designers got wrong.  Please fix this.  Light color means open, sunlight.  Dark color means closed, nighttime.  Makes sense, right?","updated":"2018-08-15T20:20:43-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2388616824","userName":"Leimeisei","userUrl":"https://itunes.apple.com/us/reviews/id103628433","version":"5.3","score":5,"title":"I can’t say enough nice things about Lutron","text":"I’ve been in home automation hell for 2 years now. Finally decided to dive into professional grade (RA2 Select) and let me just say you can tell Lutron has a lot of experience in this. They have thought of almost EVERYTHING. Product quality is amazing, apps are good, and their higher end RA2/Select and HomeWorks QS repeaters are developer friendly. \n\nThe only request I have at this point is to please expose buttons on Pico remotes as devices in HomeKit and SmartThings. I’m trying to integrate some hue lights into my system as well and it would make it much easier!","updated":"2018-04-05T18:15:37-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5905788437","userName":"Donkeyso10","userUrl":"https://itunes.apple.com/us/reviews/id400558986","version":"6.8.1","score":5,"title":"Minor tweak","text":"Great devices with sleek design.  Installing is pretty easy for someone with basic knowledge.  Support and videos are available for those who need help.  The app is simple to use with sophisticated control.  I would suggest a minor change.  A scene can be designed by the user.  Any particular scene can be turned on with the tap of the icon, but you cannot turn off the scene the same way. You must go in and turn off each individual device.  Can this not be changed with a simple app update?  Thanks","updated":"2020-05-05T05:27:21-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2338193220","userName":"tianata","userUrl":"https://itunes.apple.com/us/reviews/id14524133","version":"5.1.1","score":3,"title":"Lag improved but app has lost relevance due to device limitation","text":"The app does appear to start up a bit faster since last year however it is still much slower than Apple’s home app. In addition, the Lutron app is only limited to the account under which a specific bridge is used. I have reached my 50 Lutron devices limit and if i get another bridge i can’t use both under the same app since each bridge has a different email associated and i would have to log out of one to use the other. I would have to rely on the Apple Home app to aggregate all homekit or all Lutron bridges for that matter which defeats the purpose of using this app.","updated":"2018-03-23T10:57:32-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2061147189","userName":"Ecsdesignsvfx","userUrl":"https://itunes.apple.com/us/reviews/id172823526","version":"5.1.1","score":3,"title":"Nice app - little finicky","text":"The app itself is really well done. Setup is a breeze, adding devices and scenes is intuitive and quick. Widget is especially a nice touch. But, it doesn’t seem to respect your high/low trim settings.  I very frequently end up in an unstable flickering state with the lights switching scenes, though it’s impossible to get them to flicker using the wall mount.\n\nUpdate. Since using the app I’m dealing with endless instability via wall panel AND app. I used these for weeks with no prob before getting app/bridge. Sometimes lights flashing no matter what I hit on Wall Panel and need to use app, sometimes vice versa, and no perceivable rhyme or reason in any of the cases. Rather frustrating","updated":"2018-01-05T19:18:02-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1724858448","userName":"PeteP90027","userUrl":"https://itunes.apple.com/us/reviews/id37254533","version":"4.2","score":3,"title":"Decent but can be better","text":"This app works fine in most circumstances but it has some drawbacks and room for improvement. Specifically, the programming for scenes and schedules is a bit clunky.  Also, it does a very poor job of handling more than one smart bride when you have two residences.  You must have two separate accounts which is a pain and you can't use a different photo on each account (it is saved on your phone not in the account profile). It should be possible to easily toggle back and forth between the two. Most other automation apps can handle this.","updated":"2017-08-12T10:47:03-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6263243972","userName":"Tax Able","userUrl":"https://itunes.apple.com/us/reviews/id130562901","version":"7.1.0","score":5,"title":"Does what it should and does it well","text":"This app allows you to quickly do what you’re trying to do in app. Adding new devices is uneventful. You can easily add “timers” that are pegged to sunrise and sunset so your lights aren’t turning on at 5 PM when it doesn’t get dark until 8 in summer. The whole family can turn on and dim lights from their ipad. We started out with four caseta switches and nearly have the entire house converted because it’s such a great convenience!","updated":"2020-07-31T05:46:31-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1811151607","userName":"SimpleEU","userUrl":"https://itunes.apple.com/us/reviews/id109062950","version":"5.0","score":1,"title":"Cannot integrate with Apple HomeKit /Siri","text":"This version has problem integrating with Apple HomeKit/Siri. I update to IOS 11 and update this app, resulting HomeKit could not control all the light switches. I can only control light switches using the Lutron app. \n\nI called their support team multiple times follow their instructions to sign out and sign in to iCloud, clear all Setting on the Lutron bridge etc.  And now this become worst!!!  After I clear the setting in the bridge, this Lutron apps can no longer add or integrates with HomeKit. It was very clear the app itself is the problem. But their support wasted my 5 days troubleshooting  for them.  I really wonder How did this app pass the Lutron QA team to release for update ?   Did they not do the test before releasing this app??","updated":"2017-09-26T08:12:47-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"4968735893","userName":"Oneside","userUrl":"https://itunes.apple.com/us/reviews/id173374317","version":"6.5.4","score":4,"title":"Great app!","text":"Really enjoy the app overall. It’s intuitive and easy to control all smart devices. Setting up scenes is a breeze. I do wish there was more customization when it comes to dimming lights. Phillips Hue has a way to adjust the amount of time it takes the lights to change the brightness, and it’s great. Instead, in order to adjust brightness over the evening, I’ve had to set up several scenes which can be frustrating if for some reason you don’t want the lights to be dimming automatically. Other than that, great app!","updated":"2019-10-18T12:30:11-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2999487198","userName":"fdbck42","userUrl":"https://itunes.apple.com/us/reviews/id102084707","version":"5.6.2","score":3,"title":"Not bad, could be better","text":"It would be nice to be able to control the dimming speed turning lights on and off. My wife feels that it takes too long right now.\n\nIve hit the 50 item limit and can see another 10 devices that would be nice to have. It would be good if the limit were increased, maybe a pro2hub, or if seamless multi hub support worked in the app without signing in and out. No, I’m not going to switch to ra2. I refuse to ever be stuck calling out someone to manage my system.\n\nAlexa support is wonky. Its much more sensitive to phrasing than siri and seems to require long drawn out names for lights when siri seems to just figure it out with natural phrasing. i don’t know if that has to do with lutron or alexa though. I stopped using alexa because of it.\n\nLove the watch support. I too would like to see multi user geofencing, so its not nagging me to turn off the lights even though my wife is home and she also has the app installed.","updated":"2018-07-31T22:50:18-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"7571905918","userName":"GingerandIsaiah","userUrl":"https://itunes.apple.com/us/reviews/id389362192","version":"7.9.0","score":2,"title":"App no longer works for iOS 14","text":"The app worked fine until my phone automatically upgraded, and now I can’t add any new devices. I tried using my husbands phone who also has ios14 and the same thing happens . Every time I click on add new device, it goes to the screen to select which device you want to add, and then immediately comes the error message which says an error has occurred and to try again later. Please fix the app to work with iOS 14 so I can add more dimmers to my smart home. I can’t even link them to Alexa because I can’t add them to the Lutron app first. 😔","updated":"2021-07-13T07:19:16-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1888903358","userName":"Jguy432","userUrl":"https://itunes.apple.com/us/reviews/id38818766","version":"5.0","score":3,"title":"Meh","text":"Mostly great app, however it would be great to see the smart Away feature work with HomeKit so that it can be set with the “everyone leaves the home” option. Right now when one person leaves it can trigger smart away when people are still in the house because this app triggers the smart away feature based on one person leaving and can’t track multiple people in the home. If scenes could be trigger to correspond to HomeKit scenes, that would fix the problem. Another way to do it would be to allow it to trigger from IFTTT, but Smart Away won’t trigger from IFTTT.","updated":"2017-10-31T20:16:11-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"7160860279","userName":"jwhit6","userUrl":"https://itunes.apple.com/us/reviews/id37508883","version":"7.6.0","score":3,"title":"Nice Looking and Frustrating","text":"It’s a beautiful app and once you add your devices it’s fairly easy to navigate it. However it’s beauty and simplicity stop there. The interface is non-standard.  If you want to edit a name of a room or modify a device it is a guessing game. I wonder if UX designers and developers believe they’re being clever but forget that with the dozens of other apps, no one wants to a non-standard experience where they have to figure out how to do these things the few times a year it’s required.","updated":"2021-03-29T20:24:18-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1802247778","userName":"HanSchlamppo","userUrl":"https://itunes.apple.com/us/reviews/id36995378","version":"5.0","score":2,"title":"No Multi-Home Yet","text":"I got the email announcing the new 5.0 version of the app. Nice improvements. It is great that you guys are continuing to make this better. \n\nBut, why have you not built multi-home/multi-bridge into the app yet? If I have a vacation home or a home where I want to use two different bridges it is not possible with Lutron. Unless, of course, you log out and log back into another account. This is a big pain and defeats the purpose of location based settings. I understand it might be hard to implement but every other serious home automation platform supports it today. HomeKit, Nest, etc. Please focus on this. You guys are way behind here.","updated":"2017-09-21T10:48:44-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1947104311","userName":"de-Anna","userUrl":"https://itunes.apple.com/us/reviews/id196813619","version":"5.1","score":4,"title":"Does most everything","text":"The app is responsive and easy to use, if a bit basic. I waited for a year in hopes of getting multi-user geofencing, but now HomeKit in iOS 11 does it, so I can trigger home and away off that instead.\n\nThe room/scene UI improvements are intuitive and align better with HomeKit, but I wasn't really itching for that since I use Echos for most of the control. \n\nHappy to see the picos able to be hidden, but prior to that, they were already listed below the main switches so it wasn’t a huge hassle.","updated":"2017-11-24T22:39:11-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1944288576","userName":"Thalagyrt","userUrl":"https://itunes.apple.com/us/reviews/id29603380","version":"5.1","score":4,"title":"Generally good, buggy Alexa integration","text":"The app works wonderfully. However, as of recently, the Alexa integration no longer registers devices with Alexa as light switches but instead outlets it seems. I just added four new switches to my house only to find that Alexa will not recognize them as lights in smart groups, and thus won’t turn them on when I ask it to turn the lights on. The old switches added last month all function as lights. Hope you guys can fix this quirk. Caseta is a wonderful system otherwise!","updated":"2017-11-23T19:45:39-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"7849998065","userName":"Jlynchmft","userUrl":"https://itunes.apple.com/us/reviews/id210030488","version":"7.11.0","score":3,"title":"App is too smart for its own good.","text":"Everything use to work beautifully. Simple, easy. But now, the app likes to rename my lights.  If I edit them back to the simple name I had, the app changes it back.  When I use to say (with SmartThings/Alexa) “turn on stairs”, now I have to say “turn on living room stairs spot lights”. If I edit the name, it no longer works. I get that this might be a necessary feature for those with multiple houses/ big mansions, but I just have simple stairs. Can you guys make it simple again?","updated":"2021-09-27T01:35:27-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"7399710486","userName":"Jajmb","userUrl":"https://itunes.apple.com/us/reviews/id158308057","version":"7.8.1","score":5,"title":"Love Lutron","text":"I have been using the app for about 4 years and absolutely love it!\nI have been adding stuff over the years and currently have 49 devices connected. I have Serena shades, dimmers, fan controls and the new extender allowed me to put more devices in other areas.\nThe interface is super stable and the app has been great. I have it all integrated with the Google/Nest ecosystem and it has been flawless.\nThanks Lutron!","updated":"2021-05-28T14:29:12-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2029325235","userName":"plesae fix","userUrl":"https://itunes.apple.com/us/reviews/id326995995","version":"5.1.1","score":4,"title":"As of now.","text":"As of now, everything works flawless and to my expectations. Even better than my ecobee 3 thermostat app. I use HomeKit and it works great. But I want to be able to download the app onto our iPad I have the app connected to my iPhone. But when I go to download the app onto our home iPad it tells me that I have to purchase the app is this true? If so why? I noticed that with other versions of your apps to? I did not have to do this when I installed the switch and downloaded the app. \nThanks \nTracy.","updated":"2017-12-26T07:50:42-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5355390789","userName":"ThaWingedCow","userUrl":"https://itunes.apple.com/us/reviews/id15460844","version":"6.6.2","score":3,"title":"No Wake-up lights function","text":"The dimmer itself has such a nice fade-up, fade-down when you activate the lights - it’s bananas that wake-up lights - a slow fade-up over a set period of time - can’t be scheduled easily in the app. Instead I’ve had to make 10 distinct schedules in 5 min intervals to achieve a semi-functional result. Very frustrating as I can’t stop the cycle if I get up before it’s finished and I can’t easily flip it off if I don’t want it on a holiday morning. Please add this feature!","updated":"2020-01-03T05:16:52-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6858600808","userName":"BZ ;-)","userUrl":"https://itunes.apple.com/us/reviews/id27054750","version":"7.5.1","score":4,"title":"Good app and product (with one critique)","text":"This product has been a great solution for creating smart lights in my home! My older home doesn’t have neutral wires for the building lights and this is great solution. My only critique is that the lights don’t remember their last dim setting. Would love to see this implemented. Also, I would love there to be a setting were lights would automatically set to dimmer level in the evening. Wemo’s dimmers have this feature","updated":"2021-01-11T14:10:17-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6064086944","userName":"Jc8892","userUrl":"https://itunes.apple.com/us/reviews/id243732803","version":"7.0.1","score":5,"title":"Top-Notch app for a top-notch company","text":"Everything Lutron makes is just so polished. It costs a little more but with that you get a superior product with outstanding us-based support. I cannot sing praises of this company enough. Enough with fiddling around with the old imported junk and now I deal with Lutron products developed by people who know what they are doing and build it with pride. Simply amazing, amazing, amazing.","updated":"2020-06-11T11:52:48-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"7785144326","userName":"stealurgirl805","userUrl":"https://itunes.apple.com/us/reviews/id611171395","version":"7.11.0","score":1,"title":"Worse than dog water","text":"Multiple locations their equipment has failed, support doesn’t have a clue what the status lights mean when an error occurs and always defaults to sending a support file which never has an answer to either it’s always default the switch or repeater and when that doesn’t work send in the devices. Complete waste of time and has very slim to none patches that help fix the problem. If you like to waste your time and money I’d definitely go with these guys cause they really know how to do both effectively. Completely an appalling service and product.","updated":"2021-09-08T11:28:58-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1819554496","userName":"Maevick","userUrl":"https://itunes.apple.com/us/reviews/id372526310","version":"5.0","score":2,"title":"Downgrade in Usability","text":"For a company that focuses on modern day home streamlining and simplicity, it baffles me that they just don't understand usability. This is the only advantage you have over other products. It's the reason why people buy your products in the first place. If it becomes more annoying to use an app over getting up and adjusting thermostat temperature, then there is no reason to use this in the first place.\n\nPlease understand: The less taps/digging users have to go through, the better. That's it. It's really not much harder than this when making a control panel.\n\nLatest update is a huge downgrade over the previous 2 taps to change temperature. If anything, it should've been simplified into one single tap, but now it's worst.\n\nFunny part is I was just about to swap all my switches in my house to Lutron switches, but until they show they understand usability, I'll keep an eye on alternative solutions.","updated":"2017-09-30T15:50:24-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"7053882216","userName":"n0n_0perational","userUrl":"https://itunes.apple.com/us/reviews/id11243145","version":"7.6.0","score":5,"title":"UPDATE: Fantastic Customer Support","text":"Love this ecosystem, but after 2 day of using it I find myself frustrated that I have to dismiss a “what’s new” popup every time I open the app! Rid me of this and it would easily be a 5 star experience!\n\nUPDATE - The pop up issue was immediate addressed and resolved over the weekend. What a great show of support by Lutron! Got more smart switches in the way!! As promised - 5 Stars!","updated":"2021-03-01T11:13:46-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6571070688","userName":"ldwese","userUrl":"https://itunes.apple.com/us/reviews/id39584659","version":"7.3.1","score":2,"title":"Only connects when on same network?!","text":"Was simple to setup the Caseta system. Love that it supports multiple houses now. When it works, it works great: quick responses by devices, simply programming, astronomical time clock, all good features. However, the app cannot always connect to the devices. And it can ONLY connect when you’re on the same Wi-Fi network as the device hub. Completely defeats the purpose! I want to be able to control my lights when I’m home AND when I’m NOT home. Very disappointing performance & reliability.","updated":"2020-10-24T19:58:10-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2613873998","userName":"Superruco","userUrl":"https://itunes.apple.com/us/reviews/id85543020","version":"5.6","score":4,"title":"Works good... but","text":"This devices work fine and i love them, actually i like to install these switches at my costumers houses, The only problem i have with its that u can only install one repeater in the entire house, sometimes the cube its too far o so many walls in between or switch inside cabinets and cant reach signal from cube, specially in old houses that want to updateor add  a system, is there another way to get a stronger signal from cube?... other than that great app and devices","updated":"2018-05-29T13:55:49-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6753790418","userName":"dakume","userUrl":"https://itunes.apple.com/us/reviews/id11579807","version":"7.4.3","score":4,"title":"Great system","text":"I love the ability to control everything from my phone.  A few improvements. I think the scenes should be a toggle when you click on it.  It's weird that I have to create a whole other scene just to turn off the scene I created.  Also I think it's weird that I can't put a scene in a schedule.  I have to recreate that entire light setup a second time.  Otherwise love the app","updated":"2020-12-14T14:36:57-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"7242031146","userName":"Aphilions","userUrl":"https://itunes.apple.com/us/reviews/id42467760","version":"7.7.1","score":3,"title":"The schedule feature is not working","text":"The schedule feature does not seem to be working at all. When I had have them set up to turn on at sunset and turn off at sunrise, they turn on too early when it’s still sunny and bright. I deleted all the schedule and added new schedules to have them turn on at 7:30 pm. However, they  do not function according to the updated schedule. They still turn on at 4:00 pm.","updated":"2021-04-19T20:02:36-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1851726705","userName":"Toonad235","userUrl":"https://itunes.apple.com/us/reviews/id173304374","version":"5.0","score":5,"title":"Excellent App","text":"I love the new update, clean, easy the follow, very intuitive. Thank you Lutron! 5 stars\n\nI have a couple of suggestions:\n1. Could you add another tab called “Rooms” and subtab to be able to select a room and each room tab to list all the devices present in that room.\n2. Could you add the ability of users to take a picture of the surroundings and upload it the respective room so when the user picks the room the picture is in the background.\n\nThank you,\n\nPrevious Review\nI would have given the app 5 starts if wasn't for the almost weekly server outage. I have many caseta switches and it is annoying when I cannot connect to them while on vacation. The app is very clean and excellent layout.","updated":"2017-10-15T19:07:37-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2115484627","userName":"IFTTT - Smarthome user","userUrl":"https://itunes.apple.com/us/reviews/id207561579","version":"5.1.1","score":3,"title":"Great!! But IFTTT Trigger Integration Please","text":"This app is amazing, the devices are easy to set up, and the response time from when you command a scene or device to when you see something happen is nearly instantaneous.\n\nIFTTT triggers please - My only complaint and it’s a big one for my specific smarthome set up is that you cannot use the Lutron switches as triggers (if “this”) to control other devices. You can only have your Lutron system respond to commands made by other devices including competing switch provider....","updated":"2018-01-22T08:19:20-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5931376142","userName":"ShaunItunes","userUrl":"https://itunes.apple.com/us/reviews/id563056099","version":"6.8.2","score":4,"title":"Great improvements","text":"Please add pico remotes to homekit. \n\nNew updates are great regarding smart away and works with nest. It would be nice with a few fine tunes. Like not having to relay on phone location or nest to automatically set smart away. So you can use it at night when you are home. \nAlso be nice to be able to select individual cameras to turn on select lights. So the garage cam only turns on garage lights etc.","updated":"2020-05-11T05:11:47-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3948308378","userName":"Jay.mey","userUrl":"https://itunes.apple.com/us/reviews/id201850994","version":"6.5.1","score":5,"title":"Customer support is great.","text":"I spent two hours trying to get a three switch light done. Finally called Customer Care and had it working with in minutes.  Should’ve done that from the start.   Was on hold for a brief moment until someone came on.  Not only are their products amazingly great but their support is just as good.  It’s no wonder they are dominating the industry.","updated":"2019-03-30T15:11:37-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1963289793","userName":"Group456","userUrl":"https://itunes.apple.com/us/reviews/id11534336","version":"5.1.1","score":5,"title":"New updated interface is a major upgrade!","text":"Gets expensive but these are the Best on the market for sure. \n\nWorks as advertised, currently have over 20 switches installed. The arriving/leaving setting is great! I have it linked with my Xfinity Home app for added security features an having lutron link flawlessly with apples HomeKit is also a plus. Completely satisfied customer.","updated":"2017-12-01T15:18:23-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6044585793","userName":"MikeyPD","userUrl":"https://itunes.apple.com/us/reviews/id31231699","version":"7.0.1","score":3,"title":"Best smart switches / really bad app.","text":"I gave this 3 stars only because Lutron Caseta is the best smart switch on the market. It works with HomeKit and every other platform. \n\nLuton Caseta Hardware: 5 stars. \nLutron Caseta App: 1 star. \n\nThis app, is pretty bad. Bad design and it’s slow. \n\nBut the beauty of Caseta, is that you can use the apple Home app to control all of these devices. That works amazingly well!\n\nSo you only need to use this app once when you install a new device. After that, close it and forget about it. Use the home app and enjoy the best smart switch platform on the market. \n\nIf they redesign the app someday, it’d be nice. I wonder if this ever scares away potential customers. Who knows. Their hardware engineers are much more talented than the UX designers.","updated":"2020-06-06T17:26:36-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1824356542","userName":"Ermd25","userUrl":"https://itunes.apple.com/us/reviews/id281675203","version":"5.0","score":1,"title":"Color scheme is beyond depressing","text":"I don’t understand why the changes to the layout that were made —which frankly are just changes, not better — had to be made at the cost of turning a beautiful appearing app into something so lifeless. The black background and the vibrant flowers that were part of the app originally were a joy to look at. How can anyone think this app is more visually appealing?  I am sad every time I have to use this now, it’s like losing the ability to see in color. I’m even more disheartened when I think about the fact that someone actually chose this lack of color scheme.","updated":"2017-10-03T02:50:26-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2191027436","userName":"VinGrif","userUrl":"https://itunes.apple.com/us/reviews/id105608876","version":"5.1.1","score":5,"title":"Light timers","text":"This app is great.  It is formatted differently than what I am used to seeing.  If you are controlling lights that you want to turn on and off you have to set 2 events.  One to turn them on, and one to turn them off.   \n\nOnce you get the hang of that you are off to the races!!\n\nMy wife and I plan on adding more devices into our smart home to use with this app.","updated":"2018-02-10T05:33:34-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1928480648","userName":"majorgearhead","userUrl":"https://itunes.apple.com/us/reviews/id41139483","version":"5.1","score":5,"title":"Great improvements just need one more thing","text":"Update:  Gave it one more star.  Developer is REALLY responsive.  Makes this an all around great product!\n\nGreat improvements in naming and the ability to move rooms around. One more thing, can you give us the ability to move a device within a room. Otherwise it is solid and the switches are fantastic.","updated":"2017-11-17T14:19:30-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5279154700","userName":"dCkO","userUrl":"https://itunes.apple.com/us/reviews/id147793944","version":"6.6.2","score":1,"title":"Disappointed","text":"Honestly I’m disappointed with the product. For the cost, there are so many lighting options out there. Basic stuff like timers set for “sunset” and “sunrise” don’t work. It’s hit or miss if the lights are on when I get home.\n\nUPDATE: Why require location services - we’re capable of providing location to you without that being a sunrise/sunset requirement and it still does not work. If you spent more money on proper app development rather than whatever you pay for data aggregation (and probably sell my privacy) we’d have a functional product that still costs more than HUE. Meh, I wish I would have skipped buying the whole light kit and went with a better cheaper option. Sad.\n\nUPDATE 2:\nYour response does not address my concern, nor does it address non-functional features. Fix your horrible UI and broken features.","updated":"2019-12-16T02:44:54-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3466871593","userName":"sjsassoc","userUrl":"https://itunes.apple.com/us/reviews/id37380653","version":"6.2.0","score":2,"title":"Great BUT not built for users","text":"Usually works well - very well.  But sorely in need of a usability review:\nEach programming of a device requires 2 schedules, an on and an off.  This leaves you with a long list of schedules that appear in no discernible order.  Need folders and ability to organize / group schedules.\nThe pencil icon used for editing a schedule is unreasonably small - every time I go to edit I inadvertently trigger the schedule.\nAnd more.\nNow version 6.2 has ability to render icons in color.  First, big deal.  Second, how - there are no instructions.","updated":"2018-11-27T09:05:19-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3170034835","userName":"BartFurglar","userUrl":"https://itunes.apple.com/us/reviews/id25228576","version":"6.0.0","score":5,"title":"Stupendous","text":"Upgraded my whole home with Caesta over a year ago. This was a great decision. However, now that I’m accustomed I can never go back.\n\nThe widget allow me to have quick scene control at all times. The automation and integration with other devices, such as Nest and Alexa, have made it so I often go weeks without actually touching a light switch in the traditional manner.","updated":"2018-09-08T22:30:47-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1897608032","userName":"Djdanny1217","userUrl":"https://itunes.apple.com/us/reviews/id16684497","version":"5.0","score":2,"title":"Not a fan of the new app","text":"Echoing many other reviews, I am definitely not a fan of the new UI. Before all the lights/switches were in one section and I could easily turn on and off things without any scrolling. Now the app makes it so you have a section for each room and doesn't give the option of putting everything under one main section. Sometimes less complicated is better... please revert back to the old UI of having all the switches and devices just listed under a My Home section","updated":"2017-11-04T14:00:19-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"4104749525","userName":"gogetrealremote","userUrl":"https://itunes.apple.com/us/reviews/id183533400","version":"6.5.1","score":1,"title":"Poor quality","text":"This app doesn’t work well at all. After buying the very expensive $110 bridge I can connect bridge to my WiFi and the remote to the app but cannot figure out how to control the lights with the remote on app - no directions makes life hard - directions that came with lights refer to app once downloaded - should be step by step - nope... no help at all. Doesn’t look like the remote on the app offers much more of a difference then the actual remote that came with the lights- Life is much easier and way cheaper if just using the remote that came with the lights.","updated":"2019-05-05T07:50:33-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6832277027","userName":"Strugglebrother","userUrl":"https://itunes.apple.com/us/reviews/id110538337","version":"7.5.1","score":5,"title":"Works great","text":"One of the few smart home apps that always seem to work together with Siri.\n\nThat’s more than could be said about IKEA and many other smart home apps that can barely connect to a lamp most of the time.\n\nMaybe the startup time of the Lutron app could be improved, my only feedback.","updated":"2021-01-04T19:47:31-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"7469700708","userName":"Jd4a25","userUrl":"https://itunes.apple.com/us/reviews/id539826008","version":"7.9.0","score":1,"title":"Doesn't connect","text":"I connected the bridge and it went through it's firmware update fine. When I tried to connect a device - my outdoor garage light, which by the way, works fine with the four remote switches I have in my home, guest house and two cars - I get to the point where I hold the bottom button of the wall-mounted switch for 10 seconds until the LED begins to flash quickly and nothing else happens. The app just sits there. If I back out the app says \"finishing setup\" and that's it. No device is added.","updated":"2021-06-15T20:56:02-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6619011415","userName":"watr k9","userUrl":"https://itunes.apple.com/us/reviews/id109020809","version":"7.4.0","score":4,"title":"Update- Love the app-","text":"I was able to find the fix for the sunrise/sunset time discrepancy in the settings. As a new user, so far, I love the app. Would recommend at this time. Very convenient to be able to turn things off and on from the phone-especially when you go to bed and can’t remember if you left a light on in a detached garage!","updated":"2020-11-07T07:07:31-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1806461925","userName":"z0lo","userUrl":"https://itunes.apple.com/us/reviews/id24362973","version":"5.0","score":3,"title":"Miss some elements of old UI","text":"Miss the dark UI option. Miss being able to have my own pic as the background. The tabbed interface is not necessarily better. Adding rooms for an existing device is a bit confusing -  you have to edit the device. There is no high level menu for rooms. I do like the quick link to all lights that are on. Overall it's a decent update but it needs some further work. Bring back the dark theme please.","updated":"2017-09-23T19:14:37-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3290063449","userName":"ZacZacL","userUrl":"https://itunes.apple.com/us/reviews/id39039057","version":"6.0.1","score":3,"title":"A long way to go","text":"For some reason the team seems focused on making superficial improvements to the app instead of adding function, like conditional switching (ie: at 11pm, on switch only turns on the light dim) or long hold switching (long hold of on turns the light on full, or turns the whole room on). I really wish they would add functionality like that instead of allowing me to change the background photo on my app.","updated":"2018-10-11T09:30:03-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6448900307","userName":"LimeEgo","userUrl":"https://itunes.apple.com/us/reviews/id15155582","version":"7.2.1","score":5,"title":"Works all the time","text":"This may not be as full featured as some people want, but I love the app and Caseta because it works so well. The app always controls my lights and always works correctly. The system is not perfect, but in a world with so many flaky wireless things, this has been a really good system.","updated":"2020-09-20T05:05:19-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5320419744","userName":"Skanepagisf","userUrl":"https://itunes.apple.com/us/reviews/id462008059","version":"6.6.2","score":3,"title":"Nice solution to control your lamps but weak app support","text":"Nice solution to control your home light but the designer of the application doesn’t understand smart home. Who designed this and decided to use the phones location as the location of the home and no way to manually set the time zone where my home is?\nSo use schedules for turning lights on and off when traveling will not work.","updated":"2019-12-25T21:20:16-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2372535616","userName":"Goodfella37","userUrl":"https://itunes.apple.com/us/reviews/id110862027","version":"5.3","score":3,"title":"Time zone functionality","text":"Solid app. The one improvement is to add time zone support. You need to be able to set schedules in the time zone where your home is located, even if you are setting the schedule while you are traveling in a different time zone. I tried to set schedules for our home in NYC while traveling in Hawaii, and the only way to do it was to use schedules based on Hawaii time (which clearly was not relevant to the use case).","updated":"2018-04-01T15:18:03-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5229773438","userName":"Yes-Yes-Yes","userUrl":"https://itunes.apple.com/us/reviews/id5416941","version":"6.6.1","score":3,"title":"Watch app Needs fine grained light control","text":"Great start on the watch app. Disappointed this lacks the full range of dimming control you get with the iPhone app or the pick remote. 4 dimming levels (including full off and full on) are not enough. Please add the feature to select a light individually and control brightness with the watch wheel. \n\nthe iPhone app itself is great.","updated":"2019-12-03T12:35:05-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2360659442","userName":"ReZZeX","userUrl":"https://itunes.apple.com/us/reviews/id300852387","version":"5.3","score":5,"title":"This update is fast!","text":"This update really sped up the app launch time! I love that you can schedule lights to be turn on and off based on sunrise and sunset with the ability to define and offset (e.g. turn on lights at sunset + 15 minutes). I would love to see the interface further refined and cleaned up to make it easier to use and more modern looking.","updated":"2018-03-29T12:51:32-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"8001811119","userName":"NYNY212","userUrl":"https://itunes.apple.com/us/reviews/id202623477","version":"7.13.0","score":2,"title":"Crash Crash Crash","text":"The app worked great until the last update. Now, it crashes constantly and then freezes. Once that happens, there’s no rescuing it. I’ve had to delete the app and then reinstall it several times. I’m almost afraid to open it now. Instead, I’ve been controlling devices in my Alexa app. It’s wonkier and extra steps… but at least it isn’t freezing. Please fix whatever has changed.","updated":"2021-11-08T03:44:33-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2835453538","userName":"182Ryan","userUrl":"https://itunes.apple.com/us/reviews/id140694552","version":"5.6.1","score":1,"title":"Works but limited to a single controlling device!","text":"Got the bridge all connected to dimmer switches, setup account, but cannot login in on other devices with the account I setup. Reset everything and tried again, with no success on connecting multiple devices (phones/iPads). Called in to the tech support that according to Lutron’s website is available 24 hours 7 days a week. Found that they are only available during weekday business hours, (this is understandable just advertise as such) \nAll around disappointing","updated":"2018-07-04T06:53:16-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"7740804459","userName":"pleasedontmakemepickanickname","userUrl":"https://itunes.apple.com/us/reviews/id313373508","version":"7.11.0","score":4,"title":"Great system and good app, but...","text":"I've love my system and the app works great, but I wish the schedule feature allowed on/off settings. You have to create different schedules for off times, which is annoying to manage when trying to adjust for things like daylight savings time.","updated":"2021-08-27T07:30:06-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"7603974451","userName":"appstore buzz","userUrl":"https://itunes.apple.com/us/reviews/id23268991","version":"7.10.0","score":4,"title":"Devices don’t consistently connect","text":"I have many wall switches and plug-in switches and getting them to consistently connect was not happening. I spoke to support who walked me through resetting and reconnecting. It was also identified that a wireless extender was needed for some. I was able to eventually get the complete system working.","updated":"2021-07-21T21:58:58-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5087011189","userName":"RPMredline","userUrl":"https://itunes.apple.com/us/reviews/id36599221","version":"6.6.0","score":3,"title":"Some simple improvements would go a long way","text":"I just installed my numerous dimmer switches throughout our new home. Very easy to setup and install.\nOne oversight in the app (hopefully it’s fixed in next update), is that in ‘Schedules’ you can only set the TURN ON time, you can’t set the lights to TURN OFF. So tour lights stay on all night if they are on a schedule.","updated":"2019-11-04T15:33:18-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3710718380","userName":"yetinut","userUrl":"https://itunes.apple.com/us/reviews/id36990976","version":"6.3.0","score":5,"title":"Superb App","text":"I have been using this app (and its updates) for a few years to control more than 30 Lutron switches/dimmers in my home.  From controlling my circulation pumps to driveway lights to interfacing with Nest protect, it is really impressive. I look forward to continued improvements and functionality.  Truly an amazing product.","updated":"2019-01-29T18:43:07-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6697340383","userName":"Franco Gri","userUrl":"https://itunes.apple.com/us/reviews/id42615234","version":"7.4.2","score":5,"title":"Great starter home light kit","text":"I have been using caseta light dimmers and Blinds for 5 years. Tech support had been great and even replaced a blind for me after it feel while changing the battery’s. With that said. So new features I’d love to see would be \n\nsystem back up \nCustom UI \nHome Screen Widgets \nLighting affects \nRecommend Smart scenes\n\nThanks for everyone at Lutron for the amazing customer service. P.s for those complaining about limited stuff with a Caseta product maybe you should think about their premium products that offer 15x more I’d say then Caseta.","updated":"2020-11-28T19:00:56-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6631643837","userName":"RS_500","userUrl":"https://itunes.apple.com/us/reviews/id522408784","version":"7.4.1","score":2,"title":"Barebones and Buggy","text":"The app is very barebones in functionality. That’s ok because I’d rather use the Home app in iOS to control my lights anyways. However, there is a glaring bug that I noticed: adding a device to an existing HomeKit room seems to be impossible. Even though the app lists all the rooms in HomeKit, if I select one it says I must create a new room as that room already exists. Why is that a requirement? Makes no sense.","updated":"2020-11-10T18:59:58-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2715469065","userName":"Sami_Philly_Philly","userUrl":"https://itunes.apple.com/us/reviews/id560559898","version":"5.6","score":2,"title":"Lights turned on by themselves  couple of times. Good product but lacks key features like log","text":"Good product have using for 8 months...but needs updates!!!\n\nRecently we had our lights turned ON by itself  and it freaked my wife out!!\n\nNeed one additional functionality in the app to get a log of when what light were turned on and off and which mobile device was used or manually turned on/off.","updated":"2018-06-17T20:12:12-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1935144164","userName":"EDHWoman","userUrl":"https://itunes.apple.com/us/reviews/id198669576","version":"5.1","score":5,"title":"Very Convenient","text":"I started using the app sometime this summer.  The interface is confusing at first but I like being able to set different scenarios for my lights and also for having the ability to control the lights from afar.  Good job!  Please keep up the support!","updated":"2017-11-20T08:03:24-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5424483859","userName":"C Settles","userUrl":"https://itunes.apple.com/us/reviews/id101580346","version":"6.6.2","score":5,"title":"Integration with home security","text":"I have the ring home security.  It would be a nice feature to integrate it with the alarm system so when the smoke detector goes off it turns on all the lights.  Maybe this is something to integrate with ring and/or Alexa.","updated":"2020-01-19T12:22:13-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5366380620","userName":"Edbro29","userUrl":"https://itunes.apple.com/us/reviews/id136658507","version":"6.6.2","score":5,"title":"Problem Solved - App stopped working","text":"The app completely stopped working for me, it won’t even load and Alexa can’t turn the lights on nor off anymore.\n\n- Edit\n\nI power cycled the bridge and everything went back to normal.","updated":"2020-01-05T17:55:31-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6240982802","userName":"jvasko","userUrl":"https://itunes.apple.com/us/reviews/id39215017","version":"7.1.0","score":3,"title":"UX Needs Work","text":"When setting up a dimmer there’s no indication that the dimmer should be connected before the pico remote. Also you appear to be at the last step of set up for a device but there’s still more to do. You have to tap in further. Works well once set up but clunky as were the printed instructions.","updated":"2020-07-25T10:17:16-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"7822757055","userName":"chalfant19","userUrl":"https://itunes.apple.com/us/reviews/id612465355","version":"7.11.0","score":3,"title":"App stopped working","text":"When I open the app now it just has the “thinking spinning icon” and won’t react. I can’t turn light on or off, add new schedules, or even go into the settings. No update is offered. I tried deleting the app and reinstalling it but to no avail, and now all my schedules are gone and I can’t put them back in.","updated":"2021-09-19T06:54:38-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6081248211","userName":"sabroso26","userUrl":"https://itunes.apple.com/us/reviews/id32047065","version":"7.0.1","score":1,"title":"Not ideal when loses power to home","text":"I have had several brown outs at my home and it is annoying that I have to re-sync my Lutron devices! Would not be so bad, but I have to sign out, in-link my account, and then try 4 or 5 times to re-connect it to my google home assistant. I thought it was my google being temperamental, but this has happened to a few other friends using either Alexa or Google. What’s up Lutron? Please fix this!","updated":"2020-06-15T20:29:03-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1969220332","userName":"damoney","userUrl":"https://itunes.apple.com/us/reviews/id26488361","version":"5.1.1","score":5,"title":"Good app, great service.","text":"Not everything is perfect but I have had no problems with the basic programming. I had a little issue with the app and I reached out to customer service and they were very responsive and helped me fix it pretty quickly!","updated":"2017-12-03T22:37:33-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"7245053965","userName":"hunny boo boo<3","userUrl":"https://itunes.apple.com/us/reviews/id42862670","version":"7.7.1","score":3,"title":"Underwhelming","text":"Bought the bridge to go along with some lutron switches I had from an old job that were RF switches... got everything setup and found out the vive switches I had aren’t compatible with the bridge but the bridge knows their signal. The app even lets you know it recognizes the device but it doesn’t allow it to be added. Strictly caseta switches","updated":"2021-04-20T15:32:35-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6014826792","userName":"Paid by the hour","userUrl":"https://itunes.apple.com/us/reviews/id135527339","version":"7.0.1","score":3,"title":"Would be so much better if Siri worked with scenes","text":"Being able to create scene in which lights dim and Sonos Amp (older version) plays an Internet radio station is a capability I can’t find anywhere else, and it’s not in Apple Home Kit. Thanks for providing this! But it would be so much better if I could use Siri to start my Lutron app scenes!","updated":"2020-05-30T12:48:23-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2081911702","userName":"Sd ok","userUrl":"https://itunes.apple.com/us/reviews/id25615402","version":"5.1.1","score":5,"title":"There were problems for awhile, but all fixed nowis broken","text":"The app is now back to amazing.  This app works perfectly.  New devices are easy to integrate and the functionality is terrific.\n\nLike the best technology, this system is simple and it works every time.","updated":"2018-01-12T06:51:16-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"8131503393","userName":"bblluu","userUrl":"https://itunes.apple.com/us/reviews/id15061647","version":"21.6.2","score":1,"title":"Worked great until recently….widgets stopped showing up","text":"Have had the system for years with zero problems. Recently, none of my widgets will load any more and the app has become slow as molasses to load. Sometimes it doesn’t work at all and has become very unreliable. SUPER disappointed…..I have 2 bridges and tons of dimmers (I’m maxed out), so a lot invested in something that has has taken a very wrong turn. FIX THIS APP!","updated":"2021-12-14T21:37:16-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3007911103","userName":"efgeileen","userUrl":"https://itunes.apple.com/us/reviews/id336122251","version":"5.6.2","score":4,"title":"Push notifications?","text":"The app is pretty decent. It would be great if there was an option to get notification at to when the lights go on and off. If there is a way to enable those I haven’t found them, so let me know. If there is not a way then can you creat that option? Thanks!","updated":"2018-08-02T15:24:31-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3461103725","userName":"galenmd","userUrl":"https://itunes.apple.com/us/reviews/id3748745","version":"6.2.0","score":4,"title":"Not too bad","text":"I love the app, and love the Caseta system even more. \nOne thing I would like is the ability to sort devices. They are currently in the order I programmed them. I would like to either order them any way I want (maybe by my personal use or by location), or at least, alphabetical.","updated":"2018-11-25T19:22:36-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5174523749","userName":"DW11411","userUrl":"https://itunes.apple.com/us/reviews/id304838617","version":"6.6.1","score":3,"title":"Update renamed most devices","text":"Just finished setting up my home last week. Had scenes and schedules all set. This latest update renamed most of my devices. I have no clue what’s what now! Scenes still work but I can’t add new ones until I figure out where these devices are. My garage suddenly has a lot of Caseta devices. LOL. Just an irritation.","updated":"2019-11-20T16:09:53-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2337110498","userName":"Smithcinema","userUrl":"https://itunes.apple.com/us/reviews/id42135731","version":"5.1.1","score":5,"title":"Now best lighting on market","text":"Now with the iPad app these switches come a long way and a amazing system I have the limit 50 of them wish I could add more hopefully they will expand it in the future !! Best home innovation out amazing system!! Highly recommend","updated":"2018-03-23T04:57:04-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"4875904666","userName":"dandamanarama","userUrl":"https://itunes.apple.com/us/reviews/id31883512","version":"6.5.4","score":4,"title":"Why no lights off time for schedule?","text":"Love the schedules and ease of operation.\nBut can’t understand why there is no option for ending your light schedule. I know, complaining I have to manually turn them off sounds lame. But hey, I paid for this operation (I thought).\n\nOther than this problem, they are great.","updated":"2019-10-02T19:13:52-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5434420633","userName":"Nick Bevard","userUrl":"https://itunes.apple.com/us/reviews/id1125166977","version":"6.6.2","score":3,"title":"My lights turn off when I leave but my spouse is home","text":"It would be great if the Lutron app could recognize if someone else is at a home for the geofencing... I leave for work while my spouse is still home and all the lights turn off when I leave... a fix for this and it would be 5 stars!!!!","updated":"2020-01-22T03:20:01-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1820641721","userName":"Vacuatus","userUrl":"https://itunes.apple.com/us/reviews/id146884810","version":"5.0","score":2,"title":"Missing Features","text":"Can't control the speed of the \"turn off the house\" scene. Need 30 seconds to leave, lutron gives you 2 seconds.\n\nBought a special 4 button keypad that I wanted to control 4 scenes. It can only control 1 scene, which ruins everything for the wife. She now has to  have 4 of these things on her nightstand and I need 3. Same thing for living room. They need to make the 4 button unit do 4 things!","updated":"2017-10-01T05:26:14-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1849596640","userName":"Abner055","userUrl":"https://itunes.apple.com/us/reviews/id14113125","version":"5.0","score":3,"title":"Good But Needs Work!","text":"Haven't had any of the problems others have mentioned. \n\nHowever I would like to see more icons for scenes.\n\nThey also desperately need an iPad version where the screen can rotate to Landscape!\n\nI have a dedicated iPad for home control and using this app on it is pretty pathetic.\n\nUpdate:\n\nI appreciate that the app now works with iPads but hate the idea that we cannot arrange the order of Devices or Scenes, they are just in Alphabetical Order. Really really bad!\n\nNot really sure what order Schedules are in, but those too the order cannot be change. \n\nBut overall the system works good.","updated":"2017-10-14T20:04:21-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3396383828","userName":"JustBlessed106","userUrl":"https://itunes.apple.com/us/reviews/id458900551","version":"6.0.1","score":5,"title":"Great app, one question....","text":"Since day one this has been the most reliable HomeKit apps as well as devices.  I had my entire house re-wired all with Lutron (HK) dimmer switches. I only wish this app was capable of controlling ALL HomeKit devices. Is that at in all in any future plans? \nOtherwise great app. \nTHANKS.","updated":"2018-11-08T17:05:35-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6724205939","userName":"Garbene","userUrl":"https://itunes.apple.com/us/reviews/id18717766","version":"7.4.2","score":1,"title":"Locked out of account, password reset doesn’t work","text":"The Lutron app worked fine for about a year. I opened it up to add a dimmer last week and I’ve been unauthenticated, requiring me to sign in again. The “Forgot your password?” link/process appears to be broken. It indicates the email is a valid account, but no email is ever received. I’ve tried about 20 times now, checked my spam folder, nothing.","updated":"2020-12-06T08:46:47-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6945788619","userName":"ohana50","userUrl":"https://itunes.apple.com/us/reviews/id274471969","version":"7.5.1","score":2,"title":"IPhone application stopped working","text":"The loutron application stopped working on my iPhone and I cannot get it to work again, while the application that sits on my iPad works fine. I talked to a Loutron representative and he could not get my one light switch to pair with my app.  He said he is sending me a new switch, but for some reason I don’t think that’s going to resolve things.","updated":"2021-02-02T11:40:06-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6460292133","userName":"1929ster","userUrl":"https://itunes.apple.com/us/reviews/id167357379","version":"7.2.2","score":5,"title":"Easy to use and set up","text":"Easy to use and set up, I have numerous switches and dinners including a switch for operating my water shutoff device.  Would like more info on controlling my Ring Cameras and how to integrate.","updated":"2020-09-23T08:36:16-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6629728919","userName":"tonkinite","userUrl":"https://itunes.apple.com/us/reviews/id32136534","version":"7.4.1","score":2,"title":"Does the job, but little else","text":"The app and the hubs are reliable but very basic. Other products have more functionality, and when I ask for gradual dimming or other feature, Lutron says your smart app can do that (meaning HomeKit, SmartThings, etc.). Guess what, Lutron, YOU are supposed to be a smart app, only kinda dumb. Starting to regret buying into this system.","updated":"2020-11-10T07:05:30-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"7985977295","userName":"Carraguay","userUrl":"https://itunes.apple.com/us/reviews/id16764981","version":"7.13.0","score":2,"title":"Basic functionality missing","text":"Got a QSX system and was looking to use the Lutron app but it seems to be missing functionality from the Caseta app. For instance, I can’t figure out how to change the icons for loads. Right now, everything has a lightbulb icon (instead of a chandelier or sconce icon) - which makes it difficult to tell what is what.","updated":"2021-11-03T16:07:33-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5242808614","userName":"Steve iOS","userUrl":"https://itunes.apple.com/us/reviews/id27107442","version":"6.6.2","score":5,"title":"No longer works with Alexa","text":"Just updated the Lutron App for iOS and it no longer works with Alexa. Delinking and resetting the skill did not work.  Bridge is ok and still works with HomeKit.  Very upsetting given my whole house is eco’s and Casetta switches.","updated":"2019-12-06T21:47:38-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2443923818","userName":"Mr lobo","userUrl":"https://itunes.apple.com/us/reviews/id12694877","version":"5.5","score":5,"title":"Much better launch time now!","text":"Finally they fixed the slow launch problem.\nNow the app starts instantly and can actually control things!","updated":"2018-04-19T23:03:33-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2499589110","userName":"BottleRocket_","userUrl":"https://itunes.apple.com/us/reviews/id27862417","version":"5.5","score":4,"title":"Stopped Working After Update","text":"I have not been able to use my Lutron devices since this last update, at least not with the app. They work manually, but that’s it.\n\nUpdate: there seemed to be a conflict with Nest. I removed Lutron from Nest and things started to work as normal.","updated":"2018-05-03T05:17:14-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"4410972764","userName":"Bobcat038","userUrl":"https://itunes.apple.com/us/reviews/id210768267","version":"6.5.2","score":5,"title":"Works great","text":"Update: after working with AmpliFi finally got the app working. Now 5 stars.\n\nI put in a new router now the app won’t connect! Talked to both lutron and Amplifi and neither of them can fix. Would give zero stars if I could.","updated":"2019-07-04T12:42:47-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3163220211","userName":"Cheerioboy25","userUrl":"https://itunes.apple.com/us/reviews/id143795850","version":"6.0.0","score":5,"title":"🙌","text":"The app is great and Lutron products are solid. My few wishes now are that Lutron make controllable outlets, and also allow the pico remote to pair with the app for HomeKit functionality.\n\nAfter months now, Lutron products have been SOLID and worked great with HomeKit. Thanks devs","updated":"2018-09-07T04:21:51-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2189096905","userName":"Mangcat","userUrl":"https://itunes.apple.com/us/reviews/id190943397","version":"5.1.1","score":2,"title":"The idea is great","text":"I love the Lutron products in our home. The ability to program on/of as well as dimming has been lovely! Using the app to set up the schedule went very well. However, if I want to turn the lights on/off using the app as I’m sitting in my living room, the app doesn’t want to connect to the accessory. I do have fast enough internet to stream, so I’m not sure what’s going on.","updated":"2018-02-09T19:06:13-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6011193639","userName":"Knaras","userUrl":"https://itunes.apple.com/us/reviews/id322140688","version":"7.0.1","score":3,"title":"Needs Gradual Light Increase Over atoms","text":"This app would be amazing IF it could set a level of brightness to be illuminated over time, like imitating a sunrise or sunset. Right now you can set the level of brightness, but not increase or decrease it gradually, make that happen and you’ll have 5 stars.","updated":"2020-05-29T17:01:25-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6460286959","userName":"eab62871","userUrl":"https://itunes.apple.com/us/reviews/id104050614","version":"7.2.2","score":5,"title":"Broken on iOS 14","text":"App immediately crashes upon launch on iOS 14\n\n-update: increased score since fix was implemented. Lighting control works extremely reliably.","updated":"2020-09-23T08:34:36-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2305666828","userName":"JoshC2001","userUrl":"https://itunes.apple.com/us/reviews/id85433196","version":"5.1.1","score":2,"title":"Slooooooow","text":"App is way too slow to load.  Room names is annoying and you have to scroll and scroll and scroll if you have a few.  50 device limit should not count the pico remotes. It should be switches only.  I really want to buy more... but Lutron has capped my ability to do so through the 50 device limit.  That is money left on the table for you guys!","updated":"2018-03-14T09:09:18-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"7197951948","userName":"SrinivasReddyD","userUrl":"https://itunes.apple.com/us/reviews/id230571192","version":"7.7.0","score":3,"title":"Expensive switches and lacks features","text":"The switches are so expensive overall works very well. Lacks very important features with competitors name such as timer and auto shut off for certain time.  Hope they add these features.","updated":"2021-04-08T04:57:23-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2637496703","userName":"Jpfb","userUrl":"https://itunes.apple.com/us/reviews/id4330693","version":"5.6","score":5,"title":"Could be better","text":"Consistently shows lights off yet they are on.\n\nUpdated review: my lights were out of range and after getting a range extender (Lutron plug-in dimmer ), works perfectly. Updated to 5 stars.","updated":"2018-06-03T13:22:03-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"8084581497","userName":"Apaulo11","userUrl":"https://itunes.apple.com/us/reviews/id42584129","version":"21.6.1","score":4,"title":"Overall Great","text":"These have been very solid and reliable, especially through HomeKit. I just wish I could set on/off fades for a duration of time. e.g., turn on bedroom lights to 50% brightness over the span of 15 minutes.","updated":"2021-12-01T12:54:40-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6735094734","userName":"Bellini","userUrl":"https://itunes.apple.com/us/reviews/id117214655","version":"7.4.3","score":2,"title":"App doesn’t run unless phone nearby","text":"Until recently I would have given this a 5 star rating. However, now the Lutron app on my Apple Watch won’t run unless my iPhone is nearby. This makes the app on my watch useless.  I’ve re-installed the app on my phone and watch with no success. Hopefully Lutron will address this.","updated":"2020-12-09T11:35:38-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1818656818","userName":"cmfloyd","userUrl":"https://itunes.apple.com/us/reviews/id36601859","version":"5.0","score":4,"title":"Better, white background hard on eyes!","text":"Improved organization!\nWhite background is harsh, hard to see symbols and text. Suggest option to change background and text or fix it as black background and orange text.","updated":"2017-09-30T05:18:20-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2261230029","userName":"Michael_Zucker","userUrl":"https://itunes.apple.com/us/reviews/id18905218","version":"5.1.1","score":3,"title":"Accuracy of Lights","text":"I have come to love my Lutron. However we have noticed that current status of lights is not depicted in the app.  For example, one light could be on, but the app says it’s off. The brightness of less is also different.  It was not like this before.  What changed?","updated":"2018-03-01T19:13:25-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1698871856","userName":"ShadyApp","userUrl":"https://itunes.apple.com/us/reviews/id104759202","version":"4.2","score":2,"title":"Missing features","text":"I had some issue connecting to the bridge at at first. The app is good and easy to use. My major heartburn is there is not the basic option to sequence the turning on or off of each light in a scene. It's ether all on/dim or all off. This would really come in handy when leaving or enter a floor level.\nWhy Didn't I get a Response from the Development Team???? HELLO","updated":"2017-07-26T02:24:41-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1812005956","userName":"JohnGalt0515","userUrl":"https://itunes.apple.com/us/reviews/id35627728","version":"5.0","score":1,"title":"Awful update.","text":"I used to be able to ask “Alexa turn on the kitchen”.  And it worked.  Now because of the new grouping of rooms I have to ask “Alexa turn on the kitchen kitchen”.  And “alexa turn on master bedroom master” instead of just master.  The second floor has become “hallway second floor”.   The room naming grouping has propagated into alexa and now we need the full description command without a way to shorten it?!?  Please fix this.  It is awful.","updated":"2017-09-26T19:30:37-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"8039511488","userName":"jdegges","userUrl":"https://itunes.apple.com/us/reviews/id421821137","version":"21.6.0","score":1,"title":"Crashes every launch—used to work great","text":"For the past three days the app continues to crash every time it is launched. I’ll see the splash screen for 5-10 seconds then it crashes and I’m back at the Home Screen. This app has been pretty rock solid for 6 months, I’ve invested in >20 switches, but now doesn’t work at all and I’m beginning to regret it.","updated":"2021-11-19T00:18:52-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5836459765","userName":"The CPA","userUrl":"https://itunes.apple.com/us/reviews/id25875243","version":"6.8.1","score":4,"title":"Feedback","text":"The app works fine and is easy to navigate. What would be nice though, is to be able to rearrange the order of the lights within a room.","updated":"2020-04-19T17:32:36-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6718899322","userName":"Scott67100","userUrl":"https://itunes.apple.com/us/reviews/id37134375","version":"7.4.2","score":4,"title":"Reliable System. But need to allow more than 75 devices","text":"Highly reliable system.  Need to allow more than 75 devices to make it perfect","updated":"2020-12-04T22:23:09-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3576146153","userName":"Retired Teacher 74","userUrl":"https://itunes.apple.com/us/reviews/id203870789","version":"6.2.0","score":5,"title":"Easiest Light System Ever","text":"Received as gift. 15 mins installed. Can control 4 light switches and 3 plugs from wall, phone app, Pico remote included OR my Apple Watch. Totally cool and everything works as advertised and simple to do. Lurton stuff is the best.","updated":"2018-12-26T09:29:26-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3189918639","userName":"Slraovgwg","userUrl":"https://itunes.apple.com/us/reviews/id265952995","version":"6.0.0","score":5,"title":"lights look real nice, clark","text":"due to my own stupidity I thought there wasn’t a way to set a schedule to turn lights out, but once I realized that schedules are essentially scenes and lights could be set to 0%, i was all set!","updated":"2018-09-14T16:53:32-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1734607044","userName":"SlickVic2","userUrl":"https://itunes.apple.com/us/reviews/id87102630","version":"4.2","score":3,"title":"OK but could be much better","text":"The fact that Lutron hasn't made an iPad app is beyond my comprehension.  The apps work good enough, but the SmartThings layout of the Lutron Caseta lights is MUCH better. Those are the reasons I didn't give it 5 stars. When they change those 2 things, I'll change my review.","updated":"2017-08-19T08:31:04-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1842340095","userName":"GlenPG","userUrl":"https://itunes.apple.com/us/reviews/id517036952","version":"5.0","score":5,"title":"Great App","text":"It is apparent the Engineers of this App have listened to all the feedback and have made an outstanding product.  Here is one suggestion from me: The Leaving Home Scene needs the “Activate Scene only after Sunset” toggle button. Thanks!","updated":"2017-10-11T13:56:54-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"8036001770","userName":"Firefighter Joey","userUrl":"https://itunes.apple.com/us/reviews/id21147210","version":"21.6.0","score":3,"title":"No Countdown timer","text":"Would love to see a countdown timer integration get added. So lights can manually get turned on and have it turn off after whatever set amount of time runs out.","updated":"2021-11-17T23:24:41-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5937622934","userName":"qbanboi84","userUrl":"https://itunes.apple.com/us/reviews/id29806373","version":"7.0.0","score":5,"title":"Bye Wink!","text":"Finally left Wink behind and joined Lutron! The hub is so tiny I love it! The app is great but let’s be honest the best thing is that they support HomeKit. Wish they had more devices but what I like about Lutron is the reliability!","updated":"2020-05-12T16:26:26-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"7279451198","userName":"Poi bear","userUrl":"https://itunes.apple.com/us/reviews/id129722231","version":"7.7.1","score":2,"title":"Widgets not loading again -- even on app version 7.7.1","text":"The widgets display \"unable to load.\" The update to version 7.7.1 fixed this issue for a while, but once again I'm seeing the unable to load message. This is unfortunate since I primarily use the app via widget. I'm on IOS 14.5.","updated":"2021-04-29T20:32:38-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5986333669","userName":"hgurst","userUrl":"https://itunes.apple.com/us/reviews/id269190663","version":"7.0.0","score":5,"title":"Works Perfectly","text":"Installed today. Followed the directions. Worked perfectly first time.","updated":"2020-05-23T21:25:56-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6768735942","userName":"Roman 23 Windswept Rd","userUrl":"https://itunes.apple.com/us/reviews/id224911817","version":"7.4.3","score":4,"title":"Are you planning to upgrade 75 units to 100 or 125? Also updating driver for Contrl4","text":"Are you planing to upgrade from 75 mac units to 100 or 125? \nAlso updating driver for Contrl4 would be helpful, third parties did not get updates","updated":"2020-12-18T18:38:48-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2815568054","userName":"Ifnd323","userUrl":"https://itunes.apple.com/us/reviews/id38332272","version":"5.6","score":3,"title":"Needs greater schedules flexibility","text":"Overall ok. \n\nFirst big improvement would be to increase the offset allowed for scheduling against sunrise & sunset.  2-hours offset isn’t enough for setting blinds with rising and falling sun.\n\nBetter UI on most of my other smart home applications.","updated":"2018-07-01T17:45:43-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1803652856","userName":"Average user","userUrl":"https://itunes.apple.com/us/reviews/id33281772","version":"5.0","score":1,"title":"Ui doesn’t match the sample screenshots","text":"UX follows a desktop model with multiple taps required to do basic things. Needs a complete overhaul of the ui. \n\nSiri integration has improved but it still says can’t find that room sometimes. Sonos Pico remote is cool but it could do so much more if given the config options. \n\nThe leds aren’t turning off completely so all our kitchen lights remain dimly lit 24/7","updated":"2017-09-22T06:26:19-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"8145095682","userName":"Sephro81","userUrl":"https://itunes.apple.com/us/reviews/id343592055","version":"21.6.3","score":2,"title":"Geofencing doesn't work","text":"Used to work with leave and arriving home, but this completely stopped working recently. Also extremely slow to determine if lights on or off before can turn it on.","updated":"2021-12-18T18:14:39-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6249964740","userName":"Jw23.","userUrl":"https://itunes.apple.com/us/reviews/id212240660","version":"7.1.0","score":2,"title":"Lutron is great... the app not","text":"I love Caseta line of products. Great integration with Google Home. However, the app is PAINFUL to use if you want to adjust/enable schedules. There is no indication which schedule is on vs off, and when you try to edit schedule... most likely you will start changing status of lights.","updated":"2020-07-27T20:21:09-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6162992322","userName":"iBarrier","userUrl":"https://itunes.apple.com/us/reviews/id20713680","version":"7.0.1","score":2,"title":"Fan features lacking","text":"There is still no way to get the fan control into SmartThings. The fan is also not available on IFTTT. \n\nThe pico light controller with the exact same button layout as the fan control is restricted to lights only and cannot control the fan.","updated":"2020-07-05T23:24:52-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"7705200425","userName":"JoshLD","userUrl":"https://itunes.apple.com/us/reviews/id115823880","version":"7.10.0","score":2,"title":"Needs a better layout","text":"Solid performance, but why you can’t display multiple virtual switches on a screen is beyond me. I have 3 “homeowner” 6 button controls assigned to my kitchen, I’d like to have them all displayed on the screen as a virtual keypad at the same time.","updated":"2021-08-17T18:59:55-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5918988495","userName":"Phillysdon04","userUrl":"https://itunes.apple.com/us/reviews/id349456959","version":"6.8.2","score":4,"title":"The system works great.","text":"I wish it was better integrated with Homekit.\n1. The rooms don't match.\n2. It would be nice if the Pico remotes showed up in the home app so we could customize it.","updated":"2020-05-08T05:17:37-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6905975369","userName":"White19100","userUrl":"https://itunes.apple.com/us/reviews/id132316216","version":"7.5.1","score":4,"title":"Good App","text":"Good app.  The latest app update when opened bounces up and down several times on an iPhone 12 Pro Max.  The previous version did not do this.","updated":"2021-01-23T17:21:50-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"8124378634","userName":"signguydelorean","userUrl":"https://itunes.apple.com/us/reviews/id27351097","version":"21.6.2","score":3,"title":"Dec 12th 2021","text":"All of a sudden most of my lights which there are about a 100 of them turn on and off at random.  Started about two days ago.  Prior to this the app and switches have been solid.","updated":"2021-12-12T19:04:16-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1848776449","userName":"Donllllllllll","userUrl":"https://itunes.apple.com/us/reviews/id35432103","version":"5.0","score":1,"title":"Big downgrade","text":"New version forces you pick a room for each device which then forces itself part of the name, devices can't be named manually. All devices added previously are in there own group and you can't add any new devices to it, forcing to to have a redundant extra group. Old version you were not forced to use groups, now it's just a mess.","updated":"2017-10-14T10:25:36-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2159112955","userName":"Huubee","userUrl":"https://itunes.apple.com/us/reviews/id662537713","version":"5.1.1","score":4,"title":"Family share option","text":"How to setup the family share option?","updated":"2018-02-02T11:22:02-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6871747637","userName":"fjalkdj","userUrl":"https://itunes.apple.com/us/reviews/id265358879","version":"7.5.1","score":1,"title":"Half baked","text":"They really didn’t care when making this, did they? “Programming your system...this could take a few minutes” what the he*l does that mean??\n\nHorrible UI. Why does tapping the icon trigger the routine? It makes me think that I should tap it to ENABLE the routine rather than immediately run it. Fire your worthless designers.","updated":"2021-01-15T00:14:13-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2345395843","userName":"Jaycoolz","userUrl":"https://itunes.apple.com/us/reviews/id109837290","version":"5.2","score":3,"title":"Needs dual GPS tracking","text":"Great app but need GPS functionality so if I leave it will still note that my wife’s phone based on GPS is still home even though I have left, and NOT turn off the lights based on her location.","updated":"2018-03-25T08:39:53-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1858979395","userName":"User X7","userUrl":"https://itunes.apple.com/us/reviews/id25278060","version":"5.0","score":1,"title":"Non functional useless app","text":"Would have given minus 5.\nDoes not recognize password.\nGet disconnected from base and frequently ask you to pair with caseta base, and very misleading as there is a regular fees for remote access thru wifi if want to control lights outside the house. \nI will never recommend Lutron to anyone, never had problems with Kasa or wemo , there products are far better.","updated":"2017-10-18T22:37:17-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5597760192","userName":"RRRRRRRRRRRJ","userUrl":"https://itunes.apple.com/us/reviews/id863979644","version":"6.7.1","score":5,"title":"It just work, that’s all there is to it.","text":"Great product! Cant say enough about how well it works.","updated":"2020-02-29T09:54:15-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3914077292","userName":"8Bruin8","userUrl":"https://itunes.apple.com/us/reviews/id36654892","version":"6.5.1","score":2,"title":"Mobile app connection drops","text":"Works well at home. Bad experience with mobile app frequently losing connectivity when I’m away from home.  Have to reset bridge each time to resolve the problem.  Frustrating as I was hoping to rely on the app when traveling.","updated":"2019-03-22T17:13:52-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"4367947875","userName":"nkw55","userUrl":"https://itunes.apple.com/us/reviews/id3984617","version":"6.5.2","score":3,"title":"Single home only!","text":"Great app, would be 5 star if only one could control more that one hone from single login like the Nest and others. Real pain logging in and out to check separate locations.","updated":"2019-06-25T07:02:33-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3866714540","userName":"LG no no","userUrl":"https://itunes.apple.com/us/reviews/id619980671","version":"6.5.0","score":1,"title":"False advertising","text":"Dimmer says they work with smart things. Says needs bridge or hub. Well Samsung is a hub for all other brands but you have to buy the stupid Lutron bridge also to link to that hub. Lutron is behind the times. Get out of the stone age and stop trying to have a proprietary system Lutron. I will have to go return this and go to another store and buy a GE zwave switch now. Wasted my time.","updated":"2019-03-10T12:21:28-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3478182593","userName":"TildeK","userUrl":"https://itunes.apple.com/us/reviews/id31106911","version":"6.2.0","score":4,"title":"Works well","text":"Occasionally doesn't detect my phone when I come home to turn lights on, not sure if that is an issue with my phone or with the app.","updated":"2018-11-30T10:05:38-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1802683803","userName":"MarcelPierreTrudeau","userUrl":"https://itunes.apple.com/us/reviews/id79010905","version":"5.0","score":1,"title":"It works, but...","text":"The system works fine for me, but the app is a little clunky. \n- It would be nice to group devices by room, rather than just on a long list. \n- I’ve had scenes ‘lock-up’ to where they wouldn’t turn off, so I now avoid creating them. \n- Little things that separate thoughtful design from meh:  you can’t change the picture on the homepage that I can see, and the lighting fixture icons are too limited. \n- I received an email today with the “special announcement” that Version 5.0 is available now, but the Apple App Store only shows a preview of “The Big One”.\nSheesh!","updated":"2017-09-21T17:47:49-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"4850018118","userName":"Brad Bass","userUrl":"https://itunes.apple.com/us/reviews/id23833261","version":"6.5.4","score":4,"title":"Please add dark mode to widget!","text":"It may also be helpful to condense the widget to 5 icons across instead of just 4. I came from iPhone 8 Plus to 11 Pro, and miss the extra real estate for my 5 scenes. Thanks!","updated":"2019-09-27T21:07:00-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3890572424","userName":"dpv1975","userUrl":"https://itunes.apple.com/us/reviews/id37145459","version":"6.5.1","score":1,"title":"App is slow and tedious to navigate","text":"The app moves very slowly through the commands (even with using the most advanced IPhone).  Adding schedules is tedious.  Rather than allow the user to schedule a start (on) and end (off) using one schedule, it forces the user to add two schedules to effectuate an on and off command.  The app needs some serious updating.","updated":"2019-03-16T18:41:22-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1802434748","userName":"Bob57435)35","userUrl":"https://itunes.apple.com/us/reviews/id48810176","version":"5.0","score":5,"title":"iPad specific app","text":"Pleeaaaaaseeee!!! Love it otherwise. Have an entire house of caseta products - works like a dream.\n\nUpdate: Now there's an iPad format, that is beautifully designed!!!  Thanks!!","updated":"2017-09-21T13:39:23-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6444428702","userName":"Closetalker654","userUrl":"https://itunes.apple.com/us/reviews/id26789656","version":"7.2.1","score":5,"title":"Awesome!","text":"App had some glitches after an update and the developers fixed it ASAP!  Awesome app!","updated":"2020-09-18T23:56:46-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1879017331","userName":"DeNerd","userUrl":"https://itunes.apple.com/us/reviews/id87717455","version":"5.0","score":4,"title":"Nothing for iPad Revised","text":"Revised from a One Star.. new app supports iPad and works well. Thanks for the update!\n\nOld Review: One star simply for the fact that this app won't install on an ipad.. seriously Lutron, WTH is up with that?!","updated":"2017-10-27T09:47:25-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5364880804","userName":"gsr711","userUrl":"https://itunes.apple.com/us/reviews/id166254821","version":"6.6.2","score":5,"title":"Timers","text":"I can add a time for lights to go on. I can’t figure out how to set them to go off? Any help please...","updated":"2020-01-05T08:58:10-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6437040468","userName":"SIRGPR","userUrl":"https://itunes.apple.com/us/reviews/id104819915","version":"7.2.0","score":3,"title":"iOS 14 crash","text":"After updating my phone and devices to iOS 14 the app crash and wont work.","updated":"2020-09-16T20:34:28-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3306357808","userName":"Dhjdhj","userUrl":"https://itunes.apple.com/us/reviews/id25420720","version":"6.0.1","score":2,"title":"Great in theory but painful if you have more than one system","text":"You can’t have multiple systems under one account so you have to keep logging out and logging in again under different accounts. Wake up guys, it’s 2018 already","updated":"2018-10-15T17:22:56-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5966263386","userName":"Mr. O 🐢","userUrl":"https://itunes.apple.com/us/reviews/id105954318","version":"7.0.0","score":1,"title":"Single user pile of junk","text":"What kind of hub is this that only 1 device 1 user can use the app to control the hub?   Why in the world do you require that I push the setup button each time I launch the app from another one of my own device.   Totally useless!","updated":"2020-05-19T08:43:43-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6601075277","userName":"2902Cedar","userUrl":"https://itunes.apple.com/us/reviews/id27321154","version":"7.3.2","score":2,"title":"App won’t connect","text":"Since the last update I haven’t been able to connect to the app just keeps telling me to retry. Whatever they did on the update really screwed this up.","updated":"2020-11-02T06:19:03-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6741014945","userName":"rcpratt88","userUrl":"https://itunes.apple.com/us/reviews/id802713880","version":"7.4.3","score":2,"title":"Still no iOS 14 Widget Support","text":"What are we waiting for? I just want the same functionality to control scenes with the new iOS 14  widget functionality. Right now my old widget is forced to the bottom of the screen.","updated":"2020-12-11T04:16:24-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"7188090554","userName":"3clicks","userUrl":"https://itunes.apple.com/us/reviews/id35455177","version":"7.7.0","score":5,"title":"iOS app widget","text":"Just an FYI.., widget is broken on iOS 14.5 beta 6.  \nIn case you don’t know already.","updated":"2021-04-05T14:50:29-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3687350928","userName":"Rob Larceny","userUrl":"https://itunes.apple.com/us/reviews/id33272426","version":"6.3.0","score":2,"title":"Doesn’t seem to work with Siri anymore","text":"Since the new update, the Siri integration no longer works. I’ve had caseta for nearly 3 years and it worked flawlessly until a few weeks ago. Disappointed.","updated":"2019-01-23T19:08:20-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2300573272","userName":"Ricardo Suave","userUrl":"https://itunes.apple.com/us/reviews/id113936898","version":"5.1.1","score":2,"title":"Could be good but needs improvement","text":"Keeps resetting forcing me to log on again and re-calibrating the software. Annoying. User interface could use improving. Hope to see changes.","updated":"2018-03-12T22:18:17-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2815698907","userName":"Strifedimmer","userUrl":"https://itunes.apple.com/us/reviews/id32022085","version":"5.6","score":5,"title":"Watch app does not work","text":"The iPhone app works very well but the Apple Watch does not work. Please fix","updated":"2018-07-01T18:19:26-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"8132691122","userName":"Kristopherre","userUrl":"https://itunes.apple.com/us/reviews/id32219093","version":"21.6.2","score":5,"title":"Solid","text":"Intuitive, easy to use, robust","updated":"2021-12-15T05:50:19-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"7745235594","userName":"Bob95000","userUrl":"https://itunes.apple.com/us/reviews/id10685896","version":"7.11.0","score":1,"title":"Doesn’t ask for local network access","text":"It needs local network access to work but it doesn’t even ask for it. It doesn’t appear in the Privacy settings. I assume this is a bug but it’s a showstopper.","updated":"2021-08-28T11:27:27-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3207443046","userName":"bruhletmereview","userUrl":"https://itunes.apple.com/us/reviews/id724587916","version":"6.0.0","score":2,"title":"Only 1 User...","text":"Only one account can use the app per Lutron receiver. Meaning you either need to share your credentials with everyone, or only one person in the house gets to use the app.\n\nOtherwise the app works well as far as I can see.","updated":"2018-09-19T12:03:49-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3101815959","userName":"Sammie 987","userUrl":"https://itunes.apple.com/us/reviews/id7997968","version":"5.6.2","score":5,"title":"Great app. Elegant interface.","text":"I set up 7 Lutron Caseta dimmers in about 10 minutes. The response is immediate, zero lag. I couldn’t be happier.","updated":"2018-08-22T21:46:46-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3709108363","userName":"JRSSDCA","userUrl":"https://itunes.apple.com/us/reviews/id116379946","version":"6.3.0","score":5,"title":"Help","text":"How do you turn the lights out at a certain time?","updated":"2019-01-29T08:01:28-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6513217118","userName":"dqriffe","userUrl":"https://itunes.apple.com/us/reviews/id35772439","version":"7.3.0","score":2,"title":"Ring integration","text":"App is still buggy.  Lutron announced the Ring integration.  However, every time I hit “Works with Ring” the app is killed.  Was very excited to make this work but never made any progress.","updated":"2020-10-08T04:35:01-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"7700137024","userName":"Youngblues83","userUrl":"https://itunes.apple.com/us/reviews/id16948201","version":"7.10.0","score":1,"title":"Use a different app. No longer reliable.","text":"I suggest using the Apple Home app. \n\nThe 7.10 version is useless. There is a 60+ second delay to perform any function across all users. I have reset the bridge, deleted and reinstalled the app and reached out to support. \n\nI have total instant control via the Apple Home app and voice control which indicates the issue is isolated to the Lutron App. \n\nThe app was simple and solid for 3 years. It used to be more reliable than the Home app.","updated":"2021-08-16T10:22:44-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1718396743","userName":"Erico Panaro","userUrl":"https://itunes.apple.com/us/reviews/id42678895","version":"4.2","score":5,"title":"Perfect","text":"The automation (light + sonos) is working perfect at my home! The only suggestion is load faster the app!","updated":"2017-08-08T03:14:33-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"7674721031","userName":"CNN was good","userUrl":"https://itunes.apple.com/us/reviews/id105995819","version":"7.10.0","score":3,"title":"Inconsistent","text":"When it works, you love it. But it’s temperamental. As example, arriving/leaving has stopped working for weeks.","updated":"2021-08-09T17:40:39-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"7516882021","userName":"The Plastic Doc","userUrl":"https://itunes.apple.com/us/reviews/id114306546","version":"7.9.0","score":5,"title":"Love Lutron Casseta","text":"So easy to set up lighting scenes; timers and generally set the mood of the house day and night.","updated":"2021-06-28T14:27:53-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2233127213","userName":"j.palachi","userUrl":"https://itunes.apple.com/us/reviews/id135638067","version":"5.1.1","score":2,"title":"pathetic","text":"widgets not properly centered or it chops off the name of the scene\n\nmiserable looking icon with illustration of a window and lamp from a 100 years ago. get rid of the illustration of the lamp and window. even the letter L would be better\n\ncomputer generated responses to these reviews absolutely unacceptable\n\nslow to startup\n\nlack of ability to group scenes or devices into folders or in expanding/collapsing tree structure\n\nlack of color themes\n\nseriously? still after years? again, pathetic","updated":"2018-02-21T14:02:23-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1846628508","userName":"Francofix","userUrl":"https://itunes.apple.com/us/reviews/id42658709","version":"5.0","score":1,"title":"Terrible UI","text":"They made this app perfect. As soon as they perfected the app they change the user interface. They are now back to square one. It's ugly and nonfunctional. So disappointed... I have over a dozen Lutron devices too.  I hope someone there comes to their senses and rights this problem soon.","updated":"2017-10-13T12:02:16-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"7381094945","userName":"Ketchup9895","userUrl":"https://itunes.apple.com/us/reviews/id87728162","version":"7.8.0","score":1,"title":"Ads on a smart light app.. really? Also widget broke","text":"Couldn’t be more upset. DO NOT BUY THIS ITEM. Awful support, app is useless now and literally is a billboard for ads. Couldn’t be more upset with my decision. Stick to the competition guys, this ain’t the brand for you","updated":"2021-05-23T22:43:07-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6928368115","userName":"RbrtRao","userUrl":"https://itunes.apple.com/us/reviews/id32345320","version":"7.5.1","score":1,"title":"Unable to connect!","text":"System worked fine, but now, after investing a lot of money on switches, it no longer recognized the bridge, so all functionality is lost.  Never again","updated":"2021-01-29T06:29:26-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1808205605","userName":"1946sissy","userUrl":"https://itunes.apple.com/us/reviews/id242052375","version":"5.0","score":5,"title":"MRW","text":"Impressive \nQuestion when will we see the 5.0 update released","updated":"2017-09-24T17:49:42-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3202782265","userName":"Fzlo","userUrl":"https://itunes.apple.com/us/reviews/id291847175","version":"6.0.0","score":3,"title":"Nice when it works","text":"This app is nice when it works.  It sign us out every other day which is frustrating but when it works it’s cool.","updated":"2018-09-18T05:28:49-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2002863288","userName":"matt12321312312","userUrl":"https://itunes.apple.com/us/reviews/id25578496","version":"5.1.1","score":3,"title":"No multi-person Geofencing","text":"I was pretty disappointed to see that Apple HomeKit added multi person geo fencing but Lutron is not supporting this.  If this gets added I would rate the app higher.","updated":"2017-12-16T21:54:20-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1968690530","userName":"Jwolf13","userUrl":"https://itunes.apple.com/us/reviews/id103331993","version":"5.1.1","score":3,"title":"Disappointing","text":"Use this for a house in AZ.  Works great.  Unfortunately it will NOT let me use it for my property in CO.  Crazy that you cannot use it for two locations...","updated":"2017-12-03T17:35:06-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1802930204","userName":"Funt007","userUrl":"https://itunes.apple.com/us/reviews/id26771289","version":"5.0","score":2,"title":"App ok, Alexa much worse","text":"After the update Alexa won't recognize the lights in a room, worked better before rooms were added. The functionality with Alexa needs to be improved.","updated":"2017-09-21T20:56:06-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3097581426","userName":"Sith/Jedi","userUrl":"https://itunes.apple.com/us/reviews/id102997749","version":"5.6.2","score":1,"title":"Lack of options for linking lights","text":"The remote is a great way to control several dimmer switched lights but there is no way to link the actual switches to each other. It should be a simple thing to do as the remotes already do it.","updated":"2018-08-21T21:02:00-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5322804311","userName":"genez9","userUrl":"https://itunes.apple.com/us/reviews/id24972322","version":"6.6.2","score":2,"title":"Smart away gone?","text":"I can no longer find the smart away feature on newest app update...","updated":"2019-12-26T10:01:15-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1703742274","userName":"pdx914","userUrl":"https://itunes.apple.com/us/reviews/id224645194","version":"4.2","score":1,"title":"Do not download or purchase product!","text":"It's been a long week.  Rather than replace a bad bridge, Lutron attempts to diagnose the problem over and over unsuccessfully.  This isn't how you treat your customers.  Bad service, does not stand behind product.","updated":"2017-07-29T10:36:47-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5723216704","userName":"Arcoms","userUrl":"https://itunes.apple.com/us/reviews/id42678666","version":"6.7.1","score":1,"title":"Garbage","text":"Hit and miss sometime the so called smart plug most.   The time it doesn’t. Taking it back to the store. Unlike WEMO, Kasa,  in order to use the junk you have to pay for a bridge to use it, and WEMO and kasa are cheaper to buy","updated":"2020-03-27T15:53:08-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1643585622","userName":"Micheal Penn","userUrl":"https://itunes.apple.com/us/reviews/id180233946","version":"4.2","score":2,"title":"Siri integration does not work","text":"Why is this a problem now. Used to work by after the update it no longer works and I cannot reconnect.","updated":"2017-06-13T20:04:34-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"8038763459","userName":"RealViewer","userUrl":"https://itunes.apple.com/us/reviews/id34002756","version":"21.6.0","score":2,"title":"App times out","text":"App consistently times out. As far as apps go, this is a very basic structure, yet it fails consistently. Be better","updated":"2021-11-18T18:19:11-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6488856446","userName":"Russydean","userUrl":"https://itunes.apple.com/us/reviews/id42188116","version":"7.3.0","score":1,"title":"App crashing","text":"Everytime I click on add works with ring the app crashes immediately.  I have tried restarting phone and uninstalling and re installing app to no prevail.","updated":"2020-10-01T08:18:27-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"7498933256","userName":"marcNfriendswood","userUrl":"https://itunes.apple.com/us/reviews/id100102525","version":"7.9.0","score":5,"title":"I love this tech","text":"My whole house is filled with Leutron tech. I love it","updated":"2021-06-23T18:22:58-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"4044150816","userName":"Its just ok","userUrl":"https://itunes.apple.com/us/reviews/id337751392","version":"6.5.1","score":3,"title":"Bridge pairing","text":"The app does not do the app pairing step after installation and jumps to the switch connect. Any idea why?","updated":"2019-04-21T19:47:48-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5085372674","userName":"Ludhdbdbnsbsmsbxbs","userUrl":"https://itunes.apple.com/us/reviews/id32823929","version":"6.6.0","score":5,"title":"Now supports multiple homes","text":"Awesome app!","updated":"2019-11-04T07:23:11-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2201027237","userName":"DrGator35","userUrl":"https://itunes.apple.com/us/reviews/id118877917","version":"5.1.1","score":5,"title":"Hands down the best for the money!","text":"Let me start by saying I know more than your average bear about custom automation & A/V, but literally enough to be dangerous! My brother is a ultra high end custom AV installer and I worked for him when I got out of college for about 7 years mainly running wires and installing hardware, but got a chance to see some pretty awesome stuff regarding automation.....including Lutron’s higher end equipment such as homework’s (if it’s still called that) which I thought was amazing, but it would be a while before I could afford anything like that. So ten years later and 3 kids! I buy a house and my bro sends me a smart bridge, 3 dimmers and 8 plug dimmers to kind of get me going with my new house until I decide to get serious he says and blow some coin! Well I’m not quite sure what else I would need in addition to what I got. Every time I go to Home Depot I would buy a switch and now I have 19 dimmers and 8 plug dimmers! All I really have left to change out is the fan switches. I can not express how much I love this system! For very little money for the bridge and a switch or two you have a good foundation that you can build on as you get a little extra funding. I have a Control4 system as well that I have all the lights tied to, but keep the schedules and scenes in the Lutron app because it is so easy and I can change things in the Lutron app a whole heck of a lot easier than I can Control4! Lutron hit it right on the head with the Caseta line, way to go and keep it up....Caseta has been a flawless hit for me!!!thank you","updated":"2018-02-12T16:25:19-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"4810507826","userName":"aasmiami","userUrl":"https://itunes.apple.com/us/reviews/id42365560","version":"6.5.4","score":5,"title":"Dark mode iOS 13","text":"Don’t forget to add dark mode to the app","updated":"2019-09-20T10:01:09-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6890730345","userName":"DominikHoffmann","userUrl":"https://itunes.apple.com/us/reviews/id30614373","version":"7.5.1","score":4,"title":"Would love a universal binary","text":"Please release this as a universal binary that can also Ron on macOS.","updated":"2021-01-19T19:26:46-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6332083019","userName":"Jeff.......","userUrl":"https://itunes.apple.com/us/reviews/id40465808","version":"7.1.0","score":2,"title":"never stays logged in, have to add the thermostat every time you use app","text":"need to repeatedly add the thermostat with a name and password every time you use the app. very annoying. it should stay attached. shut down the app, then open it the next day and the thermostat is gone. need to add it again with name and password.","updated":"2020-08-17T19:48:11-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"8135495174","userName":"necroptologist","userUrl":"https://itunes.apple.com/us/reviews/id450600167","version":"21.6.2","score":1,"title":"Feature missing","text":"Need timer feature","updated":"2021-12-16T01:48:16-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"8094808892","userName":"elixanchor45","userUrl":"https://itunes.apple.com/us/reviews/id17154080","version":"21.6.1","score":1,"title":"Hangs on load, broken","text":"Lutron app stuck on “Connecting to you Lutron system” and is entirely unusable, even though bridge is on and connected to network.","updated":"2021-12-04T09:34:34-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"4998901542","userName":"WeAllMad","userUrl":"https://itunes.apple.com/us/reviews/id11267845","version":"6.6.0","score":1,"title":"Add 2 steps authentication! Security!","text":"It’s hard to believe this company hasn’t implemented such important feature as a smart home product provider.  It’s important, do it before class action lawsuit","updated":"2019-10-22T15:11:00-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"4403619893","userName":"dsldnmslsfj","userUrl":"https://itunes.apple.com/us/reviews/id236604893","version":"6.5.2","score":1,"title":"Latest update no longer works with Alexa","text":"Nothing in my set up changed, hadn’t even opened either Lutron or Alexa app. Continuous power to plug (no blackouts or brownouts). \n\nStill works with Google Home, with no interruption.","updated":"2019-07-02T21:15:55-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5561631674","userName":"TravDawg76","userUrl":"https://itunes.apple.com/us/reviews/id31419542","version":"6.7.0","score":1,"title":"Poor Security","text":"Please upgrade your apps and user accounts to require two-factor authentication. \n\nIoT devices can be used as a backdoor into users’ networks. \n\nThank you!","updated":"2020-02-21T08:11:42-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6440197846","userName":"jbcrash","userUrl":"https://itunes.apple.com/us/reviews/id42034083","version":"7.2.0","score":2,"title":"Crashes on iOS 14","text":"Repetitively crashes after iOS 14. Do not update if you want Lutron app to work!","updated":"2020-09-17T18:32:21-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6515322423","userName":"sebkg74","userUrl":"https://itunes.apple.com/us/reviews/id330366701","version":"7.3.0","score":1,"title":"Those smart switches need more work","text":"Lutron caseta is lacking basic function in their software “countdown timer’ That is critical function for outside lights or ceiling fan.","updated":"2020-10-08T18:24:26-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6090237232","userName":"Alex in San Francisco","userUrl":"https://itunes.apple.com/us/reviews/id111809773","version":"7.0.1","score":3,"title":"Room for improvement","text":"Lutron itself is a great company, and their Caséta Wireless line is fantastic—I have a large number of the dimmers, Pico remotes, and a fan controller. \n\nThe app is ok, but I see two major flaws:\n\n#1:  You can create a Scene to group multiple lights together, so that you can turn them all on—at the desire combination of brightness even—with one tap on your phone. However here’s the rub. You can tap the Scene to turn on the lights, but if tap you tap it again they don’t turn off. Lutron has you create a second Scene, which takes unnecessary time, and unnecessary real estate in your phone, just to turn off the lights. Makes no sense. So think about this. Every time you create a Scene, you will actually need to create TWO Scenes. \n\n#2: Lutron, please give us Dark Mode as an option for the app. Imagine trying to control lights in the middle of the night with a super bright phone screen. Not good.\n\n[edit/update]\n\nOn #2, the app currently provides a “dark” theme which makes the panel a transparent black, however the default background is light blue and rather bright, so with this combination it defeats the purpose. The edges of the screen, particularly the top section, are very bright (at night) even when setting your phone to its lowest brightness. The workaround that I found is to set a custom background to a completely black photo. Thankfully Lutron allows this feature, and if you take a photo while your hand is covering the camera lens, you can get an all black photo and mimic a true dark mode!","updated":"2020-06-17T22:38:10-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"4025314861","userName":"Farragut TN","userUrl":"https://itunes.apple.com/us/reviews/id486619695","version":"6.5.1","score":1,"title":"Terrible app","text":"Terrible app for a horrible product.  Our hub and one wall switch and a pico remote were installed by an electrician supposedly experienced with the product. Waste of time, waste of money.","updated":"2019-04-17T12:16:06-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1803002699","userName":"Proletariet","userUrl":"https://itunes.apple.com/us/reviews/id37941021","version":"5.0","score":4,"title":"UI Improvements","text":"Props for the very real UI improvements.","updated":"2017-09-21T21:51:38-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"8080154441","userName":"Random User","userUrl":"https://itunes.apple.com/us/reviews/id30757730","version":"21.6.1","score":1,"title":"Widget Stopped Working","text":"Nothing populates in my widget for the past week or so. I’ve tried deleting, restarting, etc to no avail (iPhone 11 Pro, latest OS)","updated":"2021-11-30T07:29:07-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5080210711","userName":"TheGamingArt","userUrl":"https://itunes.apple.com/us/reviews/id158271774","version":"6.6.0","score":1,"title":"Crashing","text":"The latest release consistently crashes on iOS 13.2","updated":"2019-11-03T08:37:55-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5424187128","userName":"WIGGINS84","userUrl":"https://itunes.apple.com/us/reviews/id154902675","version":"6.6.2","score":1,"title":"APP DOESN'T LOAD. DEVICES UNRESPONSIVE","text":"Not sure if this is a result of a recent update or firmware, but the app doesn't connect to the network (Philips Hue devices and other switches connect with no issue).","updated":"2020-01-19T10:39:19-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5647014904","userName":"Jeffashy","userUrl":"https://itunes.apple.com/us/reviews/id29519955","version":"6.7.1","score":1,"title":"Absolute Garbage","text":"Really disappointing, I bought a Lutron hub to integrate a bunch of switches with HomeKit only to face error after error trying to set it up.\n\n“Connect to your home’s WiFi”\n“Unable to add your bridge/repeater”\n“Your device may already be paired” \n\nThe list goes on, but my lights don’t. Returning the hub and deleting my account.","updated":"2020-03-11T11:46:35-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1803243925","userName":"a4agarwal","userUrl":"https://itunes.apple.com/us/reviews/id37150781","version":"5.0","score":2,"title":"Latest update is awful","text":"* Startup time is too long\n* Three tabs means more taps\n* List view vs icons in scenes view means I have to scroll a ton to find the one I want\n* Claims it can control Pico remotes. Haven’t seen how I program the center button\n\nI wish I could go back to the old version","updated":"2017-09-22T01:09:56-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5559081338","userName":"Sysek12","userUrl":"https://itunes.apple.com/us/reviews/id141532627","version":"6.7.0","score":1,"title":"It is lacking","text":"With what’s available on the market the app is lacking in simple functions like timers, guest access, sunrise to sunset etc.","updated":"2020-02-20T19:43:13-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"7498752060","userName":"bkx3","userUrl":"https://itunes.apple.com/us/reviews/id33520480","version":"7.9.0","score":1,"title":"Immediately crashes on open","text":"I can’t open this app and update my Lutron hardware.","updated":"2021-06-23T17:04:14-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2615227366","userName":"JordanPatterson","userUrl":"https://itunes.apple.com/us/reviews/id32688452","version":"5.6","score":4,"title":"Pico Remotes in HomeKit","text":"With iOS 11.4 adopting software HomeKit authentication I would love for the pico remote to be exposed in the home app.","updated":"2018-05-29T21:38:29-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6621477497","userName":"CourbcyrUS","userUrl":"https://itunes.apple.com/us/reviews/id39126323","version":"7.4.0","score":4,"title":"Solid app to back OUTSTANDING hardware - but...","text":"PLEASE ADD BACKUP / RESTORE.  Should not be that technically difficult.","updated":"2020-11-07T23:33:14-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"4999798834","userName":"LT member","userUrl":"https://itunes.apple.com/us/reviews/id87260163","version":"6.6.0","score":4,"title":"Finally - multi home support!","text":"Yessssss!  Life just got a little simpler.","updated":"2019-10-22T20:26:41-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6439650483","userName":"Bitmover","userUrl":"https://itunes.apple.com/us/reviews/id37295490","version":"7.2.0","score":1,"title":"Crashes at launch","text":"Crashes at launch.","updated":"2020-09-17T14:19:08-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"4780483852","userName":"TB001122","userUrl":"https://itunes.apple.com/us/reviews/id31071356","version":"6.5.3","score":2,"title":"Multiple homes....please","text":"Great product, just needs multiple home capabilities. Please please please!","updated":"2019-09-14T18:31:54-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3855212510","userName":"InfinitiG37x","userUrl":"https://itunes.apple.com/us/reviews/id253388856","version":"6.5.0","score":5,"title":"This works great!!!","text":"This device is awesome 👏🏽 perfect 👌🏽 for older Property","updated":"2019-03-07T19:34:21-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3374405495","userName":"JustinLS7","userUrl":"https://itunes.apple.com/us/reviews/id929655914","version":"6.0.1","score":1,"title":"Great system buggy app","text":"System works great once setup. Best lighting system when connected to homekit, but app is very buggy","updated":"2018-11-02T19:06:19-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6438413105","userName":"mike.g","userUrl":"https://itunes.apple.com/us/reviews/id41399460","version":"7.2.0","score":1,"title":"Crashes upon open with iOS 14","text":"Crashes upon open with iOS 14","updated":"2020-09-17T06:55:15-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1936177629","userName":"Scott James Remnant","userUrl":"https://itunes.apple.com/us/reviews/id86550105","version":"5.1","score":1,"title":"Does not support iPhone X","text":"Despite having updates released since the iPhone X was announced, this app still does not support it.","updated":"2017-11-20T18:50:03-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6436655983","userName":"WJKramer","userUrl":"https://itunes.apple.com/us/reviews/id34356693","version":"7.2.0","score":1,"title":"Not iOS 14 ready.","text":"Just crashes. Can’t open.","updated":"2020-09-16T17:40:19-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2324944991","userName":"gatti956","userUrl":"https://itunes.apple.com/us/reviews/id110621920","version":"5.2","score":1,"title":"what happened to nest integration","text":"updated the app today and my nest integration said no cameras could be found with nest aware (i have 5 that do)....so i figured i would remove the nest integration and start over...so i removed the nest integration and now i don’t see nest referenced anywhere! what happened???","updated":"2018-03-19T18:56:51-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3459545557","userName":"H Ohio","userUrl":"https://itunes.apple.com/us/reviews/id149291448","version":"6.2.0","score":5,"title":"Loving it so far","text":"We got our first switch about two years ago to create a three way switch where we had none.  Our electrician actually did it, as we didn’t know about this product & hired him as we didn’t want to pull wire on an exterior wall.  We didn’t buy the bridge then because we didn’t see the value in it.  \n\nNow we have twins & I constantly would sit down and have a baby start to fall asleep on my lap, but have the lights on.  If I got up to turn them off the baby would wake up, but the baby also wouldn’t fall completely asleep with the light on.  I decided we ‘needed’ a switch for that light, & decided to get the light switch with the bridge combo pack.  \n\nIt has been a game changer.  Now when we leave the house, instead of repeatedly yelling at my four year old to turn off all the lights, I just ask Siri to turn off all the lights.  Done. Awesome.  \n\nI also now have lights set on a schedule to come on at 5 pm & turn off at 11 pm, so we aren’t in the dark outside anymore.  The commands are separate, so we have one light that comes on but they all turn off.  If the kids turn the lights on for some reason, they still all turn off at 11 pm.  The remote by the outside garage door that the electrician put in, we reprogrammed to operate all the outside lights, so one switch lights it all up.  Very handy for quick lighting when we can’t find the dog or worry there is a coyote outside. \n\nI can’t believe I thought we didn’t need this before.  Next I want to start replacing blinds.  :)","updated":"2018-11-25T09:05:43-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2642325241","userName":"hartman39","userUrl":"https://itunes.apple.com/us/reviews/id180759364","version":"5.6","score":1,"title":"No multi home control","text":"How can this app not support toggling between different locations/homes???","updated":"2018-06-04T14:49:09-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2421058807","userName":"DaKinePine","userUrl":"https://itunes.apple.com/us/reviews/id28641713","version":"5.3","score":2,"title":"Soooo slow","text":"On iphone 8+, 11.3 ios, take the app 2 minutes to react.","updated":"2018-04-14T02:32:59-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1706764645","userName":"Michael Palmer","userUrl":"https://itunes.apple.com/us/reviews/id11677881","version":"4.2","score":5,"title":"Great integration!","text":"Great app and product integration!","updated":"2017-07-31T12:03:33-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3193249281","userName":"Mirandam1989","userUrl":"https://itunes.apple.com/us/reviews/id249915183","version":"6.0.0","score":1,"title":"Trash","text":"Won’t work and customer service won’t help","updated":"2018-09-15T12:39:54-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2096500813","userName":"Calicharlieftw","userUrl":"https://itunes.apple.com/us/reviews/id490945445","version":"5.1.1","score":1,"title":"Forced to create an account","text":"You will be forced to give Lutron my email address to use this app.","updated":"2018-01-16T18:33:19-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1823687760","userName":"Grafx310","userUrl":"https://itunes.apple.com/us/reviews/id112767251","version":"5.0","score":1,"title":"Step backwards","text":"The update is a serious step backwards, it feels like a first grader wrote it. Lutron, give me back the old app.","updated":"2017-10-02T18:35:44-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6392722152","userName":"northport ny","userUrl":"https://itunes.apple.com/us/reviews/id627659042","version":"7.1.0","score":1,"title":"Overly complex","text":"Challenging to simply schedule an outdoor light to turn and off at specified time.","updated":"2020-09-03T18:57:49-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5562994319","userName":"DSB123456","userUrl":"https://itunes.apple.com/us/reviews/id137567868","version":"6.7.0","score":1,"title":"Why Tho","text":"why the f do you need a medium or higher password","updated":"2020-02-21T16:55:31-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1738188936","userName":"storksj","userUrl":"https://itunes.apple.com/us/reviews/id30232814","version":"4.2","score":3,"title":"Powerful system; needs improvements.","text":"I have been using this system for over a year and it never ceases to impress my friends. Lights are timed and are collected into scenes and controlled by Harmony and through Alexa and if this than that… My echo. \n\nUnfortunately the weak point is the app.\n\n-by time the application loads I can use my echo to launch three different scenes. This can't be that hard to solve.\n-like many others, I pine for a landscape view. I have a Harmony system as well and for something like an iPad, it's a natural layout. Switching between the two applications, this app feels like an afterthought.\n-by far the most painful problem with the application is that I have 2 Smart hubs. I have one for each home but I could easily see somebody having 2 on their property.  It seems like you can only control one hub per account. That would not be a terrible thing if it weren't for this application. Switching hubs requires me to log out and manually type in the name and password for the other hub. I noticed my Harmony has no trouble switching between my two harmony hubs. Apple has a technology called keychain that would easily allow storing and retrieving the information for each account so that I could easily switch when I'm at a different house. \n     First world problem-I know! But for me this is the worst part of the application.\n\nI actually like the picture but it's the same picture for both homes lol. Tie it to account and make it a background and we're in business.","updated":"2017-08-21T21:44:31-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"7372463546","userName":"Bob3747486","userUrl":"https://itunes.apple.com/us/reviews/id475604121","version":"7.8.0","score":2,"title":"Ads!?","text":"We had a good run, Lutron.","updated":"2021-05-21T20:02:15-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3801726066","userName":"MikeCooperAVL","userUrl":"https://itunes.apple.com/us/reviews/id427269290","version":"6.5.0","score":3,"title":"Good - but could easily be so much better","text":"I installed the Caseta system in our house a couple of weeks ago. Installation was a really smooth experience: the system really simplifies wiring (effectively, turning three-pole switches back into single pole switches, controlled by wireless remotes), allows for lots of customisation (like being able to control multiple lights in a room with one button press), and is a great improvement on all the manual switches we had before.\n\n \n\nOverall, I’m impressed – but there are a couple of seemingly obvious things that have been overlooked.\n\nFirstly, my partner and I both have iPhones – but Lutron’s geofencing isn’t smart enough to tell when one of us is home and the other is out, and only switch lights on if we’re both out, for example. If I turn the option on and leave, all the lights go off, leaving my husband in darkness. Not all that smart, right? There’s a workaround if you have a Nest device that can be set to determine whether someone’s home, but if you don’t have one, this isn’t an option. If our thermostat can get this right, why can’t Lutron?\n\n \n\nAnd then there’s the Siri/HomeKit integration. I love being able to tell Siri to “turn the kitchen lights on” or “set the living room lights to 50%” – but why doesn’t HomeKit see the Scenes I’ve set up in the Lutron app, too? If I tell Siri to “set the lights to Evening”, she tells me she doesn’t know what I’m talking about. Again, there’s a workaround: you can duplicate these Scenes as new Scenes in HomeKit – but it seems like an oversight. And, at time of writing, the Lutron app isn’t supported for the Shortcuts app, either.\n\n \n\nFinally, we need a better way to make “tweaks” to Scenes that have already been set up. Live editing isn’t possible, and neither is it possible to “grab” the way the lights are set in a room and store that as a Scene. This means, if I decide I want to make changes, that I have to go into each device, one by one, make a note of the dimming level, then manually enter it in the Scene afterwards. This should be a simple fix in a future update, but will it happen?\n\n \n\nA little more thought would make this a killer app and system. Right now, I’d say we’re at 3 out of 5.","updated":"2019-02-22T10:30:54-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"7294065646","userName":"OldSchool007","userUrl":"https://itunes.apple.com/us/reviews/id3891431","version":"7.7.1","score":2,"title":"NOTHING INTUITIVE HERE/Fuh Gedd About HomeKit","text":"After the third install and reintroduction of my seven devices and hub to this app I thought I had things set up properly. My wife had been using the Pico Remote to control two lights in the den for several weeks as I decided whether to expand my Caseta universe to replace the plethora of Maestro switches (one set for the outdoor patio area is a five-way set-up) I have happily used for 17 or so years in my home.\n\nThis morning, spouse gets up and can't get her lamp and the painting light to come on regardless of which button she pushed on the Pico remote which \"controls\" an in-wall dimmer and plug-in dimmer. The only thing I had changed about the set-up was \"integrating\" Apple's HomeKit with the Caseta app. Indeed - I checked on the light switches, and it was as if they had never been paired with the hub. Perhaps \"using HomeKit names\" had screwed things up within the Caseta app?\n\nWhat I do know is that when setting up devices for the first time in the Lutron/Caseta app, there is a \"Default Room\" that devices are put into. After you set up the devices it is extremely difficult to move them from the \"Default Room\" to any other room in the home. AND, if like me, you make the mistake of setting up an incorrect room - there is (according to the Lutron Forums) still no way to delete a room. Imagine the fun of trying to delete DEN or Den. I spent enough time looking for the solution to \"how do I delete a room\" from the Lutron/Caseta app that I finally joined the Lutron Forum - BUT I can't post anything yet, because even though the forum said I had been sent an activation/verification email - I am still awaiting the arrival of said email. \n\nI have now deleted both HomeKit and the Lutron/Caseta app. I will start over with the install one more time. Two hours after joining the Lutron Community Forum and STILL NO VERIFICATION EMAIL from Lutron. Of course, when multiple home capability has been added to the app, and no one from Lutron has bothered to reply to the continuing questions about needing an different email address for each home - I question how valuable the forum will be anyway.","updated":"2021-05-03T11:40:54-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6482413157","userName":"DJ AMIR","userUrl":"https://itunes.apple.com/us/reviews/id47704592","version":"7.3.0","score":1,"title":"Apple Homekit","text":"After update not responding on apple homekit","updated":"2020-09-29T15:32:28-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"7556061517","userName":"Nusr","userUrl":"https://itunes.apple.com/us/reviews/id43710703","version":"7.9.0","score":2,"title":"NEEDS SOME ENHANCEMENTS","text":"I’ve been a LUTRON customer for more than 20 years with these types of dimmers - they are the best on the market for the REGULAR, NON-SMART NON-CASETA ONES. \n\nJust a week or so ago I decided to make my whole house ‘smarter’ when it came to lighting and a thermostat. I had all the nice regular Lutron dimmers that only have 2 BUTTONS and the hidden kill switch, like the CASETA line does as well.  \n\nThe ORIGINAL DESIGN was SUPER SLEEK/SIMPLE & EFFECTIVE: the MAIN of 2 buttons was a SINGLE LARGE TAP STYLE BUTTON, which you tapped once to turn ON/OFF the lights; TAPPED TWICE to turn on LIGHTS ON IN FULL BRIGHTNESS, or PRESSED & HELD for 10 seconds so it’d give you 30 seconds to exit the room fully lit and then it’d slowly dimmed to warn you it was turning off. \n\nSECOND BUTTON was a THIN ROCKER STYLE (push upper side to raise brightness or bottom side to lower it); and it still had 10 tiny green LED’s next to rocker button to indicate brightness level. \n\nMany of these ‘non-smart’ dimmers could even be CONFIGURED MANUALLY by clicking each of these buttons in certain sequences to set the max/low voltage you wanted lights to receive to accommodate the different types of bulbs, and other features like the ones with incorporated MOTION SENSORS (those are DEVINE - configuration options are so plenty, you’ll need the manual for sure). \n\nThe other BEAUTIFUL THING about the ‘dumb’ dimmers was that once you set a BRIGHTNESS LEVEL using the ROCKER BUTTON, you’d only need to tap the MAIN BUTTON and lights would always turn on at that LAST/DESIRED BRIGHTNESS. \n\nThe new ‘SMART’ CASETA DIMMERS LOOK ALMOST IDENTICAL, but for some reason LUTRON felt it needed to add TWICE AS MANY BUTTONS and COMPLICATE what was a SUPER SIMPLE DESIGN & OPERATION. \n\nIrony is that now I get LESS FEATURES with these new dinners with more buttons, plus now new buttons also make it hard to press them since they are CRAMMED in the SAME AMOUNT of REAL-ESTATE - there are 4 BUTTONS where there was ONLY ONE BEFORE. \n\nNow, if I turn the lights, I have to click the dedicated ON BUTTON, but they DONT RESUME at the LAST BRIGHTNESS LEVEL, but at FULL BRIGHTNESS, and then you need to CLICK 10 TIMES the LOWER BRIGHTNESS BUTTON to reduce light output; or ALTERNATIVELY, turn lights on SLOWLY by CLICKING THE BRIGHTNESS ’UP’ BUTTON 10 TIMES - what????? I can’t even recall what was was my desired brightness for this lamp, let alone all in the house. \n\nHow’s this progress? I’m hoping there’s a setting I’ve missed somewhere in the app, or the switches’ manual, that set lights to turn on at last dimmer value. \n\nTo get around this major issue (for me - have lots of mood lighting), you either need to CREATE A ‘SCENE’ ON THE PHONE APP - and run to pull out your phone, unlock it, and find the app, then find the scene, EVERY TIME you want to turn on a light (when the physical dimmer is one touch away right next to you)? \n\nOR, the other option I found is to BUY ONE PICO REMOTE PER LIGHT SWITCH, which contains an ADDITIONAL FITH TINY BUTTON in the center, and the ONLY VALUABLE BUTTON, which can be programmed to turning the lights on at a PRESET DESIRED BRIGHTNESS.\n\nWhat a FAIL. I hope like I said: that I either missed something, or that this will be fixable via through some sort of FIRMWARE UPDATE at some point. \n\nAnd I do have the problem on rare occasions where not all lights turn on when I choose a SCENE. \n\nI have about 10 LIGHT CASETA DIMMERS and another 10 CASETA LAMP DIMMERS (and more to come). House is small one floor 1500SF and no solid walls. However, this issue is rare and mostly happens if I press one scene too soon after another. \n\nOh!, and some LED lights DONT FULLY TURN OFF when I turn off the LAMP DIMMER - I’m guessing they need very light current to turn them on. \n\nSIMILARLY, several of the lights ONLY DIM SO MUCH. Even when dimmer is set at 1% in app, light lights at 25-30%. In the old ‘dumb’ dimmers, the LOW/TOP VOLTAGE LEVELS could be adjusted until light turned fully off - not here that I can tell. \n\nSo how can more buttons and ‘smart’ Wifi capabilities actually end up REDUCING functionality? Beats me.","updated":"2021-07-09T00:49:20-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3524409258","userName":"Embabydoll","userUrl":"https://itunes.apple.com/us/reviews/id250374188","version":"6.2.0","score":5,"title":"Caseta app for Xmas lights","text":"Great app!","updated":"2018-12-12T17:49:42-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1290243933","userName":"Edgeman20","userUrl":"https://itunes.apple.com/us/reviews/id107625419","version":"3.1","score":3,"title":"App and System Review","text":"The app does great laying out the switches, lights, scenes, and thermostat. It will be great to have the app show other devices within the network that work within the homekit eco system (the idevice app those this already). For example; be able to see my hue lights in the lutron caseta app the same way its done with the nest!. The platform is probably one of the best in the market. The switches and the plug switch dimmers are great and easy to add and operate. I'd recommend adding a plug switch that can be used outside for lights decorations. Or at least allow to use of other already available switches like the GE outside plug switch. offer a toggle in-wall switch. And one last, integrate a camera to your product line or the ability to add ip camera access to the app. \nThank you,","updated":"2015-11-22T10:23:20-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1802135423","userName":"Bilmer","userUrl":"https://itunes.apple.com/us/reviews/id42020487","version":"5.0","score":1,"title":"IFTTT & Sonos Issues","text":"IFTTT and Sonos integration is no longer working ☹️ Please fix!","updated":"2017-09-21T09:14:32-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1358828874","userName":"Jaynatal","userUrl":"https://itunes.apple.com/us/reviews/id475149396","version":"3.2.2","score":4,"title":"Great But Would Love The Ability to Reorganize.","text":"I have been using the application and system in my 4,000 square foot home for almost 3 months with no issues.  I have a ton of light switches that I have been replacing with the Lutron Caseta Switches (both stand alone and the one that include the pico remotes).  My only two recommendations are this.\n\n1.  I wish the application would have the ability to let you reorganize how the light switches appear in order in the application along with reorganizing scenes as well.  I started one room and added switches over the course of the month.  Then I realized that I have to scroll to the end of the list to use lights I thought I wouldn't touch that much.\n\n2.  It would also be nice to be able to click a scene once activated and have it deactivate completely rather than creating a separate scene or having to manually turn off each switch configured for that scene.","updated":"2016-04-05T02:29:44-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1394498083","userName":"Dookie 2x","userUrl":"https://itunes.apple.com/us/reviews/id25672372","version":"3.3","score":1,"title":"Poor app great devices","text":"Thankfully their devices support HomeKit and the only reason you need their app is to pair their devices and add them to your HomeKit home. The setup is a bit iffy given that they require a login (they want your email) which is completely unnecessary. They then require you keep an account or they un-pair and disconnect any Caseta device that you've added to the hub. This is odd given that HomeKit only requires pairing via the HomeKit digits/code. \n\nAnyway, once paired you don't ever have to use their app which tries to restrict you to their brand partners.\n\nThe HomeKit framework lets any true HomeKit app (Elgato Eve is an excellent example) to control their devices via scenes, timers, and rules and of course their is Siri too. I think their design flaw is that they've created a device that lets them play with as many protocols and frameworks as possible and this is why they default to requiring a login account for setup. In case you don't use their hub an devices via HomeKit. They should make that optional.","updated":"2016-06-14T16:29:34-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1269025291","userName":"Caseta Lover","userUrl":"https://itunes.apple.com/us/reviews/id163687600","version":"2.4","score":4,"title":"Almost perfect","text":"I have 3 separate switches and dimmers, each with either wall mounted or loose Pico’s.  I got the smart bridge to be able to schedule certain lights to come on at sunset and go over later.  Everything works as designed. Except I can’t get Siri Integration to work on my iPhone.  I did get it to work on my iPad Mini.  So despite, toggling on/off keychain, and doing reset on HomeKit, and even re-installing app.  No luck.  Not critical, but would be nice if that worked too.  I have IOS 9.0.2 on both devices.  Even tried this on a older iPhone which I’m running 9.1 Beta 4 on and that didn’t work on that phone either. It gets to the spot where it asks for the name of the home, and after trying it says Unable to Add that.  Like I said early, except for that feature works great.","updated":"2015-10-09T00:05:29-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1599132502","userName":"Sooo33baaad","userUrl":"https://itunes.apple.com/us/reviews/id24996733","version":"4.1.2","score":1,"title":"Horrible company - terrible products","text":"I remodeled a new home. Bought for $60+K of Lutron gears (Radio Ra2): NOTHING works as promised. They refuse to fix THEIR hardware problems, keep pointing fingers (not our fault, the dealer is the guilty party). I used 3 different dealers: same stories. One of them even took $2K from me to place the order for an automated shade, Lutron apparently canceled him out as a dealer after I placed the order and I never got my $2K back (nor the shade). Sensors are horrible (don't work as promised, randomly trigger or don't trigger,...). Switches have random issues. It looks like they \"leak\" electricity: some lights stay on 24h a day at very low level, you might only see them at night. Sometimes they don't turn on... believe me you don't want to buy anything from them. The only thing they do well is take your money and tell you it is not their problem...\nOne more thing they do well: keep you on hold on the phone or transfer you with a dropped call.","updated":"2017-04-27T11:20:13-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1230558252","userName":"TTSoul","userUrl":"https://itunes.apple.com/us/reviews/id14977828","version":"2.2.1","score":3,"title":"Suggestions","text":"Reliability of the app and server have improved tremendously. What I am waiting for is way, either through the app or through IFTTT, to enable an entire set of scheduled events in one click.  In other words, if I am on my way to our vacation home, I should be able to enable all of the lighting to follow a schedule designed for being there my pressing one button, not by individually enabling each scheduled event.  When I leave I should be able to switch it to an away schedule with one click. If this is too advanced for an app, provide desktop software. The functionality of this app, as it is, is quite limited.","updated":"2015-07-20T17:24:22-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1444071737","userName":"jcksr","userUrl":"https://itunes.apple.com/us/reviews/id40485120","version":"3.5.1","score":4,"title":"Love the system, but....","text":"This last update for the Smart Away seems to have mistakes in the times?   6pm to 11pm but not one of my lights are on after 10pm. Checked multiple times now.  \nThis needs to be corrected.  And, if my wife leaves in the middle of the day and I'm home - the porch light goes on sending her an text message, shouldn't the system know I'm home?  Why dues it turn on anyway in the middle of the day?   Might have to call this one in.  \nNow, (1) how about letting the user determine the time frame for Smart Away instead of locking it in to your predetermined times?   \nAlso, (2) how about allowing the user to decide the light intensity of the various lights programmed when using Smart Away?","updated":"2016-09-03T15:25:50-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1253744961","userName":"Nick on the Bay","userUrl":"https://itunes.apple.com/us/reviews/id16920744","version":"2.3","score":1,"title":"This app needs work","text":"This app is a great concept, but it doesn't work yet.  The manual controls work fine, but the scheduled controls don't seem to work at all. The information in the app is so thin as to be useless. Does the app need to be running in the background for scheduled events to work (I sure hope not)?  Do you have to enable location services on your mobile device to use the sunrise/sunset functions (again, I hope not since the device isn't always in the same time zone as the home)?  What iCloud functions have to be enabled to use multiple mobile devices to control the same home?  How do you change/edit the name of a device?  Good luck finding the answers to any of these questions. Any app that requires a CALL to support to work doesn't deserve more than 1 star. I still can't get my lights to go on at sunset.","updated":"2015-09-05T20:48:44-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1578287887","userName":"EveryoneIsAnotherYou","userUrl":"https://itunes.apple.com/us/reviews/id32958576","version":"4.1.2","score":2,"title":"Needs a lot of work!","text":"1. Adding a new dimmer the first time prompts for you to select the HomeKit room to assign to the dimmer. Immediately adding a second dimmer (\"add another device\") skips the room assignment. This is a bug. The room has to be manually assigned afterwards for the second and third dimmers and so forth.\n\n2. Lutron \"scenes\" are not true HomeKit scenes and can't be accessed via Siri - no excuse for this, make the Lutron scenes compatible or the same as true HomeKit scenes or name theme something different to avoid consumer confusion\n\n3. Scenes sort in the order they are created and cannot be resorted - this is lazy programming, allow manual and/or alphabetical sort, please!\n\n4. Smart Bridge firmware update fails unless the device is plugged directly into the Wifi base station/router - switches aren't supported for firmware updates. That's a pretty serious bug or design short coming the app ought to at least detect and explain to the user.\n\n5. App startup is quite slow\n\n6. App often fails to add new dimmers successfully, even when they are adjacent to the base station, and steps must be repeated multiple times to get dimmers registered.","updated":"2017-04-01T14:47:16-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1296954369","userName":"shareef777","userUrl":"https://itunes.apple.com/us/reviews/id34550805","version":"3.1","score":5,"title":"Home automation","text":"Lutron is my first foray into home automation and I must say they make it pretty simple. Everything worked out of the box as expected. Looking forward to expanding it beyond the two plug in and one wall dimmers I have now.\n\nUpdate:  what an epic failure. Siri integration has now failed. All I keep getting is 'unable to find smart bridge'.  Guess it's going back to the store. What a shame!\n\nAnother update. Turns out the  issue is NOT with Lutron, but rather Apple's poor implementation of HomeKit. Outside the HomeKit part, the system works 100% (just don't rely on Siri integration).","updated":"2015-12-06T13:12:41-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1416893405","userName":"Preferred Builder","userUrl":"https://itunes.apple.com/us/reviews/id349720804","version":"3.4.1","score":3,"title":"Not as good as WeMo","text":"As a builder I like to experiment with different wifi devices so I just installed the Caseta bridge, dimmer & remote with the app on iPhone at a client's home... So far the app works... sometimes and the jury is still out on whether the scenes I set up will work tonight (sunset on and 9:30 pm off)..... I don't like that I had to set 2 different scenes (one for on and another for off) and that scheduled scenes don't show up on the home page..... I will amend this review once the scenes are tested..... PS my WeMo (gave that 5 stars) is much easier to use & works like a charm (only one scene to set on & off).... I will say that the set up & install of the Caseta was simple & painless","updated":"2016-07-21T09:42:35-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1626902766","userName":"MMKtx","userUrl":"https://itunes.apple.com/us/reviews/id165513676","version":"4.1.4","score":3,"title":"Very slow","text":"Our experience is the same as those who say performance has slowed considerably. 50 limit is silly when Lutron hopes you will use their switches to control an increasing number of products. They are running the risk of having a product that isn't keeping up.  I am sure this will trigger another annoying standard response like others have received from Lutron.","updated":"2017-05-28T08:34:44-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1334685407","userName":"I like to calculate","userUrl":"https://itunes.apple.com/us/reviews/id308378562","version":"3.2.1","score":4,"title":"Reliable controlling light switches","text":"It gets the job done. I've been using this app to control caseta light switches for almost a year without any major complaints.\nI programmed switches to turn on and off relative to sunset and they have done the job. Occasionally use the app to remotely control lights and that has worked too.\nWould be nice to see some \"advanced\" control such as \"if light is already on don't change it, otherwise set it to 50%\". Right now you can just set it to 50% regardless of its current state.\nI guess I'm nitpicking here, as the basics all work just fine.","updated":"2016-02-17T20:34:56-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1591539452","userName":"Daxwards","userUrl":"https://itunes.apple.com/us/reviews/id25638543","version":"4.1.2","score":4,"title":"Good App, Delete and Reinstall Helps","text":"I have the latest iOS and updated the Lutron app. But I've had trouble getting the scenes to load. With this latest version I couldn't get them to load at all. But uninstalling and reinstalling solved it. I had to log in again and reset to my darker theme but everything else was there. Now I'm much more pleased. It's a great app in my opinion. The only thing I wish it had was a way to set my own hours and light intensity for the Smart Away schedule. But everything else is great. Amazing technology. Really easy to use.","updated":"2017-04-17T22:30:48-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1552650766","userName":"willys2007","userUrl":"https://itunes.apple.com/us/reviews/id31906311","version":"4.1.1","score":4,"title":"Unexpected good app","text":"I've always had good luck with Lutron products, and the Caseta line is no exception.  The SmartBridge was really the first time I used any sort of home automation gadget, and honestly for a company that focuses on hardware products, this application is surprisingly well done.  I've yet to encounter any sort of bug, so set up of the system was pretty easy.  Personally the only thing I would change is the color scheme they use to indicate if status:  on=light blue, off=gray.  It looks nice but for me under certain conditions it's a bit difficult to distinguish the state.","updated":"2017-02-25T18:19:59-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1397792692","userName":"Joeytendsbar","userUrl":"https://itunes.apple.com/us/reviews/id27369933","version":"3.4","score":4,"title":"I thought it worked great","text":"I downloaded this app to go along with my Caseta switch and Internet bridge, I had no problems with the initial set up and everything worked well. My only reason for not giving it 5 stars is I feel the timed on/off feature should of been a little easier to figure out, but not a big problem since I emailed customer support and received an answer to my question in less than 24 hours. (You need to create a scene and then you can give it a schedule)\n\nThanks Brian from Lutron tech support.","updated":"2016-06-20T19:52:27-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1262830616","userName":"NotSoRavon","userUrl":"https://itunes.apple.com/us/reviews/id49620058","version":"2.3","score":5,"title":"Superb App","text":"From my experience, the latest update has fixed the before mentioned bugs. Love this system, specifically I like that the dimmers use their own frequency to communicate (rather than clog the wifi) but still show up in HomeKit as separate controllable devices. I'd like to see HomeKit scenes added to the app (right now they are Lutron specific) but that isn't a deal breaker for me. Keep up the good work Lutron team!","updated":"2015-09-25T20:05:37-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1332120652","userName":"Phinster71","userUrl":"https://itunes.apple.com/us/reviews/id40386002","version":"3.2.1","score":2,"title":"Elementary App","text":"The app functions, but it stops there.  There are so many ways it could be better - starting with the ability to group devices by room and to be able to see more than just 4 devices on the home screen.  Look at some of your competition, they are so much better.  I just wish I could use those apps with the Caseta devices. Lastly, there needs to be an iPad version.  Using the iPhone version on my iPad with Retina results in seeing even less devices on the screen than what I see on my iPhone. Please create an iPad version!","updated":"2016-02-12T20:17:30-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1334020972","userName":"Dadzooks","userUrl":"https://itunes.apple.com/us/reviews/id201600524","version":"3.2.1","score":5,"title":"Stellar","text":"I made sure to get the Smart Hub Pro version 2 with my set up. Every single wall switch and remote set up flawlessly. As always, just make sure you have a solid wifi network at home. Don't set up Picos until you are done with all of your wired devices or you have to do it again. Otherwise, great control with options like IF for customization. Love it.","updated":"2016-02-16T12:18:24-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1276163686","userName":"iPhone4UserDt","userUrl":"https://itunes.apple.com/us/reviews/id85035353","version":"2.4","score":4,"title":"Needs an on/off schedule.","text":"These light switches and outlets have been great for us. What would make the app when better would be the ability to turn the lights off on a schedule. I like to turn the lights on for my dog but forget to turn them off at times. We used to use a timer for that but have upgraded to your app instead. Would love to see this in the next update!!","updated":"2015-10-23T20:45:57-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1271240871","userName":"JoeTech22","userUrl":"https://itunes.apple.com/us/reviews/id8821909","version":"2.4","score":4,"title":"Great app. Feature and hardware request.","text":"Overall the app works exactly as described. I use the caseta switches for my home theatre setup with my logitech whole home remote and it works eveytime. I also use it for my garage, hallway, and porch. Plan on adding more switches soon. I would really like to see a native ipad app. I would also like to see some new hardware including an outlet that is not a plugin and more availability of the non dimming switches/pico remotes.","updated":"2015-10-13T18:13:45-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1406430293","userName":"Senehts","userUrl":"https://itunes.apple.com/us/reviews/id30299426","version":"3.4.1","score":2,"title":"Love app and functionality. Hate that Siri and HomeKit randomly stop.","text":"Love the app and Caseta functionality. Over 20 devices in a newly remodeled home. Hate that the system has lost Siri/HomeKit associations more than once in the 6 weeks we've been using it. The App works; Siri stops randomly, for good. All other HomeKit devices continue to work with Siri (Philips Hue, August Lock, Ecobee3). It's frustrating and requires a good deal of troubleshooting with Lutron support and work to get it re-setup, re-associated and running with Siri again. Wish they could solve this.","updated":"2016-07-06T05:59:33-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1334721333","userName":"ramonetl","userUrl":"https://itunes.apple.com/us/reviews/id39343549","version":"3.2.1","score":5,"title":"People are such spoiled whibers.","text":"The app is free and it works flawlessly. I guess people feel that your dimmers should say \"welcome home honey would you like a drink?\" Well lets talk about the app and the product. My dimmers paired instantly, my phone controls them and everything works. Just buy it and don't listen to mr 2 stars bc it didn't make me coffee. This just works.","updated":"2016-02-17T22:24:50-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1476990091","userName":"Cindyeo","userUrl":"https://itunes.apple.com/us/reviews/id38105058","version":"4.0.1","score":4,"title":"Works well, wish you could have multiple houses","text":"I liked the Caseta system so much I just installed some new Caseta switches in my vacation house. Now I find out I cannot add a house, I have to log out and log in with a different email. I have other apps like my Honeywell thermostats and my LiftMaster garage doors that let me toggle between 2 properties. Lutron you need to bring the app up to 2016 standards","updated":"2016-11-01T16:22:09-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1328975010","userName":"Sunspot19","userUrl":"https://itunes.apple.com/us/reviews/id37530370","version":"3.2.1","score":5,"title":"Excellent switches and app","text":"Has been a fantastic way for me to automate lights in my vacation home and keep track of things whether when at home or from afar.\n\nLook forward to seeing more integration with addition home automation devices besides just thermostats.\n\nHave also used wink app with caseta switches but think I prefer the Lutron app.","updated":"2016-02-06T14:48:08-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1350201321","userName":"ShadyLady1204","userUrl":"https://itunes.apple.com/us/reviews/id497156368","version":"3.2.2","score":5,"title":"Awesome Automation","text":"I love this app. The system was affordable and easy to set up - so easy I even got my friends and family systems for the holidays! I love that I can control my lights, shades, and even Nest thermostat from anywhere in the world! When I travel, I turn the lights in the living room on and off just to mess with my family!","updated":"2016-03-19T06:59:56-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1603238321","userName":"Yachtsa","userUrl":"https://itunes.apple.com/us/reviews/id87820158","version":"4.1.2","score":4,"title":"Great system","text":"Great system. Only thing I'd like to see updated is within the App under settings to have the ability to change locations. ADT has that ability. Since I only have one email address which is used to login to the app, I'm required to use other people's emails in order to set up other homes that I own.","updated":"2017-05-02T08:32:05-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1190547076","userName":"Iphonefour","userUrl":"https://itunes.apple.com/us/reviews/id101088114","version":"2.1","score":3,"title":"Way to go Lutron","text":"Amazing update all these features you added specially geo fencing is just great! Only thing I can ask for now is a sleep timer. Where we can set our bedroom light to turn off after whatever minutes a user wants. That would be a really neat feature if you can add that.\n\nNow the reason this app is 3 star is because this app is still not optimized for iPad air why????","updated":"2015-04-30T22:56:27-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1320727725","userName":"brettsaffery","userUrl":"https://itunes.apple.com/us/reviews/id21958372","version":"3.1","score":1,"title":"App crashing","text":"Lutron really needs to decide if they want to be in this to win it! I am a dealer for Lutron and sale both caseta and RA products. Not sure if the update has something to do with the app crashing lately  but this is an ongoing issue and I have been working with tech support every month in regards to my client systems having the same issue. It appears the app is crashing with the new update and I'm sure Lutron was given enough time by Apple to release a new version. If I turn off notifications app is okay and opens.","updated":"2016-01-22T17:59:59-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1431626658","userName":"La1248Tui","userUrl":"https://itunes.apple.com/us/reviews/id132815688","version":"3.5","score":1,"title":"Needs Some Work with Siri Integration","text":"Functionality works well overall, however if using Siri Integration you cannot name your switches the same as your Siri 'Rooms'. This is ridiculous because I've had to use abbreviations on the switches that appear on the home screen:\n\nLiving Room = LR\nKitchen = K\nEtc...\n\nJust so I can tell Siri to 'turn on the Living Room lights.'\n\nThis needs to be addressed because it will become extremely confusing with 10+ switches installed. These should be able to be named the same.\n\nMoving to 1 star: in the most recent update the app randomly turns on lights when it thinks you are home...the update documentation literally states \"randomly turns on lights when the app thinks you're home.\" I woke up at 3 am this morning with my lights blazing thinking someone was in my house. I love alone.","updated":"2016-08-12T05:33:32-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1612873544","userName":"SandraCG","userUrl":"https://itunes.apple.com/us/reviews/id36399286","version":"4.1.4","score":3,"title":"Scenes only after sunset does not work.","text":"This feature stopped working since  the last two updates, I tried everything, uninstalled app and installed again and still  doesn't work. This is the only flaw I see with the app, I have 5 caseta dimmers and still thinking in continue upgrading around my home.","updated":"2017-05-13T06:57:15-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1080612536","userName":"cheezysteak","userUrl":"https://itunes.apple.com/us/reviews/id33534768","version":"1.2","score":5,"title":"Super reliable and fast","text":"Really works very well as what it does, more reliable and much faster responding than my hue bulbs. For the one one-star review here, you just have to create the \"off\" state as a scene itself. My wishlist:\n\n- iPad optimized UI\n- An external plugin switch for three prong devices (fans, etc)\n- HomeKit support","updated":"2014-10-14T23:12:50-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1497025234","userName":"V_Byl","userUrl":"https://itunes.apple.com/us/reviews/id21762602","version":"4.0.2","score":4,"title":"Functional, GUI not great.","text":"Compared to other smart home apps, this one works.  Smoothly adds devices, controls, and I appreciate the widget and apple watch app.\n\nThe GUI, for purposes of opening the app and controlling devices is just, bad.  Needs a room layout or something other than the cluttered slider look that it currently has.","updated":"2016-12-06T05:47:16-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1282531245","userName":"lbjazz","userUrl":"https://itunes.apple.com/us/reviews/id16076839","version":"2.4","score":2,"title":"Decent start, but major features lacking","text":"It seems to work well so far, but there are several missing  or incomplete features badly needed. First, we need a native iPad app. Second, scheduled scenes need to be much more robust, allowing a real, infinitely varying schedule with variables and sunrise/sunset. Finally, there just need to be more things in the Caseta ecosystem and a higher device count. Also, initial configuration of the bridge seemed overly complex  and time consuming.","updated":"2015-11-05T18:47:06-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1208305568","userName":"Rjais","userUrl":"https://itunes.apple.com/us/reviews/id181530079","version":"2.2","score":5,"title":"Solid!","text":"Apple Watch : With the limited access apple initially gave developers, Lutron has done and outstanding job coding this app. Its the quickest, most stable 3rd party app that controls the home.   Lutron continues to make solid products.  I can control my Lutron Serena shades through the apple watch.","updated":"2015-06-06T18:42:13-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1558745484","userName":"Hymark999","userUrl":"https://itunes.apple.com/us/reviews/id10545312","version":"4.1.1","score":3,"title":"Bad Scheduling App","text":"Easy setup. Great manual operation.  Scheduling is terrible. Need to setup separate events for on and off. No vacation schedule and randomized on/off - which why I bought this for when we are traveling.  Phillips is much better app for this. Lutron provides better dimmer switch solution and does not require smart bulbs. Will be switching back to Phillips - too bad.","updated":"2017-03-06T06:06:47-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1408289472","userName":"Onfus","userUrl":"https://itunes.apple.com/us/reviews/id12146454","version":"3.4.1","score":1,"title":"All broken now - do not upgrade!!","text":"Loved the app, last upgrade broke everything for me.  It all worked very well.  Lights will go on and off on schedule, Siri integration worked, scenes worked.   After last upgrade, the app 'forgot me' and can't seem to find a way to recover my account.   Had to create a new account and it even let me use the same credentials!!  Which means anybody that comes to my house can take over my light control.  Not very secure - scary.","updated":"2016-07-09T03:43:56-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1176004319","userName":"Rob189pk","userUrl":"https://itunes.apple.com/us/reviews/id149731649","version":"1.4.1","score":3,"title":"Good app but....","text":"I love the actual caseta dimmer switches and the smart bridge but the app leaves a bit to be desired. It loads slow but it's not too bad. It would be nice if you could customize the order of scenes, devices, etc... Also, it would be really awesome if Lutron created an iPad app, I think we've waited long enough.","updated":"2015-03-31T15:27:59-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1124828451","userName":"jojojojo11133re22","userUrl":"https://itunes.apple.com/us/reviews/id387851175","version":"1.3","score":2,"title":"Painful to get through the bugs and crashes","text":"Nothing like getting a message stating simply \"Error\" and enduring multiple \"Request Timeouts\" (even when 1 ft from my router with 50 MBs speeds) when there could be no reason for it. I loved Lutron when I was using the standalone remotes, and now this thing has created needless frustration. Wish they spent some more time on debugging before throwing this out there.","updated":"2015-01-04T18:36:52-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1242080318","userName":"Aifonu'","userUrl":"https://itunes.apple.com/us/reviews/id43407248","version":"2.3","score":4,"title":"Responsive app, great support","text":"After some initial setup issues (due to some bad upgrade and some bad design decisions), Lutron support was quick to suggest a work-around and fixed the issue in a couple of days. I’m quite happy with the app, and everything works as it should.","updated":"2015-08-12T11:57:46-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1126212855","userName":"Enricoclaudio","userUrl":"https://itunes.apple.com/us/reviews/id129088347","version":"1.4","score":5,"title":"Nice and simple!!","text":"This app works perfect with my Lutron Caseta Smart Bridge and Caseta Wireless dimmers. Not a single glitch since first day. It's very simple and intuitive and give you full control over your lights. In the last update they added support for Nest thermostats as well!!!","updated":"2015-01-07T12:23:25-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1385682012","userName":"DannyBoy3220","userUrl":"https://itunes.apple.com/us/reviews/id248011330","version":"3.3","score":1,"title":"Too slow to load","text":"The time it takes for this app to load you can buy a car, drive home, turn off the light, and drive back to work.  They  really should have thought about how long it takes to flip a switch when they made this app.  The only hope is to create \"scenes\" and make them accessible via \"Today Widget\" which you can access instantly.","updated":"2016-05-28T21:52:22-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1244118617","userName":"DPLBK","userUrl":"https://itunes.apple.com/us/reviews/id37352198","version":"2.3","score":5,"title":"Great product","text":"I've used it for about a month now. It hasn't ever not worked.  And when not using the app, the switches themselves are as nice as I've found. \n\nToo bad they don't own Nest.","updated":"2015-08-16T11:25:17-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1463215446","userName":"Al438","userUrl":"https://itunes.apple.com/us/reviews/id131374201","version":"4.0.1","score":2,"title":"Crash a lots","text":"When it works, it's fantastic. It crashes, it's sometimes works, and sometimes takes the night off. The Siri commands are cool, but this need a lot off minor bug fixing for me to give it more stars. The worst part is the up front investment of all the switches and the bridge, and if the app is faulty, it's money down the drain.","updated":"2016-10-08T06:40:58-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1458778676","userName":"BillyBon Thorton","userUrl":"https://itunes.apple.com/us/reviews/id225795659","version":"4.0.1","score":4,"title":"Activate scene before sunset option!!","text":"We need an \"activate scene before sunset\" option under \"Arriving/Leaving Home\" so I can have my shades open automatically when I arrive home after work and it's still sunny outside.","updated":"2016-09-30T20:38:07-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1506863323","userName":"Nickname784543543","userUrl":"https://itunes.apple.com/us/reviews/id333104870","version":"4.0.2","score":2,"title":"So much missing!!","text":"You would think a software and hardware automation system from one of the leading companies out here would have a decent UI and a full line of dimmers that are not made cheap as possible, but I guess Lutron would rather turn out poorly made software and hardware.  I shouldn't have to worry about my $100 dimmer catching fire.","updated":"2016-12-22T08:24:16-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1286993118","userName":"Zapien916","userUrl":"https://itunes.apple.com/us/reviews/id119738797","version":"3.0","score":5,"title":"Wow...","text":"This is pretty much the coolest thing I own. Connection is pretty much instant on and off (way better then with the wink hub which lags). Works as advertised and integration with Siri is seamless. Can't wait to get more switches.","updated":"2015-11-15T06:20:34-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1601883880","userName":"Nickipedia989","userUrl":"https://itunes.apple.com/us/reviews/id214737164","version":"4.1.2","score":1,"title":"Doesn't work","text":"The smart bridge will not pair with the app out of the box. It constantly displays a message about needing a firmware update \"unplug the box and plug it back in\" so the update can continue. However no update ever happens. The app will continue to tell you the smart bridge needs a software update even after repeated attempts and reboots. Support offered a workaround that does not work. Very disappointed.","updated":"2017-04-30T19:23:06-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1218646710","userName":"drtaxsacto","userUrl":"https://itunes.apple.com/us/reviews/id39765652","version":"2.2","score":5,"title":"Excellent and simple","text":"Once you get the bridge set up and understand the difference between devices and scenes this is a snap.   It works well for automation and even for geofencing.","updated":"2015-06-27T07:50:37-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1276648221","userName":"DPBFREE","userUrl":"https://itunes.apple.com/us/reviews/id28961558","version":"2.4","score":3,"title":"Works great when you can log in","text":"To many outages of the log into the app. Constantly going down. Works great when it's connected. Quick fast response with Siri. Only problem is it goes out.","updated":"2015-10-24T18:47:15-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1325664247","userName":"GoTour","userUrl":"https://itunes.apple.com/us/reviews/id35334180","version":"3.1","score":5,"title":"Easy to use, great GUI","text":"A must-have not only to control your system, but also to program it. Makes programming much faster amd easier. Works in the cloud locally or remotelly. Love it! For Caseta sustems only.","updated":"2016-01-31T10:32:51-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1607094327","userName":"RickSPI","userUrl":"https://itunes.apple.com/us/reviews/id16899706","version":"4.1.2","score":5,"title":"Great app, system","text":"Donno what the problem is. I just installed two dimmers and the Smartbridge, the app works perfectly. Maybe they fixed things as of May 2017.","updated":"2017-05-06T18:28:13-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1416456910","userName":"Gek571","userUrl":"https://itunes.apple.com/us/reviews/id6890841","version":"3.4.1","score":2,"title":"Siri control and scene automation broken","text":"I have never been able to connect the system to Siri since I installed it last year.  Additionally the most recent update broke the \"turn on when I get home\" feature--if I set it to turn on only after sunset, it never recognizes sunset so never turns on.","updated":"2016-07-20T20:30:47-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1612013312","userName":"Xtrmist78","userUrl":"https://itunes.apple.com/us/reviews/id33610092","version":"4.1.4","score":4,"title":"Great, Sleek, & Cutting Edge","text":"I would recommend that the smart away feature have a customizable start and stop time, with ability to have the times be astronomical vs. fixed.","updated":"2017-05-12T07:58:07-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1543174672","userName":"Islandluber","userUrl":"https://itunes.apple.com/us/reviews/id124855413","version":"4.1.1","score":5,"title":"Yes there is iPad support","text":"This is seamless.    However, the App Store doesn't show this app.  It seems you must load it through google, and then download.","updated":"2017-02-12T13:39:43-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1385384235","userName":"Pleter69","userUrl":"https://itunes.apple.com/us/reviews/id21293658","version":"3.3","score":4,"title":"We are off to a good start","text":"I'm a general contractor, I've installed may systems. Yeah this isn't perfect, but it's a step in the right direction. \n\nI can't wait to see what improvements are coming. \n\nKeep up the good work.","updated":"2016-05-28T07:06:12-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1311914707","userName":"Transampimp","userUrl":"https://itunes.apple.com/us/reviews/id42520447","version":"3.1","score":4,"title":"Great start","text":"I purchased the hub and 6 switches.  Works great on watch and Siri if home.  I'd give five stars if it would allow me to edit the schedule on my Honeywell thermostat. Furthermore, a way to connect motion sensors and web cameras would be great.","updated":"2016-01-05T18:01:51-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1567320900","userName":"Phin3","userUrl":"https://itunes.apple.com/us/reviews/id30064292","version":"4.1.1","score":5,"title":"Amazing app!!","text":"I love being able to control my lights from anywhere, anytime! The app works perfectly and I love how l can personalize scenes and settings.","updated":"2017-03-18T11:49:17-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1462399710","userName":"Saint Andrews","userUrl":"https://itunes.apple.com/us/reviews/id33939935","version":"4.0.1","score":1,"title":"Not working with Siri or HomeKit","text":"While the device was easy to install and works fine with the remote, the Siri integration isn't working (keeps failing when you try to set it up) and the devices don't show up in the Home app. So this doesn't really work with Apple HomeKit or Siri as promised. Big disappointment. Hope this gets fixed.","updated":"2016-10-06T21:12:25-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1380580310","userName":"MDC1","userUrl":"https://itunes.apple.com/us/reviews/id24123188","version":"3.2.2","score":2,"title":"Will not install","text":"Been using this app for months but the latest version simply will not install on my iPhone. I have tried several times on different networks. It looks like it all downloads but then it just stops and sits there without installing.","updated":"2016-05-18T10:44:53-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1288454007","userName":"Oscar Waczynski","userUrl":"https://itunes.apple.com/us/reviews/id104295242","version":"3.0","score":2,"title":"Here's what's wrong with this app","text":"When I come home, sweet home Alabama, the name of a scene I created gets fired. \n\nHowever... If another user of the app is there, it'll overwrite their lighting scene. Which it shouldn't.\n\nCreating or modifying your scenes is horrendous. Instead of actively seeing your scene play out as you adjust it, it'll instead require you to grab a piece of paper, adjust the lights, record the percentages, and then use that as a guide for your scene.\n\nWhatever you guys are doing over there... It's obvious you're not using your own products.","updated":"2015-11-18T15:23:30-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1507888293","userName":"yas375","userUrl":"https://itunes.apple.com/us/reviews/id167763933","version":"4.0.2","score":3,"title":"Bug with Pico and Sonos","text":"I have 2 Sonos Play 1. I've setup pico remote to control the one in my bedroom, but it controls the other one. If I change the setting in the app nothing really changes. It just always controls wrong sonos.","updated":"2016-12-23T23:05:53-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1389914251","userName":"Lutron lover","userUrl":"https://itunes.apple.com/us/reviews/id171935357","version":"3.3","score":1,"title":"App functionality is broken after update.","text":"Load time is insane. Sometimes hangs on loading. With wifi off I get the \"looks like you left home with lights on\" push notification even when home. Spent hundreds on dimmers and smart switches to now be unable to control effectively. DON'T UPDATE UNTIL ITS FIXED.","updated":"2016-06-06T06:29:13-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1057945962","userName":"Richr71","userUrl":"https://itunes.apple.com/us/reviews/id101794197","version":"1.1","score":5,"title":"Awesome!!","text":"Great product. I recommend this if you want control of all your lighting from your phone.","updated":"2014-09-02T09:26:57-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1284440902","userName":"Smags81","userUrl":"https://itunes.apple.com/us/reviews/id123649160","version":"2.4","score":3,"title":"Great when you can log in","text":"Just like the previous review its amazing when you can log in. When you can't it's very frustrating. Please fix!!","updated":"2015-11-09T16:42:24-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1130741670","userName":"Thomas Alan","userUrl":"https://itunes.apple.com/us/reviews/id40583055","version":"1.4.1","score":4,"title":"Great app, needs a few tweeks","text":"Love the products and app!\n\nOnly a couple wishes to make it 5 stars:\n- Wish it launched faster. (Often it's faster to walk over to the switch!)\n- Wish you could get rid of the useless picture that takes up 1/3 of the screen. Why is it there????!?\n- wish you could control the order of the buttons. \n- Wish there was an iPad version.","updated":"2015-01-16T00:14:08-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1337626453","userName":"Jazz Thompson","userUrl":"https://itunes.apple.com/us/reviews/id208029225","version":"3.2.2","score":2,"title":"Schedules (\"Scenes\") don't work","text":"My dimmer and on/off Caseta switches respond immediately to my app commands for dimming, on, and off.  But the programming of timers and sunrise/sunset light responses is confusing and doesn't work.  I updated my time zone (I think I had it correct to begin with) but that didn't help.  Please fix!","updated":"2016-02-23T12:39:08-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1318226875","userName":"Js81243O","userUrl":"https://itunes.apple.com/us/reviews/id117446255","version":"3.1","score":1,"title":"App works but Siri doesn't","text":"Light controls from the app seem to work fine. However, Siri integration thru the app is a pain.  I set up an Ecobee3 HomeKit thermostat, which was extremely easy, and now I can no longer connect to my Caseta Smart Bridge.  I called technical support but they said they couldn't help and immediately told to me call Apple.","updated":"2016-01-17T20:09:21-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1415307720","userName":"Nica Enriquez","userUrl":"https://itunes.apple.com/us/reviews/id391846633","version":"3.4.1","score":2,"title":"Not working","text":"Checked to see if I'm the only one having trouble with the app. Guess I'm not. It's a big hassle that I had to sleep with the actual Lutron remote beside me because I can't control my light with my phone anymore. I hope you guys fix it soon.","updated":"2016-07-19T04:24:54-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1373171581","userName":"PintoTheMan","userUrl":"https://itunes.apple.com/us/reviews/id15307806","version":"3.2.2","score":2,"title":"Siri Broken with latest update","text":"The Siri voice commands are not working correctly with his latest update. For instance if I say \"Hey Siri turn my lamp to 50%\" Siri will say \"Ok I turned your lamp to 50%\" but nothing happens. I have tried rebooting the Lutron Bridge and that hasn't fixed it. Please fix this ASAP!","updated":"2016-05-03T20:42:47-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1142310975","userName":"Pchainey","userUrl":"https://itunes.apple.com/us/reviews/id124121627","version":"1.4.1","score":4,"title":"Great Solution for Home Automation","text":"I was really excited to see Lutron have an affordable solution to home lighting automation. The set up was seamless the pairing easy looking forward to utilizing this app more.","updated":"2015-02-05T18:27:28-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1337929273","userName":"VinceDennis","userUrl":"https://itunes.apple.com/us/reviews/id343334591","version":"3.2.2","score":4,"title":"Love it","text":"Works really well with my dimmers. Scenes work great and I LOVE the today widget! \n\nOnly thing is it doesn't support my other smart device (iHome outlet plug); if it did this would be perfect. Thanks!","updated":"2016-02-24T04:38:37-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1327199934","userName":"Eagleone5","userUrl":"https://itunes.apple.com/us/reviews/id27366470","version":"3.2","score":5,"title":"Outstanding","text":"Simple....The server is down more than up.","updated":"2016-02-03T08:02:57-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1266120307","userName":"soop831","userUrl":"https://itunes.apple.com/us/reviews/id25473289","version":"2.4","score":3,"title":"Worked great for a while","text":"Lost my Siri integration. Keeps saying that I need to enable iCloud Keychain. That's already done. Not sure why it's not right. Still works without Siri but it's not the same and not as good.","updated":"2015-10-02T21:07:11-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1491430373","userName":"Spurlockda","userUrl":"https://itunes.apple.com/us/reviews/id179732330","version":"4.0.2","score":3,"title":"iPhone or iPad?","text":"The iPhone version on the iPad looks pretty amateurish!  Surely a company with as many brilliant engineers as Lutron can do better? Hopefully the Apps work better - especially with the costs so high!","updated":"2016-11-26T10:18:39-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1383090726","userName":"Psychor","userUrl":"https://itunes.apple.com/us/reviews/id28398330","version":"3.3","score":3,"title":"Good start, but needs som work!","text":"First, make sure you have compatible bulbs otherwise you're not going to like these devices. \n\nWish list:\n(1) Let us pick from all icons when adding a light. For some reason Lutron limits the icons selected for a light based on the switch being added.\n\n(2) Let us manually rearrange the order of lights added to the iOS app.","updated":"2016-05-23T14:03:14-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1186487317","userName":"Roxy gool","userUrl":"https://itunes.apple.com/us/reviews/id49339212","version":"2.0","score":5,"title":"Nice app","text":"The app and switches work great. It would be nice to have it shut off at a set time also.","updated":"2015-04-22T05:15:52-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1374069509","userName":"Midcarp","userUrl":"https://itunes.apple.com/us/reviews/id28703739","version":"3.2.2","score":2,"title":"Lytton academy's","text":"The hardware is very good and comes with clear instructions for installing it. The app is terrible, non-intuitive and has no instructions. I won't be purchasing anymore hardware until there is massive improvement in the software","updated":"2016-05-05T17:01:55-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1338773202","userName":"Hoping for better","userUrl":"https://itunes.apple.com/us/reviews/id35701329","version":"3.2.2","score":1,"title":"Real limitations. Don't buy Caseta!","text":"I've spent over $3k on Caseta devices. Likely will have to throw them away. \n\nWhy?  Lutron has decided to limit their app to control only 50 devices. I'm happy to pay up for a higher priced bridge, but given that every dimmer, remote, the hub etc., takes up one of the 50, you run out quick. \n\nAnd to add insult to injury, Lutron has not been able to integrate scenes with Siri. A basic capability of HomeKit is not available. \n\nAsking Apple to decertify them from HomeKit. Doubt it will happen, but this is a major ripoff.","updated":"2016-02-25T20:48:47-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1388606729","userName":"Scorpio2k8","userUrl":"https://itunes.apple.com/us/reviews/id29731873","version":"3.3","score":1,"title":"Last update broke the app","text":"Since the most recent update, my arriving home scene doesn't trigger, and I no longer get notifications if I leave a light on when I leave home. I've been in touch with lutron support, but so far they haven't resolved the problem.","updated":"2016-06-03T20:44:56-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1186034804","userName":"losethetie","userUrl":"https://itunes.apple.com/us/reviews/id100687041","version":"2.0","score":5,"title":"Holy Awesome Widget!!!","text":"The widget is exactly what I've been hoping for. Works flawlessly and makes changing scenes so much quicker. Great update!","updated":"2015-04-21T06:24:44-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1522868036","userName":"ktanthonyc","userUrl":"https://itunes.apple.com/us/reviews/id142969778","version":"4.1.0","score":4,"title":"Great app and suite of products but....","text":"I'm having problems with the latest update. It can't tell that I'm arriving home.","updated":"2017-01-15T09:47:15-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1192062418","userName":"Coolbreeze","userUrl":"https://itunes.apple.com/us/reviews/id100703629","version":"2.1","score":4,"title":"Good job Lutron!","text":"Easy to use. Connects quickly and works well with the smart bridge. Also enjoying the geofencing update!","updated":"2015-05-03T20:35:16-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1354595756","userName":"Patrick M","userUrl":"https://itunes.apple.com/us/reviews/id28076303","version":"3.2.2","score":3,"title":"Siri broken","text":"Everything works fine except Siri, which, if it worked, would make this a five star app.  No Siri is a big letdown.","updated":"2016-03-27T15:50:37-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1308131253","userName":"sandeepbangera","userUrl":"https://itunes.apple.com/us/reviews/id46180334","version":"3.1","score":1,"title":"Crashes all the time","text":"It is really slow to add devices etc and after the recent update has been crashing all the time and won't launch. sent emails but no help from support yet :(. I have been using the elgato eve app instead.","updated":"2015-12-29T09:47:30-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1233768527","userName":"hiruko27","userUrl":"https://itunes.apple.com/us/reviews/id42069202","version":"2.2.1","score":5,"title":"Awesome!","text":"Great app and has improved a lot since the first version.","updated":"2015-07-26T23:14:52-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1329321692","userName":"CaTaSTrOphiK","userUrl":"https://itunes.apple.com/us/reviews/id134430097","version":"3.2.1","score":4,"title":"Stopped working","text":"I'm not sure if it is the update that caused it. But my smart bridge is no longer accessible.","updated":"2016-02-07T05:45:48-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1298407547","userName":"GeoffreyPalmer","userUrl":"https://itunes.apple.com/us/reviews/id19457701","version":"3.1","score":4,"title":"Powerful home automation app","text":"The app works great with Lutron Caseta products (switches, remotes, etc.) and with Nest thermostats.  \n\nWhat's missing: \n- Native iPad app - when is this coming?\n- Integrated camera setup and viewing, including motion detect alerts\n- Variable auto start and end times for timed scenes so lights turn  on and off at slightly different times daily","updated":"2015-12-09T19:53:46-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1196984726","userName":"theearthling","userUrl":"https://itunes.apple.com/us/reviews/id39255460","version":"2.1.1","score":1,"title":"Just work","text":"App asks me to turn on push notifications EVERY TIME I use it.  WHY? Also, it takes a good 10-20 seconds before the app is ready to let you turn the lights on. I can walk to the switch faster than that.","updated":"2015-05-13T21:19:12-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1359693541","userName":"SMK Electric","userUrl":"https://itunes.apple.com/us/reviews/id174531959","version":"3.2.2","score":2,"title":"Needs iPad support","text":"We primarily use iPads built into the walls of our home automated system. This app needs to work with the iPad in landscape mode. I may return all of the casita dimmers as they are useless in our application.","updated":"2016-04-06T21:57:12-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1517369918","userName":"spelunkster","userUrl":"https://itunes.apple.com/us/reviews/id20680304","version":"4.1.0","score":3,"title":"This update broke the widget readability","text":"This latest update has made the widget text *impossible* to see/read.","updated":"2017-01-07T12:02:12-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1100768785","userName":"Koehlperson","userUrl":"https://itunes.apple.com/us/reviews/id141980836","version":"1.3","score":4,"title":"Doesn't work with latest upgrade","text":"Good app but breaks with latest upgrade.","updated":"2014-11-21T15:26:50-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1542497164","userName":"Carolc913","userUrl":"https://itunes.apple.com/us/reviews/id169961477","version":"4.1.1","score":2,"title":"What's happened???","text":"I upgraded the app today and now it won't communicate with Alexa.  I have deleted the app, deleted the devices and still nothing.  Please fix!","updated":"2017-02-11T16:13:58-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1207753777","userName":"Philip71118","userUrl":"https://itunes.apple.com/us/reviews/id165447670","version":"2.2","score":5,"title":"Awesome features super reliable","text":"No other home automation gadgets work this reliably. Great job Lutron!","updated":"2015-06-05T15:57:09-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1326173157","userName":"Gameguy456","userUrl":"https://itunes.apple.com/us/reviews/id147263717","version":"3.1","score":1,"title":"App crashes","text":"Installed for a client in Palo Alto, California where expectations for apps working seamlessly is high. The app crashes or requires re log in 50% of the time. Client is being patient but this won't end well. How can Lutron put out such a poor product?","updated":"2016-02-01T08:51:10-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1289896105","userName":"whoaduck","userUrl":"https://itunes.apple.com/us/reviews/id185192988","version":"3.1","score":1,"title":"No iPad app and constant crashing.","text":"The latest update completely broke the iPad compatibility. I don't know how long we need to wait for a full iPad version but now the iPhone version is broken too.","updated":"2015-11-21T18:35:55-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1332138918","userName":"Dr. Physics","userUrl":"https://itunes.apple.com/us/reviews/id33348100","version":"3.2.1","score":1,"title":"Caseta app suddenly can't find its bridge","text":"After months of reliability, the Caseta bridge now can't be discovered by the app. Your ability to turn on lights, set scenes, or use Siri is DOA. Come on Lutron, engineer a solution. While that's happening, a Caseta iPad app would be wonderful.","updated":"2016-02-12T21:08:44-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1303221757","userName":"martyjimbo","userUrl":"https://itunes.apple.com/us/reviews/id42293536","version":"3.1","score":1,"title":"Doesn't work since the last update","text":"No longer connects after the last update. Very frustrating.","updated":"2015-12-19T21:10:45-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1191186040","userName":"Cpanza76","userUrl":"https://itunes.apple.com/us/reviews/id13917299","version":"2.1","score":1,"title":"Update caused crash","text":"After the update, I can no longer connect to the smart bridge. Hopefully this issue is fixed quickly.","updated":"2015-05-02T05:10:19-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1522675188","userName":"Lt. O'Whora","userUrl":"https://itunes.apple.com/us/reviews/id35669523","version":"4.1.0","score":3,"title":"Not great but HomeKit integration works well","text":"This app does what it is supposed to but it comes with poor documentation and ugly interface. However it is integrated with Apple's built in HomeKit. What that means is that once you add your Lutron devices with the Lutron app you can use Apple's \"Home\" app to control your Lutron Caseta devices, create scenes, and invite other members of your household so they can also use the Home app to control your home's lights, etc. You never have to use the Lutron app once your home is setup.\nTips-\n*When setting up the Lutron app it will ask you to setup an account and password. You will also get a warning that only one account can be used. Don't worry, this is merely an administrator account -it can be any valid email address and password specific for your Lutron controller. Only you need to know the details. You will still be able to invite other users with iCloud accounts to control your Lutron switches, etc.\n*Use the Lutron app to add devices etc.\n*Launch Apple's Home app (you might need iOS 10) and you should see your Lutron devices. You can also create scenes to control groups of lights and/or outlets. To dim lights tap and hold the switch until a slider pops up.\n*Invite other members of your home to control your devices by tapping the triangle/compass icon in the top left of Home's home screen. \n*When an invited user launches the Home app on their iOS device they will see the invite. Once accepted they will be also be able to control your homes Lutron devices. There is no need for them to use -or even download- the Lutron app.","updated":"2017-01-15T04:31:40-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1337101397","userName":"Daddyvichy","userUrl":"https://itunes.apple.com/us/reviews/id110338537","version":"3.2.1","score":1,"title":"Stopped working","text":"No longer connects to the bridge.  Please issue an update to the app asap as it won't get passed the initial loading screen when opening the app.","updated":"2016-02-22T09:34:01-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1349860912","userName":"Flarpy101","userUrl":"https://itunes.apple.com/us/reviews/id85335320","version":"3.2.2","score":5,"title":"Love it!!","text":"Home automation is finally reliable and affordable.","updated":"2016-03-18T15:39:56-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1171477215","userName":"CynT260","userUrl":"https://itunes.apple.com/us/reviews/id30615620","version":"1.4.1","score":5,"title":"Lights on for Lutron","text":"Works now with latest update. Love it!!!","updated":"2015-03-21T17:45:31-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1237084601","userName":"B Dep","userUrl":"https://itunes.apple.com/us/reviews/id102058112","version":"2.2.1","score":1,"title":"Horrible","text":"App is improved from first version but still locks up and fails way too much. I would expect more from Lutron. Good product but horrible app.","updated":"2015-08-02T14:26:59-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1599787323","userName":"kuhiria","userUrl":"https://itunes.apple.com/us/reviews/id87016044","version":"4.1.2","score":1,"title":"The app is a disaster","text":"I don't even know where to start, as so many things don't work. A piece of crappy software, as usual, but in an extreme way.","updated":"2017-04-28T06:12:33-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1192602175","userName":"abadis22","userUrl":"https://itunes.apple.com/us/reviews/id266853780","version":"2.1","score":2,"title":"Love the app but not working!!!!","text":"After the update the app is not working!! It cannot connect to the bridge...please fix it!!! Besides that, I Love the app!!","updated":"2015-05-04T21:38:47-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1233539977","userName":"Mutha luva","userUrl":"https://itunes.apple.com/us/reviews/id47685492","version":"2.2.1","score":1,"title":"A Waste of Time","text":"I have created an account and signed it about ten times and it keeps asking me to do it again. A waste of time.","updated":"2015-07-26T12:02:56-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1374076795","userName":"me@@&","userUrl":"https://itunes.apple.com/us/reviews/id113679377","version":"3.2.2","score":2,"title":"Siri broken","text":"No longer able to use Siri to dim individual switches. Only rooms can be dimmed","updated":"2016-05-05T17:28:19-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1380085048","userName":"Stevies3","userUrl":"https://itunes.apple.com/us/reviews/id6895887","version":"3.3","score":1,"title":"Log in slow","text":"Talkers much longer to log in when starting the app.","updated":"2016-05-17T09:30:39-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1539984173","userName":"pcarman","userUrl":"https://itunes.apple.com/us/reviews/id37585151","version":"4.1.1","score":1,"title":"Update but still no iPad support","text":"Where's the iPad support? Still,lacking in this new version!!!  It's 2017 guys, get with the program!!!","updated":"2017-02-08T05:45:50-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1383694584","userName":"jamesnseattle","userUrl":"https://itunes.apple.com/us/reviews/id37192014","version":"3.3","score":1,"title":"Siri now broken","text":"App will no longer recognize my Smart Bridge and Siri can't work.   I wish I could downgrade.","updated":"2016-05-24T21:27:22-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1390154949","userName":"Unumbedyunumex","userUrl":"https://itunes.apple.com/us/reviews/id14857241","version":"3.3","score":1,"title":"Loses settings","text":"Every time I use this app it loses the lights and I have to add them again","updated":"2016-06-06T18:14:55-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1595271901","userName":"Dl🚲","userUrl":"https://itunes.apple.com/us/reviews/id248665266","version":"4.1.2","score":1,"title":"Needs major work","text":"Enough said.","updated":"2017-04-22T16:52:26-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1371050621","userName":"1esotericguy","userUrl":"https://itunes.apple.com/us/reviews/id29094841","version":"3.2.2","score":2,"title":"Who broke Siri","text":"Siri used to work with this app.  Broken now all of a sudden.","updated":"2016-04-29T23:33:15-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1321960480","userName":"R9spot9","userUrl":"https://itunes.apple.com/us/reviews/id35971345","version":"3.1","score":1,"title":"Used to work, not anymore","text":"Siri is not working anymore, does not find the bridge, this is a joke","updated":"2016-01-24T20:01:17-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1534599811","userName":"JamesOnline.com","userUrl":"https://itunes.apple.com/us/reviews/id22497074","version":"4.1.0","score":1,"title":"App stopped working","text":"What's going on the app no longer works?  Please update it!  Thanks","updated":"2017-01-31T20:46:52-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1401880498","userName":"Wildor","userUrl":"https://itunes.apple.com/us/reviews/id42426237","version":"3.4.1","score":5,"title":"Love it.","text":"Works great with my Serena shades and Caseta lights. ;-)","updated":"2016-06-28T08:25:39-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1436867802","userName":"Wtzca","userUrl":"https://itunes.apple.com/us/reviews/id14220206","version":"3.5","score":2,"title":"Half-baked","text":"Doesn't offer full HomeKit integration.","updated":"2016-08-21T10:08:00-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1088367234","userName":"Alfil06","userUrl":"https://itunes.apple.com/us/reviews/id156993195","version":"1.2","score":5,"title":"Very nice!!","text":"Super fast!!!","updated":"2014-10-29T14:15:45-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1288946175","userName":"MrSwiffT","userUrl":"https://itunes.apple.com/us/reviews/id37646401","version":"3.1","score":1,"title":"Good but where's iPad version","text":"I love the Lutron Caseta system but seriously..... Why no native iPad version?","updated":"2015-11-19T19:16:02-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1444146301","userName":"Soundbeyond","userUrl":"https://itunes.apple.com/us/reviews/id363624010","version":"3.5.1","score":1,"title":"SONOS integration?","text":"Still looking for version 4.0 to link my Sonos devices to it?","updated":"2016-09-03T19:03:40-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6537862264","userName":"AngeloDePaolo","userUrl":"https://itunes.apple.com/us/reviews/id34076278","version":"7.3.1","score":3,"title":"No Dim or Off/On Speed Control","text":"Went from Phillips Hue to Leviton to iDevices to Lutron. Heard great things about Lutron and thought maybe I’d finally found a winner. Not quite unfortunately...\n\nApp Developer Requests Pretty Please:\n\n-Allow in-app editing for how Lonng it takes for lights to turn off. Not everyone wants a drawn out fading effect. Please allow the Fade Out to be shortened or eliminated.\n\n-Allow in-app editing of Dimming range for both High or Low max/min light trim levels\n\n-Bug Fix request. I fully reset my bridge to remove the previous owner (bought bridge used on Amazon). Then added it to Homekit and Still get told Name Already Exists when trying to assign a room to my dimmer. If you are going to pull in my Home’s room and display their names, please let me actually select those rooms in the Lutron app.\n\n— Allow in app editing of the status LED light… Like turning it off entirely or dimming it so that it isn’t a nuisance when trying to sleep etc\n\nEdit (to Developer, thank you for responding)\n1. I’m interested in adjusting the fade off time when at a minimum I press the off button directly on either the dimmer or paired Pico controls. My understanding was whether I use Pico or the Lutron app or the Home app all roads lead to the main dimmer in my 4-way switch setup. So if the dimmer can have its fade off time shortened hopefully everything then anything else in my home that controls said dimmer will also yield a shortened fade off time. \n\n2. Thank you, I will give that a try and it seems a like a suitable workaround for now. I hope this changes and becomes an in-app configurable setting please.\n\n3. I will email you and hope you guys can really address this. It feels like years ago all over again in a bad way when I saw this same kind of issue with Philips Hue lights. They also seem to struggle with reconciling existing Siri names against existing  Apple Home app names against names being requested in the Lutron app. My hope is for simply a hard reset of the bridge to erase all names from a previous owner. Then pair to HomeKit and all names of rooms should be prioritized by whatever the Home app shows. If those names show up in Lutron, great, but they should just be a conduit for the Home app room names, not trying to fight the Home app and potentially duplicate room names with Lutron vs Apple Home. \n\n4. Thank you but I mean on the dimmer not the bridge. It seems fairly dim when the lights are off and then fairly bright when the lights on. I think that’s ok for now but Leviton offered within their app a setting to turn off the status bar leds so they don’t ever come on at all or a very dim setting so they were super subtle.","updated":"2020-10-15T07:24:28-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1483252650","userName":"erikjohn","userUrl":"https://itunes.apple.com/us/reviews/id116060647","version":"4.0.2","score":1,"title":"iPad version please?","text":"Need iPad version!!!!!","updated":"2016-11-12T08:20:41-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6983490164","userName":"Vossler Azelas","userUrl":"https://itunes.apple.com/us/reviews/id1095744616","version":"7.5.1","score":5,"title":"Great Hardware and HomeKit easy Integration","text":"As the title says Lutron makes great hardware and it integrates with HomeKit which is what I needed. However after adding 20+ switches the devices are unreliable and often show not responding erratically throughout the day and when I need the Convenience of voice control the most. This has been happening for 2+ months and on going.  All of my other HomeKit devices are working and only the Lutron devices show not responding randomly. I am connected to the internet and everything is in the 2.4ghz band with the smart bridge pro 2, HomePod, and Ethernet wired Apple TV as hubs. Currently looking for other manufacturer solution for my home.\n\nUpdate 02/11/2021\n\nLutron went above and beyond expectations with customer support. They went through extensive diagnosing and went as far as nearly recreating my network set up locally on their end to diagnose the issue further. It’s safe to say that with the recent update HomeKit is working flawlessly with my AMPLIFI home network! I’d give more than 5 stars if I could.","updated":"2021-02-11T18:07:10-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6725974153","userName":"Osh b gosh","userUrl":"https://itunes.apple.com/us/reviews/id48904799","version":"7.4.2","score":2,"title":"This app paired with Homework’s QSX will leave you wanting","text":"I’ve been a Lutron dealer for a long time and I’ve installed a lot of Homeworks QS systems, but now that QSX is out, I want to give my clients the newest processor. Unfortunately, this processor and app were released to the public and instead should still be in beta. As of 12/06/2020. The app will not allow you to create schedules or Scenes. Also, no geofencing or Apple Watch support. The app feels like a demo app, with every option returning a “coming soon” pop-up.\n\nLutron, you really dropped the ball on this release. Get it together and design a working app for your customers that are paying 20-75k for lighting control. Or 100k+ for lighting and shades.","updated":"2020-12-06T21:52:41-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"6607660273","userName":"CColotti","userUrl":"https://itunes.apple.com/us/reviews/id151565296","version":"7.3.2","score":2,"title":"No new support for Google Nest","text":"Nest and Google switched over a year ago. Most apps including alarm.com have accepted the new integration via Google nest.  Lutron has yet to do so.  Why is this important?  Mostly for smart away.  The nest app has the ability to have multiple phones manage the geo fencing for “away” settings.  The lutron app does not seem to do this well since both phones must log in with the same “user”.  When away was part of Nest that set the away modes properly in lutron.  Works with nest is dead and lutron has yet to switch over to the new Google home methods.   I’ve got over 50 devices and love the system but this lack of catching up to Google Nest new requirements is annoying.\n\nWhat’s more odd is lutron IS tied into Google home so why has that not been simply connected to the naive iOS app?  Clearly the integration is there and would reconnect things for smart away and scene usage.  The connection is there just not via this iOS app so why not just fix it?","updated":"2020-11-04T03:23:28-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3440409688","userName":"OpEditor","userUrl":"https://itunes.apple.com/us/reviews/id183801578","version":"6.0.1","score":3,"title":"No instructions???","text":"The dimmers are great, the app works. However learning its quirks is frustrating. There are no instructions on how to perform basic tasks in the app or the Caséta website. I had to call tech support to get answers for my questions. \n\nWant to use the great “Smart Away” feature to randomly turn lights on and off while you’re away? The product info says it’s in the app.BUT it doesn’t tell you that it’s only on the iPhone app, not the iPad. Want to set an on and off time for a controlled fixture? You have to set up a schedule to turn it on and then a new separate schedule to turn it off. \n\nLutron makes great products and installation and included written set up instructions are detailed, well written and easy to follow. Why the apps are not better documented is a major shortcoming. Still puzzles me as to why the apps for phone and tablet are different!","updated":"2018-11-20T09:28:32-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5962926737","userName":"MXPGJW","userUrl":"https://itunes.apple.com/us/reviews/id13756532","version":"7.0.0","score":2,"title":"May 13 2020 upgrade Stinks !","text":"Recently purchased several dimmers, Pico remotes and bridge and easily set up with prior IOS app with all working well. Today's friggin update arrives and lights no longer switch and Pico and Alexa no longer work. Spent HOURS resetting, unpairing, reprogramming and STILL CANNOT RESTORE ALL ORIGINAL FUNCTIONS.\n\nLutron PLEASE fix this app !!!!\n\nUpdate a few days later:\n Deleting pand then re-installing the iOS app along with deleting and reinstalling the Alexa skill has fixed most issues. Lutron has contacted me to suggest I call them. I am going to do so if I cannot fix remaining issues.","updated":"2020-05-18T15:12:08-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5383676137","userName":"Tnach","userUrl":"https://itunes.apple.com/us/reviews/id163686454","version":"6.6.2","score":2,"title":"Works reliably w/ Amazon and barely at all w/ Google","text":"After linking / unlinking / linking again I still get google saying it can’t connect to Caseta RA2 when asking to turn on and off lights. Typically once you unlink and link it’ll work for a moment and then an hour later it’ll fail. Never had these issues w Amazon.","updated":"2020-01-09T21:49:30-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"5343616997","userName":"iTunes-USA","userUrl":"https://itunes.apple.com/us/reviews/id32867872","version":"6.6.2","score":4,"title":"Expected more from Lutron","text":"I normally don’t write reviews, but the experience with this app and the Lutron Smart Bridge has been so frustrating that I had to let Anyone know. \nLove the Caseta Dimmer and the Pico Remote. Automation worked beautifully with Wink, but when migrated to SmartThings and discovered I needed the Smart Bridge, I was ok with it. \nSetting up the bridge and the devices was not too bad, but it hasn’t worked properly:\n-App is buggy: it crashes, doesn’t connect with the SmartBridge, etc. \n- Devices stopped working without any reason. \n- Devices cannot be deleted, after a long wait, there is a message that there was sn error, try again. \n- SmartBridge cannot be factory reset. \n\nBased on my experience, I wouldn’t recommend the app or the SmartBridge.\n\nUpdate 12/31/2019\n\nAfter Lutron’s customers support contacted me with several suggestions to fix my issue, app is running again. \nI had to reset the bridge, then installed the Caseta app on my iPad, set it up, link it to my account. Deleted and reinstalled on iPhone. A bit involved solution, but it solved my problem. \nThanks Lutron Customer Support.","updated":"2019-12-31T10:07:40-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3901030770","userName":"Packerbackercmb","userUrl":"https://itunes.apple.com/us/reviews/id109968749","version":"6.5.1","score":2,"title":"Login issues on WiFi but not cellular","text":"On WiFi I just get a spinning wheel of nothing on both Android and IOS plz fix","updated":"2019-03-19T09:57:29-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3871274525","userName":"Mistir.b","userUrl":"https://itunes.apple.com/us/reviews/id15399664","version":"6.5.1","score":4,"title":"Mostly what I need","text":"I’ve absolutely LOVE my Casetá line of products and the Apple Home integration (and the ability to work with Alexa when I need it). \n\nIn the past I’ve been able to utilize the general light pico remotes for other purposes besides just lights, such as using a light remote to operate as a SONOS audio remote. This has been stellar since I don’t want to spend a ridiculously over-priced amount for the same pico remote but labeled for audio. I think you can “technically” use a light pico remote for shades as well. \n\nI bring this up because I have recently acquired the Lutron Casetá fan speed control switch and have discovered I am unable to use any pico remote to control this switch. I have the most recent version of the app on 3/11/2019. \n\nHelp us out Lutron! Thanks.","updated":"2019-03-11T18:27:40-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1861028509","userName":"Specialized Reviewer","userUrl":"https://itunes.apple.com/us/reviews/id490603552","version":"5.0","score":3,"title":"Update: Great...well not really","text":"The app does what it claims to do but sometimes has a few hiccups. Also the current app UI looks amazing...if this were an android OS. The old one looked better. \n It will sometimes not connect with Apple HomeKit too.","updated":"2017-10-19T20:40:33-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"3091755084","userName":"Squellcchh","userUrl":"https://itunes.apple.com/us/reviews/id361111044","version":"5.6.2","score":1,"title":"Don’t purchase lighting yet !","text":"I purchased the lutron wireless dimmer switch for my Apple HomeKit ecosystem.  I can’t add the bridge to my HomeKit because I get an error saying the device code is incorrect.   I spent 6 hours troubleshooting this.  Reset everything and tech support can’t help me.  \n\nDo not purchase this yet until they fix this problem !","updated":"2018-08-20T11:08:21-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"2310377994","userName":"Iamamover","userUrl":"https://itunes.apple.com/us/reviews/id40293139","version":"5.1.1","score":5,"title":"I love this app","text":"I'm on my second home with Caseta switches and found it very easy to set up. The first time I hired somebody to come in and set up the light bridge and program the switches.  By the time I installed it in my second home (18 months later) I was very familiar with the product and I did it myself in about 90 minutes.  I did have an electrician install the switches so I can’t comment on that installation.  If you are a first time user I’d suggest you try it yourself and if you get stuck on anything just watch the YouTube videos. \n\nI do like the smart away feature, others have commented that they would like a longer time frame as opposed to the four hour window provided, it would be great if you could a little bit more flexibility.  \n\nI just figured out if I click on the temperature it actually brings up more info from my nest.  It was a bit more intuitive before and I didn’t realize the temperature display was actually a button/link.\n\nThanks for listening to my suggestion to add more icons, I think you pretty much nailed it. Now I can actually see what I am doing without my reading glasses. I’d still like to be able to use photos of my fixtures for icons 🙂.","updated":"2018-03-15T18:11:20-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1613358144","userName":"KamilM","userUrl":"https://itunes.apple.com/us/reviews/id164521667","version":"4.1.4","score":3,"title":"Got slow and still limits 50 devices (incl remotes etc)","text":"App got much slower connecting to smart bridge, over the past number of \"updates\".\n\nAlso, widget (even after removing and reinstalling widget and scenes) gets unresponsive or takes number of attempts to respond.\n\nWorst of all, Lutron's artificial restriction of only 50 devices while increasing number of products they offer is just stupid. Wish I didn't even thousands into their system.\n\n50 devices includes switches including all pici remotes (three way switches you have around apartment/house) and smart bridge etc\n\nSo really, maybe 20 switches. Then, they just block you to add more. Their \"solution\" is to add second bridge with separates username password and continuously log out log in log out log in... is well, stupid. Not a very smart system after all.","updated":"2017-05-13T21:51:40-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1819778861","userName":"Storm shadow003","userUrl":"https://itunes.apple.com/us/reviews/id36779005","version":"5.0","score":5,"title":"Awesome","text":"My Lutron Bridge cannot connect.\nUpdate: 9/3017 \nAfter speaking with tech support at Lutron, they were able to help me out in connecting my Bridge now the apps works great.","updated":"2017-09-30T18:44:33-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1802218665","userName":"Kkloveshorses","userUrl":"https://itunes.apple.com/us/reviews/id26047598","version":"5.0","score":4,"title":"Great Hardware but limited base unit","text":"The switches and remotes are great and have been very reliable. Love the middle button setting. The problem is the base unit only supports 49 devices (the 50th is the base unit itself). Wink has overcome this limit\n\nThe issue is every plug in dimmer is going to have a pick remote and I have a number of remotes making lights 3-way which has been fantastic but you hit the limit very quickly\n\nI use the wink as a secondary controller for less used lights. This should be a priority for them to update if the really want to add more devices and types\n\nThe app is okay, though a bit tedious to setup. The best part is Amazon Echo integration. Almost all my control is via voice\n\nUpdate:  I would like to try version 5 but it does not show up to update","updated":"2017-09-21T10:23:25-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1744115190","userName":"Dr.JGW","userUrl":"https://itunes.apple.com/us/reviews/id167877563","version":"4.2","score":5,"title":"Well Done.","text":"Works beautifully. \n\nThis was my FIRST ever smart-home device. \n\nOrdered Caséta Wireless dimmer kit with smart bridge on Amazon.\n\nSetup was a BREEZE:\n\n1) DIY installed 2 Lutron Caseta dimmers into pre-existing switch slots where previous manual dimmers were.\n\n2) Plugged in & connected the Lutron hub/bridge. \n\n3) Downloaded Lutron App, followed setup instructions. \n\nJust plain works.\n\nI will be buying more Lutron devices.\n\nEDIT 8/21/17 - dropped rating to 4-stars. There still isn't interoperability between RA2 and Caseta. There aren't any motion sensors for the Caseta system. 50-device limit per bridge is restricting. Haven't tested if this app will work with 2 bridges. But I will need to get another one so will update then. Lutron is the BEST, & Caseta is the highest quality switch system to date, but lacks a motion sensor, & needs to allow >50 devices.\n\nUpdate 8/23/17: figured out scenes, thanks. Raised to 5-stars because the Lutron app actually IMPROVES the Apple Home app by adding \"Zones\". This is helpful for upstairs, downstairs, basement, attic, garage, porch, & patio \"zones\" with multiple rooms that you want to control without \"grouping\" them as Apple makes you do. Also raised the rating to 5-stars bc I've been using the app & Caseta system and it works flawlessly! Lutron has a golden goose here with Caeta line. Build it out & up!\n\nOnly complaint: the app icon needs to be replaced. I like the Lutron Sunburst logo like on the other app.","updated":"2017-08-23T21:41:15-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1672041853","userName":"AsgraCwboy","userUrl":"https://itunes.apple.com/us/reviews/id9252946","version":"4.2","score":1,"title":"Siri Seems To Have Gotten Clueless","text":"It appears that Lutron no longer works with Apple Home since Siri informs me that there is no connection. But if I open the Lutron App I have connection. Curious, does Lutron work with Amazon?","updated":"2017-07-06T20:12:12-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1210986453","userName":"TrOpiLoKO.","userUrl":"https://itunes.apple.com/us/reviews/id154614241","version":"2.2","score":5,"title":"Excelente.","text":"Desde Venezuela, funciona muy bien,recomiendo todos los productos lutron.","updated":"2015-06-11T21:06:25-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1241122970","userName":"SkyAblo","userUrl":"https://itunes.apple.com/us/reviews/id13885345","version":"2.2.1","score":3,"title":"Not bad support, poor product","text":"Update 6/10/2015\n\nAfter not being able to set the system up correctly over the weekend, and communication with Lutron Caséta support, today the smart bridge updated its firmware and integration with SIRI worked.\n\nThe three stars are really for the customer support.\n\nOn the bad side, I still am concerned about:\n1. Why the smart bridge needs so many ports\n2. Why there is no admin system in the smart bridge\n3. Why the firmware update system broke and nobody seemed to know about it\n4. Why the 24x7 support isn't as advertised\n\n==================\n\nIn order to even use the smart bridge you need the app.\n\nHere’s the kicker, when you first plug in the smart bridge and use the app it tries to do a firmware upgrade which is needed in order to use HomeKit (yes they shipped it with old firmware despite the HomeKit label printed, not a sticker mind you, on the box)\n\nI call customer support which is 24/7 and get a guy called Zach who tells me that it needs to be able to access outbound ports and that some ISP’s block these. Here’s the email:\n\"Often cable modem/router combination products that are sold by ATT U-verse, Verizon, Comcast, COX, and some other internet providers are locked down more than a standard cable modem would be. I would contact your Internet Service Provider (ISP) and ensure the following ports are open: 7443, 4443, 443, 8883, 1883, 123, and 22.”\n\nI assume these are outbound ports as nobody in their right mind would allow these all open inbound to their network. Anyway, as I have a business connection I know none of these ports are blocked, but to humor them I created static routes for inbound, which didn’t work, then let the “Smart Bridge” be in the DMZ (which there is no way I’m going to do permanently)… Nothing worked.\n\nI then called back 24/7 support to find that it’s not 24/7 at all for the Caseta products (despite the Caseta site stating it is).\n\nFinally a guy on the forum came up with a way to get the app working. however. Great I can control my device now with the iPhone.\n\nThen I try to integrate with Siri through the app. Guess what, it requires the firmware be updated. And that reset all my devices (yes, it’s that dumb) and I’m back to square one with nothing working.\n\nThis is the worst network product I’ve ever bought. Utter rubbish","updated":"2015-08-10T16:35:34-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1585676652","userName":"MacWade","userUrl":"https://itunes.apple.com/us/reviews/id39035387","version":"4.1.2","score":2,"title":"The App Needs A Lot Of Work!","text":"I really like the Lutron Caseta light switches & window blinds! They are the best on the market and I would recommend anyone looking to get smart home light switches or blinds that work with HomeKit and the Amazon Echo.  \n\nBut the iPhone app really needs a lot of work. Interface is outdated and you can't customize the layout very much. They need to add more light & device icons to customize your setup.","updated":"2017-04-10T13:52:03-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"},{"id":"1575854363","userName":"Icedivr","userUrl":"https://itunes.apple.com/us/reviews/id19010768","version":"4.1.2","score":1,"title":"Give up some more privacy...","text":"The latest version (4.1.2) will not let you use the app without creating an account with them. This is completely arbitrary on Lutron's part - previous versions worked fine without registration. You'd think that after spending $200-300 on switches you'd be able to use them without any further intrusion on your life, but no...","updated":"2017-03-29T19:42:10-07:00","url":"https://itunes.apple.com/us/review?id=886753021&type=Purple%20Software"}]