[{"id":"5150022830","userName":"CrimsonEcon","userUrl":"https://itunes.apple.com/us/reviews/id106487894","version":"3.0.11","score":2,"title":"Notifications Unreliable","text":"I use this app for dLink’s water sensors. The other day we had a water leak. Didn’t receive any notifications. Opened the app when I discovered the leak on my own. Sure enough, sensors showed there was a leak, and they were supposed to alert me by alert, text, and email, but nothing was sent. Tried testing my intentionally getting the sensors wet (no other way to test) and still nothing. Also, the sensors periodically just go offline but the app doesn’t alert me to that. And when the sensors do go offline they have to be unplugged to reset, which makes them useless for monitoring in a remote location. All told, water sensors and app are mostly useless. I’ve had better luck with the dLink Lite camera app – it’s slow and clunky but at least it works. The home automation app and sensors are a wast of money.","updated":"2019-11-16T05:49:08-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1724774966","userName":"Enilohclyteca","userUrl":"https://itunes.apple.com/us/reviews/id149595671","version":"3.0.7","score":2,"title":"Worst automation app in my home","text":"Other home automation devices, and their apps, give plenty of feedback and testing. This device (water sensor) and its app took 4 valuable hr to install, in contrast to 15 min for the other automation devices/apps. Worst of all, the app tells us no way to test whether the device is working--without dousing it.  Next, took three tries to connect to wifi, even though I connected while 1 meter from router.  Next: app won't run in portrait, and had to spend more valuable time learning that. Your typical homeowner installs automation to save time. This device, and this app, do the opposite. Despite wirecutter opinion.\n\nHoping to exploit previous knowledge, I got, and connected, a second copy of the same device, in a different location. Same connection woes, both wps and manual. Total time: 1.5 h, mostly because of drastically limited expectations.","updated":"2017-08-12T09:25:38-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"3036693834","userName":"LaszloNYC","userUrl":"https://itunes.apple.com/us/reviews/id195619712","version":"3.0.8","score":2,"title":"D-Link is UNRELIABLE!!!","text":"I have 3 plugs, motion sensor, water sensor, siren, 2 cameras. Happy with the devices but the app just stopped working (looks like the server is down for the past 3 days). The new app supports only cameras. Switching to a different brand (unless they find a solution very soon).\nEdit:\nAfter deleting the app, restarting the phone and reinstalling the app, it works again. Could be a coincidence. It shouldn’t happen and I still think the app is unreliable.","updated":"2018-08-08T10:09:27-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"3339650353","userName":"Kirk here","userUrl":"https://itunes.apple.com/us/reviews/id30787103","version":"3.0.8","score":1,"title":"Software problems!","text":"Not easy not simple! Struggled with a long set up and finally success. Next morning I turn on espresso Maker from app so when i finally get downstairs its preheated, everything good so far I make my espresso then use app to turn off. The switch turned off but the app showed it was still on. The switch on the phone app is now unresponsive. 4 hours later after trying everything I can think of or research the app still fails somewhere in the setup process. I decide to create a new account with a different email and bingo both switches are functioning. If they fail again I’m afraid I’m going to run out of email addresses to create another account. \nEngineers and management at D-Link invest more in your software development. I’m getting the feeling I don’t ever want to buy anything made by D-Link. Good luck!","updated":"2018-10-24T14:59:24-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"5130754872","userName":"Andy221800","userUrl":"https://itunes.apple.com/us/reviews/id275636140","version":"3.0.8","score":1,"title":"App down","text":"This is not the first time the entire app has gone down for days/weeks making all my sensors/plugs useless. I bought this to control lights and stereo while away and now I have NO control of anything and no access to schedules. I also have a water sensor that I will NOT know if I have a leak of not. I also have motion sensors to let me know if anyone is on my property that doesn’t belong and now I’m vulnerable because the company can’t figure out how to keep their app running and never gives any notice or warnings about any outages or length of the planned outage!\nGet your act together.  This is unacceptable!","updated":"2019-11-12T22:48:35-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1514760023","userName":"DavidPhillipOster","userUrl":"https://itunes.apple.com/us/reviews/id13902456","version":"3.0.7","score":5,"title":"Useful for simple automation","text":"version 3.0.7 is working without trouble for me. I just have a few DSP-W110 outlets. I  use them for simple schedules. They are reliable, and don't lose their minds if they are without AC power for awhile. I wish there was an API so I could drive these with my own programs though.\n\nmy old reviews:\n\nThe 2.0.1 update crashed on launch repeatedly. I deleted the app, re-downloaded, signed in again, and now it runs.\n\n1.1.0:\nI connected 2 of the simpler DSP-W110, and talked to them using iOS 6 and iOS 8. WPS installation was flaky, but that's the fault of Apple's Airport Utility. Manual setup worked fine. In both cases, this app walked me through it. On and Off responded in under a second.","updated":"2017-01-03T14:06:33-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"2167839861","userName":"jcommisso07","userUrl":"https://itunes.apple.com/us/reviews/id167132628","version":"3.0.8","score":1,"title":"Worthless junk","text":"Someone bought me a switch as a gift. I was going to return it, but it was too late. So I figured I’d try it. It doesn’t work with my automation system at all. I had to link it directly to Alexa. The app UI and programming features are awful. And recently, it stopped working. I had to repair it, and when I try to set it up (WPS and manual), it tells me “incorrect pin”. It didn’t even prompt me for a pin, and after retrying and putting in the pin, it still does the same thing. On the plus side, it’s easy to disassemble and replace the WiFi module with something like an Arduino.","updated":"2018-02-04T14:32:29-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"3588510219","userName":"Andr11389","userUrl":"https://itunes.apple.com/us/reviews/id37573565","version":"3.0.8","score":1,"title":"Zero stars at best","text":"This is a joint review of the app and the toolshow of a smart plug. App gets stuck in a cycle of trying to scan QR codes until you force close. Whatever Th app ask you to do on the plug, router, or app settings does not work and you have no way to back up a step. I’ve tried manual setup and WPS setup and nothing connects and the lights in the plug never turn the colors the app says they should. “When light turns amber, push Next”.... ah.... it never ever turns amber. Now what... nothing. No options. No troubleshooting. Too bad I have no other home automation options. Oh wait, I have a thousand.","updated":"2018-12-29T10:16:55-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1970849490","userName":"Warm Jimbo","userUrl":"https://itunes.apple.com/us/reviews/id169417262","version":"3.0.8","score":5,"title":"Works awesome","text":"Easy to install - follow the directions - very reliable - I use water  sensors (dch s160) in multiple properties (different countries)- Gives great piece of mind when overseas or away - easy to test with a glass of water - easy to link to a siren (dch s220). Recently detected a water leak at the dishwasher - saved lots of damage. Would highly recommend the dlink system.","updated":"2017-12-04T14:14:13-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1663820277","userName":"gladel","userUrl":"https://itunes.apple.com/us/reviews/id182158269","version":"3.0.7","score":3,"title":"Device Works, but No Notifications","text":"For users who are having difficulty getting iOS notifications, keep in mind that the device is fully functioning as evidenced in the app that the motion sensor is detecting movement; however, the notifications needs fixing. As a solution, use IFTTT app, make an applet, and it will soon start sending notifications. In the meantime, D-Link should find a better solution and fix their app.","updated":"2017-06-30T09:17:35-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1539374310","userName":"Iphonecommander123","userUrl":"https://itunes.apple.com/us/reviews/id43954210","version":"3.0.7","score":1,"title":"Power meter and no connection status","text":"App doesn't show connection status.  I open the app, press to turn device on or off and it doesn't happen because it doesn't show if app is connected to device or not.   Then later it refreshes and I ha e to repeat the action.\n\nThis device works but power meter doesn't show historical power usage.  It only shows one number for watts used this month but no graph for exactly when.   Every other device out there will show details for power usage.","updated":"2017-02-07T08:59:47-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"2898292257","userName":"pruett3","userUrl":"https://itunes.apple.com/us/reviews/id42334271","version":"3.0.8","score":1,"title":"Getting bad","text":"This app used to work, fairly well. I don’t like the schedule options but make due... when it worked. The schedule option won’t open anymore for my smart plug so I can no longer change it. DLink has a very bad habit of only supporting their products for a verrrrry short period of time. I have purchased a few of their cameras because it was supported by a particular platform; shortly thereafter they stopped updating the app and gave excuses as to why it wasn’t working. \n\nNo more DLink for me.","updated":"2018-07-13T01:19:41-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"7432919566","userName":"NYPC2","userUrl":"https://itunes.apple.com/us/reviews/id4536327","version":"3.0.12","score":2,"title":"Lacks functionality, Unintuitive","text":"Confusing to set up, Hidden commands (e.g. have to swipe left on an action to reveal the Trash icon).\n\nWhat I find worst is that with my motion detector, there is no way to set a “cool down” period between activations so that it isn’t sending CONSTANT alert emails.\n\nI have it in a room and I want to be alerted by email when someone enters the room. The app does this, but as long as the room is occupied I get a never ending stream of emails!. It would be far more useful to me if I could disable it for a time (say 1 to 60 mins) after an activation. This could also alleviate dlink having to process hundreds of unnecessary emails…\n\nPlease add such a feature!!","updated":"2021-06-06T03:30:58-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"5188733133","userName":"Yavuzc123","userUrl":"https://itunes.apple.com/us/reviews/id440570511","version":"3.0.11","score":2,"title":"Need to enter password every time","text":"The app was never reliable to show motion from my sensors, but somehow I survived. However you guys came with an update after 2 years which did not bring any improvement but now I need to enter my password all the time. Can you fix this?","updated":"2019-11-23T15:11:14-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"6435624796","userName":"Tnddy","userUrl":"https://itunes.apple.com/us/reviews/id258237022","version":"3.0.12","score":1,"title":"App Outage issues","text":"Seems like Dlink has just given up on supporting this app and devices for this app. Been about 2 weeks now and haven’t been able to login. Reset pwd option doesn’t work. Create new account causes app to crash during the part where you are selecting location region.\n\nGuess it’s time to move on to any other home automation plug that’s currently out ok market as there is some support vs. no support.","updated":"2020-09-16T10:22:19-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1965995690","userName":"Keenerific","userUrl":"https://itunes.apple.com/us/reviews/id73001095","version":"3.0.8","score":1,"title":"Bad app!","text":"Had loaded & used this app for 11 months, after I received an item to use with an outlet plug. \nThen, out of the blue, it didn’t recognize my password. I subsequently then thought, I’ll just change the password, and the it’ll work again just fine.\nWRONG!!!!!!!!!!\n\nI then had to reload the app after 11 months of use!?!?!? Ridiculous, bad programming guys! Will not recommend anyone to buy any D Link products, you have lost all of my respect & confidence","updated":"2017-12-02T16:52:18-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"3552639278","userName":"Aquapod Bottle Launcher","userUrl":"https://itunes.apple.com/us/reviews/id410030673","version":"3.0.8","score":5,"title":"Works Great","text":"I installed this app and linked my water sensor and alarm to it just fine. The sensor and alarm have sounded twice just fine when my basement drain overflowed. This system has worked great for me for over 2 years.","updated":"2018-12-20T09:05:04-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"3744991167","userName":"captain k-man","userUrl":"https://itunes.apple.com/us/reviews/id38320604","version":"3.0.8","score":4,"title":"App Insp after recent iphone software update","text":"I bought 6 of the wireless water sensors and after the last IOS iPhone software update the app is inop.. it only sees my sensors as offline now. Can you please update the app so my sensors will alert me if there is a water issue- \nThanks!","updated":"2019-02-07T18:25:30-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"5133623991","userName":"MRGentille","userUrl":"https://itunes.apple.com/us/reviews/id43959706","version":"3.0.8","score":1,"title":"App Stopped Working","text":"I had been using this app for 1.5 years without issue. Then, upon most recent update, it will no longer connect. I reset my password, uninstalled/ re-installed the app, and again tried to change my password. None of this worked, and all I get is: “Sorry, please try again”.  When will you fix this?","updated":"2019-11-13T13:19:43-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"5213639380","userName":"C141medic","userUrl":"https://itunes.apple.com/us/reviews/id43319407","version":"3.0.11","score":1,"title":"Smart plug useless without proper working app","text":"I give up. Apparently D—Link isn’t interested in supporting their devices because this app hasn’t worked for over two weeks now. I’m replacing all my D-Link smart plugs with TP-Link. Much better rated and app is also better. I will never purchase another D-Link product. Very sad as I’ve been a D-Link user for over 10+ years.","updated":"2019-11-29T14:24:29-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"5166681912","userName":"Randy8","userUrl":"https://itunes.apple.com/us/reviews/id164844242","version":"3.0.11","score":3,"title":"Password is not saving and notifications not working","text":"Hi app got updated and now not able to save password. Every time entering pw is too much.\nschedule option is good in new but Not getting notifications. \nRevert back to old version","updated":"2019-11-18T17:52:26-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"5134395054","userName":"Shark3136","userUrl":"https://itunes.apple.com/us/reviews/id489290317","version":"3.0.8","score":1,"title":"Headaches","text":"Downloaded the app. Connected a device. Worked well. 48hrs later - the app doesn’t work. The app doesn’t recognize me, doesn’t accept my password, doesn’t recognize a change to a password, doesn’t recognize the device. Just tells me repeatedly “Please try again”.\nI’ve had Dlink cameras for years. Always failing and a pain to setup.","updated":"2019-11-13T17:38:50-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"5163186484","userName":"JTOMalley","userUrl":"https://itunes.apple.com/us/reviews/id27067604","version":"3.0.11","score":2,"title":"v 3.0.11 won’t stay logged in","text":"Buggy and useless. Has turned three DSP-W110 smart plugs into dumb plugs that won’t connect to my WiFi after repeated factory resets and attempts to reconnect. App will not stay logged in between the time I go to connect to the plug on my iPhone and when I go back to the app to complete setup.","updated":"2019-11-17T23:56:23-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1933935914","userName":"Black Perl 42","userUrl":"https://itunes.apple.com/us/reviews/id371047235","version":"3.0.8","score":1,"title":"Junk","text":"Wanted to give 0 stars but wouldn’t let me. Don’t even waste your time with this app or associated products. Couldn’t even add a simple water sensor without WPS. Wasted 2 hours trying to connect after turning off cellular, Bluetooth, reboots, device power cycles, device resets. In comparison it takes me 5 seconds to add a sensor to my wink app at a different facility. Just wanted a simple water sensor but just wasted my time.","updated":"2017-11-19T19:22:59-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"6784722250","userName":"Saamrand","userUrl":"https://itunes.apple.com/us/reviews/id494912773","version":"3.0.12","score":5,"title":"We don’t have any other choice.","text":"Thank you  Dlink. Because you didn’t stop service to older Dlink devices.","updated":"2020-12-23T05:25:05-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"2762449596","userName":"WRMSRM","userUrl":"https://itunes.apple.com/us/reviews/id657322157","version":"3.0.8","score":2,"title":"Won’t follow advanced schedule.","text":"Have the DSP-W110. Worked great and followed the advanced schedule I set up. Now they will not follow the schedule. They are still tied to WiFi because lights can be manually turned on using phone. How do I get them to follow schedule again?? I also deleted app and downloaded it again.","updated":"2018-06-24T16:22:42-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"3302597573","userName":"SuperDaveGr","userUrl":"https://itunes.apple.com/us/reviews/id598141580","version":"3.0.8","score":1,"title":"Next to useless","text":"I have the water detector in my basement for the condensation pump.  The pump shut off the other day and the sensor was submerged in water.  No notifications.  I have the actions set up but received nothing.  \nI tried to send more than one notification, one to me and one to my wife but the app doesn’t allow you to do this.  I’m going to look for an alternative to this detector.","updated":"2018-10-14T16:39:46-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"2534144799","userName":"nt9of9","userUrl":"https://itunes.apple.com/us/reviews/id238154274","version":"3.0.8","score":4,"title":"Works well. Needs more time settings options.","text":"I would like to schedule settings down to 5 minute intervals. Please update the app to allow for this option.","updated":"2018-05-11T14:41:06-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"2117364162","userName":"CCARRA2014","userUrl":"https://itunes.apple.com/us/reviews/id457503198","version":"3.0.8","score":5,"title":"Awesome update","text":"Push notification was back online! Now everything works as it was.","updated":"2018-01-22T22:37:56-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"5130653237","userName":"SNIKDAMUSIC","userUrl":"https://itunes.apple.com/us/reviews/id113366500","version":"3.0.8","score":1,"title":"Terrible","text":"I have two cameras that can only be seen through this D-Link home app..I can not sign in and it’s been two days.\nI’ve been using this for a couple of years, and this is the first time.\nWithout the app, the cameras are useless.\nI called support and they said maybe the server is down..for two days??","updated":"2019-11-12T22:16:05-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1570255126","userName":"BaobaoCali","userUrl":"https://itunes.apple.com/us/reviews/id204656408","version":"3.0.7","score":1,"title":"App need updated","text":"Funny that the app does not recognize my email and password. Try to reset new password the app keep spinning which can't access to the system.\nI just got the motion sensor, work great but the app such. Really want to return and find a different brand.\nDlink team should put more efforts to keep up with problems they have. The app look like a beta version.","updated":"2017-03-22T11:25:08-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"7182678390","userName":"lafos","userUrl":"https://itunes.apple.com/us/reviews/id12942737","version":"3.0.12","score":2,"title":"Is this an orphan app?","text":"Can’t change the password and the developer support contact page requires information that is not available with the devices controlled by the app. Hoping they see this.","updated":"2021-04-04T06:05:09-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1945902454","userName":"PleaseFixThisPOSApp","userUrl":"https://itunes.apple.com/us/reviews/id429633660","version":"3.0.8","score":1,"title":"Piece of Junk","text":"My 10 year old can create a better app!  The team who ‘designed and built’ this piece of crap should get other jobs. \nThe app doesn’t recognize my password no matter how many times I reset it. It spits out “sorry try again’ even before I enter the password .. \nEnough said ... please don’t buy this junk. This app killed it for me.","updated":"2017-11-24T10:58:14-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1495928170","userName":"Mac Man 1979","userUrl":"https://itunes.apple.com/us/reviews/id106874932","version":"3.0.7","score":1,"title":"Needs fixed","text":"I use the my dlink lite app for my cameras and when I saw this for the Apple TV I was excited. It doesn't show any of my cameras and is worthless. I have tried numerous ways to get it to work. Dlink needs to fix this and I'll rate it higher. Hopefully it works on their other products but I wouldn't buy any in hopes that they would with this app.","updated":"2016-12-04T07:01:07-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"5134233577","userName":"Dlinknomore","userUrl":"https://itunes.apple.com/us/reviews/id398749075","version":"3.0.8","score":1,"title":"App no longer works","text":"It was last updated 2 years ago.  Today none of my DSP-W110 devices will work. Receiving an error on both my Iphone and Ipad when trying to log in. No information on there website. I will not be buying another D-Link device.","updated":"2019-11-13T16:45:14-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"6238474310","userName":"not online 7","userUrl":"https://itunes.apple.com/us/reviews/id411337492","version":"3.0.12","score":2,"title":"Not on line","text":"My device is not showing online. I can’t control it from this app. It is stuck in my previous schedule and works on its own. Please update app to fix bug.","updated":"2020-07-24T19:42:29-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"5134398425","userName":"cool-aspen","userUrl":"https://itunes.apple.com/us/reviews/id377127650","version":"3.0.8","score":1,"title":"App not working anymore","text":"App stopped working 24 hours ago. Is there a replacement app or anyone know of a fix? Not sure this is an IOS issue since I have been running the latest version for over 2 weeks now and it suddenly stopped working.","updated":"2019-11-13T17:39:58-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"2701133485","userName":"Kp_600","userUrl":"https://itunes.apple.com/us/reviews/id197516104","version":"3.0.8","score":1,"title":"App Does Not Work!!","text":"Bought two sets of DSP-W215 plugs and they worked fine until recently. Suddenly the plugs lost connection with the router and, when factory resetting them, the app will not allow me to add them back onto my account - it keeps saying error, please try again?! Surely you can do better for your customers","updated":"2018-06-15T12:32:52-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"4534536769","userName":"Humanmagicmarker","userUrl":"https://itunes.apple.com/us/reviews/id38967404","version":"3.0.8","score":1,"title":"No notifications","text":"When this app works it’s works ok I guess. But if the only thing you use it for is to alert you of movement or a water sensor, it will most likely fail to notify you. Comes in waves for no reason at all just a week without notifications and then randomly starts working again.","updated":"2019-07-28T18:58:46-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"5164408388","userName":"UB-1002","userUrl":"https://itunes.apple.com/us/reviews/id119008664","version":"3.0.11","score":2,"title":"3.0.11 broke wifi","text":"It took 3 years to come up with an update and result if the device stopped connecting with wifi and the app has no way to initiate wifi connection settings","updated":"2019-11-18T05:59:14-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"4325902650","userName":"jsharu","userUrl":"https://itunes.apple.com/us/reviews/id21165289","version":"3.0.8","score":1,"title":"Both devices stopped working","text":"Since purchasing this device, I’ve had problems. On occasion, both devices would reset and only way I noticed it, when connecting to WiFi, I see both devices advertising it’s SSID which occurs when in setup mode. \n\nThis morning, I tried numerous times to configure with any success. I tried reset button as well. \n\nThis was a complete failure and seems D-Link doesn’t care about fixing this issue. \n\nNot sure if I will invest anymore $$$ in D-Link products moving forward.\n\nWhat can you do to remedy this for me?","updated":"2019-06-16T10:12:38-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"5541076457","userName":"never buy D-Link","userUrl":"https://itunes.apple.com/us/reviews/id292171137","version":"3.0.12","score":1,"title":"Complete waste of time!","text":"Over the course of four days I spent hours each day attempting to set it up. I finally got it set up and then moved it to its final place and it would not connect to my router. Complete piece of crap!  I’ve wasted money before, but this one tops the list.","updated":"2020-02-16T16:27:29-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"2117014686","userName":"rocknroll12","userUrl":"https://itunes.apple.com/us/reviews/id139785007","version":"3.0.8","score":5,"title":"No false alarm","text":"The motion detector is awesome. No false alarm was generated ever. Much better than my previous system that uses camera to perform motion detections.","updated":"2018-01-22T20:02:59-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1748163646","userName":"Texanplayer","userUrl":"https://itunes.apple.com/us/reviews/id200165896","version":"3.0.7","score":1,"title":"Retail sites. 0 ⭐️","text":"Please, please!!! Fix your app, It has security flaws.  Anyone listening?  \n\nExample: \nIf you have both Lite and Mydlink  even with a different account and password, MyDlink logs on to Dlink Lite.  \n\nIdentied.. Same issue over a year ago.  \n\n***********\nBelow was posted year ago.  \n---------------------------------------------\nSuggestion: Post comments on retailer sites where items purchased. As you can tell from the app ratings and timeline of comments, customer service is not a top priority for Dlink.  Issues identified still remain after months of posting.","updated":"2017-08-25T06:09:38-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1641141914","userName":"rbitterman","userUrl":"https://itunes.apple.com/us/reviews/id31032593","version":"3.0.7","score":1,"title":"Horrible customer experience","text":"Great way to waste a Sunday. Install app could not complete installation and had to call customer service. Had to change several settings on my router and iPhone to accommodate install process. 5 minute job took over an hour. Not worth the hassle.","updated":"2017-06-11T11:12:04-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1988204730","userName":"MikeJabo","userUrl":"https://itunes.apple.com/us/reviews/id496807077","version":"3.0.8","score":1,"title":"Smart plug Problem Installation","text":"Followed instructions to the T but get error at last step saying “there was a problem adding this device to your account. Please try again.” Over & over! I can see that the smart plug is attached to my wireless router. Ready to return....","updated":"2017-12-11T06:26:41-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"3026563598","userName":"stratoblaster1994","userUrl":"https://itunes.apple.com/us/reviews/id230300250","version":"3.0.8","score":1,"title":"Can’t log on today","text":"using two different accounts, service obviously down, no support, web site useless. Acted up yesterday too. Uninstalled, rebooted phone (6s with latest iOS), reinstalled app to no avail. How hard would it be to send out email re: downtime?","updated":"2018-08-06T09:41:22-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"5162356875","userName":"wfiveash","userUrl":"https://itunes.apple.com/us/reviews/id25863356","version":"3.0.11","score":1,"title":"Latest version is garbage","text":"One, every time I run the app it asks me for my password. Two, if one has multiple sensors, the is no way to enable/disable them as a group. And there is no meaningful IFTTT or iOS shortcuts support. Stay away from D-link.","updated":"2019-11-17T19:31:18-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"4482839263","userName":"wary app man","userUrl":"https://itunes.apple.com/us/reviews/id465573308","version":"3.0.8","score":1,"title":"Crap","text":"This app is crap!! I installed the slink plug and the thing said to start all over again - but the plug thinks everything is fine - the app can’t find it and can’t re install the stupid thing!! Total waste of LOTS OF TIME!!! and of course MONEY!! I’d give it zero stars but it won’t let me!","updated":"2019-07-18T19:36:24-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"4433980696","userName":"Chris6998","userUrl":"https://itunes.apple.com/us/reviews/id40057412","version":"3.0.8","score":1,"title":"Worst app","text":"The whole point of having a water alarm is to be able to get notifications on the phone. Hard to do when it constantly logs me out. Will be seeking another product instead.","updated":"2019-07-09T05:51:06-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"3021324499","userName":"eday46","userUrl":"https://itunes.apple.com/us/reviews/id43644521","version":"3.0.8","score":2,"title":"Not being supported","text":"I was using this app to control cams and smart plugs. It stopped the support on the DSP plugs. I called support, they were of no help but suggested I try the new Dlink app. This app supports the cams, but not the 110 and 215. I suggest you look for another brand of smart plugs.","updated":"2018-08-05T07:43:32-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"2770681563","userName":"Chuck 352","userUrl":"https://itunes.apple.com/us/reviews/id133618635","version":"3.0.8","score":2,"title":"Programs stopped working","text":"I have used this app for a long time to control lights and other items plugged into outlets. It has suddenly stopped all of my programs from working.","updated":"2018-06-25T19:38:37-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"2912438292","userName":"jk6465","userUrl":"https://itunes.apple.com/us/reviews/id234834010","version":"3.0.8","score":1,"title":"What happen to scheduling functionality","text":"What happened to the on/off scheduling functionality?   The switches no longer turn on or off as scheduled.   Theses are expensive not to be working.  \n\nAlso it would be nice if your apps supported your hardware","updated":"2018-07-15T06:43:38-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"3621779193","userName":"Manhhungphoto","userUrl":"https://itunes.apple.com/us/reviews/id137892147","version":"3.0.8","score":2,"title":"Fix problem","text":"Need to upgrade app and connection. Too bad to connect device with wifi. Can’t change schedule...","updated":"2019-01-06T23:00:30-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"5133926800","userName":"SCUSNRET","userUrl":"https://itunes.apple.com/us/reviews/id149937871","version":"3.0.8","score":1,"title":"Stopped Working","text":"While not a great app I’ve got significant dollars invested in older D-Link devices. App hasn’t worked for two days - says “sorry please try again.”  Devices other than cameras are useless.","updated":"2019-11-13T14:57:01-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1906078858","userName":"Saljade","userUrl":"https://itunes.apple.com/us/reviews/id4206914","version":"3.0.7","score":1,"title":"Hopeful.. but no results","text":"I bought the motion sensor. It took me over 1.5 hrs to connect the device to the app. I was so hopeful it would work. Created a IFTTT event... and it failed. It keeps saying firmware needs updating. But that fails too. So I'm in limbo. \nDifficult set up\nTime consuming\nDoes not work.","updated":"2017-11-08T05:31:35-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"5129010860","userName":"Sofochka123456","userUrl":"https://itunes.apple.com/us/reviews/id189940540","version":"3.0.8","score":1,"title":"Login problems","text":"All of a sudden cannot login anymore. Tried to reset password multiple times, still no luck.\nPoor quality application.","updated":"2019-11-12T12:47:24-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"5802739732","userName":"T K D","userUrl":"https://itunes.apple.com/us/reviews/id209998059","version":"3.0.12","score":1,"title":"Worthless","text":"Terrible programming. I’m fed up with “Sorry please try again” when trying to save settings. The dlink hardware has now become doorstops. It seems the developers have abandoned supporting this app.","updated":"2020-04-12T15:52:24-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"5135554950","userName":"CompScientist27","userUrl":"https://itunes.apple.com/us/reviews/id35926459","version":"3.0.8","score":1,"title":"App issues","text":"Unfortunately the app sometimes goes out for several days which makes all of the devices useless.","updated":"2019-11-13T23:33:28-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1037570885","userName":"Dominic Shields","userUrl":"https://itunes.apple.com/us/reviews/id35452343","version":"1.0.3","score":2,"title":"Work in progress","text":"A good start, but still in development.\n\nFirst there is dlink's confusing multiple apps approach; do I use their smartplug app or their myhome app? Both have similar but not identical functionality.  That's after wading through their various cam focused apps, to even find the ones that are relevant to the smart plugs - please reconsider and simplify to a small number of apps at some point (ideally just a single app).\nHowever my main gripe now is crashes. Whenever I try to set up / adjust a schedule for a plug, the app crashes...\nAlso, as noted by a prior reviewer, the notification feature does not appear to work yet.\nLots of potential, but needs continued development - hopefully it will become a powerful and simple tool at some point.\nThe interface is clean, and it is easy to set up (basic) rules. The hardware is easy to set up, and so far seems to work well. Hopefully they will fix the current app and add more features and flexibility over time (eg, I can set a plug to turn on when the motion sensor detects activity, but no way to turn it off - you could have an option to trigger after a certain length of inactivity).","updated":"2014-07-30T06:14:12-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"5134433410","userName":"SteveEshleman","userUrl":"https://itunes.apple.com/us/reviews/id261290803","version":"3.0.8","score":1,"title":"Usable for a while, then unusable!","text":"App work ok but not great for a while. Now the app doesn’t log into anything. “Sorry, please try again”. I deleted the app and downloaded fresh. Same result. Useless!","updated":"2019-11-13T17:50:26-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"3027342050","userName":"dissatisfied 24","userUrl":"https://itunes.apple.com/us/reviews/id792025389","version":"3.0.8","score":1,"title":"Not even worth 1 star","text":"The device is good but the app is garbage. Would've bought more devices but the app is awful. The one device I bought is worthless because the app never works.","updated":"2018-08-06T14:28:08-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"3520353728","userName":"Geoff Klimko","userUrl":"https://itunes.apple.com/us/reviews/id26886470","version":"3.0.8","score":1,"title":"Can’t find the device","text":"Got a DSP-W115 plug, should be easy to connect, right? Finally got it connected without the app through WPS, got the green solid light, and the app (on the same WI-FI network) can’t find the device. I give up!","updated":"2018-12-11T13:52:03-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1723885723","userName":"camira2","userUrl":"https://itunes.apple.com/us/reviews/id113365621","version":"3.0.7","score":1,"title":"Hands down worst config app ever","text":"I have the DCH-160 water sensor.  Almost impossible to setup due to multiple bugs in app.  Most notably it has issues finding WiFi networks in the app whereas IOS sees them perfectly.  No updates since 2016? Wow.","updated":"2017-08-11T19:53:25-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"6014061721","userName":"短路OMG","userUrl":"https://itunes.apple.com/us/reviews/id194574725","version":"3.0.12","score":1,"title":"Cannot login, again","text":"May 30, 2020, cannot login again. Password reset already, still didn’t work. Please fix.","updated":"2020-05-30T08:30:17-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"5132224932","userName":"Johndavidp","userUrl":"https://itunes.apple.com/us/reviews/id36179198","version":"3.0.8","score":1,"title":"Server isn’t working!!","text":"Server isn’t working!!! Unable to log in. Error message \n“Please Try again”.   Please fix the problem ASAP \nThank you","updated":"2019-11-13T06:10:20-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"5134373331","userName":"Chris_R_Rob","userUrl":"https://itunes.apple.com/us/reviews/id22613112","version":"3.0.8","score":1,"title":"Login issues, repeatedly says please try again.","text":"Please resolve the login issue to the mydlinkHome app ASAP!!  Unable to access my dlink motion sensor and my dlink wifi alarm.","updated":"2019-11-13T17:31:16-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"3226040850","userName":"NoMoreDlink","userUrl":"https://itunes.apple.com/us/reviews/id777814794","version":"3.0.8","score":1,"title":"Stay away","text":"With ios 11.3 notifications stopped to work, ifttt is no longer supported, no app update for more then a year...big dislike for company","updated":"2018-09-24T12:20:50-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1597338407","userName":"pykhantsev","userUrl":"https://itunes.apple.com/us/reviews/id85317025","version":"3.0.7","score":1,"title":"Useless","text":"Camera video won't load and the app crashes every other time I use it. Wish dlink cameras had decent software to match their great specs.","updated":"2017-04-25T05:34:02-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1907921603","userName":"StanfordCE","userUrl":"https://itunes.apple.com/us/reviews/id120921644","version":"3.0.7","score":1,"title":"11/08 update will not let me log in","text":"Can't log into use my waterleak detector after updating. Log in info is correct but does not work.","updated":"2017-11-08T23:53:20-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"5203349130","userName":"Stan LV2","userUrl":"https://itunes.apple.com/us/reviews/id11339835","version":"3.0.11","score":1,"title":"Not user friendly","text":"Why do I have to enter my password every time?","updated":"2019-11-27T04:33:56-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"5130709879","userName":"dd max 99","userUrl":"https://itunes.apple.com/us/reviews/id154992882","version":"3.0.8","score":1,"title":"Login Problem","text":"Starting today I can’t login into my account. Useless!","updated":"2019-11-12T22:34:10-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"3083138604","userName":"LumberGuy1","userUrl":"https://itunes.apple.com/us/reviews/id109531473","version":"3.0.8","score":1,"title":"App","text":"The app no longer keeps track of alerts in last detection history","updated":"2018-08-18T12:21:23-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1904405822","userName":"Ya homeboy!!!!!!","userUrl":"https://itunes.apple.com/us/reviews/id495433086","version":"3.0.7","score":1,"title":"Horrible","text":"It won't even let me download the app AT ALL. I've tried at least 8 times and it won't download the app onto my phone.","updated":"2017-11-07T11:20:49-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"3027898807","userName":"dtesoro","userUrl":"https://itunes.apple.com/us/reviews/id115536237","version":"3.0.8","score":1,"title":"Unreliable","text":"Just stops working every now and then and can’t login to the account","updated":"2018-08-06T18:00:08-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1713261590","userName":"JJ2 review","userUrl":"https://itunes.apple.com/us/reviews/id24446321","version":"3.0.7","score":1,"title":"Mediocre","text":"Update the app. Several error notifications during setup.","updated":"2017-08-04T16:05:33-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"3517093110","userName":"tmcb82","userUrl":"https://itunes.apple.com/us/reviews/id446097115","version":"3.0.8","score":1,"title":"I think they gave up!","text":"As of December 2018 there has not been an update in over a year. Does not support iPhone X displays. Reliability is hit or miss at best.","updated":"2018-12-10T15:29:49-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"5135264224","userName":"Ahmad_K","userUrl":"https://itunes.apple.com/us/reviews/id112536180","version":"3.0.8","score":1,"title":"Always has issues","text":"Worse app ever","updated":"2019-11-13T22:06:35-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1529059746","userName":"Ivi 98","userUrl":"https://itunes.apple.com/us/reviews/id44053976","version":"3.0.7","score":1,"title":"Doesn't work","text":"Don't download this app or buy any of its products, trust me when I tell you they don't work.","updated":"2017-01-23T15:43:39-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"5129700163","userName":"cmuzic1","userUrl":"https://itunes.apple.com/us/reviews/id85765315","version":"3.0.8","score":1,"title":"Quit working","text":"Can’t log in any longer","updated":"2019-11-12T16:55:46-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1581303220","userName":"bjkoch","userUrl":"https://itunes.apple.com/us/reviews/id13628000","version":"3.0.7","score":1,"title":"Apple TV app crashes on open","text":"Can't even open the Apple TV app, it crashes immediately.","updated":"2017-04-05T05:46:34-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1987744218","userName":"Chickel chackel","userUrl":"https://itunes.apple.com/us/reviews/id406485285","version":"3.0.8","score":1,"title":"Awful","text":"Completely useless","updated":"2017-12-11T02:17:39-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"4316849474","userName":"dr.ozz1","userUrl":"https://itunes.apple.com/us/reviews/id502888432","version":"3.0.8","score":1,"title":"Update coming soon?????!!!!!","text":"Can u update the app it doesnt support my DSP-w215 device...frustratingly tricky and difficult to connect to the app...app is super old ....","updated":"2019-06-14T17:46:30-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1537979331","userName":"Hhnhnhnh","userUrl":"https://itunes.apple.com/us/reviews/id396348160","version":"3.0.7","score":1,"title":"Doesn't work","text":"Poor design, awful setup, waste of time. Sorry to say as I wanted it to work.","updated":"2017-02-05T10:36:36-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1752269105","userName":"Sucka3d","userUrl":"https://itunes.apple.com/us/reviews/id33898059","version":"3.0.7","score":1,"title":"Junk","text":"Plug does not have ifttt support.  Does not work.  Junk. Stay away from dlink products.","updated":"2017-08-26T15:22:40-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"6345707481","userName":"Afshin sh","userUrl":"https://itunes.apple.com/us/reviews/id266228161","version":"3.0.12","score":1,"title":"Firmware update error","text":"In water leakage sensor model DCH S160 app wants to update firmware  but nothing happen","updated":"2020-08-21T10:19:24-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"3027198113","userName":"Dr. Konstantinou","userUrl":"https://itunes.apple.com/us/reviews/id42385392","version":"3.0.8","score":1,"title":"Server is down","text":"Your server is not working.","updated":"2018-08-06T13:27:43-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1918804050","userName":"Dasblau","userUrl":"https://itunes.apple.com/us/reviews/id529925143","version":"3.0.8","score":1,"title":"Worst app ever","text":"Utterly useless as their customer service line","updated":"2017-11-13T13:12:56-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1666148128","userName":"Rich Chuckrey","userUrl":"https://itunes.apple.com/us/reviews/id10858044","version":"3.0.7","score":1,"title":"App is broken","text":"Motion sensor works but app fails to notify. D-Link please fix.","updated":"2017-07-02T06:29:49-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"3466783639","userName":"Elma1231","userUrl":"https://itunes.apple.com/us/reviews/id124200847","version":"3.0.8","score":1,"title":"Pure Crap","text":"See title","updated":"2018-11-27T08:29:27-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1371539654","userName":"MeowMix nomnom","userUrl":"https://itunes.apple.com/us/reviews/id119845420","version":"3.0.4","score":4,"title":"Works well, could use some improvements","text":"My 4 outlets are incredibly responsive. They used to take up to 20 seconds to turn on/off with older versions of the app. Now they're instantaneous. I may have to tap it twice one out of six times to get it to turn on or off. I've never had the indicator not match reality. (I.e. App say light is on when it's really off). It knows if the touch doesn't work. \nI particularly like the scheduling feature. I have my lights on timers. \n\nFirmware updates on the outlets worked fine, as I was on my home wifi network. Be sure you're connected to same network when updating the software. \n\nCameras don't work with this app (even though they show up). You have to use mydlink light.\n\nOne recommendation: customize push notification options. I turn them off completely because there are too many motion detection events from my cats on the cameras (even though you can't use the cameras with the app). It would be nice to select the devices that would push a notification (like a water leak!) but I can't because the cameras activate all the time.","updated":"2016-04-30T20:07:58-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1353471947","userName":"The Razor","userUrl":"https://itunes.apple.com/us/reviews/id47685465","version":"3.0.4","score":5,"title":"Worked for Me","text":"I see there are many 1 star reviews and I don't doubt there are people have problems with this app but I have to say it worked great for me. I am using it to control a DCH-S160 with a Verizon FIOS router. I used the manual setup versus the WPS method and it worked on the first attempt.\n\nOnce it was up and running the software even did a firmware update on my device.\n\nI do wish the documentation was better, I didn't realize I needed to create rules to send alerts after the device was setup. Good thing I tested it before I just plugged it in and forgot about it.  That could've caused some issues with another user wouldn't know any better.","updated":"2016-03-25T13:03:06-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1180686522","userName":"sarkees","userUrl":"https://itunes.apple.com/us/reviews/id33242569","version":"2.1.0","score":1,"title":"USELESS!! CRASHES!!","text":"This app works up until the moment you successfully add a device! (Which was successful, only after 8 unsuccessful attempts!) After that, it crashes when you start it! I have deleted the app and reinstalled and even rebooted my iPhone 6 plus before reinstalling, and it is still a piece of garbage! I now realize why all of the devices are on sale, because they are useless without this app! \n\nI bought a motion sensor, thinking it would be cool to play with and see if it would actually work, and send me messages if it sees motion.. Even without the app, I tried to log in on-line, but there are NO CONFIGURABLE OPTIONS!!! You must have the App!! So basically, I bought garbage!! Don't get your hopes up! Don't waste your time! Don't waste your money!","updated":"2015-04-10T05:56:35-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1115323259","userName":"CamanoIsland","userUrl":"https://itunes.apple.com/us/reviews/id114147920","version":"2.0.2","score":1,"title":"Not What I Expected","text":"This is the upgraded app from Dlink and it is marginally better than the first. I have encountered soooo many issues with this app and the Dlink SmartPlug I am amazed that Dlink would attach their name to them.\n\nI set custom schedules based on our lifestyle. Its not hard to set the schedule; however, the app/service constantly loses the settings. The more comlicated the schedule the bigger the pain to restore. \n\nThe other issues are with the SmartPlug device. It kicks on and interferes with my other wifi devices (the connections are dropped). When this happens the app cannot connect to the smartplugs and I have to reboot my network. I have several wifi devices on my network (Roku, Apple TV, Nest, etc) and this problem is a first.\n\nIf I had to do it again I would NOT purchase the DLink products.","updated":"2014-12-18T07:54:00-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1266255379","userName":"DVCdvc2","userUrl":"https://itunes.apple.com/us/reviews/id172641779","version":"3.0.0","score":4,"title":"Great Improvement, keep up good work.","text":"Just installed this latest version and is an excellent improvement. Last few version were VERY slow to activate devices. A few times the requests took so long it generated an error and you had to reopen the app.  This version it's quite responsive and looks better too.\n\nHopefully there will be an iPad version too.\n\nOne suggestion would be to integrate your network cameras and other devices into a single app. It's quite jarring to be redirected to another app, back and forth, to use my devices.","updated":"2015-10-03T03:47:36-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1133884109","userName":"petersonpc","userUrl":"https://itunes.apple.com/us/reviews/id114700671","version":"2.0.3","score":3,"title":"App Crash City iPhone 6","text":"I set up a switch which works great for my lamp. I set up a camera and it works great from a laptop or computer but the app crashes on my iPhone after pop up warns of charges may be incurred. Come on people! If your smart enough to hook up your gear and link it to the app you understand you might be charged in certain settings. Just have a one-time warning we can check it off. I want to be able to see the camera on my iPhone or there is no point because that is what I will have when I am not at home.","updated":"2015-01-21T15:01:42-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1297119983","userName":"igDyson","userUrl":"https://itunes.apple.com/us/reviews/id268562442","version":"3.0.3","score":5,"title":"Works better than expected","text":"Don't know why this got such low reviews. Setup was super easy, picture looks great on my iPhone 6s Plus and my wife's iPhone 5c. Detects motion and sound and alerts us in case of intruder. Only thing is I wish I could view the video on my Apple Watch. Hopefully an update with that feature in the future :)","updated":"2015-12-06T22:08:53-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1121336643","userName":"Jnottingham","userUrl":"https://itunes.apple.com/us/reviews/id101338781","version":"2.0.2","score":5,"title":"Better Than Iris","text":"We have Iris at home and just set up dLink in second home.  DLink is superior.  I downloaded the App and went through the device setup on an outlet switch.  Took about 5 minutes to setup and worked fine from the start.  The free App does more than my more expensive Iris Hub and is easier to use.","updated":"2014-12-29T12:38:22-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1123526956","userName":"NightRPStar","userUrl":"https://itunes.apple.com/us/reviews/id39528679","version":"2.0.3","score":3,"title":"App crashing on iPhone 6.","text":"Hi app dev team, \nJust wanted to make you all aware that the app keeps crashing on my iPhone 6 starting with version 2.0.1. I've already just updated to 2.0.3 but it still keeps crashing even after rebooting my phone. When you have an opportunity please test on the iPhone 6 to see if you have similar results or if you have any suggestions that I can follow to remedy it.","updated":"2015-01-02T12:01:37-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1235162433","userName":"MangoTreeMama","userUrl":"https://itunes.apple.com/us/reviews/id85273085","version":"2.2.3","score":1,"title":"Great idea, doesn't work","text":"Agonizing to set up, even after you talk on the phone to customer support, the best you can do it run the set up over and over and over and over until, finally, for some magical reason, it connects. \nThen, it randomly disconnects itself and can't be found until you do the above long drawn out process above. Each setup takes upward of 20 minutes and it needs to be done several times a day. \nAbsolutely NOT a time saver or in any way a reliable device.","updated":"2015-07-29T17:59:26-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1094786317","userName":"flybynite11","userUrl":"https://itunes.apple.com/us/reviews/id30747080","version":"2.0.1","score":2,"title":"Has software issues","text":"This app kept crashing after the version 2 update. I had to delete the app and reinstall to get it to open without crashing. Now it's says a firmware update is available... After updating the firmware multiple times and the indicator saying its 100% complete the firmware is never upgraded. The app keeps saying firmware update required. D-link's software is not ready for prime time.","updated":"2014-11-10T04:48:59-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1234129463","userName":"sabatang","userUrl":"https://itunes.apple.com/us/reviews/id28706222","version":"2.2.2","score":1,"title":"Crashes immediately on iOS 8","text":"Confirming what the other reviewer (Qusbbdidb) reported, this app crashes immediately after you have finished configuring your device (in my case a motion sensor, DCH-S150). Try to start it again and it will crash immediately. Restart your iPhone? Try it on an iPad? Uninstall and reinstall? None of that worked for me. Still crashes instantly. The lack of quality assurance on D-Link’s part is stunning—how could they not notice this unless they didn’t actually test it?!","updated":"2015-07-27T16:39:19-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1222802154","userName":"BellMartin","userUrl":"https://itunes.apple.com/us/reviews/id15516760","version":"2.2.1","score":1,"title":"Sorry but it's junk.","text":"Bought the camera after a lot of online reading. Downloaded the app. It took many tries to get it to work with the camera. It lasted about a day. It kept having trouble connecting to the camera and eventually could not. I tried from scratch and nothing. Reset the camera, deleted the app then reinstalled the app and tried again and nothing. I totally wasted my time and money.  Sorry, I can't recommend this product at all!","updated":"2015-07-05T18:21:08-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1188329203","userName":"Ebly","userUrl":"https://itunes.apple.com/us/reviews/id43309967","version":"2.1.0","score":3,"title":"Promising but needs work","text":"Works great with the power outlet sensor. Will not connect to my 933L. Given that the 933L is one of the models featured on the \"connected home\" line support would be assumed to be a given. It will immediately send me a push alert when motion is detected but then I have to switch to the dlink lite app to view it. With all the products coming out soon I hope they get on it.","updated":"2015-04-26T05:31:53-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1253462050","userName":"TheRealElbadoo","userUrl":"https://itunes.apple.com/us/reviews/id29934861","version":"2.2.4","score":2,"title":"Wakes me up for no good reason","text":"I get notifications from my water alarm all night long to alert me of minor wireless network hiccups, and there's no option to disable that.\n\nI can turn off sounds in the notification options for the app as a whole, but the whole reason I bought the wireless water alarm is to be alerted when something has sprung a leak.","updated":"2015-09-05T06:39:08-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1255020541","userName":"SteveJeeper","userUrl":"https://itunes.apple.com/us/reviews/id42494649","version":"2.2.4","score":4,"title":"Pretty Cool App","text":"Set up was easy and it worked fine once I moved my router to achieve the range I need. I'd give five stars if I could have one minute increments for the timer/schedules; how difficult could it be? 30 minute increments are way too large. Think beyond security lights D-Link, there are other uses.","updated":"2015-09-08T18:52:53-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1267114446","userName":"Steve in Weston","userUrl":"https://itunes.apple.com/us/reviews/id30265151","version":"3.0.0","score":1,"title":"Update 3.0","text":"Get into the app. It states my plug firmware needs update. It downloads, installs, says to reboot. And then when it comes back only it states there is new firmware. I've run this update now 3 times. It still is not working and still states there is a firmware update needed. \nThis update is a week late and has issues.  So now without the updated firmware my plug is useless. \nUpdate, tried the update again. Installed the software. Once the software installs it states \"Please reboot your device\".  I have checked the manual and no where does it state how to do a reboot. \nI hate this update 😡\n\nCalled for support twice today. The first time they said they would call back at 4 PM. No call. Around 5 I called them. Still no luck.","updated":"2015-10-04T18:35:28-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1361922445","userName":"EverSoSelective","userUrl":"https://itunes.apple.com/us/reviews/id175290635","version":"3.0.4","score":5,"title":"Worked fine for me!","text":"I'm using the D-Link Water Sensor. The firmware updated itself and everything works great. The alert and email actions can be setup as needed. I couldn't have asked for any more functionality. Thanks!","updated":"2016-04-11T05:38:50-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1267068226","userName":"flashcat3313","userUrl":"https://itunes.apple.com/us/reviews/id133271945","version":"3.0.0","score":2,"title":"Great update, but has problems.","text":"Really like feature so each device (switch) can have its own schedule. Cleaner look. Problem is only my 5010 cameras are working right. The 5020, 930, & 933 cameras almost always cause the app to close. Have to use the dlink+ app to access them. Please fix soon.","updated":"2015-10-04T16:05:05-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1266157187","userName":"Jimmy Q. K.","userUrl":"https://itunes.apple.com/us/reviews/id173807182","version":"3.0.0","score":5,"title":"Excellent","text":"I got update notice from dlink which mentioned this update is going to have big difference.  to take screenshot of my schedule. After updated, my plug works perfect and fast. Good update.","updated":"2015-10-02T23:01:33-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1319892177","userName":"Harry's review","userUrl":"https://itunes.apple.com/us/reviews/id177182601","version":"3.0.4","score":1,"title":"No longer works with my DCS5222L","text":"The app worked great with my DCS5222L until the update to the app in September. My camera is no longer available within the app. They removed it from the list of supported cameras. Now I am forced to use the mydlink lite app which does not work well. When you turn motion on or off other camera settings are simultaneously changed from their original settings.","updated":"2016-01-21T04:32:47-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1177491193","userName":"kilauea88","userUrl":"https://itunes.apple.com/us/reviews/id43327800","version":"2.1.0","score":1,"title":"Used to work, now does not","text":"MyDLink Lite and JustConnect work fine, this paid version will no longer connect to my DCS-931L, I get a \"connection error\" every time I've tried for the last 2 weeks.  \n\nIt's a great feeling while to traveling to receive notifications that motion or sound has been detected at home...and then not be able to connect to the camera to see what is actually going on. :-(","updated":"2015-04-03T18:12:36-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1312964443","userName":"benwillis","userUrl":"https://itunes.apple.com/us/reviews/id19745913","version":"3.0.4","score":1,"title":"Can't turn off motion alerts","text":"WHEN WILL DLINK FIX THIS APP?? \n\nI do not want to be notified every time there is motion detected by my camera.  Like, for example, alerting me every time I walk in or out of my own living-room.  There is a setting in the camera app to disable this which works fine but this app ignores it and I get so many alerts I finally had to uninstall this really poorly written and tested app.  \n\nUnusable POS. Please fix soon!!!","updated":"2016-01-07T19:41:30-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1287706466","userName":"cjcpeter","userUrl":"https://itunes.apple.com/us/reviews/id17436517","version":"3.0.3","score":3,"title":"Fast response, but the meter function was not fixed for smart plug","text":"The response greatly improved.  If you encounter a smart plug update failure, please reset to factory default and try to update again.\nThe meter will not reset after the billing date. Please fix it!!!","updated":"2015-11-16T21:19:14-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1412013136","userName":"Kstet2112","userUrl":"https://itunes.apple.com/us/reviews/id244849066","version":"3.0.5","score":1,"title":"Crying for updates!!!","text":"How about a timer for sunset and sunrise with an offset?   I cannot get different devices to share a schedule.  So you have to create an identical schedule for each device.  Waste of time.  Other company's are constantly updating and improving their apps. Dlink is not.  Not on the app.  Huge room for improvement.  Had expected more.","updated":"2016-07-14T16:57:14-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1271543630","userName":"Mugsheader","userUrl":"https://itunes.apple.com/us/reviews/id46246316","version":"3.0.0","score":2,"title":"Only one user may control the devices?","text":"Only one user may control the device. If you want multiple users they must all log in using the same email address and password. Bogus if you have more than one person living in your house.","updated":"2015-10-14T09:35:34-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1206637454","userName":"pomeccia","userUrl":"https://itunes.apple.com/us/reviews/id180200983","version":"2.2.0","score":2,"title":"After app update it is crashing everytime","text":"After the last update I can't access my account it's crashing every time and so I would have to expect an update!! Please do it fast! Still crashing!!! Please do something all my devices are not reach from me!!","updated":"2015-06-03T04:37:51-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1068059475","userName":"mnuseight","userUrl":"https://itunes.apple.com/us/reviews/id102298855","version":"1.1.0","score":2,"title":"Disappointing, hope its upgraded soon","text":"Doesn't send texts like advertised, only notifications! Stopped working completely  after iOS 8 update. Constantly gets disconnected and re connected. Please make this work better!","updated":"2014-09-21T08:28:40-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1336215690","userName":"TerencPepa","userUrl":"https://itunes.apple.com/us/reviews/id140360135","version":"3.0.4","score":1,"title":"Not good","text":"I purchased the 935L for this app. And for notifications. Will not recommend anyone to buy this camera and use. I have other cams that costs 26$ and have more Quality.\nAlso smtp notifications not working very well. Notifications will be send also when sun comes up so this will be scary. \n\nDont buy!","updated":"2016-02-20T18:52:19-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1270365877","userName":"Phan mok","userUrl":"https://itunes.apple.com/us/reviews/id217255166","version":"3.0.0","score":5,"title":"I can on/off smartplug more faster than before","text":"I can on/off smartplug more faster than before","updated":"2015-10-11T18:22:05-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1107227196","userName":"cjkohler","userUrl":"https://itunes.apple.com/us/reviews/id22025194","version":"2.0.2","score":1,"title":"God awful","text":"Really D'link? How many engineers does it take to fix the bugs in this app? You have great hardware, but god awful software. I have a lot of D'link in my home (smart plugs, routers, cameras, NAS, etc.) and I'm about to throw it all in the trash because you're incapable of fixing a simple program like this. Fire your IT team and get your head out of your a**.","updated":"2014-12-03T03:16:03-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1232497613","userName":"Qusbbdidb","userUrl":"https://itunes.apple.com/us/reviews/id237584721","version":"2.2.2","score":1,"title":"Doesn't work iphone6 s150","text":"I bought three s150 model motion sensors and followed the instructions to install on my wps router. The product does not work the app for iOS that I am reviewing keeps crashing and does not do what I expected it to the product also requires a firmware update trying this now, until it all works 1 star.","updated":"2015-07-24T11:59:12-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1090255681","userName":"OmaNomad","userUrl":"https://itunes.apple.com/us/reviews/id23739858","version":"2.0.0","score":3,"title":"Ver 2 crash solution","text":"Horrible documentation- if you upgrade to V2 and it crashes you need to delete it off your device to clear out old data. Then reinstall it. It should work then.","updated":"2014-11-01T22:57:17-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1268411769","userName":"K Jung","userUrl":"https://itunes.apple.com/us/reviews/id202748658","version":"3.0.0","score":1,"title":"Too bad it doesn't work POS.","text":"I bought this to control lights while away. The app has to be manually activated almost every time, even though a program has been selected. \nSave your money and buy a couple of cheap automatic switches from a home supply store. \nVery bad app, which makes the switch almost useless.","updated":"2015-10-07T13:52:54-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1461203985","userName":"Notapaidreviewer","userUrl":"https://itunes.apple.com/us/reviews/id42207574","version":"3.0.6","score":2,"title":"Simply horrible","text":"App has issues of not detecting camera. Limited functionality. The only thing worse than this app is dlink customer support. They leave the user very frustrated with the ineptitude and canned responses.","updated":"2016-10-04T20:28:18-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1351343167","userName":"Spookyechc","userUrl":"https://itunes.apple.com/us/reviews/id20665453","version":"3.0.4","score":1,"title":"No good","text":"From the set up of the camera being way to hard to not remembering the password for auto login (used for a baby monitor at night I have to login to view), this app is is not worth it.  Should have spend a little more and got a better camera that doesn't need an app.","updated":"2016-03-21T10:53:30-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1205869941","userName":"K. Ku","userUrl":"https://itunes.apple.com/us/reviews/id135977232","version":"2.2.0","score":1,"title":"Not working, too much pain","text":"I bought 3 DSP-W215 smart plug , used this app on my iphone6 to set them up, all 3 plugs got solid green light but it would not get through the last step which is \"searching for device\", it always said \"Device not found\". There are some bugs in this app, waiting for next update!!!","updated":"2015-06-01T10:10:29-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1248064534","userName":"Mr1080p","userUrl":"https://itunes.apple.com/us/reviews/id41402431","version":"2.2.4","score":3,"title":"MyDlink smart plug","text":"Good product. Only thing I would suggest is allowing advanced timer to set any time instead of the 30min increments they have preset currently. Would have been 4-5 stars with that option.","updated":"2015-08-24T14:53:03-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1430492484","userName":"y0o0o","userUrl":"https://itunes.apple.com/us/reviews/id85619035","version":"3.0.6","score":3,"title":"Just OK.....","text":"i have an older Dlink camera which it is not compatible. That is one negative. App is sometimes buggy, doesnt pick up my smart plug or theres a bit of a delay activating my smart plug. WISH THERE WAS A WIDGET FOR THE PULL DOWN IOS NOTIFCATION CENTER. ! ! that would make the app A LOT BETTER !","updated":"2016-08-10T07:39:19-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1166545053","userName":"GreeziBear","userUrl":"https://itunes.apple.com/us/reviews/id294711000","version":"2.1.0","score":1,"title":"Garbage App","text":"It was a waste of time downloading this app. It is garbage. The scan does not work. I skipped the scan, and I tried adding my camera, but it doesn't have the option of the model that I have. What's the point of even creating an app that does not have your model of the camera?","updated":"2015-03-11T13:57:10-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1267046906","userName":"HateRaining:)","userUrl":"https://itunes.apple.com/us/reviews/id154046073","version":"3.0.0","score":5,"title":"Five stars","text":"I just bought a water sensor, it works pretty well. Installation was easy. Good product and app.","updated":"2015-10-04T14:48:28-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1187484649","userName":"Davidhn112","userUrl":"https://itunes.apple.com/us/reviews/id260308756","version":"2.1.0","score":5,"title":"Nice IFTTT like features","text":"Was able to link my sensor to the camera to perform actions like take a snapshot and notify very easily.","updated":"2015-04-24T14:52:10-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1266585500","userName":"BCK70","userUrl":"https://itunes.apple.com/us/reviews/id18222618","version":"3.0.0","score":2,"title":"Doesn’t seem to work","text":"The app launches the old version and never lets me update the firmware.  At least the old version worked…not a happy customer right now.","updated":"2015-10-03T18:51:31-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1367719032","userName":"Chezzti","userUrl":"https://itunes.apple.com/us/reviews/id409084407","version":"3.0.4","score":4,"title":"Works with manual set up","text":"Like a couple of other reviewers mentioned, this works fine with Manual set up","updated":"2016-04-23T10:28:50-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1267515787","userName":"Jjxx7","userUrl":"https://itunes.apple.com/us/reviews/id20671229","version":"3.0.0","score":1,"title":"Horrible update!","text":"After update the app tells me to upgrade the firmware on a motion detector but won't let me do it unless I'm connected to my home networks Wi-Fi. The problem is, I am connected \nto my home network's Wi-Fi.  Then crashes when I check the camera.  Using iPhone 5.","updated":"2015-10-05T15:47:21-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1284054948","userName":"IpodHappy","userUrl":"https://itunes.apple.com/us/reviews/id38551234","version":"3.0.2","score":1,"title":"Complete fail","text":"The new version has completely locked me out of my 11 devices.  I did a complete uninstall and reinstall of the app and have the same problem.  I'm having to downgrade from an older version saved on my computer.","updated":"2015-11-08T19:17:06-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1263604484","userName":"Pathfinder2400","userUrl":"https://itunes.apple.com/us/reviews/id241839398","version":"2.2.4","score":1,"title":"Terrible App and Products","text":"D-Link wall plugs are strictly junk. I got 4 of them setup using D-Link Home and within a week they became unstable. Then D-Link needed to push out a firmware upgrade. We tried this and it killed our whole system. Avoid the frustration of using D-Link cameras and plugs!!","updated":"2015-09-27T08:42:53-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1387870167","userName":"713jojo","userUrl":"https://itunes.apple.com/us/reviews/id23969125","version":"3.0.5","score":2,"title":"Please update!!!","text":"I can only watch for 5sec before it freezes. App closes on its own. It won't let me change the settings without freezing up. Plz fix!","updated":"2016-06-02T07:53:50-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1273256460","userName":"Fraqu","userUrl":"https://itunes.apple.com/us/reviews/id367979085","version":"3.0.0","score":1,"title":"Terrible Interface","text":"I could write a lengthly tome of how difficult it was to set up my two DCS 5020L cameras, my DCS 5009, my 2 DCS 930s, my one 933 camera, and my five smart plugs\n\nIn essence it takes TWO HOURS to finally get them connected, firmware updates are hit or miss, yes using an ethernet cable.\n\nCurrently I am on the third hour trying to set up my latest smart plug. The experience gets more difficult with every app update. \n\nPlease fix the \n\n1)Set up process\n2)Firmware update process\n3)overall stability","updated":"2015-10-17T15:14:51-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1266397866","userName":"guoyr","userUrl":"https://itunes.apple.com/us/reviews/id138336299","version":"3.0.0","score":5,"title":"Excellent update","text":"Turns a 2-star app 5 stars. Immediate response even on a crowded 2.4GHz network","updated":"2015-10-03T09:13:34-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1203959197","userName":"randomsushi","userUrl":"https://itunes.apple.com/us/reviews/id103194325","version":"2.1.1","score":1,"title":"app crashes","text":"crashes as soon as you open it. can't even use it. I'm returning their product because there's no point if the app doesn't work. I contacted customer service but no help. you'd think they'd fix it by now....","updated":"2015-05-28T14:21:58-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1351039445","userName":"Coppermax","userUrl":"https://itunes.apple.com/us/reviews/id41873362","version":"3.0.4","score":1,"title":"Latest Version Unusable","text":"Constantly logs you out of the app making the convenience factor of the tech, extremely inconvenient. Hopefully they fix this soon. I have over 15 smart plugs, and it's becoming annoying.","updated":"2016-03-20T21:21:06-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1266298814","userName":">JFK<","userUrl":"https://itunes.apple.com/us/reviews/id242936515","version":"3.0.0","score":1,"title":"After update you need setup all your devices once again","text":"After update you need setup all your devices once again. It is horrible. Developer should publicate software if it works properly.","updated":"2015-10-03T05:39:17-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1265692775","userName":"Volleyball Queen Bee","userUrl":"https://itunes.apple.com/us/reviews/id155654936","version":"2.2.4","score":1,"title":"Needs an update","text":"App used to work fine, now it just thinks and doesn't do anything a lot of the time. Also have to enter my password most times I go into the app. The issues are since the ios9 update.","updated":"2015-10-01T23:22:26-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1023299261","userName":"jhaverisd","userUrl":"https://itunes.apple.com/us/reviews/id36395199","version":"1.0.0","score":1,"title":"Serious bug in app","text":"There is a serious flaw in this and and I am waiting for dlink to fix the issue. I reported the problem to their development team yesterday. The notification portion of the app for motion sensor devices is not working.","updated":"2014-07-06T07:09:53-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1296561825","userName":"Jim5pt7v8","userUrl":"https://itunes.apple.com/us/reviews/id18393841","version":"3.0.3","score":1,"title":"No sound or badges for notifications","text":"Bought a water sensor but the alerts simply pop up on the phone with no sound or badge.  Useless to alert quickly for a water leak.","updated":"2015-12-05T20:16:14-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1261888064","userName":"LotusOH","userUrl":"https://itunes.apple.com/us/reviews/id4679163","version":"2.2.4","score":1,"title":"Bugs","text":"This app is so full of bugs I'm not going to take the time to list. Constantly crashes and hangs - virtually impossible to use. I'm returning all my power modules. Does dlink bother to test updates before releasing them?","updated":"2015-09-23T17:47:59-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1197667695","userName":"Ndiaz90","userUrl":"https://itunes.apple.com/us/reviews/id151054726","version":"2.1.1","score":1,"title":"Application crash in iPhone 6 plus","text":"I'm very dissappoint with this product I bought sensors for all my house and the configuration was a mess!!!. Then, after installation was completed , the application start to crash every time.","updated":"2015-05-15T07:12:42-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1172510344","userName":"Firedog53","userUrl":"https://itunes.apple.com/us/reviews/id18812914","version":"2.1.0","score":1,"title":"Did work but now not so much.","text":"This app worked until the update now it has a mind of its own. Turns on off all on its own not following the time I set up. I even tried to reload the app but no help.","updated":"2015-03-23T21:34:00-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1262604332","userName":"Duinnutin","userUrl":"https://itunes.apple.com/us/reviews/id158653985","version":"2.2.4","score":1,"title":"Terrible","text":"It freezes every time it runs. Last two days I was unable to open application to reschedule, turn on/ off anything...I am running out of patient.","updated":"2015-09-25T08:06:11-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1132366127","userName":"Manorven1","userUrl":"https://itunes.apple.com/us/reviews/id350352908","version":"2.0.3","score":2,"title":"App crashes often","text":"did you do any testing of this app before releasing the new verison?","updated":"2015-01-18T18:52:33-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1451880855","userName":"Frank Qing","userUrl":"https://itunes.apple.com/us/reviews/id197443920","version":"3.0.6","score":1,"title":"not okay","text":"Very disappointed. Delay sometimes about 5mins. There is no notification.  You only can check by yourself when you are running this app.","updated":"2016-09-18T08:44:29-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1266441131","userName":"foxbristol","userUrl":"https://itunes.apple.com/us/reviews/id176238389","version":"3.0.0","score":5,"title":"A very good update","text":"This update has greatly increased the usability of the app.","updated":"2015-10-03T10:59:52-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1264996297","userName":"cdphoto","userUrl":"https://itunes.apple.com/us/reviews/id15072675","version":"2.2.4","score":1,"title":"Crashes","text":"Crashes on launch.\nCome on Dlink, the cameras are nearly worthless without a stable iOS app.\nYou won't be able to give away your cameras with the current software!","updated":"2015-09-30T11:03:43-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1244243171","userName":"Whispering Spirit","userUrl":"https://itunes.apple.com/us/reviews/id42201326","version":"2.2.4","score":3,"title":"With update problems","text":"My light switches are not working with updated","updated":"2015-08-16T18:25:03-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1250511297","userName":"Texasttn","userUrl":"https://itunes.apple.com/us/reviews/id21093726","version":"2.2.4","score":1,"title":"Set up","text":"Having major issues getting these set up on 2 different home networks. The app is constantly freezing or crashing.","updated":"2015-08-29T20:33:41-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1270703393","userName":"Roscoe52","userUrl":"https://itunes.apple.com/us/reviews/id150438492","version":"3.0.0","score":1,"title":"Beware! This update stinks!","text":"If you use smart plugs beware that this app will require firmware update and will cause it to disappear from older versions of app on other phones. It will also link to mydlink lite for cameras. Yuck.","updated":"2015-10-12T10:39:33-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1312340513","userName":"Mordie1997","userUrl":"https://itunes.apple.com/us/reviews/id29349794","version":"3.0.4","score":1,"title":"Stopped working","text":"About two weeks ago the app stopped working. The screen goes black when the app is launched. I'm using an iPod Touch 6th generation running iOS 9.2.","updated":"2016-01-06T14:13:25-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1402126422","userName":"James5wins","userUrl":"https://itunes.apple.com/us/reviews/id161159357","version":"3.0.5","score":1,"title":"Broken, black screen","text":"Installed this the first time, deleted 3 other times and installing, nothing by a black screen. I'm returning my 2 new devices tomorrow nothing.","updated":"2016-06-28T19:57:03-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1205100600","userName":"Pawlosgr","userUrl":"https://itunes.apple.com/us/reviews/id143611551","version":"2.2.0","score":5,"title":"Awesome","text":"It is way better than Wemo.","updated":"2015-05-30T21:43:32-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"4507915098","userName":"Bqhan","userUrl":"https://itunes.apple.com/us/reviews/id616247672","version":"3.0.8","score":2,"title":"D-link cameras","text":"I have been using two cameras DCS-930L and DCS-933L for my home system since 2017. These cameras have been working fine indoor but recently I have tried to update the software from Mydlink Lite to the new Mydlink version I encountered a problem that both of them didn't not connected to the Wifi when I failed to install them because I did not have the setup codes to do it and I  had to say\"no\" to follow the steps without the code.\nThese instructions never worked and the LED never light green and both devices were not found.  I spent the whole morning to repeat the instructions and finally had pto give up.\nWould you please help me by sending me the QR codes or find some other ways to recover those cameras.  I truly appreciate your assistance in this matter.\nSincerely,\n\nBinh Han","updated":"2019-07-23T15:34:05-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1098063968","userName":"BartMcD","userUrl":"https://itunes.apple.com/us/reviews/id36986610","version":"2.0.2","score":1,"title":"Crashes upon opening","text":"App doesn't work after latest update - will revise review once app starts working again.","updated":"2014-11-16T07:50:27-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1211008768","userName":"AJslo","userUrl":"https://itunes.apple.com/us/reviews/id218662085","version":"2.2.0","score":5,"title":"Works perfect","text":"Thanks guys! I got a motion detector and it is perfect with the app.","updated":"2015-06-11T22:10:30-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1318621647","userName":"Super67894","userUrl":"https://itunes.apple.com/us/reviews/id296041707","version":"3.0.4","score":1,"title":"Bad update","text":"Stop working, screen goes black on iPod touch 5. About 1 month ago with no fix to date very poor.","updated":"2016-01-18T14:19:32-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1287625265","userName":"yuneeq","userUrl":"https://itunes.apple.com/us/reviews/id29511117","version":"3.0.3","score":1,"title":"Useless App bricks the device","text":"I can't login bec. I forgot my password and clicking \"forgot password\" leads to absolutely nowhere. The app is a piece of crap and make my timer a useless brick.","updated":"2015-11-16T16:52:52-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1134942673","userName":"Ron Ireland","userUrl":"https://itunes.apple.com/us/reviews/id41817334","version":"2.0.3","score":1,"title":"An expensive light switch","text":"Nothing in this app works but the on/off switch. The scheduling portion of the app is confusing and does not work.","updated":"2015-01-23T14:53:59-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1090527820","userName":"longviewlady","userUrl":"https://itunes.apple.com/us/reviews/id218370510","version":"2.0.0","score":1,"title":"Schedule doesn’t work","text":"I can turn my light on and off from my iPhone 5s, but the schedule doesn’t work.","updated":"2014-11-02T07:52:37-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1372969667","userName":"Mky000005","userUrl":"https://itunes.apple.com/us/reviews/id263131203","version":"3.0.5","score":1,"title":"Help please!!!","text":"Whenever I try to open the app my iPod touch 5th generation crashes it didn't do this in the last update (3.0.3) I need help!","updated":"2016-05-03T10:21:29-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1351044163","userName":"skylin513","userUrl":"https://itunes.apple.com/us/reviews/id100533377","version":"3.0.4","score":1,"title":"FIX THIS APP","text":"This app now logs me out every single time I leave the app to do something else... I love logging in every single time I want to turn on or off anything.. This app is USELESS.  FIX IT DLINK","updated":"2016-03-20T21:35:36-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1352436706","userName":"Vexed 22","userUrl":"https://itunes.apple.com/us/reviews/id6542516","version":"3.0.4","score":1,"title":"Stopped working - black screen on launch","text":"Stopped working - black screen on launch.","updated":"2016-03-23T16:33:47-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1100921326","userName":"Mickey2tone","userUrl":"https://itunes.apple.com/us/reviews/id17518344","version":"2.0.2","score":1,"title":"Not yet ready","text":"Keeps asking me to resend my verification link when I try to view a camera and it doesn't remember by login. Needs QA.","updated":"2014-11-21T21:37:38-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1376512387","userName":"LABeachGuy","userUrl":"https://itunes.apple.com/us/reviews/id38035038","version":"3.0.5","score":1,"title":"Useless","text":"I use the app to control a wifi outlet.  It tells me the device is on when it's off.","updated":"2016-05-10T09:05:13-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1088850593","userName":"Try7035","userUrl":"https://itunes.apple.com/us/reviews/id325023252","version":"2.0.0","score":1,"title":"New update doesn't work on iPhone 5","text":"Please fix this the new update doesn't work on iPhone 5. It is unusable","updated":"2014-10-30T13:46:19-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1173350834","userName":"Lenard311","userUrl":"https://itunes.apple.com/us/reviews/id396965902","version":"2.1.0","score":1,"title":"Complete waste of time","text":"Network error please try again......I hate to even give it one star","updated":"2015-03-25T19:57:44-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1108288349","userName":"Tim DeMint","userUrl":"https://itunes.apple.com/us/reviews/id354619632","version":"2.0.2","score":1,"title":"Broken","text":"It's pretty, I like the direction.  But the ability to set up new devices is simply broken. Please fix!","updated":"2014-12-05T07:00:50-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1335645289","userName":"slapware","userUrl":"https://itunes.apple.com/us/reviews/id43363119","version":"3.0.4","score":1,"title":"Smart switches WPS","text":"Having had 3 out of 8 brick on updates over a year, don't buy. A short term investment for a pile of junk.","updated":"2016-02-19T18:41:22-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1174063458","userName":"Fanatic4rf","userUrl":"https://itunes.apple.com/us/reviews/id108155399","version":"2.1.0","score":1,"title":"Doesn't work with older cameras...","text":"Not working with my DCS-932L cameras, but does work with my DCS-5020L.  Gonna keep using the myDlink Lite app instead, at least it works.","updated":"2015-03-27T11:08:10-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1296835170","userName":"Disappointed Jack","userUrl":"https://itunes.apple.com/us/reviews/id40712636","version":"3.0.3","score":1,"title":"DLink Switch Terrible","text":"Can't get the software or the switches to work and no customer support. Complete waste of money.","updated":"2015-12-06T07:50:02-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1270679811","userName":"Mtmsf","userUrl":"https://itunes.apple.com/us/reviews/id3667608","version":"3.0.0","score":1,"title":"Still doesnt work","text":"Another buggy update.  Cant control plugs now, and cant set up motion detector.  These people are idiots.","updated":"2015-10-12T09:37:28-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1267910147","userName":"JudoDogMD","userUrl":"https://itunes.apple.com/us/reviews/id38081335","version":"3.0.0","score":1,"title":"Does not work as of 10/6","text":"Update on 10/6 just broke the app. It no longer connects to any cameras.","updated":"2015-10-06T11:24:11-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1375119859","userName":"MovieAddicts","userUrl":"https://itunes.apple.com/us/reviews/id103790654","version":"3.0.5","score":1,"title":"Doesn't save login","text":"I have to login manually every time I launch the app","updated":"2016-05-07T16:27:39-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1322216000","userName":"Bigandugly","userUrl":"https://itunes.apple.com/us/reviews/id226590390","version":"3.0.4","score":1,"title":"Latest maintenance has yielded unusable app","text":"3.0.4 yields black screen upon launch - how long is the vendor going to ignore this issue!","updated":"2016-01-25T07:12:23-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1101874953","userName":"Chase Member","userUrl":"https://itunes.apple.com/us/reviews/id14461659","version":"2.0.2","score":1,"title":"App update","text":"Piece of junk since the new update will not connect. Will wait until app update.","updated":"2014-11-23T09:00:55-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1414200461","userName":"Dge1980","userUrl":"https://itunes.apple.com/us/reviews/id479053322","version":"3.0.5","score":1,"title":"Device won't connect with app","text":"The app couldn't connect with my device. Returned.","updated":"2016-07-17T14:45:47-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1088189378","userName":"HarvH","userUrl":"https://itunes.apple.com/us/reviews/id26960731","version":"2.0.0","score":1,"title":"Doesn't Work","text":"News flash. The new update crashes.","updated":"2014-10-29T06:19:44-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1346311957","userName":"Qwhdidisjsjs","userUrl":"https://itunes.apple.com/us/reviews/id47701892","version":"3.0.4","score":1,"title":"Doesn't work","text":"Nonfunctional on iPod Touch.  Only shows black screen. D-Link support is useless.","updated":"2016-03-11T10:45:52-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1266527939","userName":"Lets9255","userUrl":"https://itunes.apple.com/us/reviews/id116636142","version":"3.0.0","score":1,"title":"crashes","text":"app loads faster with update but any camera i try to access crashes app. even deleted app and redownloaded it and still crashes even rebooted phone. no joy","updated":"2015-10-03T15:53:58-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1175017683","userName":"Kndfgh","userUrl":"https://itunes.apple.com/us/reviews/id111951456","version":"2.1.0","score":1,"title":"Does not work on w215","text":"Will not connect no matter what I try","updated":"2015-03-29T10:00:02-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1093298742","userName":"RFI listener in USA","userUrl":"https://itunes.apple.com/us/reviews/id49817746","version":"2.0.1","score":1,"title":"Not working!!","text":"The app doesn't launch!","updated":"2014-11-07T14:32:52-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1089547481","userName":"joj0m","userUrl":"https://itunes.apple.com/us/reviews/id41488574","version":"2.0.0","score":1,"title":"Need more testing","text":"Someone in it should be fires did not do a thorough testing","updated":"2014-10-31T19:14:24-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1210107413","userName":"DaleBarton","userUrl":"https://itunes.apple.com/us/reviews/id24619523","version":"2.2.0","score":3,"title":"So many missed opportunities","text":"I bought a smart plug to use as a power monitor; it requires this app. After creating a d-link account and configuring the plug to connect to your wifi, the app allows you to turn off and on the plug, create a schedule, monitor power usage, and set up conditions for the plug to turn off and on. You're probably thinking that sounds amazing; I was too. It's not what you think. You can only create six schedules, period, and then choose which of those six your device will use. The schedules aren't even open ended: you choose a start time, end time, and on/off frequency and which days it will do that. It's like someone had a specific idea for the schedule and programmed it to do only that. \n\nThe other features are equally ham-fisted: \n1. Yes, it will monitor power usage, both total and at the moment, but it only updates the current number when you click on the device's name. That is, you have to hit back, then forward again to see the new usage, it does not autoupdate. This adds a delay as it reconnects to the device each time. Totally irritating. \n2. The total energy use is only shown as a percent of the total for that month. There is no option to show a graph over each day or week or arbitrary time interval (like the Health app does, for example). Also no option to compare multiple devices over time. In fact, the power usage shouldn't be under a menu, it should be front and center on top of the plug's title card. I need that more than I need to select a color for my plug's name. \n3. You can set up conditions, yes, provided the conditions are either \"turn off when reaching x temperature\" or \"turn off when reaching y power consumption.\" There is no support for if-this-then-that or anything remotely useful. The app even demands access to your location data, but there is no way to say \"turn on the switch when I come home.\" Too reminiscent of Henry Ford's \"you can get a model T in your favorite color as long as your favorite color is black.\"\n\nIt really feels like D-link said, \"I hear home automation is going to be a big thing; let's cash in on that,\" made a plug, and then hired a programmer to make a perfunctory app. It does the things I want, sort of, but it's uninspired and could be so much more. These guys need an industrial designer who understands home automation. Or, better yet, just open it up completely and allow people to use it how they want. I might possibly not return it to the store, but I'm certainly not jumping up to buy another one.\n\nUpdate: the plug/app does not seem to save the power management on/off setting. I turn it on, hit \"apply\" and then go back, click on the device again and it is turned to \"off\"","updated":"2015-06-10T01:29:46-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1184856153","userName":"Jfb9/'eifjeoenz","userUrl":"https://itunes.apple.com/us/reviews/id26137182","version":"2.1.0","score":1,"title":"Lousy... POS!","text":"Crashes when opening.","updated":"2015-04-18T20:16:28-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1160585560","userName":"Gladman113","userUrl":"https://itunes.apple.com/us/reviews/id425171044","version":"2.1.0","score":1,"title":"No Workie","text":"Using DCH-S150 motion sensor on iPhone 6P. It detects motion but won't notify by email or push. Of no value to me.","updated":"2015-02-28T11:58:23-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1218783689","userName":"Edtver","userUrl":"https://itunes.apple.com/us/reviews/id299788660","version":"2.2.0","score":1,"title":"Motion Sensor","text":"Crash. Does not work with iphone 6","updated":"2015-06-27T14:41:56-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1111470615","userName":"dmac-ct","userUrl":"https://itunes.apple.com/us/reviews/id31172409","version":"2.0.2","score":1,"title":"Not an improvement - entirely missing the potential for this market","text":"I got the link hardware (initially two power plugs) because I love the concept of a software controlled home and I want my home to be one.\n\nAt first I used the SmartPlug app and I wrote several reviews of how disappointing that app is - it barely matches the capability of the hardware power plugs - set a time and it goes on and off. I am looking for *software* features, such as adjusting on and off times by the length of the day, and randomizing the on and off times to look more natural. The SmartPlug app was a complete failure as far as I was concerned and I told Dlink so.\n\nThen they abandoned that app and said we users of the smart plugs had to switch to mydlink Home (this app) at the end of November. They promised more features, but again this is a completely disappointing experience. \n\nThe user interface is difficult to navigate, etc., etc., but the main failing in my opinion is the complete lack of advanced features. It would be so easy to have the app adjust on and off times by the season (i.e., by the apparent movement of the sun), or add a randomizing adjustment to the times so that behavior seems more natural. Why are times constrained to only the nearest half hour? I should be able to have the light turn on three minutes before the hour so it looks like I’m coming into the room to watch a TV show. I could detail another 10 features that would be (1) easy to do with software and (2) very desirable in the marketplace (they would drive sales). I’ve offered to do this, but nobody from DLink has taken me up on this.\n\nThis could be a great product. But at this point, I’m not going to invest in anymore DLink hardware because the software is so limiting.","updated":"2014-12-11T05:14:50-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"5134589775","userName":"ShiftLft","userUrl":"https://itunes.apple.com/us/reviews/id21323982","version":"3.0.8","score":1,"title":"Unable to log in as of 11/13/19","text":"As other reviews have noted, you are unable to log into the app. “Sorry. Please try again”. This obviously prevents the use of the app and product (DCH-S160). D-Link, please resolve ASAP!","updated":"2019-11-13T18:36:59-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"4548054043","userName":"AirRun-2001","userUrl":"https://itunes.apple.com/us/reviews/id43973992","version":"3.0.8","score":1,"title":"They stopped supporting their devices!","text":"Now that they created a new app they stopped supporting their existing products all together. I recently bought 2 motion detectors of theirs (DCH-S150) off Amazon. They worked well for a while suddenly neither of them sends alerts to my iPhone. My wife has a Android and it still works with her’s. Buyer beware!","updated":"2019-07-31T17:26:38-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"3534554564","userName":"TerryAAustin","userUrl":"https://itunes.apple.com/us/reviews/id37183415","version":"3.0.8","score":1,"title":"Just don’t","text":"I bought two flunk smart plugs\n\nThe app fails to find the device. In DLink forums the official advice is “find a friend with an Android phone and have them set up your plug.”\n\nSERIOUSLY‽","updated":"2018-12-15T11:24:03-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"2803922715","userName":"112124567","userUrl":"https://itunes.apple.com/us/reviews/id120270912","version":"3.0.8","score":1,"title":"it’s pretty bad","text":"it works to set up and install after many tries, but after you put in an on/off schedule, it says”sorry, try again later” and never accepts changes. there is no way to send feedback to the developer and this app was obviously not tested before the release. the android app is even worse. it’s pretty bad. no e mail of company is available to get help. reinstall does nothing.","updated":"2018-06-30T05:30:05-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"2734299938","userName":"CheatedOutOfMyMoney","userUrl":"https://itunes.apple.com/us/reviews/id42544014","version":"3.0.8","score":1,"title":"Complete steaming pile of poop","text":"Just takes you to the horrible D-Link Lite app. So this app is 100% worthless pointless redundant steaming pile of poop.","updated":"2018-06-20T15:44:53-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"2430389685","userName":"U. Know","userUrl":"https://itunes.apple.com/us/reviews/id221352083","version":"3.0.8","score":1,"title":"Sensor works, app not so much","text":"We just had a heavy rain 4/16/18 and the sensory sounded but it was so low we couldn’t hear it. Yet I have the app that buzzed once. Why would the app not keep alerting me? Then when I check the app, there is no recited of the detection but my basement is still in 6 inches of water.","updated":"2018-04-16T11:28:02-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1284645608","userName":"Quepues","userUrl":"https://itunes.apple.com/us/reviews/id106858633","version":"3.0.3","score":1,"title":"Outrageous killer update for IOS 9.1","text":"Just upgraded to the latest version on Nov 8 2015 and now I cannot use it on my iPhone 6 +. When  I try to log in it keeps giving me an error \"Sorry, try again\". I uninstalled it completely thinking that would fix the problem but now when I search for the app its not even available for download. If I google it I find it I click to download and I get an apple store message that the application is not available in the us store.","updated":"2015-11-10T04:16:26-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1362215786","userName":"_will_88","userUrl":"https://itunes.apple.com/us/reviews/id203589534","version":"3.0.4","score":5,"title":"Works for me as well","text":"Just got my device and set everything up in a few minutes. Qr code scan.. device and router found each other... I just setup a schedule and I was all set.  The only unfortunate thing about the app is that dlink did not (or at least I don't know how) to have the dlink lite devices added here as well.","updated":"2016-04-11T20:27:39-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1177899552","userName":"REBaker","userUrl":"https://itunes.apple.com/us/reviews/id39419345","version":"2.1.0","score":1,"title":"Darn! Darn! Darn! Bug Ridden and poor UI","text":"I am bummed. I hoped that a company like D-Link could design a reasonably great App for the iPhone. But, apparently not. There seems to be no rhyme nor reason to all the apps that are out here. And this one is just a poor example of UI ease of use, solid bug free code and robust functionality. I will continue to use the app as there is no alternative. Hoping for an upgrade. D-Link just took an integrity hit from my perspective. The quality of this app makes me question the quality of their other products too. So sad!","updated":"2015-04-04T12:50:20-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1171961249","userName":"prabath delpechitre","userUrl":"https://itunes.apple.com/us/reviews/id315149826","version":"2.1.0","score":1,"title":"Network error.Please try again.","text":"DSP-W215 Smart plug is a very poor product. I have been trying to get my device connected for few weeks with no luck. Customer care is well aware of the issue but no resolution.","updated":"2015-03-22T15:32:28-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1122949575","userName":"Good App1211","userUrl":"https://itunes.apple.com/us/reviews/id28078026","version":"2.0.2","score":1,"title":"BEWARE: does not work on iOS8","text":"Download the old SmartPlug App as WSP setup doesn't work and manual entering of the pin code has a bug using iOS8.","updated":"2015-01-01T12:26:57-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"},{"id":"1120759600","userName":"ctudoc","userUrl":"https://itunes.apple.com/us/reviews/id136436296","version":"2.0.2","score":1,"title":"Awful not working","text":"I have bought Wi-Fi smart plug and motion sensor. Two smart plugs are not accepting PIN code so I am not able to install them in recommended app - mydlimk home. After long wait for support I was interrogated who I am and if I register ( not working ) plugs. After long discussion we got to trying to fix problem. The recommendation was to download app - smartplug - which connected to the smart plugs but cannot work with motion sensor and do not control devices if I am out of my home wi-fi. So I would like to know where I can get the refund for it - 120$.\nDo not trust Dlink","updated":"2014-12-28T11:34:15-07:00","url":"https://itunes.apple.com/us/review?id=888259383&type=Purple%20Software"}]