[{"id":"8073906854","userName":"M_J_S","userUrl":"https://itunes.apple.com/us/reviews/id28004446","version":"3.5.5","score":2,"title":"Incorrectly reports status","text":"App constantly says ‘Foobot not connected to internet’ when in fact it could be anything - e.g. phone isn’t connected, poor connection, just taking a while. Overly simplistic implementation as EVERY time my device at homes connection is, in fact, just fine. Surprising given cost of the device.","updated":"2021-11-28T12:21:55-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"3862653200","userName":"Particle_person","userUrl":"https://itunes.apple.com/us/reviews/id42751233","version":"3.5.1","score":3,"title":"Good idea, poor implementation","text":"The app layout is well-designed and the user interface makes sense. Unfortunately, this app is extremely buggy, almost to the point of being unusable. The main screen frequently shows incorrect info (like, you will see the wrong units on a number) or info that lags behind what is shown on the graph for the latest measurements. When you switch screens to the graphs, it defaults to the hour view. It would be nice if it went to the minutes view because that is usually what I want to check. Also it does not update automatically as new data comes in. You have to go back to the main screen to force an update and then switch back to the graph to see new data.","updated":"2019-03-09T13:09:44-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"3038166428","userName":"EagleDTW","userUrl":"https://itunes.apple.com/us/reviews/id294209776","version":"3.2","score":5,"title":"Great smart home integration!","text":"We live in a zero-lot line home - meaning our master bedroom has no windows as that wall is the neighbors property boundary and use the foobot in combination with IFTTT app linked to Nest thermostat which circulated the fan to refresh the air quality. Also have the temperature readings trigger the Nest to raise the temperature and turn on the furnace for overnight babies comfort.  Yes the app does not refresh automatically and yes the CO2 is calculated and not true readings. Overall we are excited by the features and great functionality!","updated":"2018-08-08T19:39:52-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"5114971286","userName":"AppFzx","userUrl":"https://itunes.apple.com/us/reviews/id13783937","version":"3.5.4","score":1,"title":"DON’T BUY A FOOBOT YET","text":"Bad UI all the way down to something as no brainer as using a slider that goes from midnight to midnight for setting time that the LEDs are on. What if someone works night shift? What if someone wants them to come on exactly at 8:00? Can’t set either of those because .. slider. Review basic UI design principles or test on some folks (not us) who can give feedback *before* you release.\n\nNOT to imply that that is representative of all the issues, it isn’t, but simply that they can’t even get the simplest thing right. Read other reviews for the major bugs like wrong data, etc.","updated":"2019-11-09T18:11:02-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"4611794726","userName":"Thomasfx10","userUrl":"https://itunes.apple.com/us/reviews/id190333317","version":"3.5.1","score":1,"title":"Poor quality and even poorer customer service","text":"My Foobot lasted a few weeks before it would not connect to my phone anymore. I contacted customer service and after many emails they sent me a replacement foobot that did not work. I then sent that back with money out of my own pocket and they kept on saying They would send another one out and after 10 plus emails later They said they would refund my money which they never did.  I think this company is run by a bunch of high school students out of a garage. Look elsewhere for better customer service and better quality.","updated":"2019-08-13T10:08:11-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"3682551908","userName":"rlrdlr","userUrl":"https://itunes.apple.com/us/reviews/id37472636","version":"3.5","score":5,"title":"What I’ve been looking for.","text":"For years I’ve wanted to monitor my indoor air.  Now I’ve got the tool to do it. The Foobot has already had a significant impact on how we manage ventilation.  To quantify what was before a guess is exactly what we wanted to do.  Top quality device.","updated":"2019-01-22T11:48:33-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"5067905958","userName":"cellomania","userUrl":"https://itunes.apple.com/us/reviews/id37217482","version":"3.5.4","score":2,"title":"Color scheme on app changed","text":"Can you please bring back the old color scheme from a year ago? Now it is monochromatic. It’s more difficult to use now.","updated":"2019-11-01T23:17:14-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"4579767687","userName":"T9876","userUrl":"https://itunes.apple.com/us/reviews/id85962141","version":"3.5.1","score":1,"title":"Horrible app... just like their support.","text":"These guys are completely incompetent and make a terrible product. Read the other reviews! Mine was dead on arrival. After sending in the confirmed DOA unit, two months of constantly begging for a replacement, and finally offering to go to court because they basically stole my ~$200, I got a refund.  Zach Kenny, their \"support\" rep should be fired. I think he spends most of this day licking the window and eating chocolate soft serve out of the toilet.  DONT BUY!","updated":"2019-08-06T21:04:49-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"3756346876","userName":"rkrupka","userUrl":"https://itunes.apple.com/us/reviews/id126270653","version":"3.5","score":4,"title":"Good summary","text":"Gives a good summary of my air. Since I have two units it would be helpful if the name assigned to the unit would appear on the main page. As it is now I must go into settings to discover which unit’s measurements I’m looking at.","updated":"2019-02-10T19:39:27-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"3786496539","userName":"drew2656","userUrl":"https://itunes.apple.com/us/reviews/id158713047","version":"3.5","score":5,"title":"It really works!!","text":"Definitely helpful to know the quality of the air your breathing.","updated":"2019-02-18T14:24:10-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"2403422876","userName":"Fuzzy blender","userUrl":"https://itunes.apple.com/us/reviews/id124571343","version":"3.1.2","score":1,"title":"I agree. Buggy","text":"I have to agree with pretty much everything that was written. This app, while looking great, is very buggy.  The biggest annoyance is that I have to kill the app to get it to refresh (instead of the standard pull to refresh that every other app has).\n\nThat said, the hardware device works great.","updated":"2018-04-09T14:24:39-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"3655012958","userName":"Retrostyle","userUrl":"https://itunes.apple.com/us/reviews/id38712450","version":"3.5","score":5,"title":"Great company. Great Product","text":"I have 3 Foobots so far and love them.  Super accurate and more importantly the people behind it are fantastic. Love them!","updated":"2019-01-15T19:01:04-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"1316114816","userName":"Imrodimus","userUrl":"https://itunes.apple.com/us/reviews/id173613250","version":"1.0.16","score":2,"title":"App crashes all the time","text":"Just got this thing and when I hit the home icon the app crashes... Also, I had to go through the initial setup entirely in French! Seriously!?!?!? Fortunately I understand enough to go to settings and change it to English.  The app still crashes in English too in case anyone was wondering.  The item does mention that it will not give you an air quality reading until six (6) days have gone by! I need this to do what I paid it for and to do it now, not next week. What difference does it make, the app will crash next week too.  What a waste of $200 hard earned bucks... smh","updated":"2016-01-13T19:23:31-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"4454406414","userName":"feroosy","userUrl":"https://itunes.apple.com/us/reviews/id428860574","version":"3.5.1","score":1,"title":"Inaccurate sensor","text":"I have been using this device for four years. In my experience, there are some good and bad things. \nPros: 1- VOC sensor very helpful.\n2- the light representative of the AQI simple to Observe even in the distance.\nCons:1- pm2.5 sensor not accurate at all( not even near the correct value).\n2- temperature and humidity sensors reported a precise result when you switch it on, but after a while, the results start to shift from the correct value.\n3- the app needs to be improved, especially the history page.","updated":"2019-07-13T08:36:26-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"6416304116","userName":"Iz Waf","userUrl":"https://itunes.apple.com/us/reviews/id384649708","version":"3.5.5","score":1,"title":"Terrible design and worse customer service","text":"The app is buggy, slow to update, and customer service is terrible.","updated":"2020-09-10T17:29:16-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"5955727755","userName":"JamonYQueso","userUrl":"https://itunes.apple.com/us/reviews/id41329883","version":"3.5.5","score":3,"title":"LED Timer stopped working","text":"I was happy with the Foobot and app, but the LED timer setting stopped working recently in the app.","updated":"2020-05-16T21:07:54-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"1918456945","userName":"DJ HJ","userUrl":"https://itunes.apple.com/us/reviews/id47697570","version":"3.0.5","score":1,"title":"Extremely buggy app","text":"Since the big update\n- Logs off randomly\n- shows stale data instead of the latest\n- doesn’t show precise data (eg shows 70.0 instead of 69.7)\n- timeline view’s time scale often wrong by 12+ hours\n- often requires killing app to show accurate data","updated":"2017-11-13T09:29:43-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"6611062375","userName":"spongebobnopants","userUrl":"https://itunes.apple.com/us/reviews/id32190484","version":"3.5.5","score":1,"title":"Can’t login iPhone 12 appears Developement has stooped","text":"Can’t login iPhone 12","updated":"2020-11-05T03:23:32-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"2018607388","userName":"Sole614","userUrl":"https://itunes.apple.com/us/reviews/id284934055","version":"3.0.5","score":1,"title":"Disappointing","text":"For the sake of the improvement of this product, I'm just going to give some straightforward criticism here: this is a very disappointing app. I spent good money on the Foobot device that goes with this app. However, the value of the $200 device is completely tied up in the quality of this free app, which just happens to be atrocious. At some point I'll have to make a video detailing the issues, but for now here are a few things: The app often has to be killed in order to accurately update and provide live results. While the user interface is quite attractive at first glance, it is extremely non-intuitive and difficult to use, not to mention it is outright glitchy. It gave me an alert asking me to tell it what room the device was in. I swiped the alert, but no option came up in the app itself to insert this data. \nAt the bottom of each reading, there are tips. If the tip is more than a sentence or two, it is followed by \"...\" If you try to click the ellipsis to read the rest of the tip, you are instead taken back to the home screen. If you try again to read the remainder of the tip by clicking the arrow underneath it, that doesn't work either and instead you're taken to a poorly designed graph of logged data. If you click the top bar of the logged data in order to return to the previous screen, you are instead presented with a bewildering list of options for the chart, which you never intended to look at in the first place. If you want to get back to reading your incomplete tip, you need to click the tiny home button, reselect the category you were looking at, and then swipe to the tip. However, you will NEVER be able to read the remainder of the tip (as far as I can tell). Apparently they want to keep it a mystery. Oh, and this applies to about a third of all the tips given in the app.","updated":"2017-12-22T14:09:27-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"1519394764","userName":"Just336674","userUrl":"https://itunes.apple.com/us/reviews/id12530151","version":"2.2.0","score":1,"title":"Great app that keeps improving with minimal bugs","text":"Update: I'm going to have to rate the app 1 star again. The latest version crashes on starting it. Tried deleting app, restoring phone. The app is now broken. :(\n\nUpdate: the latest version is great and generally have not encountered many bugs and generally have not had to restart the app. The new app with the new firmware update seems to have resolved problems that many reviewers had. I've changed my rating to 5 stars. I'm glad to see the Foobot team so active in providing timely updates.\n\nI suggest disregarding reviews prior to July 13 as they are mostly irrelevant now.\n\n--------\n\nThe Foobot is getting better with every update. At first, this update caused wifi connectivity issues before the Foobot's firmware was updated a couple days ago. Now WiFi issues and app stability seems better than ever.\n\nA couple minor things. I am not impressed with Breezometer for outdoor air. I would use Plume Labs API for outdoor air quality and graphs of outdoor air. If it's not available for a specific area, then use Breezometer.\n\nThe 5 minute live graphs look nice but aren't intuitive. It took me a while to figure out how it was graphing 5 minutes. Basically, the graph shrinks with time.\n\nPollution events may not be working as well this update. The air in the house got over 100 ug/ml and Foobot didn't ask me to tag the event. I tag the events without notifications, but it would help if they work.","updated":"2017-01-10T14:01:43-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"1223348142","userName":"SuperSlickdealer","userUrl":"https://itunes.apple.com/us/reviews/id185642691","version":"1.0.8","score":1,"title":"Beautiful device but bad app and questionable support","text":"The device is very nicely designed and it's very easy to set it up. That's where the great things stop. The app doesn't seem to be tracking air quality often and updating charts. Mine shows readings from 3 days ago as the most recent ones. Also, the device has been stuck in learning mode (it says 1 out 3 hrs) for about 2 weeks. Finally, good luck finding a link, email or phone number for tech support...it seems like the company doesn't want to provide support. I emailed them through the only form available on their website, which didn't list tech support as an option! Let's see how long they take to respond, if at all. If you buy use a credit card so you can return it or stop the payment because this has a potential to be an expensive paper weight very fast w/o tech support.","updated":"2015-07-06T21:05:13-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"1673340392","userName":"asus389","userUrl":"https://itunes.apple.com/us/reviews/id25622603","version":"2.9.0","score":2,"title":"App won't connect when not home","text":"The app won't connect when not on my home wifi. I think it is very sensitive to latency. Not sure why, it's just pulling data from a sensor. I don't care if my data is a couple seconds behind if I'm checking the temp in my apartment when out of town. Support hasn't been able to resolve this. Earlier versions of the app didn't seem to have this issue.\n\nEdit: it sometimes won't even connect when I'm in my home network. It complains about latency in an error message. I am  Yeah on a fiber connection with a 3ms ping.","updated":"2017-07-07T18:14:12-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"1505274623","userName":"SPSponger2","userUrl":"https://itunes.apple.com/us/reviews/id30780705","version":"1.29.0","score":2,"title":"Buggy software","text":"Love the product but the iOS sw is buggy. When I try to help \"recognize similar events\" to help the device learn and then click on one of the values (I got it!) it just doesn't respond. \n\nI can't trust the app as I don't understand the responses. Please fix this.","updated":"2016-12-19T23:07:46-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"1203939631","userName":"DH tri","userUrl":"https://itunes.apple.com/us/reviews/id160488125","version":"1.0.6","score":1,"title":"Frequent freezes, inaccurate","text":"This app freezes up frequently with \"please wait\" and sometimes crashes. It doesn't update well and the information can't be accurate. It measures parts per billion and parts per million but it almost always shows round numbers that are the same hour after hour. How can that be?  The app and the Foobot device are pretty, but I think the emphasis has been on form over function.","updated":"2015-05-28T13:15:44-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"1330099271","userName":"DaddyDre07","userUrl":"https://itunes.apple.com/us/reviews/id197412321","version":"1.0.16","score":1,"title":"App crashes all of the time","text":"I really wanted this unit to work, but no such luck.  The unit itself will not sync with my iPhone, no matter how many times I try.  As for the app, it looks very interesting, but you can't see much because whenever you try & navigate it, it crashes. \nWould have been very useful, but instead it's a really expensive bookend right now.","updated":"2016-02-08T18:43:53-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"1225898501","userName":"J. Sheffield","userUrl":"https://itunes.apple.com/us/reviews/id20880269","version":"1.0.8","score":5,"title":"Useful Data and Trends","text":"I am a bit of a data nerd (e.g. Quantified Self), and this has so far been one of the more useful and actionable products I have bought.","updated":"2015-07-11T20:58:51-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"1516987800","userName":"JimExCFP","userUrl":"https://itunes.apple.com/us/reviews/id154530472","version":"2.1.0","score":2,"title":"Settings page not functional","text":"This current software release dated 21 Dec 16 is messed up. Configuration page where you do your settings cannot be accessed. Historical graphs are also no longer visible. Tech support said they'll be fixed soon. Thus far, nothing yet.","updated":"2017-01-07T00:09:09-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"1627823571","userName":"Uptosix","userUrl":"https://itunes.apple.com/us/reviews/id36542046","version":"2.9.0","score":2,"title":"Login?? Huh?","text":"Why in the world you wouldn't let people just use the app without giving you information? Isn't it enough that they have paid you for the device already?","updated":"2017-05-29T08:09:03-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"1428009256","userName":"alexdw5","userUrl":"https://itunes.apple.com/us/reviews/id200337460","version":"1.27.0","score":1,"title":"This App and The Product Are Garbage","text":"Where to begin?\n\nI'd only buy this product if you enjoy sitting for an hour-plus trying to get this pos app to connect to this pos product.\n\nI've spent so much time troubleshooting getting the foobot to work that I probably could've gotten my own product to market by now.\n\nI've owned this thing over a year and gotten it to work but connecting it to wifi is a nightmare. I should fight for a refund but this product is so crappy that I doubt their customer service is anything to write home about.\n\nPlease die in a fire, foobot.\n\nSincerely, Alex","updated":"2016-08-06T07:29:11-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"1551482096","userName":"Vass iTunes","userUrl":"https://itunes.apple.com/us/reviews/id15540336","version":"2.8.0","score":1,"title":"Wi-Fi Connection is Bad","text":"After well over a year of use, still Foobot has the worst Wi-Fi connection of any of my devices I use in my house. It's a hit-and-miss reading the device via Wi-Fi...I get the annoying message of lost connection...You might have to fire entire tech team and hire more capable people...","updated":"2017-02-24T03:51:48-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"1365366660","userName":"Adobespain","userUrl":"https://itunes.apple.com/us/reviews/id155010190","version":"1.0.20","score":5,"title":"Great device and app","text":"Everything is fine","updated":"2016-04-18T10:32:11-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"1513444190","userName":"Jellyfin","userUrl":"https://itunes.apple.com/us/reviews/id40525251","version":"2.1.0","score":1,"title":"Crashes every time","text":"This app crashes as soon as I try to log in.  The previous version failed to set up the foobot.  Product is garbage.","updated":"2017-01-01T12:05:36-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"1793611576","userName":"screamktq","userUrl":"https://itunes.apple.com/us/reviews/id33615990","version":"3.0.1","score":5,"title":"Works Great","text":"New user but so far the Sensor and Application are working great. Design is very clean and easy to use.","updated":"2017-09-16T17:55:37-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"1277690638","userName":"epacopaca","userUrl":"https://itunes.apple.com/us/reviews/id168370353","version":"1.0.12","score":1,"title":"Cannot log in","text":"App quit unexpectedly, when I try to log in again it freezes. I erased it and redownloaded it but it still won't work","updated":"2015-10-26T20:41:14-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"1508566319","userName":"Kibsaim Me","userUrl":"https://itunes.apple.com/us/reviews/id389502641","version":"2.1.0","score":1,"title":"Can't use my foobot","text":"Recently I bought my foobot and I cant use it because the app keeps crashing, I can't even configure my foobot for the first time","updated":"2016-12-24T23:33:41-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"1289947389","userName":"Polynya","userUrl":"https://itunes.apple.com/us/reviews/id42072732","version":"1.0.13","score":1,"title":"App crashes during setup on iPhone6","text":"This app is completely broken,  and crashes during setup on an iPhone6 and iPhone5.  Please fix it ASAP.","updated":"2015-11-21T21:10:36-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"1327599442","userName":"Foouser","userUrl":"https://itunes.apple.com/us/reviews/id258578822","version":"1.0.16","score":1,"title":"Useless app","text":"Hangs/crashes all the time horrible experience. Save your money and look elsewhere.","updated":"2016-02-04T02:53:45-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"1641121698","userName":"tehdaev","userUrl":"https://itunes.apple.com/us/reviews/id34604770","version":"2.9.0","score":1,"title":"Blueair fail","text":"It says I already have a blueair account and need to use that app. That app doesn't work. Absolute fail.","updated":"2017-06-11T10:35:50-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"4317917376","userName":"Mrs. Esterhouse","userUrl":"https://itunes.apple.com/us/reviews/id103751261","version":"3.5.1","score":1,"title":"Totally different from android","text":"The android app lets me drill down by the minute by category. The iPhone app lets me view trends. I don’t understand why the functionality is so different.","updated":"2019-06-14T22:52:51-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"},{"id":"1284577945","userName":"lionlight","userUrl":"https://itunes.apple.com/us/reviews/id41636234","version":"1.0.13","score":5,"title":"App completely broken -- unable to even setup due to lack of \"Next\" button","text":"Essential 5 star device, beautiful app.\n\nAs air quality gets worse and wore (and ever more polluted air goes east from deadly pollution central -- China -- towards the west coast of the US and even further toward the midwest), you and your family will literally die -- or at least live much less of a life -- without devices such as the FooBot. \n\nFooBot is so sensitive, it'll even tell you when toxic chemical VOCs (volatile organic compounds) from your very own cleaning products are in the air. Awesome!! \n\nOf course, it also does particles, too, including the ever harmful pm2.5. Google all this and you'll see how the foobot is really a dream come true. It really is the first device to really tell you what you actually need to know in a reasonably priced package.\n\nEnvironmental medicine has become one of the most important kinds. See Dr. Crinnion and others online to learn just how important this to to genetic and epigenetic expression. I think Dr. Crinnion even has youtube videos now, so please check them out for your own good. He does some wonderful studies, but can talk to a lay audience in an entertaining and clear way we easily understand.\n\nIf you want to live a happy life and avoid things like cancer, you will absolutely NEED healthier air. Period. It's just NOT an option.\n\nPair this with a great air filter or two such as the IQAir or AirPura, and you are at least 10-50x better off than you were before. Seriously.\n\nThat said, I hope they convert this app to also work with the ipad. Most members of the family have the ipad. I'm the only one with the iphone. I'm sick of them bothering for my phone when the foobot turns orange. This is the only real reason I've docked it a star. Thank you :)","updated":"2015-11-10T00:25:43-07:00","url":"https://itunes.apple.com/us/review?id=909284570&type=Purple%20Software"}]