[{"id":"5723483751","userName":"armango211","userUrl":"https://itunes.apple.com/us/reviews/id582901877","version":"2.0.1","score":4,"title":"Up date","text":"Last up date the light no working in the tv simulation \nThe time I set is from 6pm to11pm all days the problem is\nThe light turn on 12pm some times o diferent times all days","updated":"2020-03-27T17:16:15-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"7423744359","userName":"Seabeeski","userUrl":"https://itunes.apple.com/us/reviews/id117696782","version":"2.1.0","score":1,"title":"Used to be awesome. Not sure who is responsible for this mess","text":"This app and the Lightify system in general used to be amazing. I’m not sure who you put in charge of the latest update or why they are angry with end users but please let me know who to send a fruit basket to. I would love to “mend fences”. I don’t know if I killed their dog or what but jeez!! Since the latest “mandatory” update that angry person just broke things. Sometimes it will respond to my “commands” on my iPhone 12. Almost the time it won’t. And when it does it takes a minute or more to respond. Even when using google assistant it Alexa. (Yes I have both..... I’m indecisive. Sorry. At least I don’t lash out at strangers like whoever put this update together). Please fix this. I love my Lightify bulbs. Most my house is in Lightify. I realize you are moving on to other things that will make your leadership richer but can’t you take into account the hundreds of dollars I have spent on your products trusting that you would continue to support your customers??? I’m sure I made at least one payment on your new car. Come on!! Buddy!!! Let’s stay friends.  Hook us up with a working update. I’ll even light a WiFi lightbulb in your name!! At least I’ll try. Can’t promise it will work. That’s up to you.","updated":"2021-06-03T18:58:11-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5127505850","userName":"Turbocouch","userUrl":"https://itunes.apple.com/us/reviews/id30498473","version":"2.0.0","score":1,"title":"Latest update has stopped my motion sensor from working","text":"Everything was running well with all my devices before the update. Now my motion sensor will no longer turn on lights when motion is detected. Then this app said I needed to update the firmware on my multicolor bulb, and now it doesn’t work. Thanks for making my Lightify system absolutely worthless. I guess now I’ll have to spend hours trying to figure out what is wrong, or reset everything and lose all the programming I had before the updates. This is ridiculous. I just purchased another hub and bulbs for another location that I do not have constant access to. It costs me $100 to go there every round trip. This is not giving me warm and fuzzy feelings about relying on this product to help make my second house look like it is lived in while I’m not there.","updated":"2019-11-12T05:33:21-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5832621958","userName":"germanwind","userUrl":"https://itunes.apple.com/us/reviews/id26426495","version":"2.0.1","score":3,"title":"Some good features for the price","text":"But I had issues on the way.  At one point my hub did not update to the latest version of software, which meant back and forth with customer service in Germany.  Another time zone made this a lengthy process.  Also the usability was not up to par in the beginning.  Latest version is better but still not as intuitive as I hoped.  Every time I want to change something it feels as if I have to discover it all over again.  What I liked is the price and the features it offers.  If you buy now you are good, all the nasty teething problems of the app are vastly improved now.  Overall I would recommend it and buy again.","updated":"2020-04-18T21:12:22-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6471440662","userName":"Double-LLLL","userUrl":"https://itunes.apple.com/us/reviews/id186161827","version":"2.0.2","score":3,"title":"Needs work","text":"This app is fine for your phone but it is not usable on an iPad.  It is one of the compatible that means it is a small iPhone on your big iPad and will not roll the screen to landscape like other apps.\nWhen using this on the phone you have to manage each light individually and not as a group.  The themes do not work.  I set all my lights for watching a movie and saved a theme.  When I click that theme it does nothing.  Rather annoying.  Maybe they should focus on the basics and not try to have so many non used feature.\nUnfortunately it it the only app I have found to manage their light and Alexa has lost contact with them now so I am stuck with it.","updated":"2020-09-26T10:57:11-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5133830034","userName":"245)935","userUrl":"https://itunes.apple.com/us/reviews/id101093308","version":"2.0.0","score":1,"title":"Worst System Ever","text":"I have had this system/app for a few years now and it is a source of constant aggravation. The only reason I have stayed with it is because of the investment in the light bulbs. The gateway (third) randomly goes offline and has to be power cycled at least once a week. If this happens when I am out of town, I have no control over the lights. Now with a new version of the app and “mandatory” update the system is unusable.  I cannot get the gateway to come online let alone update it. I have no control over any light in my house, schedules, brightness, etc. There is no customer service to speak of. The CSA (“Niko”)has disappeared after telling me the gateway is offline. System can not be reset. What a joke.","updated":"2019-11-13T14:26:15-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5724506697","userName":"Jr1919030","userUrl":"https://itunes.apple.com/us/reviews/id383319167","version":"2.0.1","score":2,"title":"Not worth the money","text":"We have garden lights connected. They would be amazing if they could do half of their capabilities and if the app was useful at all. They don’t respond to what is programmed in the app. The updates did nothing to fix the issues. Both need unplugged often to even be recognized. “Programmable” lights should actually be programmable. Should be able to set up our own color schemes and can’t. It has a timer set to come on in a pre set and doesn’t. Has a timer to turn off too and it doesn’t. 2 years later and this does not do what it claims. Don’t waste your money on these products.","updated":"2020-03-27T22:34:10-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6757652323","userName":"BeccaBokeh","userUrl":"https://itunes.apple.com/us/reviews/id276653772","version":"2.0.3","score":1,"title":"Hate the MANDATORY updates!","text":"You get 1 star ⭐️ from me right now because you’ve instituted these mandatory updates which means I can’t change my lights or do anything basically until it updates. I live rurally and have slow speed Internet. I set my lights a few days ago for Christmas and needed to change something and today I can’t do anything until this update goes through. 1st attemp failed BECAUSE I closed the app to use my phone. Apparently it doesn’t update in the background NOR if your screen protection clicks on. So I have to go settings to change it to NEVER and keep your app OPEN and my phone on a charger. What a PAININTHEASS! Seriously! 😡","updated":"2020-12-15T17:03:28-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5280434041","userName":"crazyivanov","userUrl":"https://itunes.apple.com/us/reviews/id40228427","version":"2.0.0","score":5,"title":"Even more confusing than the previous version","text":"The version wasn’t very intuitive, but the newest version is heavy. Trying to navigate to the options of first gen bulbs is a maze. Took a week of messing with the app to finally get the bulbs working again. I haven’t a clue how I succeeded, and I have a degree education in digital technologies. \nNow, one bulb is ignoring programming. Comes on but stays on. \nCertainly, a dropped ball on the revise.","updated":"2019-12-16T09:54:29-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6979896747","userName":"Chrisw1125","userUrl":"https://itunes.apple.com/us/reviews/id193825968","version":"2.0.3","score":1,"title":"Connection issues!!","text":"Whatever changes you did made the existing connection issues 100x worse. If I change the color on any of light, it goes to offline status and has to be manually power cycled to reconnect. Sometimes it won’t reconnect at all and has to be repaired. Scheduler is unreliable - half the time the lights either don’t come on or they just stay on. I’ve been resetting my system for years to avail. You would be better off buying a $3 lightbulb and save yourself the hours of frustration with this system. I wish I had.","updated":"2021-02-10T20:04:38-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5240829769","userName":"den-h","userUrl":"https://itunes.apple.com/us/reviews/id109181062","version":"2.0.0","score":3,"title":"New app needs some work!","text":"Sorry Dev team, but the new app is not an improvement over the older version. I truly love your products and ordered two more lights today. But the new app is much harder than the old one when it comes to setup and after installing the new\nApp it took me several hours to get my schedule back up and running. I had to reset all the lights and start from scratch and that wasn’t a good user experience.","updated":"2019-12-06T08:53:44-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"7738844479","userName":"Lumbergh","userUrl":"https://itunes.apple.com/us/reviews/id40340806","version":"4.0.4","score":5,"title":"Nearer, my god, to thee","text":"I really admire the developers of this app.  With less than a week left before Osram pulls the plug on the cloud server, the app developers put out a really full featured update with a lot of useful stuff.  Zigbee diagnostics, manual firmware updates, soft reboot capability, local mode — all great stuff.  They are cranking out a quality app right up to the very end, and should be commended.","updated":"2021-08-26T19:22:26-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6961381632","userName":"thgfdgcb","userUrl":"https://itunes.apple.com/us/reviews/id634563073","version":"2.0.3","score":1,"title":"Crap connection","text":"Frequently loosing connection. Cant reconfigure because it says I’m not connected to WiFi even though I obviously am. Un-plug, re-plug over and over.  Still says not connected. Days later when it decides I have WiFi again it works nicely. However they stopped making the color changing light bulbs and they barely last 2 years. So with no replacements and a crap system that keeps failing, turns out I wasted a whole lot of money on this.  Oh, right now I can’t connect because it says I have no WiFi yet I’m posting this review.","updated":"2021-02-06T06:36:05-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6337384246","userName":"MrProdigal","userUrl":"https://itunes.apple.com/us/reviews/id373011601","version":"2.0.2","score":1,"title":"Who knew lightbulbs could be such a problem?","text":"Every time there is a software update, I have to spend a half hour getting this product to work with Alexa again.  I’ve had these lights for 3+ years and I absolutely hate them.  If you are a programmer, you might enjoy the complexity and esoteric nature of the bulbs.  If you just want to tell your lights to turn off an on with little effort, these are the very last thing you want to buy.","updated":"2020-08-19T05:32:26-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"7329607740","userName":"lightifysucks","userUrl":"https://itunes.apple.com/us/reviews/id1252355319","version":"2.0.3","score":1,"title":"Terrible. Don't bother.","text":"Lights only worked for a couple months when I purchased them, a few years ago at Lowes. Now one light doesn't work at all. The others barely connect. The APP is insanely slow at pairing with anything. They constantly reset to yellow when I flip the switch, even though there is supposedly a setting to make sure that doesn't happen. Just horrible horrible lights. Don't waste your money or time.","updated":"2021-05-12T06:36:32-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6694881316","userName":"CALOSTAR","userUrl":"https://itunes.apple.com/us/reviews/id28175430","version":"2.0.2","score":1,"title":"Scheduler Does Not Save","text":"Out of all of my smart bulbs, I have the most problems with Osram.  Alexa and Google lose contact with them frequently and they tell you they have contacted you about the problem. The device scheduler will let you create schedules but they don’t work or save anywhere.  None of the timers work!  What is going on here Osram.  U use to work. I actually bought Phillips Hue bulbs cause I cannot rely on the Lightify app!!!!  Is there a fix on the way?","updated":"2020-11-28T03:49:08-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5319653669","userName":"ragnarsantos","userUrl":"https://itunes.apple.com/us/reviews/id111440983","version":"2.0.0","score":1,"title":"Horrible system","text":"I’ve had this system for few years but it has never worked as it should.  Now I also have Philips Hue which works so much better.  Even after the newest upgrade it’s still not working.  The app is some better but the two lights I still have are always loosing connection and the scheduler only works sometimes. Bottom line I’m not going to use this anymore. :(","updated":"2019-12-25T16:22:16-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6993620322","userName":"nsnshhdhdbd","userUrl":"https://itunes.apple.com/us/reviews/id1129793139","version":"2.0.3","score":2,"title":"Terrible product","text":"Terrible product, the lights communicate through the app so slow and often lose the configuration of all lights then I have to read couldn’t figure all again. I’ve probably spent more time trying to make things work than buying something else that is better than Osram’ product","updated":"2021-02-14T07:10:19-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6657215683","userName":"T Matahead","userUrl":"https://itunes.apple.com/us/reviews/id168791641","version":"2.0.2","score":1,"title":"Wish it worked... :-(","text":"After updating to iOS 14, schedules were lost. I’ve added them everyday since but, they don’t save. Pop-up message says it saved. But nothing shows. \nUsed to be nice to have lights on when we got home. Now we come home to a dark house. There are no longer any lights or parts available for Lightify. Guess it’s time to replace the entire system. Merry Christmas 2020!","updated":"2020-11-17T16:41:26-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5203501900","userName":"ChasOp","userUrl":"https://itunes.apple.com/us/reviews/id161929613","version":"2.0.0","score":5,"title":"Osram Remote LED Bulbs","text":"I love how I can program, operate and monitor these bulbs directly from my phone (via a small, simple Gateway) and not from a “Smart Hub”.  I hope this product is continued and more such devices are offered.","updated":"2019-11-27T05:12:38-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5558818898","userName":"Angus bird","userUrl":"https://itunes.apple.com/us/reviews/id157191263","version":"2.0.1","score":2,"title":"Can be a pain","text":"The app itself is fine, but the experience has to do with the while lightify system and it can be annoying at times. It is not stable and the light bulbs are very easily disconnected with no reason, prompt one to delete them and reconnect them to the system. It happens all the time and truly a PITB.","updated":"2020-02-20T18:20:12-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5099726178","userName":"JUSTCOCONUTS","userUrl":"https://itunes.apple.com/us/reviews/id541482823","version":"2.0.0","score":3,"title":"I finally got my lightning to work! WOO HOO!","text":"After spending $$$ on 6 BR-30 floods for my living room ceiling years ago, I finally got them to work !!! Thank you for sending the email notification of the app update. \n\nI’ll increase my rating if they continue to work correctly.","updated":"2019-11-07T09:27:13-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"7854843341","userName":"MAlan ","userUrl":"https://itunes.apple.com/us/reviews/id30389559","version":"4.1.0","score":5,"title":"iCloud","text":"Any chance of another company picking up Lightify \nand putting it back on the cloud so we can have “out of home” usage ? Thank you","updated":"2021-09-28T09:39:56-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"8091488893","userName":"97Sid","userUrl":"https://itunes.apple.com/us/reviews/id728896881","version":"4.1.0","score":1,"title":"Likely the worst app on my phone","text":"The app is one of the worst performing app I have seen ever. For a reputed company working in smart devices space, they should have much higher standards for technology. The app is poorly designed and almost always doesn’t work it’s supposed to. It’s like a high school kid developed the app. If you’re looking for frustration for any reason, this is the app","updated":"2021-12-03T12:25:11-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5205328805","userName":"t q nguyen","userUrl":"https://itunes.apple.com/us/reviews/id226897994","version":"2.0.0","score":4,"title":"Good for home","text":"I have been used 3 years no problem at all","updated":"2019-11-27T15:20:03-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5096143804","userName":"ETownpimp","userUrl":"https://itunes.apple.com/us/reviews/id25744530","version":"2.0.0","score":1,"title":"New update has bugs that make lights not be controlled as intended","text":"I spent a solid hour downloading updates for the devices after initial set up, they wouldn't work otherwise.  The app is horrible for user friendliness.  Have the developers ever heard of the concept of abstractionNew up !??  I don't think they could have done a worse job in designing this app.","updated":"2019-11-06T17:54:48-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5558442802","userName":"Mad289-6","userUrl":"https://itunes.apple.com/us/reviews/id284969525","version":"2.0.1","score":5,"title":"What? Where? Huh?","text":"App is VERY hard to figure out. Help doesn't have search function. The whole thing is riddled with undefined buzz words.","updated":"2020-02-20T16:08:41-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5091561093","userName":"muckw","userUrl":"https://itunes.apple.com/us/reviews/id553979950","version":"2.0.0","score":5,"title":"Many improvements","text":"Several improvements. Following local sunrise and /or sunset is my favorite so far.","updated":"2019-11-05T16:53:45-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"7882160569","userName":"bad light system","userUrl":"https://itunes.apple.com/us/reviews/id649058960","version":"4.1.0","score":3,"title":"Bad system","text":"It’s not available on Alexa anymore and it only works about 1% of the time if I could I buy all different lights in a different system do yourself a favor by a different company light","updated":"2021-10-05T14:25:09-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6302384990","userName":"2020nio","userUrl":"https://itunes.apple.com/us/reviews/id106092874","version":"2.0.2","score":1,"title":"Worst app user experience ever","text":"Have used so many Apps over years, this is by far the most confused App and its user experience is horrible!!!!!I can’t believe this is a product from Germany. And it looks like the whole app is developed by a engineer /programmer without having user experience in mind. I’m done with the App and Osram product.","updated":"2020-08-10T06:01:38-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"8027998648","userName":"tonyterr1447","userUrl":"https://itunes.apple.com/us/reviews/id656550240","version":"4.1.0","score":2,"title":"No longer works with Alexa","text":"One of the reasons we got the bulbs was that they were compatible with voice assistance devices.  Now they are no longer compatible.  Is there plans to correct the issue or do we just need to trash our bulbs? #irratated","updated":"2021-11-15T14:16:32-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5968060268","userName":"acupod","userUrl":"https://itunes.apple.com/us/reviews/id155295393","version":"2.0.1","score":3,"title":"Functionality Review","text":"Works well, but service will be discontinued in 2021 unless there is greater demand request to continue service or offer an alternative application to configure the system.","updated":"2020-05-19T18:42:45-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5778483864","userName":"Severisth","userUrl":"https://itunes.apple.com/us/reviews/id41991652","version":"2.0.1","score":1,"title":"Absolutely terrible","text":"Possibly the most unintuitive, aggravating app I've ever used. The lighting schedule makes no sense and doesn't work, every action on the app takes forever, tap areas too small or misaligned. This is what happens when you outsource your app and don't spend any effort on usability.","updated":"2020-04-07T18:37:30-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6764736472","userName":"Heyguysimisaac","userUrl":"https://itunes.apple.com/us/reviews/id125942281","version":"2.0.3","score":1,"title":"Unreliable :(","text":"I reset the application because it couldn’t connect to Alexa again. Now I can’t create schedules anymore and I still can’t connect to Alexa. :(\n\nI don’t even know what to do when you discontinue supporting the app next year. Can you at least fix the app enough to be usable until then.","updated":"2020-12-17T16:28:49-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5639555339","userName":"Toemn","userUrl":"https://itunes.apple.com/us/reviews/id760269282","version":"2.0.1","score":1,"title":"What happened","text":"I haven’t opened th Lightify app lately. Now everything in the app is completely different. I am ticked off. Now was not a good time to ask my opinion.  Also as I type this the font is invisible so I can’t proofread anything. Are you kidding. I hope you can see this because I can’t.","updated":"2020-03-09T20:22:44-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5376884235","userName":"Sallytigger","userUrl":"https://itunes.apple.com/us/reviews/id3853973","version":"2.0.0","score":1,"title":"Unhappy","text":"I’ve had my light for several years and loved it. Your latest update was a down grade. Light no longer works and the app makes no sense what so ever. I suggest an upgrade by downgrading back.\n\nUpdate:  I contacted support over the week for support and there has been no response yet. That’s 5 days ago.","updated":"2020-01-08T08:07:16-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5209843723","userName":"CNWHOGGER","userUrl":"https://itunes.apple.com/us/reviews/id194486524","version":"2.0.0","score":1,"title":"Frustrating system","text":"All in all the lights work, but the frustration level is unbearable when they don’t. Communication between the hub and the lights can be intermittent. The color lights are the worst as range appears to be a hindrance. Recent changes to the Lightify app are also frustrating.","updated":"2019-11-28T18:01:00-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5132322409","userName":"Peoria also","userUrl":"https://itunes.apple.com/us/reviews/id119251995","version":"2.0.0","score":5,"title":"Excellent service","text":"We are very pleased with this system. Hasn’t failed us yet!!","updated":"2019-11-13T06:35:06-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"7276809437","userName":"brand-Y","userUrl":"https://itunes.apple.com/us/reviews/id159026927","version":"2.0.3","score":5,"title":"Love, love, love!","text":"I have loved my lightify system ever since I got it in 2016! So fun, amd easy to use. Their support is always super helpful as well.","updated":"2021-04-29T04:28:20-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5511114074","userName":"kenosha62","userUrl":"https://itunes.apple.com/us/reviews/id20316603","version":"2.0.1","score":3,"title":"Updates","text":"I still love the system -I am just not pleased with the update they implemented several months ago. Just not as user friendly","updated":"2020-02-09T20:58:50-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"7598088927","userName":"CTLguy","userUrl":"https://itunes.apple.com/us/reviews/id334411063","version":"2.1.1","score":5,"title":"Awesome product","text":"Easy to install and is reliable in the service. Good investment.","updated":"2021-07-20T07:21:29-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6805398074","userName":"Fruit pop 2 go","userUrl":"https://itunes.apple.com/us/reviews/id297924081","version":"2.0.3","score":5,"title":"August ending","text":"What am I supposed to do after august? We have a lot of money tied up in bulbs. Any suggestions?","updated":"2020-12-28T20:03:29-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5117561088","userName":"smh.1979","userUrl":"https://itunes.apple.com/us/reviews/id657960955","version":"2.0.0","score":2,"title":"Wake up lights no longer work.","text":"The old version worked great.  Ever since the update my wake up lights don’t work.  They come on for a couple of minutes and then shut off.","updated":"2019-11-10T02:47:01-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"7446030909","userName":"Dr.DanielB17","userUrl":"https://itunes.apple.com/us/reviews/id1107880933","version":"2.1.0","score":1,"title":"Can’t login!","text":"I’ve been here for hours and still can’t login it says this is the wrong email but it’s not and I put hundreds of emails still Don’t work but wait there’s more I pressed sign in and still doesn’t work I can’t find the Serial number","updated":"2021-06-09T12:50:08-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6894079925","userName":"Fafnir812","userUrl":"https://itunes.apple.com/us/reviews/id151326752","version":"2.0.3","score":3,"title":"Improve the app and leave it in a sustainable state before discontinuing the service","text":"The app needs to be improved and refined to be stable before the Lightify service is disconnected or discontinued","updated":"2021-01-20T16:12:21-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5378513525","userName":"kenglish22","userUrl":"https://itunes.apple.com/us/reviews/id37971268","version":"2.0.0","score":5,"title":"Love, love, love","text":"Easy to set up, super nice to come home and have the lights on in the house. Highly recommend!","updated":"2020-01-08T17:34:32-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6526166195","userName":"Solimar1968","userUrl":"https://itunes.apple.com/us/reviews/id575122154","version":"2.0.2","score":3,"title":"Not able to play a house member’s favorite","text":"Should allow to play other’s favorites if I can see it on my list","updated":"2020-10-11T21:20:07-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"7894941491","userName":"Chulo Skylark","userUrl":"https://itunes.apple.com/us/reviews/id3337415","version":"4.1.0","score":1,"title":"Pitiful, buggy, useless customer service","text":"Can't dim bulbs, can't update new ones, no longer works as smart bulbs. Just a regular light bulb that was supposed to last 20 years. Osram tries to pass the buck to Sylvania who passes it back. Waste of time trying to get help.","updated":"2021-10-09T04:42:47-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5129577419","userName":"iamforgiven","userUrl":"https://itunes.apple.com/us/reviews/id21242917","version":"2.0.0","score":1,"title":"The latest Update Messed Everything Up!","text":"The latest Update Messed Everything Up now my Lightify lights do not work at all. So frustrating.  Just about ready to buy a remote lighting system. Very disappointed!!","updated":"2019-11-12T16:12:46-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6328716665","userName":"Kevnjeni","userUrl":"https://itunes.apple.com/us/reviews/id85668930","version":"2.0.2","score":1,"title":"Won’t work now?!?!!!","text":"So I opened the app - can’t find my account?!?! Worked last night now it doesn’t- argh! What happens now that the app can’t find my account? Start all over just in time for the app to get shut down?! What’s going on at osram?","updated":"2020-08-16T22:53:40-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5460341696","userName":"Hebereli mejia","userUrl":"https://itunes.apple.com/us/reviews/id231835116","version":"2.0.1","score":5,"title":"Great product","text":"Works great with google home","updated":"2020-01-28T17:00:10-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6687555302","userName":"red1430","userUrl":"https://itunes.apple.com/us/reviews/id214543356","version":"2.0.2","score":1,"title":"No good","text":"The app works on and off. Lights can’t connect. I always have some type of an issue. When trying to connect is not discovering the light I’m trying to connect. In short the worst app. It doesn’t improve.","updated":"2020-11-26T04:26:10-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5527549075","userName":"Kliffard","userUrl":"https://itunes.apple.com/us/reviews/id30263397","version":"2.0.1","score":1,"title":"Doesn’t work","text":"Products\nLose connection frequently and their bulbs are junk. The color changing bulbs last about 6 months and cost way too much. Find a better system.","updated":"2020-02-13T15:55:12-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5410695540","userName":"BestAppsUser","userUrl":"https://itunes.apple.com/us/reviews/id19500509","version":"2.0.1","score":1,"title":"Don’t upgrade.","text":"You know what irks me most? When developers decide an update should delete and require re-authentication. It was easier to tell my installer to replace all lightify final elements and integrate competitor products into HomeKit rather than re-login at every iPad.","updated":"2020-01-16T05:07:13-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"7515258718","userName":"LJSena22","userUrl":"https://itunes.apple.com/us/reviews/id195537123","version":"2.1.0","score":5,"title":"Very Pleased","text":"Great Product. Very Low Cost. Great support and Response, if needed.","updated":"2021-06-28T05:22:32-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5092051285","userName":"Jerry's 44","userUrl":"https://itunes.apple.com/us/reviews/id415925920","version":"2.0.0","score":1,"title":"The worst!","text":"Every time they do an update, I have to start all over again scanning codes. After scans they tell me it’s a different account I’ve called and called and called. Do not buy this product","updated":"2019-11-05T20:09:43-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5174484493","userName":"zzcxccbbh","userUrl":"https://itunes.apple.com/us/reviews/id436555073","version":"2.0.0","score":1,"title":"Terrible","text":"Ever since the update my light has been unreliable. There is nothing intuitive about the new app at all! One night it follows the setting, the next night it doesn’t. I absolutely hate it.","updated":"2019-11-20T15:53:24-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5091430577","userName":"Mr. BW","userUrl":"https://itunes.apple.com/us/reviews/id27865441","version":"2.0.0","score":1,"title":"New App!  Same Problems","text":"Slight user interface improvement, but guess what?  Still doesn’t work.  The $250 in bulbs I bought 2 years ago are still worth $20 in lighting thanks to the not so smart, smart lights.","updated":"2019-11-05T16:02:09-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5144574193","userName":"Weppey","userUrl":"https://itunes.apple.com/us/reviews/id181164121","version":"2.0.0","score":1,"title":"Awful","text":"This app is awful...the mandatory update changed everything and I don’t have 1/2the options I used to...no simple to use instructions...this is not worth the money we spent on the fixtures!","updated":"2019-11-15T14:28:39-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"7762457778","userName":"BubbleNest","userUrl":"https://itunes.apple.com/us/reviews/id40200118","version":"4.0.4","score":1,"title":"Trying to complete local network update","text":"Instructions fail to include where to find the password for transition to local network. PWF on back of device does not work.","updated":"2021-09-02T05:38:53-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"7118347569","userName":"not hands off...","userUrl":"https://itunes.apple.com/us/reviews/id415077516","version":"2.0.3","score":2,"title":"Constantly disconnects","text":"When working it’s a great product, easy fun outside light.  The hub and lights will disconnect often and reconnecting isn’t always a simple “reset”.","updated":"2021-03-18T16:50:55-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5100039610","userName":"Lionking.2007","userUrl":"https://itunes.apple.com/us/reviews/id179739111","version":"2.0.0","score":1,"title":"Regret having to deal with osram","text":"This is the worse smart light system you can come across. It’s a complete nightmare. Every now and then there is a major problem with networking, connection, automation. PLEASE STAY AWAY FROM THIS SYSTEM","updated":"2019-11-07T10:58:38-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"7488012027","userName":"DougEW","userUrl":"https://itunes.apple.com/us/reviews/id372703945","version":"2.1.0","score":3,"title":"Getting Better","text":"Lightify has continued to improve their software.","updated":"2021-06-20T19:37:15-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6990177207","userName":"Jacking1","userUrl":"https://itunes.apple.com/us/reviews/id86495125","version":"2.0.3","score":5,"title":"Nice app","text":"Very great app thanks","updated":"2021-02-13T10:04:09-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6736802818","userName":"Blabney","userUrl":"https://itunes.apple.com/us/reviews/id105341812","version":"2.0.3","score":1,"title":"Doesn’t connect consistently with google home","text":"When it works it works great, but every time there is an update it quits working with google","updated":"2020-12-10T00:12:28-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6785932532","userName":"Jaynuke1","userUrl":"https://itunes.apple.com/us/reviews/id304336943","version":"2.0.3","score":1,"title":"Update","text":"The most recent update completely eliminated the ability to save schedules. It also deleted all of my saved schedules. Terrible mandatory update!!!","updated":"2020-12-23T12:33:01-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5866867566","userName":"j4sik4","userUrl":"https://itunes.apple.com/us/reviews/id433508479","version":"2.0.1","score":1,"title":"Osram lightify dimmer","text":"Downloaded updated app and can no longer program my dimmer switch. Worked before new version of this app. I now have a worthless dimmer.","updated":"2020-04-26T08:13:02-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5208624546","userName":"youxep","userUrl":"https://itunes.apple.com/us/reviews/id492830001","version":"2.0.0","score":2,"title":"Don’t work properly on timer","text":"Something is not work","updated":"2019-11-28T10:19:56-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"7801014740","userName":"Dave of mich","userUrl":"https://itunes.apple.com/us/reviews/id483987569","version":"4.0.4","score":1,"title":"Useless","text":"Bought to use with Alexa now less than a year later no longer works","updated":"2021-09-13T00:09:19-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"7056617988","userName":"dxfdgfhfytjgyukkguyk","userUrl":"https://itunes.apple.com/us/reviews/id241900695","version":"2.0.3","score":1,"title":"Doesn’t work anymore","text":"It has stopped working. We’ve reset it and it still doesn’t work.","updated":"2021-03-02T05:22:26-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6808400236","userName":"kf 51","userUrl":"https://itunes.apple.com/us/reviews/id566325642","version":"2.0.3","score":1,"title":"Osram  left us hanging","text":"Nice people shut down their server now it only works when you are on your own wifi \nThanks nothing","updated":"2020-12-29T15:25:53-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6328632434","userName":"hsohail22","userUrl":"https://itunes.apple.com/us/reviews/id901133879","version":"2.0.2","score":1,"title":"Very poorly run app","text":"Routinely the hub goes offline and I have to unplug and replug it. And now I can’t even log on to the app. The password recovery isn’t even recognizing my email.","updated":"2020-08-16T22:17:17-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5262030735","userName":"yostfish","userUrl":"https://itunes.apple.com/us/reviews/id475074084","version":"2.0.0","score":2,"title":"Scheduler frequently malfunctions","text":"After the latest update, the scheduler is essentially non-functional.","updated":"2019-12-11T20:47:02-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"7901061995","userName":"psychobeth","userUrl":"https://itunes.apple.com/us/reviews/id22043066","version":"4.1.0","score":1,"title":"This is stupid","text":"Yesterday I could connect with no problem. Today, nothing. No lights. It can’t find my gateway even though I’m sitting right next to it. This is idiocy v","updated":"2021-10-10T19:22:50-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6895411094","userName":"Kenneth F. Powers","userUrl":"https://itunes.apple.com/us/reviews/id112872915","version":"2.0.3","score":1,"title":"Randomly stopped working","text":"App started saying invalid security token all of a sudden and now won’t turn on or off any lights. I logged out and back in to no avail. Great....","updated":"2021-01-21T01:31:33-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6662793968","userName":"!^!#$","userUrl":"https://itunes.apple.com/us/reviews/id10817275","version":"2.0.2","score":1,"title":"Buyer beware.","text":"The server is going to be shut down in less than a year.  Why are the lights still in the market?","updated":"2020-11-19T06:23:48-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6975043588","userName":"usgal1","userUrl":"https://itunes.apple.com/us/reviews/id503573574","version":"2.0.3","score":2,"title":"Scheduler does not save schedules","text":"Something you did list all of my schedoand I can’t add them back","updated":"2021-02-09T14:29:00-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5657905965","userName":"Beach finder","userUrl":"https://itunes.apple.com/us/reviews/id37381117","version":"2.0.1","score":1,"title":"Crap","text":"The apps blow. Not user friendly and barely works with high speed internet. The concept is great but needs a lot work.","updated":"2020-03-13T21:37:26-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5206320350","userName":"Joingary","userUrl":"https://itunes.apple.com/us/reviews/id375441482","version":"2.0.0","score":2,"title":"Review","text":"Constantly offline when I need it most","updated":"2019-11-27T21:19:42-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5252154354","userName":"Ispwork","userUrl":"https://itunes.apple.com/us/reviews/id3327494","version":"2.0.0","score":2,"title":"Lights","text":"Since new Update lights will not go on as timed. I have removed and reinstalled but still bad.","updated":"2019-12-09T04:53:40-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5201008697","userName":"ght14","userUrl":"https://itunes.apple.com/us/reviews/id172145486","version":"2.0.0","score":1,"title":"DO NOT BUY","text":"If and when it works it’s great, has a mind of its own.  Now the its been updated nothing works, settings, etc.  pro bag ping to trash this and buy Phillips Hue","updated":"2019-11-26T14:25:22-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5195916328","userName":"Berylnola","userUrl":"https://itunes.apple.com/us/reviews/id227966104","version":"2.0.0","score":1,"title":"NOT USER FRIENDLY!","text":"What a frustrating mess. Impossible to figure out. I’m ready to switch products because of this. Terrible!","updated":"2019-11-25T07:28:32-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6897740013","userName":"Summit60","userUrl":"https://itunes.apple.com/us/reviews/id24502320","version":"2.0.3","score":1,"title":"Bad","text":"This app is nearly impossible to install, clunky to use, and tech support is by email only.","updated":"2021-01-21T14:55:41-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5404454900","userName":"Valerie_G","userUrl":"https://itunes.apple.com/us/reviews/id26284857","version":"2.0.0","score":1,"title":"No QA","text":"The software is full of bugs in basic operations.  The developer clearly doesn’t care about quality assurance.","updated":"2020-01-14T16:56:50-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5129354286","userName":"Dedala1234","userUrl":"https://itunes.apple.com/us/reviews/id229998456","version":"2.0.0","score":1,"title":"Bad app made worse","text":"Big delay in response and will not connect to the gateway rendering the widget inoperable. Over all a badly designed app made worse.","updated":"2019-11-12T14:50:58-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"7686099036","userName":"Oma Shar","userUrl":"https://itunes.apple.com/us/reviews/id291188166","version":"2.1.1","score":1,"title":"Time zone","text":"Every time I try to set the time zone it errors. Cannot use the app if I cannot get past this!!!!","updated":"2021-08-12T16:56:28-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6998899364","userName":"Lokalx","userUrl":"https://itunes.apple.com/us/reviews/id111433957","version":"2.0.3","score":1,"title":"Fine When it Works","text":"Lousy instructions...minimal customer support. Too many hours lost f’in’ with their crappy app.","updated":"2021-02-15T15:19:30-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6348219019","userName":"Jerseybooch","userUrl":"https://itunes.apple.com/us/reviews/id44022347","version":"2.0.2","score":1,"title":"Timer is bad","text":"Schedule time goes on.  But never goes off.  So frustrating!","updated":"2020-08-22T03:51:27-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6754730055","userName":"Abellee28","userUrl":"https://itunes.apple.com/us/reviews/id13639245","version":"2.0.3","score":1,"title":"DON’T BOTHER","text":"Piece of junk and they are out of business soon. I wasted too much money and time. Learn from my mistake","updated":"2020-12-14T21:40:10-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5310781318","userName":"caller104","userUrl":"https://itunes.apple.com/us/reviews/id361482380","version":"2.0.0","score":1,"title":"Doesn’t work","text":"This app makes absolutely no sense. I work with the apps all the time.","updated":"2019-12-23T16:42:47-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5280807160","userName":"ffc77103","userUrl":"https://itunes.apple.com/us/reviews/id659607029","version":"2.0.0","score":1,"title":"App and Lighs don’t work well","text":"Lights are not working properly when I schedule","updated":"2019-12-16T12:35:45-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5867789632","userName":"Teddy z","userUrl":"https://itunes.apple.com/us/reviews/id130146172","version":"2.0.1","score":5,"title":"Love it","text":"This just woks dude!","updated":"2020-04-26T12:59:09-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5193213151","userName":"do jejeidjehwhdjfjcjdjejehd","userUrl":"https://itunes.apple.com/us/reviews/id394390711","version":"2.0.0","score":1,"title":"Completely unreliable.","text":"Horrible!","updated":"2019-11-24T15:13:22-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6708217272","userName":"No N Jen","userUrl":"https://itunes.apple.com/us/reviews/id486302126","version":"2.0.2","score":1,"title":"Crappy app","text":"Crappy app. Crashes. Won’t let me create groups. Bugs out","updated":"2020-12-01T20:49:35-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"7718431725","userName":"jd32117","userUrl":"https://itunes.apple.com/us/reviews/id1134939066","version":"2.1.1","score":1,"title":"Terrible","text":"Do not buy these lights or hub. You will regret it immediately.","updated":"2021-08-21T07:28:48-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"8060174990","userName":"jj1007jayj","userUrl":"https://itunes.apple.com/us/reviews/id685343390","version":"4.1.0","score":1,"title":"Dont ever get products from this company","text":"Discontinued my lughts that are now useless forcomlared to whybIbbought them (Goigle Hime)","updated":"2021-11-24T19:20:08-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6717747573","userName":"RodnSC","userUrl":"https://itunes.apple.com/us/reviews/id100203587","version":"2.0.2","score":1,"title":"Pure garbage","text":"Worthless junk","updated":"2020-12-04T14:06:55-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6435832301","userName":"CB Arlington","userUrl":"https://itunes.apple.com/us/reviews/id401195631","version":"2.0.2","score":1,"title":"What a mess","text":"Holy crap I hate this app.","updated":"2020-09-16T11:33:54-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"7762009370","userName":"davidthewatson","userUrl":"https://itunes.apple.com/us/reviews/id156909993","version":"4.0.4","score":1,"title":"Cloud was unreliable","text":"Deprecated cloud is a blessing in disguise","updated":"2021-09-02T03:15:31-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6535954298","userName":"xofkt","userUrl":"https://itunes.apple.com/us/reviews/id140749140","version":"2.0.2","score":1,"title":"Stinks","text":"App is lousy","updated":"2020-10-14T17:55:53-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1663959562","userName":"VNeBLOB42","userUrl":"https://itunes.apple.com/us/reviews/id358894736","version":"1.8.1","score":4,"title":"Works but plan on troubleshooting","text":"Had several issues with connectivity and preset settings.  Returned all other bulbs but kept the RGB Flex.  As it was the most useful to me (under counter lighting). Out of the box some would not be recognized/located by the hub. Frustrating as heck, but did some research and was able to find out how to reset the bulbs/flex.    It was under the help menu. 5 sec on/off 5 times. Was able to reset and connect again.  Also I found it simpler to update the bulbs/flex via 4G not connected to your home WiFi.\n\nDeveloper,\n\nI am good. To clarify I return the other ones because I didn't need them. They were the RGB recessed lighting bulbs. I ended up going with the Home Depot LED 5000k brand. I didn't need the RGB nor adjustable white. I am all set I was able to troubleshoot and everything is working great, once I learn how to reset the flex lighting.  I am tech savvy so I wasn't really stressing till I figured out how to reset. I think that's the most common issue is the connectivity may want to do a better job to explain how to reset to others. May save a lot of returns. I'll send you some photos what email should I send them to?","updated":"2017-06-30T12:18:32-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2865672137","userName":"tcafranz","userUrl":"https://itunes.apple.com/us/reviews/id397130240","version":"1.9.4","score":2,"title":"Kind of works sometimes","text":"I only have the GardenSpot & Gateway but half the time it says only connected through cloud. The user interface is pretty complicated to figure out. I hate these smart lighting apps that have a section for “scenes” with extremely limited options like this one. \nWhile on the scene subject... there’s a small handful of default dynamic scenes available for the gardenspot but the fact that you cannot create your own (and lack of a third party app that is compatible and reliable) makes me want to wrap the lights around my neck. The color switcher is extremely touchy & getting some pretty standard colors is an uphill battle each time. \nYes it’s compatible with smart home hubs like Smartthings but having to disconnect from the Lightify Gateway first is counterproductive. If there is a firmware update, you must remove from Smartthings & re-pair with Lightify Gateway to update. If you want it back, you then must remove from Gateway before it can be discoverable on any other Hub. \nSuper disappointed because the lights give off some great power & really light up my backyard. \nI really hope that they are re-designing these. If the lights had a snap on connection (like regular low voltage led lighting) so you could get the spacing you want between each light, these would be amazing.","updated":"2018-07-08T12:32:16-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2399257400","userName":"nickcrafts","userUrl":"https://itunes.apple.com/us/reviews/id144670185","version":"1.9.3","score":2,"title":"If wishing worked, this would be awesome","text":"I have tried, tried some more and then tried again. No... The Osram technology and app interface is something to avoid, if possible. I’ve had about 8 components going on more than 2 years and have always kept the software updated. It’s just not reliable. Most of the time, about half the items respond to commands and about 20 percent of the time, my lights are flashing like crazy because they magically lost control of the hub (again). Yes, the light are well within range of the hub. It’s just glitchy. When I bought this system and saw some of the negative reviews, I figured those people just weren’t good with technology. Ha! \n\nI was about to give up and take my lights out when I decided to try connecting them to a Smart Things Hub. It actually works much better and has been fairly reliable for the past month! I’m keeping my fingers crossed that th very expensive components I bought from Osram don’t have to be replaced. However, I will distance myself away from Osram products in the future. \n\nFor those of you pulling your hair out with the fact that this stuff never works, try connecting your Osram technology to a SmartThings App and Hub. I can attest that it works much better for the garden-spot and flood lights.","updated":"2018-04-08T11:39:01-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1512901173","userName":"Maxclout","userUrl":"https://itunes.apple.com/us/reviews/id175305620","version":"1.7.1","score":4,"title":"Not for the App at heart","text":"It took a lot of previous experience and how apps work to get this going. The apps ability is unlike any other at that I've used. I had to reset the outdoor strips after the update even after I had them connected. You have to unplug them and plug them in for five seconds a total of five times. So what I did was start the stopwatch on my iPhone and left it running while I toggled the switch on my power strip (one I own) which has nothing to do with the strips themselves but for simplicity reasons I decided to hook all five of my lightify strips up to the power strip. Leaving the strips powered for five seconds and then off for five seconds again for a total of five times. Essentially equating to 25 to 30 seconds.\nBy doing this this successfully reset the strips after the necessary firmware upgrade after first opening the package and plugging everything in. This got the light of phi gateway to recognize the strips. After that everything was sweet. Happy to help if anyone has a question. This is day one of using and connecting everything. 31Dec16.","updated":"2016-12-31T16:22:37-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1200341788","userName":"Rxt^","userUrl":"https://itunes.apple.com/us/reviews/id113377671","version":"1.2.0","score":4,"title":"Nearly perfect !!!","text":"By far the most smart lighting system I ever had. The temperature manipulation it's excellent and regardless the light fixture you can tune it perfectly for a perfect temperature match for all lights. In the latest update the most important thing it's you can set the default setting for each led lights and control it from your wall switch without losing the settings of your preference even if a power outage occurs.  \nThe only thing for not giving the 5 stars is because share the same opportunity for improvement that other systems have in common. If a power outage occur and you're not at your home you didn't know and all the lights are turned on wasting energy until you get home to get noticed. I think this can be resolved in a future update in which if the system detect a change of status of the lights send a notification so you can open the app and turned it off and that will be 100% smart. I have various tunable white bulbs and two rgbw led strip and are awesome. Hope to see soon the US version of the RGB classic A60 and PAR 16 spotlight.","updated":"2015-05-20T20:21:06-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3894755036","userName":"thaoskids4","userUrl":"https://itunes.apple.com/us/reviews/id596897033","version":"1.9.5","score":4,"title":"So far so good","text":"I started with a garden spot, which didn’t come with a hub. I bought a hub,  couldn’t get that to connect with my wifi, 2 hours I fought that son of a gun!! Took it back disgusted, I bought a starter kit which had a second hub. It connected within seconds. So now I had a extra bulb with the starter kit. Everything is working great, I also have it connected to Alexa!! I’ve also added a color bulb, I’ll also be adding a few more runs of the garden spots, 9 lights just isn’t enough!! At times the individual bulbs or sets go offline and are uncontrollable and I have 2 that are unrecoverable, they work as a normal light. Not a smart bulb, for that I’m disappointed and completely disappointed that they are discontinued !!!! For that you lost me for the next version. I’ll spend more with hue","updated":"2019-03-17T17:18:53-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2577289815","userName":"Zizuar","userUrl":"https://itunes.apple.com/us/reviews/id41083357","version":"1.9.3","score":1,"title":"Crappy App.. Dishonest Company","text":"This is definitely about the app, their software and their competition. The physical product I use is amazing and would rate a 5 star. The company itself is a lieing and manipulative corporate pr scammer. For the longest time they blamed phillips hue for their products not being compatible with their devices. Their website still even claims it's phillips not releasing zigbee 3.0 compatability which would make their non light link devices work on the hue bridge in the US. \nWell, zigbee 3.0 has been out on the hue bridge now for 2 or 3 months and lightify products are still incompatible. The company also refused to explain and told me when I called that I need to contact phillips because it's not their problem. \nSorry, but it IS your problem. Your amazing product is supported and run by the worst piece of trash app I've ever seen and there aren't even any 3rd party alternatives to use. This is what you call an out of touch company that is more skilled in lieing with PR spin to make their competition look like the bad guy.","updated":"2018-05-21T06:51:26-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1694287379","userName":"LuckDynasty","userUrl":"https://itunes.apple.com/us/reviews/id474048214","version":"1.8.1","score":4,"title":"Frustrating setup process","text":"I just bought 2 of the full color flood lamps and the setup/updates took FOREVER!!  Only one lamp would update and I had to reset to get it to finally work.  But once I was able to complete the setup, it works great.  Good product, but the setup needs work.  Luckily I'm in IT, so I was able to figure it out, but someone who isn't technologically gifted would probably throw it across the room before the setup was complete.  If you want average people to buy and recommend it to others, you should consider making the setup process more reliable and easier to understand.  One final thought though, it would be nice if there was a way to download new presets to add to the pathetically short list of presets that came with the app.  I love me some options!!!","updated":"2017-07-22T21:46:38-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1575847556","userName":"Dan Man 58","userUrl":"https://itunes.apple.com/us/reviews/id108650003","version":"1.8.0","score":4,"title":"Happy Customer","text":"I bought the hub and 7 bulbs for 4 different rooms. I had some minor glitches that I was able to resolve myself but now everything seems to be working solidly. If all is good after a few more weeks I'll buy another 10 bulbs for inside and 2 for outside.  The app works well. Pretty dang cool!\n\nA few weeks have passed and I've added more lights, a plug, and a 4 button switch. I'm very pleased with the system. I'm not sure why others are having difficulties.  If system remains solid, I'll add a motion sensor in a week or two.","updated":"2017-03-29T19:32:41-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2514648748","userName":"JoshAttackk","userUrl":"https://itunes.apple.com/us/reviews/id23250269","version":"1.9.3","score":5,"title":"Amazing, these features are the best","text":"I have been using the system with 11 bulbs and strips lights, and Ive never had an issue. People that do probably just cant set it up properly. I use the timers and scheduler regularly, it’s a lot more pleasant than an annoying alarm. I connected my system to google home, and with a little bit of set up, the entire system is voice activated, and I hardly even have to open the app!! I don’t know how I lived without this for so long. It saves on the electric bill and these full color bulbs are cooler than ever. The only thing I haven’t figured out is how to get google home to set my lights with my saved scenes in the Osram app, so thats next. Ladies and gents, welcome to the future.","updated":"2018-05-06T22:14:05-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3491386932","userName":"weekapog","userUrl":"https://itunes.apple.com/us/reviews/id39485882","version":"1.9.5","score":2,"title":"Still Doesn’t  Support iPhone X, etc.","text":"The iPhone X has been out for over a year, but this app still doesn’t support its screen.  I thought Apple was requiring all phone apps to support iPhone X screens.\n\nAs a Lightify customer for two-plus years or so, I’ve noticed the development on this app (and Osram ecosystem in general) is painfully slow.  There have been numerous times I have thought the ecosystem was going to be abandoned, but periodically new lights are released. \n\nOsram/Sylvania should advise all customers what their intent is moving forward for the Osram Lightify (or is it Sylvania SMART+?) brand. Should their customers move on to third party gateways/controllers and apps, and leave this app behind? Or will there be meaningful development on the app to bring it into the current generation of iOS/iOS devices and smart home products?","updated":"2018-12-03T22:05:30-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1396620524","userName":"Bwf007","userUrl":"https://itunes.apple.com/us/reviews/id24466191","version":"1.6.1","score":5,"title":"Updated review","text":"App now works flawlessly! I have the entire house approx 6 room sections for a total of 17 bulbs and 2 garden spot light fixtures outside. Have 4 flex light under-cabinet led strip sets on the way! Absolutely love lightify! \n  \n\"Scheduling now works perfectly the only feature that does not work for me is the Loop for rgbw bulbs will not function correctly. I now have 16bulbs and 1 garden spot light that all work great!\"\n\n  \"Not sure why there are so many bad reviews the only problem I've had is scheduling does not work but that's no big deal for me. I'm sure there will be improvement. I'm able to operate 9 bulbs now with no issues and have 7 more on the way\"","updated":"2016-06-18T12:31:56-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"4008675853","userName":"Shucjdjebxjckfjcxbdjsossc","userUrl":"https://itunes.apple.com/us/reviews/id107814969","version":"1.9.5","score":1,"title":"Needs editable “dynamic presets” color palettes and effects","text":"I had no big problems with the app or my lights. Installed 10 lights in my basement ceiling, it took a few tries to get the hub to find and add them all, but after that, they all worked fine. The best part of this app is the “dynamic presets” which program the bulbs to repeat a pattern of colors, simulating fire, water, the aurora borealis, a few others, one that cycles through colors with all the lights cycling together (all green, then all fade to blue etc), and one that cycles each light individually/randomly, which looks awesome for parties. You can change the brightness and the speed that the effect changes, but you can’t change the color palette or how the pattern changes, which if you could, would make this app the only one I’d need for anything - parties, d&d mood lighting for any occasion etc.","updated":"2019-04-13T14:03:40-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1658194507","userName":"mudd316","userUrl":"https://itunes.apple.com/us/reviews/id154541933","version":"1.8.0","score":5,"title":"SUPER GREAT APP","text":"The lights have been great 5 ⭐️ The APP has been great 5 ⭐️ i had 1 problem with it and it was the cable modem causing it to go out and not show the bulbs so i hooked up my old router to it and i have not had 1 problem with it in at least 6 months the 2.4ghz was going out and the 5ghz was staying on the cable modem from my cable provider so i hooked my old 2.4ghz wireless router and havent had not 1 problem with it since and yes everything on the APP works great and i havent found anything that dont work on this APP i hope this can help someone if they have had the same problem!!!!!!!!!!!5⭐️⭐️⭐️⭐️⭐️              THANKS KEVIN","updated":"2017-06-26T03:21:12-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3314146816","userName":"CHRIS5377.","userUrl":"https://itunes.apple.com/us/reviews/id454425167","version":"1.9.5","score":1,"title":"Please make Siri available!!!!!","text":"It’s truly nice to be able to control the lights at home when I’m not there and also turns the light on in the morning for me to get up. There is a few small problems, you can’t connect the lights with Apple’s HomeKit app which means you can’t use Siri on any device(my biggest problem), one bulb is $30 and a pain to open your phone, open the app, WAIT for it to load, LOGIN EVERY TIME!!!! just to turn the lights on or off. They should only focus on one app, this developer has like 15 other apps that they use, just focus on making one perfect. Other wise this is an amazing app and system. Update:  now you can make your own shortcuts in the shortcut app for a lot of apps... except this one.  Not being able to use Siri really frustrates me because it’s a hassle to login and turn the lights off.","updated":"2018-10-17T19:43:40-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1489902483","userName":"PSSphoto","userUrl":"https://itunes.apple.com/us/reviews/id13554905","version":"1.7.1","score":1,"title":"Big Brand - Nice Idea - Poor OTA Implementation","text":"Update: it's been a year now and Lightify is no better. Worse software and smart IOT implementation ever. Do NOT buy\n\nLots of iot devices out there, all vying for your connected home dollars. You want to buy from established companies with strong brand, but it doesn't always deliver. Lightify is one of those.  Fairly early to the game (2 years now) with a decent looking solution (hardware, app & controls in app) BUT firmware updates are retrieved using mobile device and Osram just doesn't understand how to complete a reliable or fast update. Using Apple device it generally fails to update Lightify devices with needed firmware updates. When it does succeed it can take minutes (several minutes that seems like hours) and each device has to updated one at a time.  Just not worthy of your consideration.","updated":"2016-11-23T20:13:35-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1199427578","userName":"Lady_DD","userUrl":"https://itunes.apple.com/us/reviews/id119830276","version":"1.2.0","score":5,"title":"Love it!","text":"This app and product is amazing and the price of the lighting system is very reasonable to purchase and use. I am not a tech person but found it easy to follow the directions and set it up. I had been considering another whole house, very expensive product involving changing out light switches, etc. but this is a much easier, no disruption, and much less expensive. It is much simpler to use than the plug in timers on lamps that I have and, unlike my old timers, Lightify can be accessed remotely from anywhere through an app on my iPhone to set or change a schedule. I plan on ordering more bulbs.","updated":"2015-05-18T19:48:25-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1397298398","userName":"Speedy2003913","userUrl":"https://itunes.apple.com/us/reviews/id435557661","version":"1.6.1","score":5,"title":"Very convenient to have","text":"Not sure why others are having problems with this product or the app.   We've had it now for 6+ months and no issues.   My husband even set the system up at home and create the profile for us and he is super computer illiterate!   I'm the one always having to fix or do whatever with apps, pc, phones, ect...     Maybe they don't have the patience or doing something wrong.     But for the money to buy the products and free after that, it's definitely worth it!!!   Don't let the other comments scare you off from a purchase!","updated":"2016-06-19T19:47:40-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1801074111","userName":"Nik2002","userUrl":"https://itunes.apple.com/us/reviews/id204436578","version":"1.9.0","score":1,"title":"Good product Pathetic app","text":"Reading there other reviews, I was hoping that the app was not as bad.. and I could work around it.. But NO. The bad app brings the usability of the whole product to a zero level.. unbelievable how they can launch such a product ! I was giving it time to fix it.. but missed the deadline to return the product within 30 days.. should have put a reminder and returned this product and uninstalled the app..\n\nto start I have a group of 3 lights .. every 2 weeks one of the bulbs disconnects from the group and cannot be controlled by controlling the group.. and has to be controlled separately only.. unless I delete the scene and recreate ALL the scenes..\n\n(2) I have one bulb that does not save the defaults for brightness.. it saves the color but the brightness just blinds me every morning !\n\n(3) the scheduled scenes is very rudimentary.. I cannot even schedule it so as to have white lights in mornings and yellow lighting in the evenings.. \"smart lights\" not even by a stretch of imagination.\n\n(4) updating the bulb software took a 2 days.. it would download.. and install and fail.. and repeat.. but after 2 days it just happened.. 2 days of continuous trying...","updated":"2017-09-20T19:58:36-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1521326830","userName":"dkar","userUrl":"https://itunes.apple.com/us/reviews/id5308439","version":"1.7.1","score":2,"title":"Confusing, unpredictable, and overly complex","text":"I've had no problems as far as the hardware is concerned, except that the light color settings do not always get set. I find I have to manually apply the color/brightness too often. \nI also find the App to be really confusing and overly complex.  It doesn't always work like you expect it to - not intuitive.  That's surprising because there are so many examples they could mimic: just look at how alarms are setup in iOS!   Easy!  Setting up a schedule AND the light settings should be as easy, but I always find it an odd sequence.  If I did it all the time, it might be easy, but the typical user probably sets up a \"scene\" and schedule a few times a year.","updated":"2017-01-13T07:34:47-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"4154126338","userName":"JoekerB","userUrl":"https://itunes.apple.com/us/reviews/id22655393","version":"1.9.5","score":2,"title":"Not intuitive even for a lighting designer","text":"The startup and commissioning is straightforward but that’s where the simplicity ends. The color wheel is fairly standard, but there is a delay when picking colors and its finicky when trying to hit a specific color.  From there, the concepts of groups, scenes and favorites leave much to guesswork and frequent references to the manual. Even the manual does not truly cover the steps needed to set up an effective control scheme.  And, not being able to add effects to a preset is a huge loss.  \n\nNow, current releases of the controller do not support effects and the LED strings produce white differently than previous versions, from just last year.  Should I switch to Hue?","updated":"2019-05-15T07:08:11-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3200579035","userName":"jgreene777","userUrl":"https://itunes.apple.com/us/reviews/id36619127","version":"1.9.5","score":3,"title":"Fairly solid system","text":"Most of these systems are \"too hard\" to setup, so I don't think one could really count that factor against this one. Although some interface tweaks would be nice, it's not bad. The system works with Alexa, so I rarely even use this app to control the devices. I have a dozen or so light bulbs and my patio lights and fountain are all controlled via Alexa with the smart plug. \n\nMy main request would be to make a watchOS app so I could turn off my nightstand lamps without having to use my voice (with Alexa) or open the app on my phone. That would just make getting in bed without waking anyone else easier.","updated":"2018-09-17T13:17:21-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1442977390","userName":"RA_benson","userUrl":"https://itunes.apple.com/us/reviews/id516923389","version":"1.7.0","score":1,"title":"Crashes","text":"I got this product yesterday. It loaded and seemed to work fine.  My phone went to sleep, I go to open the app back up and it requires me to log on. I log on and the app crashes.  Now everytime I try to open the app it crashes. I went through all the trouble shooting for crashing apps and nothing works.  I shut the app down , still crashes. I deleted the app and reinstalled, it is stable until I log in, then it crashes. I deleted the app and installed in through a hard line to iTunes, still the same, it seems stable and stays open until I log in then it crashes.  I wipped my phone and rebuilt it from a back up, same thing app crashes once I log on and everytime the app is opened after that.","updated":"2016-09-01T14:13:23-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1559379203","userName":"demeo123","userUrl":"https://itunes.apple.com/us/reviews/id223347882","version":"1.7.1","score":4,"title":"using schedule with different dimming","text":"Would be five star if you could set up your schedule to not only turn on/off the light, but also have different dimming percentages for each schedule during the day. Example when I arrive home from work I would like the living room lights at 100% for a few hours but then later on to dim down to about 25% and then turn off a few hours later. This would also help save on electrical consumption.","updated":"2017-03-07T05:06:38-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1269395313","userName":"Magnakuz","userUrl":"https://itunes.apple.com/us/reviews/id12916636","version":"1.3.1","score":1,"title":"Does NOT work!","text":"Be warned - this does not work. I bought the outdoor lights and the gateway device so that I could have holiday / Halloween lights and ambient outside lighting. The gateway device is next to impossible to setup on a network and I have a computer engineering background and work in IT. If I can't do it, trust me neither can you!\n\nThey have a nice cryptic message about unable to find device due to my router not allow UDP broadcasts? Really? My router totally allows it on the LAN. Seems like the app needs to be updated and bugs fixed. Ironically the gateway device did get on my LAN with an IP but the app can't find it. It would be nice to be able to manually add that info to the app so I can finally move past the setup wizard and use the app!","updated":"2015-10-09T19:16:45-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1722606841","userName":"Beckster8","userUrl":"https://itunes.apple.com/us/reviews/id76009507","version":"1.9.0","score":1,"title":"What the $&@!","text":"Does not connect to my Apple HomeKit, does not respond to the app's settings like wake up feature or timer or anything for that matter. Took an hour for it to finally set up and I have fast internet! Interference with my phone calls and other electronics, really loud buzzing if I am in the same room as the device. It's a piece of crap! The app, the light bulb, and the plug you had to buy for the stupid thing to supposedly work. None of it is worth them money and this app should pay its users to download it! Free just doesn't cut how poorly made the app and hardware have been! I can't believe they are getting away with $30 bucks a bulb when all you can do is turn it on and off!","updated":"2017-08-10T23:24:48-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1574675048","userName":"Sethcbb","userUrl":"https://itunes.apple.com/us/reviews/id370893945","version":"1.8.0","score":3,"title":"Bugs and more bugs...","text":"The app is fine and have not had many issues with it. The whole system itself has been a nightmare. I have installed almost 40 lights and have had to return and replace half of them because of glitches or bugs in the drivers. Switching to the RGB color changing lights have improved most of the issues I've had but I continue to have a couple lights here and there that won't cooperate with me. \n\nWhen the system works, it is great but when I have petty issues I just want to rip it all out and go back to the old school light switches!","updated":"2017-03-28T05:55:54-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1501472897","userName":"IsaIvy","userUrl":"https://itunes.apple.com/us/reviews/id302470405","version":"1.7.1","score":1,"title":"App needs help","text":"I also had the same problem for the first week it worked great until an update and now lots of problems. Never stays on always going out I did a timer when I wanted on and off. When I decided no longer a timer no where to delete it and it never worked anyways. I tried changing the timer to stay on always didn't work I manually on to turn on. So I decided to reset instead it didn't work at all. So I got rid of app went back to download app again then no where to just sign in being that I already had an acct. I had to make a new acct with a different email cuz it wouldn't let me use my same email from my acct. I'm having lots of problems with this app.","updated":"2016-12-13T20:23:42-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3134939522","userName":"West FL","userUrl":"https://itunes.apple.com/us/reviews/id8084459","version":"1.9.5","score":1,"title":"1 year solid and then downhill","text":"OSRAM, please hire a new development firm and definitely work on your UX. I’m super disappointed with the way your lights seem to have a mind of their own when creating color scenes. For whatever reason the lights are constantly resetting back to their purple factory settings. I have exterior garden spots and interior non-RGB white lights. The garden spots seem to have a mind of their own. The interior non-RGB lights work well on their settings. The whole experience is a lesson in money well burnt. These Internet of Things (IOT) devices have a long way to go. I hope for OSRAM they really take a look into how their consumer products hold up and seriously invest to restore confidence. 1.5 star if I could give one.","updated":"2018-08-30T18:05:21-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3647765761","userName":"Shoestring Sales","userUrl":"https://itunes.apple.com/us/reviews/id669744175","version":"1.9.5","score":1,"title":"Have several bulbs","text":"Have several bulbs throughout my home. Indoor and outdoor some set up with timers and light settings. Everything was going well, until they weren't. Nearly a third the app no longer recognizes (\"error third party\") after a few minutes the app will say one or more needs to be updated, however after three months of troubleshooting and app freezing I have given up on those bulbs. A few others random shut off and have to be reset. Considering it's been only a year and a huge investment converting my home lighting over to \"smart home lighting\" with one brand, I am very disappointed. As a consumer I paid more, therefore I expected more.","updated":"2019-01-13T19:57:31-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1577913916","userName":"Chichiflys","userUrl":"https://itunes.apple.com/us/reviews/id19203126","version":"1.8.0","score":1,"title":"Not too good","text":"I can manually control the lights but most of the more complicated rules don't work. The alarm/wake up feature doesn't work and the fade out feature also fails. Overall this needs some fixing. The app interface isn't that great either. Not sure if the company is even listening. There are a lot of negative reviews here. I doubt I will support this company any more.\n\nUpdate 31 Mar 2017. I received a message from tech support after sending them a question. They said these features wouldn't work until after a software patch was made. Yesterday I updated the hub and these still don't work. Knocking off a star for lack of functionality.","updated":"2017-04-01T03:46:53-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1459829087","userName":"avoid101","userUrl":"https://itunes.apple.com/us/reviews/id162290620","version":"1.7.1","score":1,"title":"Stuck in update loop.","text":"Yesterday I purchased a OSRAM Lightify Gateway Home Kit and extra OSRAM Lightify bulbs, went though all the motions of connecting WiFi and paring the bulbs.   No problem until I was FORCED to install two updates.  This morning (now many, many hours later) the download was still trying to install.  I ended up taking the product back to my local supplier and they offered to let me try another one.   After another four hours, I end up taking the second unit back to my supplier for a refund.  The second unit download the updates, but then put me back in an endless cycle forcing another update.   I'm not sure if the problem is with the application or hardware.","updated":"2016-10-02T10:28:23-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1522295391","userName":"Nickp1966","userUrl":"https://itunes.apple.com/us/reviews/id310001789","version":"1.7.1","score":2,"title":"Need Faster Support","text":"Like many others today, my Osram lights no longer work with Alexa. Issues happen but it's now been at least 14 hours with no updates. Lightify customers are left in the dark....literally. That there is no solution or even an update is unacceptable. We could have easily gone with Phillips Hue but instead threw our loyalty behind Lightify. We deserve better. Or do we? Maybe we are getting what we deserve for believing in an alternative option. Too bad, I've loved the product until today. Now it feels like everyone else is laughing at me. Like I should have known better. C'mon Osram, get in the game!","updated":"2017-01-14T17:30:23-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1496168658","userName":"Renton black","userUrl":"https://itunes.apple.com/us/reviews/id333795542","version":"1.7.1","score":2,"title":"Needs some serious updates","text":"I rarely leave reviews but based on my experience so far I'm extremely let down by the overall experience. Everything worked well for the first week or so then a update to the bulb firmware was needed . Updating firmware for the bulbs is a nightmare ! The update just times out , I tried to update from 3 different devices with no luck . I followed some trouble shooting suggestions that I found and still no luck . My experience with lightify could just be down to some faulty bulbs . With that said I will be returning the product and exchange it out for something better .","updated":"2016-12-04T18:27:25-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1517332777","userName":"TA1222","userUrl":"https://itunes.apple.com/us/reviews/id330153825","version":"1.7.1","score":4,"title":"Great product. Very pleased.","text":"OSRAM has made a great product. I have the LED strip light. There are so many cool features and different options to do with these lights. I'm not sure why so many negative reviews, I have none of the other stated problems and I too have a Philips hue set up as well and although both have their pros and cons, OSRAM lights are physically more durable and dependable. I will continue to expand my lighting options with Lightify.","updated":"2017-01-07T10:19:44-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1502401122","userName":"maverick4731","userUrl":"https://itunes.apple.com/us/reviews/id32525101","version":"1.7.1","score":1,"title":"Product fine, app terrible","text":"The smart bulb and hub were easy to install/set up, but the app doesn't appear to function properly. Once logged in, I receive a notification that there are two important updates to install. There's no option to skip these updates and once you click OK, you're stuck in a continuous loop because the updates will not apply. So 24 hours later and the app still does not function because the updates won't install. And I just have a $50 light bulb and non-functioning hub. This product is going back to the store and I'll look for another brand that focuses on both hardware and software.","updated":"2016-12-15T09:43:27-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1479903950","userName":"SkiRider","userUrl":"https://itunes.apple.com/us/reviews/id20175823","version":"1.7.1","score":2,"title":"Poor performance","text":"The app kept losing connectivity to lights and the colors often didn't match my chosen color. Hue's color matching is much more accurate. The app also has an option for scenes but no option to create a scene; at least not one that I could find. I did like the circle-in-a-circle method of dimming and choosing the temperature as well as the fact that I could set a default color and temp for each light. It is annoying in Hue and other apps when a light comes back on bright red from some scene I had going. I have added all my Lightify bulbs to my Wink system and am much happier.","updated":"2016-11-06T12:39:31-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1527993233","userName":"Pullen01","userUrl":"https://itunes.apple.com/us/reviews/id149781732","version":"1.7.1","score":5,"title":"Worst Software that you can find for lighting software","text":"This software is soooo bad that I believe that it will eventually result in the Lightify system becoming obsolete. The scheduler is horrible. I have to manually turn on my groups/scene options. When using scenes, the light settings always reset to default. So, that option often doesn't work.  The software altogether is very difficult to setup.","updated":"2017-01-22T04:32:06-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1591877953","userName":"cincinpanky","userUrl":"https://itunes.apple.com/us/reviews/id205512378","version":"1.8.0","score":1,"title":"Should be great but it stinks!!","text":"The bulbs have amazing potential. I bought a bunch because the ability to regulate color temperature and brightness is invaluable to my art studio. The rgb stuff is plain old fun, but...\n\nThis app is sooooooo bad and glitchy. Lights lose their settings all the time, edits don't hold, and the updates regularly don't work. Forget about trying to contact their help team. They just don't respond. They are probably buried with emails begging for help. \n\nI've been in the dark for three days because I need to do a system update but it won't allow me to actually do it. After I click yes it pops back to the home screen. The manual reset button on the wifi device doesn't work and the apps reset glitches off too. If only they would acknowledge my email. \n\nI am so frustrated with this system because it has the potential to be so terrific. Get some decent app developers so I can recommend this product!","updated":"2017-04-18T07:28:46-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1575225589","userName":"Nobody you know 87","userUrl":"https://itunes.apple.com/us/reviews/id6515169","version":"1.8.0","score":1,"title":"Pretty much useless","text":"The app and hardware all installed fine, without an issue. But once up and running, it's pretty much useless.\n\nVacation mode: you set a start and end time. Ok, so far so good. Oh wait, you can't put a random factor on that, so it will start and stop at the same times everyday. \n\nYou can set some sort of frequency timer for the vacation mode, ranging from 5 minutes to several hours. After extensive testing, I found this is how long the light will be OOF. Let's set the slider to 20 min. The light stays off for 20 min. Turns on briefly (2-4 minutes) then turns off again for 20 minutes. Really not sure what that is supposed to simulate.\n\nOh and the app has all sorts of rich features, such as changing the bulb color. Turns out the bulb I got doesn't support that. Can't find any mention of that on the box. Since this was the only bulb that lowe's carried, there was no obvious indication that this was the low end bulb.","updated":"2017-03-28T23:46:53-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3563842201","userName":"rswjlw","userUrl":"https://itunes.apple.com/us/reviews/id604520651","version":"1.9.5","score":1,"title":"User unfriendly","text":"Hue app is intuitive. Osram Lightify app is the opposite. It is all backwards once you get beyond “add device.” Once you learn how the app thinks, you can program. Groups and scenes should be independent, but scenes with multiple members have to be created from groups made first. Members cannot be added to scenes later unless you create a new group with new member, delete all the old scenes, and create all new scenes based on the new group with new member. Time consuming as hell. Discourages from buying additional lights. Save a headache, go buy Hue and bolt on anything at anytime very quickly. I wonder if Alexa could make it easier?","updated":"2018-12-23T07:28:32-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1568232101","userName":"hazlewobble","userUrl":"https://itunes.apple.com/us/reviews/id431235911","version":"1.7.1","score":1,"title":"Sooooooo many problems","text":"I wanted to like this and I convinced myself I did because of the money I spent on 20+ rgb bulbs(close to $1k) and massive time invested. It has been problem after problem: multiple rgbw bulbs where a single color burns out, a complete failed bulb, gateway needs power cycling, constant loss of connection to bulbs, intermittent service outages, time consuming total system resets, the Alexa skill issue for a week, daily fix of random bulbs not being connected, now today all devices/timers/groups have vanished from my account. \n\nI wish I could go back in time and tell myself to pick a different brand.","updated":"2017-03-19T19:04:15-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"4187123725","userName":"Gediminas M","userUrl":"https://itunes.apple.com/us/reviews/id584527366","version":"1.9.5","score":1,"title":"Have a mind of it’s own","text":"Never works right. I had a d vice and light bulbs for few years and the schedule never worked right. I thought that is a slow internet issue. Now we have optical internet right up to the modem with 100 megs a second both upload and download consistently and hub is plugged 15 feet away. No change. Lights are coming on whenever they want. I switched the phones and now I cannot even tether it to the app it claims that this device is associated with different account while I log in to the same account. Totally worthless. But that’s expected from European company.","updated":"2019-05-21T10:23:44-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2321295133","userName":"NytFlt","userUrl":"https://itunes.apple.com/us/reviews/id43579824","version":"1.9.2","score":1,"title":"Dont .... just, dont buy Osram","text":"If Osram were the only smart light system out there, I still wouldnt buy it again. The Osram app is VERY badly designed and if you do figure out the non-intuitive controls, the settings dont stay set. Having not improved on their abysmal ratings and reviews here is pretty clear evidence that this company cant or wont make this better ... these buffoons deserve to be edged out of the market by the better systems available elsewhere and I sincerely hope it happens sooner than latter. Osram is a crap product and a crap-app not worth a second (or first) look - flee far from anything they make.","updated":"2018-03-18T17:18:03-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1469904984","userName":"work1955","userUrl":"https://itunes.apple.com/us/reviews/id147595731","version":"1.7.1","score":3,"title":"Good Start","text":"The app is a good start. Lights can have their color and brightness saved and recalled. Working on Alexa integration next. Be great if there was a smart app to integrate with Smartthings and accurate color matching inside Smartthings. \n\nSome light settings seem to not save. Set light brightness and color. Save as default. Reverts back to previous color after about 30 seconds. \n\nThe app is not as straight forward and intuitive as it could be. The interface with user needs to be cleaned up, stream lined and simplified.","updated":"2016-10-20T04:36:14-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3271116359","userName":"Laser D","userUrl":"https://itunes.apple.com/us/reviews/id509422471","version":"1.9.5","score":2,"title":"A product not ready for Primetime","text":"Purchased 40 RGB bulbs to make my driveway more festive which it does well when it works. And therein lies the problem. It works sporadically and requires constant resetting and re-pairing the bulbs to the hub. The app doesn’t help either it’s convoluted and isn’t intuitive at all. Takes forever to find settings and the layout can be confusing. Save yourself the hassle, look elsewhere unless you enjoy beta testing products. If you’re not significantly technically inclined then avoid at all costs.","updated":"2018-10-06T10:13:53-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2006232514","userName":"Janelle407**","userUrl":"https://itunes.apple.com/us/reviews/id377955518","version":"1.9.0","score":1,"title":"Only 1 Star b/c I can’t leave 0","text":"We purchased 5 lightbulbs and the hub and were excited to get automated. What a joke. Less than a year later we have totally worthless technology and it’s been that way for a long time. The lightbulbs can’t be controlled via the app, after the entire system has been reset more times than imaginable. I managed to get one color bulb connected recently but I can’t change the colors so that’s a waste. Customer service is completely useless. I trying to find a way to get my money back for this entire joke of a system.","updated":"2017-12-18T04:14:09-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1574290567","userName":"Aggietoker","userUrl":"https://itunes.apple.com/us/reviews/id146192335","version":"1.7.1","score":2,"title":"Not reliable,  buggy.","text":"I have 40 osram bulbs lighting nearly my entire house since last November is. It has been a constant headache troubleshoooting, returning, and reprogramming these bulbs. It is frustrating and unreliable. Bulbs randomly stop working correctly, lose and won't save a new default, won't turn on with a schedule, etc. The costumer support has been no help and just tells me to return the bulbs for new ones. But that's not a solution, they keep having issues. It's awesome when everything works correctly.","updated":"2017-03-27T20:55:44-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1344525307","userName":"Pete Chavana","userUrl":"https://itunes.apple.com/us/reviews/id36078290","version":"1.5.0","score":4,"title":"Good Enough","text":"I purchased the starter kit plus one extra bulb. On the extra bulb the light worked but would never register in the app. Exchanged it, and it worked like it should. Setup was a breeze and I really like the different scenes I created for the front room. Would like to see Siri support, Apple Watch App, along with a more intuitive approach to working the application. Yes, everything's there just not laid out efficiently. Recommend.","updated":"2016-03-07T19:26:44-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1334097475","userName":"Tumbleweed143","userUrl":"https://itunes.apple.com/us/reviews/id127297086","version":"1.5.0","score":5,"title":"OSRAM Lightify kit","text":"Hello, just purchase this Lightify led kit, and let me tell you, it's not easy. I was going along pretty well until the apps ask to update SOC 1 and an update for the A19 bulb, now I lost gateway connectivity and it will not let me reconfigured the gateway because it still wants to do the update which it will not go away..please update this apps. Not happy, on the verge to return the product.😠😡","updated":"2016-02-16T16:40:44-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1580162085","userName":"Holyautoadplaybatman","userUrl":"https://itunes.apple.com/us/reviews/id31707426","version":"1.8.0","score":4,"title":"Really Cool","text":"Purchased 2 color changing bulbs, a plug and a 2 button switch. Everything paired easily but the switch was a bit glitchy and kept showing low battery even after I changed out the factory installed one. Eventually got it working and everything is now running smoothly. Lights are awesome and the preset scenes are a nice touch. Def recommend.","updated":"2017-04-03T21:17:13-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1518724778","userName":"EcoBoost11","userUrl":"https://itunes.apple.com/us/reviews/id30652587","version":"1.7.1","score":3,"title":"Could be better","text":"Just hooked up the controller and my new light for my shed. Almost didn't even go through with the install. You have to set your phone up to the Osram wi-fi, then it hooks up to your home Wi-Fi. It didn't want to hook up to my home wi-fi. I then updated my Airport Express and it was like the Lightify was always hooked up, the app just showed up on the settings page. Anyways it seems to work for now. To bad it's not HomeKit compatible. It works with Nest.","updated":"2017-01-09T12:03:07-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1512195586","userName":"Mr SweetnesstQ","userUrl":"https://itunes.apple.com/us/reviews/id466047984","version":"1.7.1","score":5,"title":"Lightify is da s.....t!! Go get it","text":"I got the bulbs and hub got the app on my phone. \n\nOne night my son went in the kitchen I was upstairs and I used my phone to turn lights on and off. My son ran upstairs screaming \"dad dad I think the house is haunted, there is something paranormal going on\"\nI told him go downstairs and if it happens again call ghostbusters. I couldn't stop laughing. Get lightify and get your freak on.","updated":"2016-12-30T12:06:26-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1627014697","userName":"Storm shadow003","userUrl":"https://itunes.apple.com/us/reviews/id36779005","version":"1.8.0","score":2,"title":"Great app","text":"I like it works great I have them Connected from my garden LED lights and the fixture inside my house the only changes should be add is a sunset and sunrise feature so the lights can turn on and off by themselves without setting a specific time other than that I like it.\nUpdate: The app is OK but he still has a lot of bugs the lights outside stay on when They are set on a schedule to go off sometimes my living room lights I find it on in the morning when there were turn off at night","updated":"2017-05-28T12:02:43-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1431962937","userName":"ella kate","userUrl":"https://itunes.apple.com/us/reviews/id43310191","version":"1.6.1","score":2,"title":"Honestly, just use Phillips Hue","text":"There's really no sense in using this company when you could use Phillips Hue. It seems much more reliable and useful, and this app, though functional on the most necessary level, is very flawed. You can't control anything from outside of your home WiFi network, the updates don't seem to work, and the app is too confusing all-around to make it worth the effort. I like it better than a regular old lightbulb by a long shot, but I wish I'd gone with a different company.","updated":"2016-08-12T20:29:44-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3633630205","userName":"2A7A886h927Xd7h","userUrl":"https://itunes.apple.com/us/reviews/id107477411","version":"1.9.5","score":1,"title":"Just terrible","text":"The app is extremely unreliable and poorly developed. Sometimes it works, sometimes it doesn’t, and that’s not good enough. \n\nSometimes it lets me create schedules but not delete them. Sometimes it won’t let me update or delete schedules. Sometimes it won’t connect to the lights at all, reporting that the “gateway is offline” even though my wireless router is operating normally. If your power goes out, you’ll lose connection to the lights and be forced to set up everything again.\n\nThis product barely functions and shouldn’t be on the App Store. The use experience is simply a raging dumpster fire. \n\nI’ve given this company the benefit of the doubt, hoping updates would improve the app over time. However it’s still broken 2 years later, and I’ve had enough.\n\nThis app is why I’m switching to Phillip Hue lights.","updated":"2019-01-10T04:34:35-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"4007077371","userName":"T3chNinja","userUrl":"https://itunes.apple.com/us/reviews/id31149481","version":"1.9.5","score":5,"title":"Not sure why so many low ratings","text":"This eco-system has always worked exactly has it should for me. And using the Lightify gateway and app have been a great experience.  \n\nOur system has 20+ lights (mix of A19, cabinet and LED strip), sensors, plugs and 10 switches. Everything works exactly as it is supposed to, and the app controls it all. \n\nMy only compliant is that when scheduling actions, I should be able to change brightness/dimness level and color based on time of day. However, Alexa does allow this feature so its easily worked around. But thought I’d mention it. \n\nKeep up the great work Lightify!","updated":"2019-04-13T05:19:07-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2548381537","userName":"bankdude","userUrl":"https://itunes.apple.com/us/reviews/id41963976","version":"1.9.3","score":1,"title":"Gateway goes offline frequently","text":"I am tired of fighting with the Gateway and app!  One works the other goes offline.  When the GW is up the app can not connect or “see” my network! \n\nIt should NOT be this hard to control my three LED bulbs and light strip, but here I am AGAIN resetting the GW for like the hundredth time since I bought the starter kit. Now I am wondering if I really need to have color changing bulbs? \n\nI’m over it and ready to throw their product out and cut my losses! They will eventually figure things out but for now they are NOT ready for prime time, IMHO!","updated":"2018-05-14T19:26:07-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1912096299","userName":"Srtracer","userUrl":"https://itunes.apple.com/us/reviews/id14120099","version":"1.9.0","score":4,"title":"Works great. Wish it had app for watch","text":"I’ve had no problems with the app. It always turns my lights on right away. Only reason it didn’t get five stars is because I wish I could turn my lights off with my watch instead of grabbing my phone and unlocking it to open the app and finally turn the light off","updated":"2017-11-10T17:59:02-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2859724859","userName":"JoeAlexa","userUrl":"https://itunes.apple.com/us/reviews/id203033634","version":"1.9.4","score":5,"title":"Works great with Gardenspot Mini RGB","text":"Just set this up today using the Lightify Gateway, device was detected right away and all app controls work as expected.  I set up a schedule for tonight so we’ll see if the schedule will work correctly.  So far so good, let’s hope the app and Alexa integration continues to work.","updated":"2018-07-07T16:49:53-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2103780315","userName":"Analyze Everything","userUrl":"https://itunes.apple.com/us/reviews/id701238455","version":"1.9.1","score":4,"title":"Smart Lighting","text":"We have had two rooms setup using Lightify bulbs and they are ok so far. We have had to remove the reset the lights and the hub a few times but not too annoying. We have had one of the lights go out and stop working thus far so we have to get it replaced under warranty. I will let everyone know how that goes.","updated":"2018-01-19T00:01:02-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2002254963","userName":"GingerGnome","userUrl":"https://itunes.apple.com/us/reviews/id48785638","version":"1.9.0","score":3,"title":"Functional, however flounders on fun.","text":"The app itself is very function and relatively start forward.  It provides a practical spectrum of options one could hope for.  The biggest down side is the lack of ability to create custom lighting loops for specific occasions(think of Christmas with Red/Green, Halloween with Purple/Orange or July 4th Red/White/Blue).  \n\nTruly that would take this app, for this user to a point it would be worthy of 4 Stars.","updated":"2017-12-16T16:24:31-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1451558580","userName":"Jamesbmiller","userUrl":"https://itunes.apple.com/us/reviews/id104673978","version":"1.7.0","score":5,"title":"Great App","text":"Since becoming disabled, i have been looking for ways tu make my life easier (turning lights on/off, etc) this app and these light bulbs have made it much easier for me but at first my family was a little frustrated but now that they are used to it, life is good. I highly recommend.","updated":"2016-09-17T21:30:58-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1170776482","userName":"1 less mac fan","userUrl":"https://itunes.apple.com/us/reviews/id164395253","version":"1.1.1","score":2,"title":"Week and boring","text":"Ok so what you get is a light you can turn on from your iPhone and change it's colors. Yawn. The light often comes on by itself while the app says the light is off. No capability to schedule times. Worst is that you cannot simply come into a dark room and throw on the switch. You must use the app. So not good as a primary room light. How annoying late at night to have to fumble for the phone just to turn on the light. The app is decades behind Philips!","updated":"2015-03-20T09:38:04-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1493676201","userName":"Seanbizzo","userUrl":"https://itunes.apple.com/us/reviews/id101966124","version":"1.7.1","score":4,"title":"I like what a see","text":"A lot of potential here once you're setup. Had to update the gateway and devices several times before it worked, which is expected. The presets are great and I am happy with the quality of the equip. So far I have a strand of 3 x rgbw strips working behind my entertainment center. Planning on grabbing some bulbs and a couple switches next.","updated":"2016-11-30T17:17:15-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3194574334","userName":"21hornca","userUrl":"https://itunes.apple.com/us/reviews/id17393762","version":"1.9.5","score":5,"title":"Love","text":"I love the lights I have them in my bedroom I just wish that they had more settings, such as being able to like bounce to music or change colors as the music beats change. Then I also wish the lights could blink, flash, strobe, etc.  But other than that, I love the lights.","updated":"2018-09-15T22:15:46-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1454250882","userName":"Echopiece","userUrl":"https://itunes.apple.com/us/reviews/id8113490","version":"1.7.1","score":4,"title":"Love it!!!","text":"Don't let the other negative reviews scare you.  This app works great and is very responsive with the lights! I find the controls very intuitive and easy to navigate around. I really don't have anything negative to say. I love the freedom we have to turn the kitchen lights on or off for our dogs while away from the home.","updated":"2016-09-22T20:24:27-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1378783184","userName":"Eggrollin1","userUrl":"https://itunes.apple.com/us/reviews/id28587317","version":"1.6.0","score":1,"title":"Really bad app","text":"The app is so bad I don't even know if it's the hardware or the software that's having problems. For example, sometimes the light would not turn off according to the preset time. I have to turn off and turn back on the preset for it to go back to the normal schedule. The app itself would show there are updates (for bulb), non of them would run, even if it runs , it would still take like 10 min to finish. I would recommend not get yourself lock in to this eco system.","updated":"2016-05-14T19:46:35-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2015860613","userName":"Michael Rueb","userUrl":"https://itunes.apple.com/us/reviews/id49579861","version":"1.9.1","score":1,"title":"Lighting Scene","text":"I’m very disappointed to see this app has limited preset lighting scenes.  I purchased Lightify for my LivingRoom and LifX for the Bedroom, LifX has unlimited amounts of preset animated light scenes which are really fun.  I’ve been waiting for over a year to see if Lightify will catch up with more animated lighting scenes but none have been added and to my knowledge there are no third party compatible apps.  Many of the third party apps compatible with LifX even have sound to accompany their animated scenes making the experience with LifX superior to Lightify.","updated":"2017-12-21T16:05:03-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1568235029","userName":"Speedracerindy","userUrl":"https://itunes.apple.com/us/reviews/id199082145","version":"1.7.1","score":1,"title":"Works great...10% of the time","text":"The app works great when the stars are aligned. Most of the time when I start the app all of my devices are suddenly gone and I can't control them. Then, the next day they are back. I don't have this issue with any other devices on my network. Wish I had not spent hundreds on all these bulbs and had just gone with the Philips Hue system and app. Most of the time I have several very expensive LED bulbs that I end up using the light switch to turn on and off.","updated":"2017-03-19T19:09:41-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1472491740","userName":"radiocosmo","userUrl":"https://itunes.apple.com/us/reviews/id39257189","version":"1.7.1","score":3,"title":"It's a Start","text":"Pleased with what it can do, but unhappy with documentation and Q&A. 1. Why is Eastern Time called Indiana? 2. For \"Wake-up Lights\" you can set wake up and lights off, but \"sunrise\" automatically becomes wake up minus 20 minutes?! Totally meaningless. Why is it there at all? 3. In learning and playing with Wake-up I ended up creating 3 that I don't want. There's no way to erase those settings. 4. Please make it work with My Home app!","updated":"2016-10-24T18:42:24-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1446194742","userName":"Bunn Bunnz","userUrl":"https://itunes.apple.com/us/reviews/id261172065","version":"1.7.0","score":5,"title":"Led strip lights","text":"Got the lights and gateway from lowes. Had a little trouble setting it up. It was my wifi that was causing the problem. Now it works great. You can take pics and make the lights the color of anything(except black) in the pic. Love them. Whole house will have these lights.","updated":"2016-09-07T19:54:54-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1988446572","userName":"LTinMN","userUrl":"https://itunes.apple.com/us/reviews/id219937044","version":"1.9.0","score":1,"title":"HORRIBLE!!! -Updated and now it stopped working","text":"I used this system for several years. It’s been a bit quirky but always managed to get it working. I updated whenever updates came out. This time I updated and it has stopped working! Will NOT find the devices. Tried deleting app and resetting from gateway. Got network connected but it will not find the devices (lights) which it had been already connected to for several years.  NOTHING works now!","updated":"2017-12-11T08:29:38-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2468483353","userName":"DrkDuck","userUrl":"https://itunes.apple.com/us/reviews/id346598133","version":"1.9.3","score":4,"title":"Nice System","text":"Bought the starter pack and then two more recessed lights along with a switch. Easy to set up. Once connected all the devices automatically update to the latest version. IPhone app works well, although it has a learning curve. Integrates well with Alexa","updated":"2018-04-25T19:06:21-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1574086767","userName":"Grunt520","userUrl":"https://itunes.apple.com/us/reviews/id243262237","version":"1.8.0","score":3,"title":"RW","text":"It was pretty easy to set up but I had one bulb that was constantly going off line. I finally returned it and now everything works most of the time. I have had a bulb come on in the middle of the night so I can't totally trust it. However, you get what you pay for and this was relatively inexpensive. I would like to see a random setting or an on at dusk  setting.","updated":"2017-03-27T12:52:16-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1483547290","userName":"jonathanstark","userUrl":"https://itunes.apple.com/us/reviews/id85169880","version":"1.7.1","score":1,"title":"Unfortunately, useless","text":"I'm very happy with my Phillips hue bulbs and I have an Alexa in every room. When I saw these, I was excited by the price and convenience. Unfortunately I've been trying to get them set up for three hours and I'm caught in an infinite update loop. I have Googled around a bit and found no solution. I'm gonna try again tomorrow but if I can't find a solution I'm going to return them. It's a shame because the hardware seems pretty good, but the software is what counts. And this software stinks.","updated":"2016-11-12T21:28:24-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1491499278","userName":"Mnjhhk","userUrl":"https://itunes.apple.com/us/reviews/id178792783","version":"1.7.1","score":3,"title":"Good Light, Just not too fancy.","text":"These lights work well, and I had no set up issues. I currently only own one light, but it works just fine. I wish they would simplify the app, and make it easier to use. Also, they should make the interface cleaner. A design change is what this needs, along with some more features to make this app worth it.","updated":"2016-11-26T14:27:01-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1399108525","userName":"Chad 1988","userUrl":"https://itunes.apple.com/us/reviews/id85031731","version":"1.6.1","score":1,"title":"Lots of problems","text":"Slow load times. Fade to on/ off doesn't save changes. System is giving a notification that says it needs updates but isn't offering any updates. Can't use any of the preset color changes without the updates that the app doesn't offer. This is badly broken. I'll probably be returning the whole system tomorrow. Actually got the app to show and download updates but then freezes and never installs the update.","updated":"2016-06-23T07:57:55-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1771978782","userName":"karida z","userUrl":"https://itunes.apple.com/us/reviews/id285944969","version":"1.9.0","score":3,"title":"Has a mind of its own","text":"Great concept, definitely needs tweaking. Lights sometimes come on at unscheduled times, and sometimes don't come on when scheduled. Pray you don't have a power outage in the middle of the night, because when it ends all the lights will all come blazing on. Otherwise, I kinda like it, but hoping for future improvements.","updated":"2017-09-03T19:01:51-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"4994268910","userName":"jedidaddio","userUrl":"https://itunes.apple.com/us/reviews/id30276214","version":"1.9.5","score":1,"title":"Won’t even connect to Gateway","text":"Can’t even get past the setup screens to configure the gateway as app has a major bug in that it instructs you to connect to a Wi-Fi generates by the gateway but then won’t let you proceed popping up an error message that you aren’t connected to a Wi-Fi with a slightly different name —- uggh.   Emailed support last week.  Have not heard from anyone.   Seems the HW and the App are simply not supported given it’s been a year since this app was updated.","updated":"2019-10-21T13:25:34-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1820107477","userName":"Jimmy Fuzzbuster","userUrl":"https://itunes.apple.com/us/reviews/id167754985","version":"1.9.0","score":2,"title":"Decent app with potential","text":"This is a decent app with a lot of potential but the scheduled keeps dropping my schedules. I had it set up for the lights to go on and off 6 times over night for when no one was home. Now it only has 2 scheduled and keeps dropping ones I add or over writes existing ones even though I am adding a new schedule. Needs work but will eventually be a great tool.","updated":"2017-09-30T22:44:00-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1468054895","userName":"Twinkles2727","userUrl":"https://itunes.apple.com/us/reviews/id217660645","version":"1.7.1","score":1,"title":"Terrible","text":"First off I work in the electrical industry and deal with lighting controls daily. This is pure garbage of a app and product. They started with a decent light and started growing the line and what felt like the beginning of a good app if they kept working on it. Obviously they pulled funding and left it as a huge pile of messed up bug filled crap. If I can't work out the bugs with this system I don't know if anyone can. Return it if you bought it and get anything else.","updated":"2016-10-16T18:00:52-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1420582023","userName":"Fluffyva","userUrl":"https://itunes.apple.com/us/reviews/id187066590","version":"1.6.1","score":1,"title":"Do Not Work as Designed","text":"I bought these lights and use app to control lights in a second residence in another state. \n\nAll worked fine until I left the residence and now I can't control a thing. Defeats the whole purpose of having the app to control them. \n\nUpdate: having same problem as others. Says there is an update but it never downloads. If I was in the state where these are, I'd be taking them back since they don't work.","updated":"2016-07-26T17:40:17-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3670750204","userName":"Mives99999","userUrl":"https://itunes.apple.com/us/reviews/id111786337","version":"1.9.5","score":5,"title":"Not user friendly","text":"It’s a 1 star only because that’s the lowest rating available \n\n I finally got the light/switch/gateway to work after an update.....after two weeks of screwing the lightbulb in and out every I needed to use it\n\nWorked great with fade in and out for a year until the update came, then it took those two weeks of trial and error to get it to work just on and off, but software won’t save the fade \n\nI do not recommend this combo of gateway, switch, and light.","updated":"2019-01-19T13:13:25-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1440836221","userName":"ManniMonster","userUrl":"https://itunes.apple.com/us/reviews/id135912186","version":"1.6.1","score":4,"title":"Once set up- it is awesome","text":"The set up for my lights was a pain in the rear, but once it was set up, everything has been a breeze. I love the products and I love that I can control everything from my phone. I can dim lights that are too bright and visa versa. great product, we'll buy more.","updated":"2016-08-28T14:01:20-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1803115561","userName":"Henrybighead","userUrl":"https://itunes.apple.com/us/reviews/id479737909","version":"1.9.0","score":4,"title":"Works but...","text":"This app works but has issues. \n\nTurning bulbs on and off quickly cause delays. \n      Example one bulb turned off (with the app) and you switched bulb back on (with the app) within the minute will cause a delay and sometimes nothing will happen.","updated":"2017-09-21T23:23:06-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1400446480","userName":"Spitfirevx","userUrl":"https://itunes.apple.com/us/reviews/id19040723","version":"1.6.1","score":5,"title":"Happy with the updates","text":"The system and app are currently working flawlessly. I've had the system for about 4 months now... It's been a process, but the bugs have been slowly squashed.\nPlease please please add Apple Home support!!!","updated":"2016-06-25T19:50:42-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1417807249","userName":"PennyV","userUrl":"https://itunes.apple.com/us/reviews/id8464148","version":"1.6.1","score":4,"title":"Recent update","text":"Have had these lights since March and am pleased with them.  Easy to install and control.  My only complaint is that since the last update, it continues to indicate that an update is needed, but when I attempt to do so nothing happens.","updated":"2016-07-22T16:10:08-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1456625710","userName":"DreamingDisney","userUrl":"https://itunes.apple.com/us/reviews/id296387294","version":"1.7.1","score":3,"title":"Great to good","text":"When it works it's great.  I love this. However at least once a week one of the lights do not work properly.  I have to reset.  It only takes a few minutes but very frustrating.  The wake setting works great. I use the alarm as backup. If I could trust my the app not to forget. I could do away with the alarm","updated":"2016-09-27T02:34:34-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1679765435","userName":"Sigtauguy","userUrl":"https://itunes.apple.com/us/reviews/id9540266","version":"1.8.1","score":1,"title":"Horrible","text":"It's not user friendly in any way. I purchased a flushmount light, for my entryway, to integrate into my smart home. You cannot use this app and your Wink hub at the same time to manage your lights the same way Philips Bridge works with your Wink hub. It's either one or the other. Overall it seems like the Sylvania Osram lighting system is far inferior to the Philips Hue, whose app is far more user friendly and allows for smoother control of your lighting.","updated":"2017-07-12T15:03:26-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1523827762","userName":"Bhwats","userUrl":"https://itunes.apple.com/us/reviews/id258194089","version":"1.7.1","score":3,"title":"It works but...","text":"It needs more features that could easily be added. A sleep button for your lights that would cut them off in so many minutes . The ability to set certain schedules with different brightness. Please work this in. Also, a suggestion area. No contact form in app.","updated":"2017-01-16T18:56:06-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1143529183","userName":"oewii","userUrl":"https://itunes.apple.com/us/reviews/id164701771","version":"1.1.1","score":3,"title":"Scheduler needs a little fine tuning","text":"I would like the option of scheduling outside lights for 8pm to 8am each day, but there is no ability to do that. You must schedule from 8pm to 11:59pm then a second schedule of 12:00am to 8:00am. That means your lights go off for one minute at 11:59 each night. Easy to set schedules for the day, just not overnight.","updated":"2015-02-07T22:49:05-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3385047161","userName":"robb_gü","userUrl":"https://itunes.apple.com/us/reviews/id24938984","version":"1.9.5","score":1,"title":"Have this piece of sh... for about one year now. Time to dump","text":"The whole osram Lightify System only works from time to time. Sometimes everything will be fine. Other times you will have to unplug the gateway 4-10 times because it cannot be found. Then it works for two days and then you are back to square one. \n\nUnless you are ready for a challenge, don’t go there. It is a waste of money and time. \n\nRobert from Göppingen, Germany","updated":"2018-11-05T14:13:53-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1548036773","userName":"Silvertag","userUrl":"https://itunes.apple.com/us/reviews/id26190323","version":"1.7.1","score":1,"title":"Not ready for prime time","text":"Does not stay connected after you close the app for a while, cannot program cool things like flicker lights on text messages or music sync like my hue system. They are great because they are mass produced cheap competition for all the other guys to adjust to. The update mechanism is slick. I am hoping they can fix these issue through updates. For now it gets the job done. The light switch works superbly.","updated":"2017-02-19T09:14:45-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3168924373","userName":"Wabbott58","userUrl":"https://itunes.apple.com/us/reviews/id458177276","version":"1.9.5","score":4,"title":"Good Product","text":"I have used the system for about a year now. While it is a little complicated to set up, once you figure it out the system is all it’s cracked up to be. I will say that updates are slow to come.","updated":"2018-09-08T14:48:20-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2885310978","userName":"Chucky139","userUrl":"https://itunes.apple.com/us/reviews/id13755873","version":"1.9.4","score":4,"title":"My lightify","text":"This is the best lighting system I have ever seen so easy to understand and customer support is outstanding very helpful. I use this through out my hose and love it.I tell others about it every time they see light go on by itself.\n Thanks again , Bill Konefal USA South Carolina","updated":"2018-07-11T06:58:51-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1542458574","userName":"Blakpr0ph3t","userUrl":"https://itunes.apple.com/us/reviews/id101084312","version":"1.7.1","score":5,"title":"So Far So Good","text":"Followed the instructions and did not have a single problem. Also, the ability to add a timer (waking up to a lit kitchen) is pretty amazing. Looking forward to buying more of these products.","updated":"2017-02-11T14:23:54-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1782733267","userName":"Fishmcmuffin","userUrl":"https://itunes.apple.com/us/reviews/id35589950","version":"1.9.0","score":5,"title":"Works well if you do some reading on hard resets","text":"If you have problems turn off and on your bulbs for 5 seconds intervals 5 times and then wait","updated":"2017-09-09T18:31:13-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2089613441","userName":"bbdaddy5150","userUrl":"https://itunes.apple.com/us/reviews/id242438698","version":"1.9.1","score":1,"title":"Works, but little to offer in customization","text":"I like the lights, the app is clunky, and not easy to use. You cannot program the light to have the loops or special effects hat are built into the app come on at scheduled times. You have to manually turn them on every time. Wish they also had “holiday” loops. You would think this would be a highly sought after feature of these lights.","updated":"2018-01-14T14:23:52-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1375196154","userName":"JordanLammens","userUrl":"https://itunes.apple.com/us/reviews/id121276692","version":"1.6.0","score":3,"title":"Works good but not perfect","text":"This is a good app but it needs more updates and interface updates. The lights need to be able to gradually dim from complete darkness to any percent. But from this the app is still good and useable. Please integrate a feature so you can give control to your children to certain lights or to your guest","updated":"2016-05-07T19:57:51-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1735080065","userName":"Jan. 17th","userUrl":"https://itunes.apple.com/us/reviews/id241940988","version":"1.9.0","score":4,"title":"Not too bad","text":"Once you understand it \nYou will like it\nRead help under info in the app. It will help you a lot answering all your questions \nGet it cheaper as used on eBay from the people who could not get it and understand it :))","updated":"2017-08-19T18:25:51-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1782733267","userName":"Fishmcmuffin","userUrl":"https://itunes.apple.com/us/reviews/id35589950","version":"1.9.0","score":5,"title":"Works well if you do some reading on hard resets","text":"If you have problems turn off and on your bulbs for 5 seconds intervals 5 times and then wait","updated":"2017-09-09T18:31:13-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1375196154","userName":"JordanLammens","userUrl":"https://itunes.apple.com/us/reviews/id121276692","version":"1.6.0","score":3,"title":"Works good but not perfect","text":"This is a good app but it needs more updates and interface updates. The lights need to be able to gradually dim from complete darkness to any percent. But from this the app is still good and useable. Please integrate a feature so you can give control to your children to certain lights or to your guest","updated":"2016-05-07T19:57:51-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2067259337","userName":"Wld8hrt*","userUrl":"https://itunes.apple.com/us/reviews/id209829231","version":"1.9.1","score":1,"title":"Exasperfy","text":"I have several smart home devices. Most are far from smart. But most also generally work as they are supposed to. Except these sylvania things. \nLightify products are the bottom of the barrel and I suggest that of you can still return the ones you have. Do it. Now!\nThey rarely work, the updates never complete, the bulbs disappear all the time, they go on and off when they want. \nI’ve tried writing to them three times without response so their customer, um, service is non- existent!\nThe same problems showed up over two years ago and still aren’t addressed?! That says a lot. \nHow they can, in all good conscience, still sell this crap is beyond me.","updated":"2018-01-07T15:31:39-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1329123090","userName":"josie711","userUrl":"https://itunes.apple.com/us/reviews/id102789029","version":"1.4.0","score":4,"title":"Finally working.","text":"I finally figured it out. It took me a while but I did. Great, I'm happy with my products. I would still like to see some improvements on the app because it is very hard to figure out.","updated":"2016-02-06T21:28:07-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3601549068","userName":"Neonbigred","userUrl":"https://itunes.apple.com/us/reviews/id228968430","version":"1.9.5","score":1,"title":"It has a mind of its OWN!","text":"Worst Sylvania product line I’ve ever owned or serviced and my career involves lighting systems and lighting repairs, so I’ve seen a lot. Lights work when they want to or not, change settings on there own, brightness, colors, etc. Luckily I’ve only used a handful of the ones I bought and not going to waste my time with the others. Definitely a flawed system.","updated":"2019-01-01T18:26:09-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1562493426","userName":"Sweg City Central","userUrl":"https://itunes.apple.com/us/reviews/id324571808","version":"1.7.1","score":5,"title":"Beautiful and User Friendly","text":"Absolutely beautiful user interface and extremely user friendly. Couldn't ask for a better app.","updated":"2017-03-11T17:37:42-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1523808869","userName":"Dogden Raised","userUrl":"https://itunes.apple.com/us/reviews/id40718765","version":"1.7.1","score":2,"title":"Dynamic Presets","text":"This feature was awesome when it worked.  I have about a dozen of these lights in my home and after a couple of weeks non of the dynamic presets would work and continue to not work.  The app overall is way too complicated and not easy to navigate or understand. There is no good resource for instructions either.","updated":"2017-01-16T18:24:26-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1486338463","userName":"ghannah","userUrl":"https://itunes.apple.com/us/reviews/id167028223","version":"1.7.1","score":1,"title":"Missed the Mark","text":"This app is not very intuitive. I have used other apps like the Wemo app that are much better laid out and easy to use. My biggest disappointment is that I can not set a dimmer level to be recalled with scheduled events. Would be great to set my wake up at 25% so as to not bother my wife and have an evening scheduled event set at 75% but this was not considered. \n\nI have also had issues with the app not responding. Nice bulbs sorry app.","updated":"2016-11-17T15:45:38-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2254886246","userName":"Chakazulú","userUrl":"https://itunes.apple.com/us/reviews/id472148668","version":"1.9.1","score":5,"title":"Got better","text":"Latest updates made it more easier to set up and it also fixed my connection to one of my light bulbs, so far so good!","updated":"2018-02-27T22:26:11-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1933067820","userName":"Gmiddie","userUrl":"https://itunes.apple.com/us/reviews/id34247302","version":"1.9.0","score":2,"title":"Disappointing","text":"Love the concept of this product, but the app is quite disappointing. Often times nothing works, it’s not very intuitive, and many times there are updates buttons that don’t even allow you to press them. Quite annoying I wish I had found a competitor’s product first.","updated":"2017-11-19T10:25:16-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1499750741","userName":"Natronmeens","userUrl":"https://itunes.apple.com/us/reviews/id49375011","version":"1.7.1","score":1,"title":"Don't buy their products! App doesn't work","text":"I wish I would have read the reviews before spending $75 on one light bulb and the \"gateway\". The app forces you to upgrade but then gets stuck in a loop and nothing ever happens which makes the light useless. I took both back the next day for a refund and bought philips hue which is 1000 times better. I can't believe sylvania hasn't fixed the app yet.","updated":"2016-12-10T21:31:26-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1443593095","userName":"NuclAstroPhys","userUrl":"https://itunes.apple.com/us/reviews/id114896968","version":"1.7.0","score":2,"title":"Lightify","text":"App seems better than the WeMo app.  I like the aesthetic.  I'm glad my old WeMo bulbs work with it.  I'd like it to have a feature the WeMo app had, the ability to turn on/off at sundown/rise automatically.  I'm guessing I'll have to reset all bulbs each time there is an update based on other reviews.  Fix that!  I don't want to lose my settings each time.","updated":"2016-09-02T19:07:27-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3223070516","userName":"jimmy718662","userUrl":"https://itunes.apple.com/us/reviews/id365573100","version":"1.9.5","score":5,"title":"Not worth it","text":"Hub loses contact with lights every couple days. App won’t update to latest version. Wish there was another option for high hat lights","updated":"2018-09-23T17:04:25-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1306251103","userName":"Mavalavadingdong","userUrl":"https://itunes.apple.com/us/reviews/id43530395","version":"1.4.0","score":1,"title":"Yes, I'd Like This Product to Work, Please","text":"So in order to be a programmer, all I have to do is make a pretty UI and it not actually do anything and I get $100,000 a year? Come on. Do you guys not test your product? If not, let me fill you in. It doesn't work. None of the buttons do anything. You know buttons have to do stuff when you press them, right? I spent $200 on this and I can't even turn the lights on.","updated":"2015-12-25T20:29:24-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3799564741","userName":"DianeDe","userUrl":"https://itunes.apple.com/us/reviews/id192667186","version":"1.9.5","score":2,"title":"Last update","text":"Well the last update seems to have broken the system. Seems like after that certain groups no longer work with the app. The bulbs work they’re just stuck on white instead of any color.","updated":"2019-02-21T22:40:04-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3464818405","userName":"fedup203","userUrl":"https://itunes.apple.com/us/reviews/id226956831","version":"1.9.5","score":1,"title":"Horrible","text":"Had these for a year and it’s been miserable! They constantly disconnect, they Un-sync\nfrom the gateway which is a huge pain to re-sync. Was working with Alexa for a while and now it won’t even discover these lights! Very limited capabilities. For the price it’s not worth it! Spend the extra few bucks on a better system, you’ll be better off in the long run!","updated":"2018-11-26T19:58:26-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1858797653","userName":"bs628","userUrl":"https://itunes.apple.com/us/reviews/id152814508","version":"1.9.0","score":1,"title":"Update","text":"Until just recently I would’ve given this a five with 11 devices. However in adding the 12th one I am having trouble updating the files. It has taken me two days to do the update the devices and it still not working. Once the 12th device is almost completed it goes back and tries to upload all 12 devices again.","updated":"2017-10-18T20:43:20-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1444718468","userName":"Stuart Colorist","userUrl":"https://itunes.apple.com/us/reviews/id24253924","version":"1.7.0","score":1,"title":"Terrible!!!","text":"The product looks promising (purchased it at Lowes today) but the app is terrible. Continuously crashes no matter what. Can not even be open for a literal second before it crashes. How can a product that has it's basic functionality based on an app can have a completely broken app? Zero stars!! If this is not fixed ASAP, I am returning the entire purchase.","updated":"2016-09-04T20:02:06-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1947698404","userName":"Jruhl74","userUrl":"https://itunes.apple.com/us/reviews/id124917233","version":"1.9.0","score":4,"title":"APP WORKS!!","text":"I have to say I really like this product, it was easy to set up using the app. The app dose everything it should. (Remembers all my custom settings) Most importantly it works vary well with my google home and makes my life easier.","updated":"2017-11-25T04:45:35-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"4297337619","userName":"bruha","userUrl":"https://itunes.apple.com/us/reviews/id26861934","version":"1.9.5","score":1,"title":"Brutal app","text":"Maybe the worst app I have ever tried to use. Constant battle trying to set times for two lights. Not sure the logic applied but seems made by engineers who don’t understand how normal people think. Wish they could get some input to make this more intuitive to do the very basic things you want to do like set a schedule.","updated":"2019-06-10T16:12:33-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1271438883","userName":"kennykolour","userUrl":"https://itunes.apple.com/us/reviews/id37847046","version":"1.3.1","score":4,"title":"Works GREAT!!!","text":"Easy to set up and use. I have 2 lamps in use right now with plans to buy a few more. The next step is to develop the app for the Apple Watch...that will move me to give this 5 stars! Hurry up with this upgrade please.","updated":"2015-10-14T05:02:07-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1675505592","userName":"Dla0716","userUrl":"https://itunes.apple.com/us/reviews/id27339859","version":"1.8.1","score":1,"title":"So many bugs!!","text":"I have a ton of products on this system, like 10 or so here are my current issues. App won't update within the app and it will not save groups or group settings at all. I've tried several times to get the components to update in app and have several times had to reset the entire system and start over completely.","updated":"2017-07-09T08:22:11-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1394499704","userName":"Oakpig","userUrl":"https://itunes.apple.com/us/reviews/id127580872","version":"1.6.1","score":1,"title":"Useless","text":"This app is pretty much useless!  I finally was able to get one bulb to work and have no idea how I did it. I decided to add a bulb and have yet to get it to work. App is definitely NOT user friendly. I've never had such a problem. There's no info on how to operate the app and way too many options. I may end up unplugging and taking it back!!!  Frustrating to say the least!","updated":"2016-06-14T16:34:42-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3950423923","userName":"kubiedtx","userUrl":"https://itunes.apple.com/us/reviews/id267189613","version":"1.9.5","score":1,"title":"Boondoggle","text":"Probably ok if you have an IT degree, but to the average user, this entirely too complicated. Getting it back to just a normal yellow incandescence is proving to be another frustrating process of “push the buttons and see what happens” when the first need to renter or reset a password occurs do that I can turn the frigging lights on it off, I’ll be done with it.","updated":"2019-03-31T02:02:05-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1576016282","userName":"LdyBevrage","userUrl":"https://itunes.apple.com/us/reviews/id12921541","version":"1.8.0","score":1,"title":"I HATE THAT I PAID FOR THIS","text":"I WOULD love everything these bulbs are supposed to do, but the app blows big chunks.\n\nI can turn on and off the bulbs. One even works with a scheduler.  Only preset that works is the warm light setting. Plant light works for awhile but switches back to warm light about every 20 minutes.  \n\nABSOLUTELY ZERO of the dynamic settings function on any of the bulbs I purchased.  Specifically wanted the \"Good Night Light\" one for my daughter.  \n\nTried to contact company but got no response.  Latest app and gateway update had no effect.  I basically have regular lamps that I spent more money on than normal ones.  Would return if I hadn't waited to long to get my money back.","updated":"2017-03-29T23:26:04-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1500759606","userName":"Zeewoman121","userUrl":"https://itunes.apple.com/us/reviews/id141769575","version":"1.7.1","score":4,"title":"So far so good","text":"Easy to install. Updates were quick. Because of the poor reviews i may try another brand to see which one i like best. Have not tried to pair with Alexa yet. Baby steps!!","updated":"2016-12-12T15:09:13-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"4759225405","userName":"dededde","userUrl":"https://itunes.apple.com/us/reviews/id643502936","version":"1.9.5","score":5,"title":"This device","text":"Very cumbersome. It was a gift and I wouldn’t recommend it to anyone. And posting the review is even complicated.","updated":"2019-09-10T19:57:48-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"4397063515","userName":"Unhappy-","userUrl":"https://itunes.apple.com/us/reviews/id85182598","version":"1.9.5","score":2,"title":"Buggy, needs work","text":"A difficult to grasp interface, not many options (compared to Hue) \nDoes not integrate with Apple Home kit\nOnly need the app to switch my Osram gardenpoles, had them connected to Hue first but the behaviour of the lights was totally unpredictable, probably because Osram does not connect to a Hue zigbee mesh.","updated":"2019-07-01T07:52:06-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1574096005","userName":"RyanH1993","userUrl":"https://itunes.apple.com/us/reviews/id25677744","version":"1.8.0","score":2,"title":"The app is Ok, but what's with the Alexa integration?","text":"The app does work as advertised. But I'm tempted to switch brands and definitely am not buying any new Osram bulbs unless they improve the Alexa integration. I have two bulbs now and upon issuing an Alexa command, there's a long pause, one bulb comes on, another long pause, the next bulb comes on. It's cheesy and annoying.","updated":"2017-03-27T13:20:25-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1415743195","userName":"H_Nathan","userUrl":"https://itunes.apple.com/us/reviews/id86703594","version":"1.6.1","score":4,"title":"Please Add Apple HomeKit","text":"The setup was a bit tedious but once that was over it ended up being a pretty good app. I enjoy being able to dim any light in my house. Subtracted one star for not having it able to link to Apple HomeKit.","updated":"2016-07-19T20:47:12-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1550346094","userName":"Gerryklotz","userUrl":"https://itunes.apple.com/us/reviews/id131197587","version":"1.7.1","score":3,"title":"It's ok but could be better","text":"The app works fine but the problem I had is with the bulbs disconnecting which is apparently a bad gateway. I wish the app had the capability to turn lights on and off for sunset and sunrise, so I wouldn't have to manually go in and adjust it.","updated":"2017-02-22T17:05:55-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1351606792","userName":"USMC6500","userUrl":"https://itunes.apple.com/us/reviews/id234007253","version":"1.5.0","score":2,"title":"Difficult","text":"Took me two hours to finally get this going. Multiple re installs and the wake up feature just turned my lights on at 350 instead of 450! For such an expensive product I am very disappointed on the app and wifi support side. I am most likely returning this product tomorrow","updated":"2016-03-22T00:55:06-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"4431508461","userName":"SellersFeller","userUrl":"https://itunes.apple.com/us/reviews/id43674841","version":"1.9.5","score":5,"title":"They work!","text":"My Lightify system works good!\n\n4 full color, 2 white, 2 switches.\n\nBUT, setting up is awful. Ridiculously awful. \n\nThe iPhone interface is very good. I would like to be able to apply actions simultaneously to each device within a group?\n\nIf you are patient enough to make it through the setup, this is a good system.","updated":"2019-07-08T15:58:44-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2260988438","userName":"Rockb19","userUrl":"https://itunes.apple.com/us/reviews/id134312948","version":"1.9.2","score":1,"title":"Works sporadically","text":"Takes multiple times to turn lights on and off.  Normally won’t turn lights off on first try. Often won’t turn all lights off so you have to turn off 3-4 times.  Right now, can’t even open app even after deleting and adding again. Sorry I wasted my money.\n\nYes, tried multiple times.","updated":"2018-03-01T17:32:36-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1764863714","userName":"CommonInterface","userUrl":"https://itunes.apple.com/us/reviews/id126881263","version":"1.9.0","score":2,"title":"Fix this or lose customers","text":"I've had this setup for a year and a half. Changed routers and everything went wrong. Lights don't rename correctly, app crashes, can't even reset the gateway via the app. Dedicate some time to fixing it. Also they spelled lose as loose under gateway reset. Smh","updated":"2017-08-31T17:24:16-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"4079116617","userName":"joshs iphone 5s:)","userUrl":"https://itunes.apple.com/us/reviews/id167929809","version":"1.9.5","score":5,"title":"Great app","text":"Only using it to control 4 light bulbs with Alexa but it works great and haven’t had issues.","updated":"2019-04-29T20:45:26-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1318524855","userName":"Clifford gettysburg","userUrl":"https://itunes.apple.com/us/reviews/id303504698","version":"1.4.0","score":1,"title":"Buggy, quirky and Bad","text":"I spent about 7 hours trying to get this up and get it running. I succeeded in the installation of the App and configurations. I was able to link one of the bulbs. However, a second bulb was linked, but it caused problems with the first. Ultimately, it is going back to the retailer.  This is a great idea, but the software issues are profoundly bad and render this product useless.","updated":"2016-01-18T09:25:12-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1602341573","userName":"App user Jan/MS","userUrl":"https://itunes.apple.com/us/reviews/id108615563","version":"1.8.0","score":1,"title":"All cross up","text":"It worked great for 3 weeks. The power goes out for an hour Now the den lights turn on bed room lights and vice versa. The switch no longer works and it looks like a complete delete and reset is my only path to a fix. No, not spending the time osram. Moving on. \n\nOn the bright side this gives me the opportunity to make the switch to a smart things hub.","updated":"2017-05-01T07:00:29-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1451940343","userName":"mamburn","userUrl":"https://itunes.apple.com/us/reviews/id37740759","version":"1.7.0","score":1,"title":"Crashes. Every. Time.","text":"For two days, I've attempted to use the app. Worked long enough to set up an account. Then it crashed. Open, crash. Open, crash. Delete app, reinstall, open, crash. It says \"logging in\" but then crashes every single time. The app is required for color temperature changes, so I guess I have to return all 14 bulbs I purchased.","updated":"2016-09-18T11:01:02-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1522915286","userName":"Kway58","userUrl":"https://itunes.apple.com/us/reviews/id175118006","version":"1.7.1","score":1,"title":"Can't wait for trash truck to take it away","text":"Never written a review before, and wish my first could be positive. \nNot the case. Two bulbs and the gateway device bagged up waiting to go to the landfill. \nMultiple attempts to install on three different networks failed. I have installed hundreds of apps, and nothing has been as frustrating as this. \nExpected better from Osram. \nNot even worth returning for restock. Don't want someone else to buy it and experience same frustration. \nHardware is likely ok, but software \nhas an unfinished, amateur feel. \nHurry up trash hauler. Take it away. \nOne star for nice packaging.","updated":"2017-01-15T11:37:19-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1454740481","userName":"OUhlmann74","userUrl":"https://itunes.apple.com/us/reviews/id206283566","version":"1.7.1","score":3,"title":"App is fine but could be better...","text":"The app is fine but could be definitely improved! One example, the on/off schedule should take into consideration active sunset and sunrise parameters, not only fix hours...\n\nPlease update! Thanks...","updated":"2016-09-23T17:28:23-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3543622532","userName":"Buddy16748","userUrl":"https://itunes.apple.com/us/reviews/id195537824","version":"1.9.5","score":1,"title":"Wouldn’t buy again.","text":"I just got my bulb kit and I’m having an extremely hard time setting it up with my wifi, and I have good wifi. I can not get this to work, will be returning product from where I bought it, would not buy again. Make the app have less problems and easier to use.","updated":"2018-12-17T21:52:22-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2230492235","userName":"Night owl12343321","userUrl":"https://itunes.apple.com/us/reviews/id227820015","version":"1.9.1","score":2,"title":"Not impressed","text":"It has not worked basically since the day I got it. Can’t do the update it asks for and the schedule doesn’t work properly. \n\nCan’t use it away from the house, one of the bulbs doesn’t connect 99% of the time. \n\nWould not recommend.","updated":"2018-02-20T19:06:09-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1644310495","userName":"micsmac","userUrl":"https://itunes.apple.com/us/reviews/id39793993","version":"1.8.0","score":5,"title":"Works great from my iPhone","text":"Works great from my iPhone, but for some reason i can’t get it on my iPad, which I prefer to use.","updated":"2017-06-14T10:05:32-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2461793376","userName":"Philly runner","userUrl":"https://itunes.apple.com/us/reviews/id101538517","version":"1.9.3","score":2,"title":"Not intuitive","text":"This app has a long way to go for generally accepted use.  Setting up devices, scenes, etc is not intuitive. Some functions like “fade” on or off only works part of the time, on some devices.  Some schedules i’ve migrated to Alexa because she handles them better.","updated":"2018-04-24T04:52:18-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1468605160","userName":"Timitowerboss","userUrl":"https://itunes.apple.com/us/reviews/id259851591","version":"1.7.1","score":2,"title":"Not the best, not the worst","text":"I have used better apps, but this one isn't the best. I find it to not respond as much as I would hope, only sometimes it responds to my actions. The updating feature needs work, because when you go to update it you simply cant.","updated":"2016-10-17T18:33:33-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1316605920","userName":"Tiny tippy","userUrl":"https://itunes.apple.com/us/reviews/id22453794","version":"1.4.0","score":2,"title":"Disappointed!","text":"The app works ok for me, and I like the way bulb controls are presented. But the feature set is very limited. There's no control over transition rates and the new loop feature is plain missing. The bulb hardware and price points are really good, but I'd recommend using them with a non-Lightify system like Hue or SmartThings.","updated":"2016-01-14T19:40:02-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1518510039","userName":"ColonelAddams","userUrl":"https://itunes.apple.com/us/reviews/id32182792","version":"1.7.1","score":2,"title":"No internet controls","text":"Was thinking since it connected to my wifi network that I could turn my lights off and on while out of town, you can not :( \n\nI did ready you could with wink, but then why am I buying osram if I should have just bought wink!","updated":"2017-01-09T04:40:25-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1237590189","userName":"Gixxer6nick","userUrl":"https://itunes.apple.com/us/reviews/id338136491","version":"1.2.0","score":1,"title":"Garbage","text":"Followed the instructions in the starter kit and continued on with downloading the app on my iPhone 5. Once I was up and running, I was prompted about a couple of updates. As I clicked either of the updates nothing would happen. The \"working\" wheel pops up and never goes away. I've tried numerous times and I have yet to have any luck.","updated":"2015-08-03T17:00:24-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1759413154","userName":"JustJay6980","userUrl":"https://itunes.apple.com/us/reviews/id85128974","version":"1.9.0","score":4,"title":"Works well, but...","text":"This app needs an Apple Watch companion app! Please add one! Can you also add Siri voice control in the same way it works with Alexa? I'm not buying an AppleTV for their HomeKit.","updated":"2017-08-29T08:01:00-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1547520212","userName":"Nickmame hell","userUrl":"https://itunes.apple.com/us/reviews/id100366497","version":"1.7.1","score":1,"title":"Going back tomorrow..","text":"Set up takes too long updates 3 plus 4 bulbs .. no way to id each bulb for grouping, bulbs would only turn on and off with wall switch app is useless wants me to log out of nest and provides no way to do so ... have no idea how this got on the market ... simply typical German over engineering leading to a useless device ...","updated":"2017-02-18T18:57:01-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1491473386","userName":"Atgitcjtsg","userUrl":"https://itunes.apple.com/us/reviews/id100306946","version":"1.7.1","score":1,"title":"This app ruined my lightify account","text":"I walked through the new gateway setup steps. At the end of setup the app flashed a message telling me to reset the gateway with the button on the bottom. \n\nAfterward the app logged me into my account where I am now repeatedly told to update the gateway. \n\nBut - the gateway has been reset and cannot be updated because it is no longer on wifi. \n\nMy only option is to return the now useless gateway and create a new account or wait for support to fix my account via email. No phone support available on the weekends. \n\nAbsolutely terrible","updated":"2016-11-26T12:46:39-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1719626606","userName":"Amerist","userUrl":"https://itunes.apple.com/us/reviews/id38209829","version":"1.8.1","score":2,"title":"Unable to set default brightness","text":"I bought the gateway and I am using the app so I can adjust the default brightness. I have all of my osram lightify bulbs firmware up to date and I can't get any of them to remember the default brightness or color temperature I am setting through this app.","updated":"2017-08-08T23:14:26-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1356597207","userName":"NightEagle28","userUrl":"https://itunes.apple.com/us/reviews/id87457037","version":"1.6.0","score":2,"title":"Used to work","text":"New app doesn't work right. If you use one of the new dynamic scenes, the tunable bulbs stop responding to changes until they are turned off and back on. Groups show me scenes that are not compatible with my bulbs, but individual devices show not compatible.","updated":"2016-03-31T16:54:29-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1923960185","userName":"Appey","userUrl":"https://itunes.apple.com/us/reviews/id39280117","version":"1.9.0","score":2,"title":"If it works it’s good","text":"I have four bulbs. One frequently disconnects and doesn’t works. The other three work majority of the time. App shows on the network and randomly disconnects and the ability to control becomes much harder. I expected more.","updated":"2017-11-15T18:17:26-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1481394196","userName":"MindenMichelle","userUrl":"https://itunes.apple.com/us/reviews/id249926069","version":"1.7.1","score":3,"title":"I want it to be better","text":"I love the whole concept. And when the lights work correctly it is wonderful. They need to keep working to get the bugs out of the app. It seems very glitchy.","updated":"2016-11-09T03:30:17-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1801110251","userName":"dsewell10","userUrl":"https://itunes.apple.com/us/reviews/id126985403","version":"1.9.0","score":2,"title":"Worst functioning app I have on my phone.","text":"Does it work?...Yes it works with the worst user interface I think they could come up with. There is a delay for every button you push. It's 2017 and these are smart lights yet the app looks like it belongs on a blackberry","updated":"2017-09-20T20:23:50-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1689206072","userName":"SouthTex","userUrl":"https://itunes.apple.com/us/reviews/id48829746","version":"1.8.1","score":1,"title":"Terrible update.","text":"Ever since a firmware update a bit back only one of my lights responds to dynamic scenes. I emailed support and they said it is a known issue and will be fixed with the next update. Two updates later and nothing has changed. \n\nI wish I could figure out how to revert to an earlier version :/","updated":"2017-07-19T10:22:32-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1438533372","userName":"B-real UT","userUrl":"https://itunes.apple.com/us/reviews/id146803394","version":"1.6.1","score":3,"title":"Need to add sunset as a schedule option","text":"Please add sunset/sunrise as schedule options so we don't have to continually adjust the times in schedules to reflect when it actually becomes dark and we need to turn on lights","updated":"2016-08-24T08:13:03-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1978551319","userName":"kdunks","userUrl":"https://itunes.apple.com/us/reviews/id25334556","version":"1.9.0","score":5,"title":"Great Job App Team","text":"You guys have done a fantastic job with fixing the app / skill compatibility on Alexa.  As of December 7, 4pm EST The product is flawless.  Thank you","updated":"2017-12-07T15:42:40-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1809384455","userName":"Hammerin1","userUrl":"https://itunes.apple.com/us/reviews/id30885350","version":"1.9.0","score":1,"title":"can't update.","text":"The app won't work unless you update it even though I just downloaded it. No matter what I do it will not update. It's horrible. You can't work the lights without the update and it will not work. I've wasted far too much time working with this. I'm ready to bring it back.","updated":"2017-09-25T09:13:51-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1476071550","userName":"Banjobo2014","userUrl":"https://itunes.apple.com/us/reviews/id206995943","version":"1.7.1","score":1,"title":"Terrible!","text":"I have nothing good to say about this system. And there is no real support. Emails reply takes days. I have replaced the system twice and always have the same issue. It works when it feels like it. The one light keeps going off-line and Wi-Fi is good and the app says it is connected and good. Pure garbage!","updated":"2016-10-30T21:49:05-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3392605862","userName":"RHorn97","userUrl":"https://itunes.apple.com/us/reviews/id39749820","version":"1.9.5","score":2,"title":"Settings don’t stay","text":"Not sure if it is the lights or if it is the gateway or if it is the app but something is not correct. The default settings don’t always stay when you change them.","updated":"2018-11-07T15:48:30-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1915630034","userName":"jwhin","userUrl":"https://itunes.apple.com/us/reviews/id286065080","version":"1.9.0","score":1,"title":"Bad product, bad support, unusable app","text":"I have had trouble with this system from the beginning. When I ask the company for help, they tell me that they are very busy and will get back to us in the future. Guess what?  No contact from them. I now have cabinet lights I cannot turn off.","updated":"2017-11-12T05:10:14-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1419911490","userName":"Eggsabyte","userUrl":"https://itunes.apple.com/us/reviews/id29497048","version":"1.6.1","score":1,"title":"Worst App Ever","text":"Do not buy the color lights and think you will be able to setup nor customize your home experience.  Nothing works.  It's all sporadic.  Sometimes they work sometimes not.  I have 12 can lights and I cannot connect 1 of them.  One of them is Greyscale only.  This is just awful!","updated":"2016-07-25T17:19:28-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1345370943","userName":"Hrf26","userUrl":"https://itunes.apple.com/us/reviews/id27161669","version":"1.5.0","score":1,"title":"Current issue not working","text":"Current version of the app won't let me do anything unless I do their mandatory update/upgrade on the devices. It takes forever, and then when it is \"done\" it says it didn't do it at all. At the moment I give this a big fat zero","updated":"2016-03-09T12:44:36-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1344360018","userName":"Gamer4222","userUrl":"https://itunes.apple.com/us/reviews/id217345622","version":"1.5.0","score":1,"title":"App does not function","text":"Same issue as others. Just bought starter kit & lots of bulbs. I followed the install steps. At the end, the app forces an update to SOC1 and A19 which both never work.  The app is the only way to control the bulbs and it is not functioning any more. Unless they fix the app do not buy this product.","updated":"2016-03-07T10:25:31-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"4079116617","userName":"joshs iphone 5s:)","userUrl":"https://itunes.apple.com/us/reviews/id167929809","version":"1.9.5","score":5,"title":"Great app","text":"Only using it to control 4 light bulbs with Alexa but it works great and haven’t had issues.","updated":"2019-04-29T20:45:26-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1695530770","userName":"Chlorinehair","userUrl":"https://itunes.apple.com/us/reviews/id103271645","version":"1.8.1","score":4,"title":"Works great for me.","text":"I'm not sure why there are so many harsh negative reviews. The setup process was easy to follow and the handful of bulbs we have all work fine.","updated":"2017-07-23T19:39:46-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1576318822","userName":"Allssse","userUrl":"https://itunes.apple.com/us/reviews/id116720364","version":"1.8.0","score":4,"title":"Motion sensor","text":"After the update yesterday, the motion sensor stopped working correctly, update yesterday was for the contact sensor they added and now my motion sensor doesnt work","updated":"2017-03-30T05:53:18-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1553261711","userName":"RobEveFamilyApple","userUrl":"https://itunes.apple.com/us/reviews/id38433175","version":"1.7.1","score":1,"title":"Buggy buggy buggy","text":"Trying to use it in a commercial setting. Every week something else goes wrong. Won't display colors correctly, won't apply scene colors correctly, can't reset all manually, yuck. Not recommended.  Wish I had saved tho boxes so I could take it all back.","updated":"2017-02-26T11:55:59-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1346874294","userName":"Carina.LMC","userUrl":"https://itunes.apple.com/us/reviews/id41208303","version":"1.5.0","score":1,"title":"Not a reliable product.","text":"We have been trying to use this product for 3 months now. Every time we are prompted for a system update, the app cannot complete it. Without the update, the system does not function at all. Please fix this immediately Osram.","updated":"2016-03-12T11:46:17-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3936777377","userName":"Nai-De","userUrl":"https://itunes.apple.com/us/reviews/id39059509","version":"1.9.5","score":1,"title":"Can’t use the app to locally control lights without cloud account","text":"Can’t use the app to locally control lights without cloud account.\n\nIt is an outrageous habit of forcing people to sign up with online accounts that spy on users before making available basic functionality.\n\nI will never, ever want to use Osram‘s cloud solution, as I use HomeKit instead,\n\nWith the Hue app, setting up an account is optional, as it should be.\nWith this one, one cannot get past the welcome screen without having an account, being logged in, and spied on.\n\nAbysmal!","updated":"2019-03-28T05:11:33-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3112805090","userName":"Bh-not taken","userUrl":"https://itunes.apple.com/us/reviews/id195913605","version":"1.9.5","score":1,"title":"Tried and tried","text":"I’ve always had problems with this app. Osram says to do a factory reset, reinstall the app, etc etc.   well, that’s really inconvenient for a convenience appliance.  I’ve basically given up.  Going to try one more time and then this thing is going in the garbage.","updated":"2018-08-25T08:02:55-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1464626142","userName":"angelmath1984","userUrl":"https://itunes.apple.com/us/reviews/id170849521","version":"1.7.1","score":1,"title":"Trying to update a reset gateway","text":"I reset the Lightify gateway and I am not able to set it up again because the app wants to update firmware. The app should should let me setup my gateway again instead of trying to update, how can I update something that I can't even configure again. Please fix.","updated":"2016-10-10T18:05:18-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1418625803","userName":"Darcydog04","userUrl":"https://itunes.apple.com/us/reviews/id342314704","version":"1.6.1","score":1,"title":"App doesn't work!!","text":"So disappointing!! App requires firmware update to even use and the update will not process. I've reset everything uninstalled the app, etc with zero luck. Potential to be a cool product but it's now being returned after wasting an entire Saturday trying to make this work","updated":"2016-07-23T17:39:20-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1313129212","userName":"667565656","userUrl":"https://itunes.apple.com/us/reviews/id152554325","version":"1.4.0","score":2,"title":"Partially works","text":"I can turn my lights on and off, dimming too. That is it. Scheduling (the reason I bought this) does not work. Even better, once or twice a week, all my lights turn on at midnight! No, I'm not happy with this product or app.","updated":"2016-01-08T03:47:56-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1933781286","userName":"Lovejoi2000","userUrl":"https://itunes.apple.com/us/reviews/id112318704","version":"1.9.0","score":1,"title":"Lights and app","text":"Shouldn’t have been so cheap and bought Phillips. Ended up getting what i paid for. When i turn the lights out with my phone only 1 bulb turns out. Such a waste. Got this so i could turn the lights out with my phone. Totally not happening anymore. It worked at one time","updated":"2017-11-19T17:49:47-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1551113292","userName":"dak970","userUrl":"https://itunes.apple.com/us/reviews/id124798481","version":"1.7.1","score":5,"title":"Not bad","text":"Works well, a little different from hue but not bad.  Good interface. Does the jobs","updated":"2017-02-23T17:40:47-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1534470402","userName":"milehighmassive","userUrl":"https://itunes.apple.com/us/reviews/id33322830","version":"1.7.1","score":2,"title":"Not robust. No HomeKit support","text":"Don't know if app or router. Not enough flexibility. Schedules get flaky and occasionally stop working. I have to reset the router and therefore all lights about once every 4 months if I want to make a change. Widgets occasionally stop working. I dunno. Needs work.","updated":"2017-01-31T15:49:06-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1747028161","userName":"Txrman","userUrl":"https://itunes.apple.com/us/reviews/id29620323","version":"1.9.0","score":2,"title":"Just got so waiting to see how it works","text":"I wish that it had a mode that it would just change colors threw out its cycle and could also do each light a different color and that the white was brighter","updated":"2017-08-24T20:46:08-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1744308608","userName":"joeryyan","userUrl":"https://itunes.apple.com/us/reviews/id37347574","version":"1.9.0","score":1,"title":"Poor execution of good concepts","text":"This app and the hardware has been poorly implemented. Functionality that once worked becomes useless after updates. Hardware looses its connection frequently and the app scheduling and lighting features work for limited time periods before they require reset.","updated":"2017-08-23T23:24:54-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1643103137","userName":"Idontwantanickname:/","userUrl":"https://itunes.apple.com/us/reviews/id290786358","version":"1.8.0","score":1,"title":"The app RARELY works","text":"The lights are great but they're useless without the ability to turn them on and off with the app. The app simply does not work. It won't turn the lights on. Every now and then it works but it's completely unreliable. I hate this app, it's a daily source of frustration.","updated":"2017-06-13T07:36:06-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1756725833","userName":"Donaleigh33","userUrl":"https://itunes.apple.com/us/reviews/id153342313","version":"1.9.0","score":1,"title":"PRESETS DO NOT WORK","text":"One of the best features is the option to chose the presets on the app that allow you to change your lights in different ways and colors. This feature doesn't work! I have changed and reset them and contacted customer support. Definitely feel cheated.","updated":"2017-08-28T06:17:55-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1521617585","userName":"Bradford64","userUrl":"https://itunes.apple.com/us/reviews/id149703493","version":"1.7.1","score":1,"title":"Cannot Log into App","text":"Bought two bulbs a year ago. Loved it and had no issues until my wife and I moved into a new home. No forum help to log into app . Asks to \"check my login credentials and region \" only to find a selection for region which it will not accept ... very disappointing","updated":"2017-01-13T19:19:45-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1301710349","userName":"ohio.emt","userUrl":"https://itunes.apple.com/us/reviews/id17878108","version":"1.4.0","score":1,"title":"Do not update","text":"I've had my lights strips running for at least six months without a problem. Within an hour of the update I've had to restart my strips twice due to them losing connection. Also can't get the new loop feature to work at all.","updated":"2015-12-16T21:01:12-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3690383853","userName":"ghhddhi","userUrl":"https://itunes.apple.com/us/reviews/id105451731","version":"1.9.5","score":3,"title":"Terrible.","text":"This app continually drops off line. Try to get in touch with customer service & that’s like winning the lotto, it just doesn’t happen. Good luck with the system.","updated":"2019-01-24T14:18:11-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1888549237","userName":"Griffintech99","userUrl":"https://itunes.apple.com/us/reviews/id281310028","version":"1.9.0","score":5,"title":"Positive","text":"Best app for controlling there smart light bulbs. I have 8 bulbs , two remotes, and one flex strip. Been using for several years.","updated":"2017-10-31T16:24:59-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1553379005","userName":"John Higg","userUrl":"https://itunes.apple.com/us/reviews/id150592448","version":"1.7.1","score":1,"title":"I wish I could give zero stars","text":"I was so excited when I first brought these home. That's as far as the love went. The app is useless, the lights will not and have not worked by voice commend. I have reset them at least ten times. Run from the garbage of a product","updated":"2017-02-26T17:59:47-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1474746279","userName":"OCTx","userUrl":"https://itunes.apple.com/us/reviews/id17632364","version":"1.7.1","score":1,"title":"Does not work reliably","text":"I have been using the light and app for a few weeks now. When the app works, the light is great. Thats about 1 in 100 times I open it up. All other times I have to reset everything. A lot more work is needed to have better ratings.","updated":"2016-10-28T17:52:40-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1510397762","userName":"@iamsammis","userUrl":"https://itunes.apple.com/us/reviews/id232764155","version":"1.7.1","score":1,"title":"TERRIBLE","text":"Worst app developed ever. Something went wrong with setup and it won't let you manually reset the account attached with the gateway. The app lets you get NO FURTHER and customer service has been useless. Total fail. Making my sister return for a full refund. Waste of Christmas present.","updated":"2016-12-27T18:00:02-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"4402751514","userName":"Hdhdbdjn","userUrl":"https://itunes.apple.com/us/reviews/id423182129","version":"1.9.5","score":1,"title":"Don’t bother","text":"I’ve tried this app in a bunch of different configurations with two light bulbs and it has never performed as expected. I have the app setup to run certain scenes on different schedules and it is very unreliable. The hub loses communication with the bulbs in a daily basis and operation is impossible to predict. Nice try Osram.","updated":"2019-07-02T15:57:51-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3213718924","userName":"Uncle url","userUrl":"https://itunes.apple.com/us/reviews/id275082126","version":"1.9.5","score":3,"title":"More reliable than Wink","text":"I have had major issues with Wink working with Alexa. That frustration led me to try this app. It has worked with Alexa from the start.","updated":"2018-09-21T06:47:00-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1472722256","userName":"slowdivr","userUrl":"https://itunes.apple.com/us/reviews/id43853646","version":"1.7.1","score":2,"title":"Can't track sunrise or sunset in scheduler","text":"Works ok just needs some more features. \n\nThe main one for me is automatically knowing when sunset and/or sunrise is and incorporating it into schedules.\n\nIt appears they are more interested in lighting gimicks, pulsing or flashing lights.","updated":"2016-10-25T05:17:28-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5063577896","userName":"coder12","userUrl":"https://itunes.apple.com/us/reviews/id186495620","version":"1.9.5","score":1,"title":"iOS 13 setup issues","text":"You can’t setup a new hub using iOS 13. The app hasn’t been updated to use location services to allow seeing local WiFi networks, and you’re soft-locked in the setup.","updated":"2019-11-01T11:48:12-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1513515813","userName":"ShreddedHouse","userUrl":"https://itunes.apple.com/us/reviews/id337730246","version":"1.7.1","score":1,"title":"Never works a second time","text":"I purchased the light & Wi-fi device at Lowe's. It setup fine but it never stays connected. I need to either reboot the Wi-fi device or re-setup the connection through the app. Just wished it would stay connected more then just a day.","updated":"2017-01-01T15:48:44-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1453000032","userName":"Vegas frustrated with lights","userUrl":"https://itunes.apple.com/us/reviews/id28509578","version":"1.7.1","score":1,"title":"Useless","text":"These lights were difficult to configure, won't update and now just blink on and off. \n\nI've reset the system multiple times and tried about every fix you could imagine. \n\nMine, (nearly $200 in lights) are going in the garbage.","updated":"2016-09-20T09:45:57-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1445124060","userName":"lemmonkl","userUrl":"https://itunes.apple.com/us/reviews/id85696488","version":"1.7.0","score":1,"title":"Can't pair multiple lights on one circuit","text":"This is ridiculous! I bought 6 lights. Spent and hour installing everything. And now I only have 1 light that actually changes color because the app won't pair to any of the other lights because they are on the same circuit!! I'm livid! 😡","updated":"2016-09-05T15:05:46-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2979392475","userName":"Puck2goal","userUrl":"https://itunes.apple.com/us/reviews/id42181558","version":"1.9.5","score":1,"title":"Garbage, what a waste of money.","text":"This app and the whole system is garbage. Every time there is an update to the software you need to uninstall everything reset the system and re-add all your devices and scenes. So much for making my life easier.","updated":"2018-07-27T14:49:15-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1300760097","userName":"! ;)!","userUrl":"https://itunes.apple.com/us/reviews/id152659386","version":"1.3.1","score":4,"title":"Just follow the quick guide","text":"Takes a little time to setup, but works fine!","updated":"2015-12-14T19:28:28-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1453000032","userName":"Vegas frustrated with lights","userUrl":"https://itunes.apple.com/us/reviews/id28509578","version":"1.7.1","score":1,"title":"Useless","text":"These lights were difficult to configure, won't update and now just blink on and off. \n\nI've reset the system multiple times and tried about every fix you could imagine. \n\nMine, (nearly $200 in lights) are going in the garbage.","updated":"2016-09-20T09:45:57-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1445124060","userName":"lemmonkl","userUrl":"https://itunes.apple.com/us/reviews/id85696488","version":"1.7.0","score":1,"title":"Can't pair multiple lights on one circuit","text":"This is ridiculous! I bought 6 lights. Spent and hour installing everything. And now I only have 1 light that actually changes color because the app won't pair to any of the other lights because they are on the same circuit!! I'm livid! 😡","updated":"2016-09-05T15:05:46-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1448757318","userName":"Safari is lame","userUrl":"https://itunes.apple.com/us/reviews/id35256125","version":"1.7.0","score":4,"title":"Good Start App Needs Some Polish","text":"Installed per instructions, updated firmware, grouped two canned lights and put in Ocean scene.  Works as expected.  iPhone 6plus. The app is in need of polishing.","updated":"2016-09-12T15:23:19-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2979392475","userName":"Puck2goal","userUrl":"https://itunes.apple.com/us/reviews/id42181558","version":"1.9.5","score":1,"title":"Garbage, what a waste of money.","text":"This app and the whole system is garbage. Every time there is an update to the software you need to uninstall everything reset the system and re-add all your devices and scenes. So much for making my life easier.","updated":"2018-07-27T14:49:15-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1870566534","userName":"KeithLeo90","userUrl":"https://itunes.apple.com/us/reviews/id10988085","version":"1.9.0","score":1,"title":"Awful","text":"I bought this product for the alarm light. It worked for the first week. And hasn't worked since. I don't know if it's something internal with the time zones not being calibrated correctly by the developer or what. Do not buy","updated":"2017-10-23T19:36:36-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1499498137","userName":"OldMan-Seadog","userUrl":"https://itunes.apple.com/us/reviews/id130574336","version":"1.7.1","score":1,"title":"Difficult without a support team","text":"I E-mail the team about connection issues\n\nThey did not return my E-Mails\n\nI returned the fist hub and switched it out, I was able to get it working.\n\nThe updates are very long\n\nIt is not directly comparable to ECHO, but can be used with a wink hub to connect to ECHO\n\nThe products are very innovative with direct color and intensity controls\n\nIf they did not sell hubs and only sold lights telling you to get a wink2 hub to control them they would have had a lot of stars in my review","updated":"2016-12-10T10:03:52-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3466382175","userName":"Vfgdxyjjhckfxbd","userUrl":"https://itunes.apple.com/us/reviews/id361017086","version":"1.9.5","score":3,"title":"Basic","text":"Seems to work ok. Limited options on lighting choices. Requires internet to work so a stable connection helps.","updated":"2018-11-27T06:01:09-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3354876468","userName":"osramjunk","userUrl":"https://itunes.apple.com/us/reviews/id573939161","version":"1.9.5","score":1,"title":"What a waste of money","text":"I bought a few osram RgB bulbs and they worked good. So I bought 8 more. Now this junk software won’t acknowledge all but 2 bulbs. I reset everything and still nothing. I shouldn’t have cheaped out and bought the hue bulbs. At least the work right!!","updated":"2018-10-28T11:48:39-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3297359874","userName":"metrodoro","userUrl":"https://itunes.apple.com/us/reviews/id32688616","version":"1.9.5","score":1,"title":"Seriously?","text":"It is impossible to connect to the lights.... just one out of three ... all of them were working and a couple of months ago they stopped ... after endless attempts to reconnect only managed to connect one ....","updated":"2018-10-13T08:09:18-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1587399065","userName":"DJC513390","userUrl":"https://itunes.apple.com/us/reviews/id562901669","version":"1.8.0","score":2,"title":"Average/frustrating","text":"The lights work relatively well as you'd expect, but the dynamic presets don't work at all. The app indicates they're successfully applied, but the lights don't change. Software and hardware both need some help.","updated":"2017-04-12T20:16:42-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1606099971","userName":"Kliegmite","userUrl":"https://itunes.apple.com/us/reviews/id49448615","version":"1.8.0","score":1,"title":"Stopped working","text":"The system worked fair for a couple of weeks then This morning all my devices disappeared from the app and I have no systematic control. Could not find\nA number to get help, only email. Waiting.","updated":"2017-05-05T16:01:29-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1343728872","userName":"blackwellhome","userUrl":"https://itunes.apple.com/us/reviews/id30687053","version":"1.5.0","score":1,"title":"Very disappointed","text":"Like others, I can't really comment on the way this app works with the lights because it forces you to update your products as soon as you do the initial setup. The progress wheel just spins and spins on the updates. I'll be returning the lights and gateway.","updated":"2016-03-06T05:32:48-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1444058751","userName":"jurhfnfkd","userUrl":"https://itunes.apple.com/us/reviews/id176094989","version":"1.7.0","score":1,"title":"App doesn't work - Returning now","text":"August rev of app doesn't work. Made to the identify bulbs page and the app closes every time. Poor testing before release. Returning product before I have more problems. Bought 10 bulbs and a gateway for house. All going back.","updated":"2016-09-03T14:39:42-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1413417075","userName":"Ejb5oh","userUrl":"https://itunes.apple.com/us/reviews/id24756319","version":"1.6.1","score":1,"title":"Lackluster GARBAGE!","text":"Don't waste your time. App fails to deliver. Bought a full color bulb and the only time you get to see all the colors is when you first sync it. App doesn't allow color change, keeps issuing token error message, and simply fails to perform. \n\nMost features are not support, though they are offered as teasers. \n\nJust plain junk. Very disappointed that a reputable (or maybe not) company would even allow such trash to be publicly marketed. \n\nReturning immediately!\n\nZERO STARS.","updated":"2016-07-16T10:49:15-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1862748038","userName":"MikeKuntz","userUrl":"https://itunes.apple.com/us/reviews/id135488868","version":"1.9.0","score":1,"title":"Can’t update Firmware","text":"I’ve tried probably 10x today to update the firmware in my gateway but each time after 15min it doesn’t successfully complete. I’m not able to do anything else with the gateway until I get this done.","updated":"2017-10-20T13:30:35-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1531250596","userName":"trashpar","userUrl":"https://itunes.apple.com/us/reviews/id27327248","version":"1.7.1","score":1,"title":"Maddening","text":"App works very poorly, hard to setup and constantly needs reset.  It will create new groups by itself and then you can't delete them.   You have to delete the app and start from scratch.  No more Sylvania smart lights in this house.","updated":"2017-01-26T17:19:25-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1523151030","userName":"Mr202","userUrl":"https://itunes.apple.com/us/reviews/id71021007","version":"1.7.1","score":1,"title":"Two starter kits, no luck.","text":"I bought two starter kits. The first gateway was \"already registered\" and I couldn't get any further so I returned it. The second time I bought a starter kit, I made it as far as attempting to discover the device, a light bulb, and failed to discover it. Terrible app. Good idea. Bad execution.","updated":"2017-01-15T20:20:51-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1505487982","userName":"Disapointed48532","userUrl":"https://itunes.apple.com/us/reviews/id11010457","version":"1.7.1","score":1,"title":"I'd rather just have a lightbulb","text":"The firmware on my lightbulbs will not update. Making them unable to do anything smarter than dim. \n\nThis is moronic - And the app won't let me reset until I log out of nest, which I am not logged into.\n\nThis is a stupid problem to have.","updated":"2016-12-20T05:49:15-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1476521246","userName":"Rcody67","userUrl":"https://itunes.apple.com/us/reviews/id224487706","version":"1.7.1","score":4,"title":"Very convenient","text":"Simple to use and functional.","updated":"2016-10-31T19:20:24-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5082393030","userName":"Prize66","userUrl":"https://itunes.apple.com/us/reviews/id194676339","version":"1.9.5","score":1,"title":"Poorly designed product","text":"App is difficult to use and navigate. Settings do not save properly and constantly need to be reset. Phillips Hue is much easier to use.","updated":"2019-11-03T17:33:36-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1558356017","userName":"Goldie8677","userUrl":"https://itunes.apple.com/us/reviews/id172287149","version":"1.7.1","score":1,"title":"Very hard to use this app","text":"This app is so difficult to use. Not intuitive at all. If you are used to apple products, you will hate this app. This product needs some instructions with the box. Not just pictures like IKEA.","updated":"2017-03-05T18:02:26-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1483466740","userName":"Katboopmag","userUrl":"https://itunes.apple.com/us/reviews/id455724875","version":"1.7.1","score":1,"title":"No title","text":"I can see why this product received such bad reviews. I've tried 3times to update and after 15 minutes each, it loops me back to the same update. Too bad, I was looking forward to this product, but I'm returning it tomorrow","updated":"2016-11-12T18:24:39-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3010664773","userName":"Jonathan L.A.","userUrl":"https://itunes.apple.com/us/reviews/id26841184","version":"1.9.5","score":1,"title":"Clunky interface / Hue far superior","text":"Mostly using Hue but we bought two rgbw30 bulbs and a light strip from paramount/sylvania with a lightify hub.  The bulbs won’t update and the software is junk.\n\nNot trying not to be a hue fanboy....but everything just worked with them","updated":"2018-08-03T03:50:32-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1738876601","userName":"Blake Gossard","userUrl":"https://itunes.apple.com/us/reviews/id113160196","version":"1.9.0","score":1,"title":"Doesn't stay logged in - who wants to log in to turn their lights on and off - lame app","text":"Won't be worth getting until it stays logged in and connected to the lights for quick operation. Otherwise it's cumbersome.","updated":"2017-08-22T04:52:02-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1620309571","userName":"findfed","userUrl":"https://itunes.apple.com/us/reviews/id137127395","version":"1.8.0","score":1,"title":"Not very stable and very buggy","text":"I have 6 lights to control, and they respond when they feel like it. It's not my WiFi. I have a very strong signal. Not worth the money. I would give the app less than 1 star, if I could.","updated":"2017-05-21T10:41:28-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1563864167","userName":"Mr.iPhone95","userUrl":"https://itunes.apple.com/us/reviews/id297315882","version":"1.7.1","score":2,"title":"Ehh","text":"The app used to work great now not so much. I can change the color without too much issue but none of the dynamic color settings work at all anymore.","updated":"2017-03-13T16:44:19-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1554345981","userName":"nickharger","userUrl":"https://itunes.apple.com/us/reviews/id171860116","version":"1.7.1","score":1,"title":"Waste of Money","text":"I wish I didn't waste my money on these bulbs from Lowe's. They do not work correctly at all. They turn on automatically at 4am and I just can't get them to stop doing that. Do not bother contacting support because no one speaks English.","updated":"2017-02-28T02:45:48-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1519417885","userName":"Trekking Turtle","userUrl":"https://itunes.apple.com/us/reviews/id166893094","version":"1.7.1","score":3,"title":"Good except....","text":"Overall I like the app except that I would like to name individual bulbs since we have multiple lights in the room.","updated":"2017-01-10T15:17:44-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2574417931","userName":"Raedlight","userUrl":"https://itunes.apple.com/us/reviews/id593169664","version":"1.9.3","score":1,"title":"Doctor","text":"It started good and then a month later I was unable to operate and updates non functional \nI can’t change a thing about these lights and now stuck with the white color only","updated":"2018-05-20T14:50:34-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1992079211","userName":"BadFritter","userUrl":"https://itunes.apple.com/us/reviews/id36708159","version":"1.9.0","score":1,"title":"Pull it together.","text":"I have spent way too much money on these lights (and I’m sure you have too) to have this mess of a system.  Alexa connection is terrible.  Lights can’t find the switches. It’s a total mess, guys. Come on! You’re better than this.","updated":"2017-12-12T19:13:08-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1498120700","userName":"Kelli Beth","userUrl":"https://itunes.apple.com/us/reviews/id38264889","version":"1.7.1","score":1,"title":"Stuck in update hell","text":"We haven't even had a chance to use the product yet, because the app continues to say it's updating. If this isn't fixed, I won't ever recommend this product to anyone.","updated":"2016-12-08T04:09:24-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1483381983","userName":"CMB e's mom","userUrl":"https://itunes.apple.com/us/reviews/id367622952","version":"1.7.1","score":1,"title":"Not Updating","text":"I bought this thinking it would be cool and helpful but I can't update. I don't know if it is my wifi speed or the app. I should be able to use it if I don't want to update. They definitely need to fix this.😡","updated":"2016-11-12T14:35:08-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1592888693","userName":"Megeek55","userUrl":"https://itunes.apple.com/us/reviews/id534496264","version":"1.8.0","score":1,"title":"Can't dim groups","text":"Please please please add the ability to dim groups. Many of us are putting multiple bulbs into a single fixture (ceiling fan in my case) and grouping the bulbs. My main goal was to be able to dim the bulbs and to have to do them individually is terrible.","updated":"2017-04-19T17:18:06-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1285343680","userName":"Warlord","userUrl":"https://itunes.apple.com/us/reviews/id36502303","version":"1.3.1","score":1,"title":"Erik","text":"Got the device and app today. Took several tries to finally pair with device but now stuck in this infinite loop of updates. Do not buy this device. Not a finished product or they just aren't trying.","updated":"2015-11-11T18:00:13-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1569750791","userName":"Amir Saud","userUrl":"https://itunes.apple.com/us/reviews/id526866564","version":"1.7.1","score":1,"title":"Disappointed","text":"I bought over 50 bulbs and have not been able to make them work. The support is overseas. I was informed they are coming up with improved hub by November. Did I do a mistake buying the product with no Support. Yes.","updated":"2017-03-21T21:28:32-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1486917021","userName":"It's Mr. Cat Daddy to you","userUrl":"https://itunes.apple.com/us/reviews/id196638161","version":"1.7.1","score":5,"title":"Holy WOW","text":"Awesome, fantastic, ❤️❤️❤️❤️LO❤️E this app & the temperature settings of the lights. I enjoy the manner in which each light can be set to flicker like candles❣❣❣","updated":"2016-11-18T16:25:43-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1436957510","userName":"Marvin Martian01","userUrl":"https://itunes.apple.com/us/reviews/id43908272","version":"1.6.1","score":3,"title":"Bare bones application","text":"This no frills app will get the job done. It would be nice to see additional features like a sunset/sunrise option for turning on and off lights.","updated":"2016-08-21T14:49:26-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3258324050","userName":"Jaydiar","userUrl":"https://itunes.apple.com/us/reviews/id42207031","version":"1.9.5","score":3,"title":"Invalid Security Token","text":"I can’t login to the apps because of a popup error “Invalid Security Token” can anyone advise how to fix this? The customer service is nonexistent for this company.","updated":"2018-10-03T01:34:41-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1798964415","userName":"4theluvofmusic","userUrl":"https://itunes.apple.com/us/reviews/id34322538","version":"1.9.0","score":1,"title":"Garbage...deserves 0 Stars","text":"Constantly having to reset all fixtures. App is clunky, not intuitive at all and I'm a gear head. I would never buy this garbage again. Spend your money elsewhere, just an awful product.","updated":"2017-09-19T16:55:23-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1471091184","userName":"ScottyTrump","userUrl":"https://itunes.apple.com/us/reviews/id37795298","version":"1.7.1","score":1,"title":"Fix the app please","text":"For as much money as these bulbs cost there is no reason they shouldn't have a functioning app. Freezes often doesn't hold settings even after you hit save","updated":"2016-10-22T05:40:48-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"4520238809","userName":"kourosh07","userUrl":"https://itunes.apple.com/us/reviews/id334848600","version":"1.9.5","score":1,"title":"Connections","text":"A lot of problems to program and still some of the bulbs do not get connected \nReally frustrating","updated":"2019-07-26T06:07:09-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1711768779","userName":"Subie88","userUrl":"https://itunes.apple.com/us/reviews/id104393317","version":"1.8.1","score":1,"title":"Needs serious work","text":"I have to completely reset my lights twice a week. The app becomes unpaired so much that I don't even use the features any more. A true let down and waste of money.","updated":"2017-08-03T17:21:46-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1496204856","userName":"mattrealtor1969","userUrl":"https://itunes.apple.com/us/reviews/id32531983","version":"1.7.1","score":1,"title":"Not worth it","text":"I couldn't be more disappointed. It took hours to set up and then I noticed an update available and I had to set up all over again. And Siri she won't work with this","updated":"2016-12-04T19:58:45-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1482265790","userName":"Gseattle","userUrl":"https://itunes.apple.com/us/reviews/id197455149","version":"1.7.1","score":1,"title":"Does not work!!","text":"Does not work after installing the lightbulb outside on the porch. Tried in my bathroom with the wake up setting & it failed. Wasted my time setting this up with hopes of it working. I will get the Hue lights instead!","updated":"2016-11-10T18:37:47-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1382138724","userName":"Nick Gooseberry","userUrl":"https://itunes.apple.com/us/reviews/id155276774","version":"1.6.0","score":1,"title":"Garbage","text":"When bought this I thought \"this is a waste of money, but could be fun.\" Turns out it's also a huge waste of time. App is garbage and nothing works. That's what you get for trying to complicate flicking a light switch.","updated":"2016-05-21T15:50:10-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"4532429097","userName":"gregsnewcc","userUrl":"https://itunes.apple.com/us/reviews/id29540052","version":"1.9.5","score":1,"title":"Not being supported.","text":"App Updates no longer work.  Lights drop off system frequently. Poorly engineered software with poor support.","updated":"2019-07-28T09:07:47-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3475283703","userName":"Gojoe1212","userUrl":"https://itunes.apple.com/us/reviews/id15108340","version":"1.9.5","score":1,"title":"Very inconsistent","text":"Some features work, others don’t and the features that do work only work some of the time. Zero technical support available and FAQs are woefully lacking. Great idea - terrible execution.","updated":"2018-11-29T16:06:46-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2443165812","userName":"Ant7871","userUrl":"https://itunes.apple.com/us/reviews/id251259092","version":"1.9.3","score":1,"title":"Stopped working with Alexa","text":"My lightify stopped working with my Alexa app.  This was a main reason for me buying them.  I am about to do a house renovation and was going to add more.  When will this issue be fixed if at all","updated":"2018-04-19T18:48:21-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1309255346","userName":"lysoleverywhere","userUrl":"https://itunes.apple.com/us/reviews/id195360541","version":"1.4.0","score":1,"title":"Worst app ever","text":"App doesnt work. I have two gateways and various Lightify devices and none of them ever connect during setup. Also all of the new features are not even in the latest app.  Way overprices for this productz Simply doesnt work.","updated":"2015-12-31T16:44:48-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1507081778","userName":"MontyW4","userUrl":"https://itunes.apple.com/us/reviews/id85553172","version":"1.7.1","score":4,"title":"So far so good","text":"Although at Lowe's very pricey for a bulb but functionality is great","updated":"2016-12-22T18:38:26-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1539626005","userName":"Ralthan","userUrl":"https://itunes.apple.com/us/reviews/id125120787","version":"1.7.1","score":1,"title":"Don't waste your time","text":"Hub does not detect the lights at all. I have updated hub to latest firmware, I have reset the lights multiple times / and still nothing. Yet - my smartthings hub has no problem detecting the lights... urgh, I should have stayed with Hue.","updated":"2017-02-07T20:00:49-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1385853454","userName":"Romulon","userUrl":"https://itunes.apple.com/us/reviews/id32009232","version":"1.6.0","score":1,"title":"Absolutely Horrible Product","text":"I purchased the OSRAM lightify product for an under cabinet lighting installation and to my dismay, the product DOES NOT WORK. I installed the app and I cannot get past the installation of updates. Without the app the lighting is useless.","updated":"2016-05-29T05:21:27-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1920523621","userName":"Cyn Lear","userUrl":"https://itunes.apple.com/us/reviews/id444623629","version":"1.9.0","score":1,"title":"Barely works","text":"As soon as it set up it works and then a half hour later it stops working until it set up again.","updated":"2017-11-14T06:42:16-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1542538519","userName":"Foodie Mac","userUrl":"https://itunes.apple.com/us/reviews/id104268614","version":"1.7.1","score":1,"title":"Lights are great but app is terrible","text":"Inconsistent performance. One bulb took 5 tries before it was recognized. There is no help documentation or how to steps once you get the lights to work. Not impressed with the software. \n\nThe color of the lights and the spectrum is great though.","updated":"2017-02-11T17:50:15-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1447885063","userName":"wv-ibmike","userUrl":"https://itunes.apple.com/us/reviews/id247340748","version":"1.7.0","score":5,"title":"Super app","text":"Love the features and so much more affordable than Phillips hue","updated":"2016-09-10T23:51:52-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3270262031","userName":"sydneeb4788","userUrl":"https://itunes.apple.com/us/reviews/id86728346","version":"1.9.5","score":1,"title":"Unbelievably confusing","text":"This is quite possibly the most un-user friendly app I’ve ever downloaded. It’s like the people that designed it never took a minute to see if it works..  absolutely TERRIBLE","updated":"2018-10-06T05:51:12-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1481661449","userName":"Bomar85","userUrl":"https://itunes.apple.com/us/reviews/id24816160","version":"1.7.1","score":1,"title":"When it works - it's ok","text":"This is my third hub & I refuse to buy another one. Every hub I've bought pairs & works great for 6 months - then it loses connection with wifi & refuses to pair again even after numerous resets & attempts to repair.","updated":"2016-11-09T15:45:13-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3638937235","userName":"Dinho615","userUrl":"https://itunes.apple.com/us/reviews/id169443903","version":"1.9.5","score":1,"title":"Terrible product.","text":"I am sorry for you who bought this product. There is no help from the support and they will ask you to contact a third party to seek help.","updated":"2019-01-11T14:13:19-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3380521194","userName":"DecaturLINY","userUrl":"https://itunes.apple.com/us/reviews/id472607875","version":"1.9.5","score":1,"title":"Big hassle","text":"Took way too much time to set up. Over and over again trying to get it to work. It will probably blink out again on me. Dreading that.","updated":"2018-11-04T08:15:12-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1784141663","userName":"Mama G2011","userUrl":"https://itunes.apple.com/us/reviews/id464436906","version":"1.9.0","score":1,"title":"Can't login","text":"For some reason, I can no longer log into the app. It keeps telling me to check my login credentials and my region. The system still works, but I can't log in to add anything.","updated":"2017-09-10T15:35:59-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1551736493","userName":"Southern NJ","userUrl":"https://itunes.apple.com/us/reviews/id264012536","version":"1.7.1","score":1,"title":"FRUSTRATING","text":"This worked fine for 2 months, then it disconnected and stopped responding.  It is very frustrating to do the setup all over e is a reason why there are soooooo many one star reviews.","updated":"2017-02-24T11:44:19-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1404650890","userName":"Morachd","userUrl":"https://itunes.apple.com/us/reviews/id103715157","version":"1.6.1","score":1,"title":"App not intuitive enough","text":"I'm completely confused by scenes versus device versus scene settings. Can get things to coordinate. And can't get a slow loop through the colors to happen based on the set schedule.","updated":"2016-07-03T04:29:39-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1369660632","userName":"Bcxxxxxx","userUrl":"https://itunes.apple.com/us/reviews/id399511574","version":"1.6.0","score":1,"title":"App doesn't work!!!! Lightify Garden Spot","text":"This used to work. Not now! Download app. It says to update 2 items. Why offer an outdated app in the first place??? Then, one update just loads & loads but never finishes. The other does nothing!","updated":"2016-04-27T07:14:49-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2452436191","userName":"Disgruntled User 9999","userUrl":"https://itunes.apple.com/us/reviews/id155093405","version":"1.9.3","score":1,"title":"Very disappointing","text":"The lights and the app are iffy.  Sometimes it works and it doesn’t.  When it works, it is very slowly.  I purchase 20 bulbs from this brand and am very disappointed","updated":"2018-04-21T21:41:04-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1650377286","userName":"Adgfjhoukg","userUrl":"https://itunes.apple.com/us/reviews/id42653084","version":"1.8.0","score":1,"title":"If I could rate it less I would","text":"Worked briefly after an hour on the phone with support then stopped and hasn't worked since.","updated":"2017-06-19T17:28:48-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1503871883","userName":"Ejs1182","userUrl":"https://itunes.apple.com/us/reviews/id125572963","version":"1.7.1","score":1,"title":"App update has shut down the app","text":"We just received the lightify starter kit and the app update is frozen which has prohibited any use in the app at all. I will be returning these products immediately","updated":"2016-12-17T18:39:20-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1452588229","userName":"Flash 5600","userUrl":"https://itunes.apple.com/us/reviews/id203246264","version":"1.7.1","score":1,"title":"will not update","text":"This app does not update or upload properly. I am unable upload directly from the site or through iTunes","updated":"2016-09-19T16:56:55-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1446430711","userName":"Mi Heffey","userUrl":"https://itunes.apple.com/us/reviews/id43123708","version":"1.7.0","score":1,"title":"Great idea, poor executed app","text":"Terrible.  Unintuitive.  Laughable.  \n\nThis app is so poorly designed it is surprising.  The color schemes on the app make certain features difficult to read.  Highly un-intuitive and poorly designed.","updated":"2016-09-08T06:13:30-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5027796251","userName":"Troy1star","userUrl":"https://itunes.apple.com/us/reviews/id18506915","version":"1.9.5","score":1,"title":"Complete Trash","text":"Why even waste time developing an app like this that doesn’t work properly 95% of the time. Not even the bulbs work properly.","updated":"2019-10-26T18:20:52-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3695013303","userName":"MAK Panda","userUrl":"https://itunes.apple.com/us/reviews/id468323660","version":"1.9.5","score":1,"title":"Not working","text":"Was working fine, now it doesn’t respond.  There’s a notification to do a software update, when I tap the Update link nothing happens.","updated":"2019-01-25T19:29:57-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1450830126","userName":"Annoyed ready to leave","userUrl":"https://itunes.apple.com/us/reviews/id153785675","version":"1.7.0","score":1,"title":"Big does not work","text":"I have played with this for over an hour. The directions were unclear about pairing this to the Wi-Fi. Once I finally got it paired to the Wi-Fi the app would never find the light. DO NOT BUY.","updated":"2016-09-16T13:41:04-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1352367222","userName":"ewitzke","userUrl":"https://itunes.apple.com/us/reviews/id189345749","version":"1.5.0","score":1,"title":"Application does not work","text":"Tried many time to do a mandatory update and did not work, therefore you can not used the feature of the lightify.\nReturning the product","updated":"2016-03-23T12:42:49-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1605668523","userName":"Tprince5","userUrl":"https://itunes.apple.com/us/reviews/id136941870","version":"1.8.0","score":1,"title":"Garbage","text":"Stopped working completely. Lights were buggy before but now don't even show up at all. None of them. Waste of time and money","updated":"2017-05-05T02:35:22-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"4520238809","userName":"kourosh07","userUrl":"https://itunes.apple.com/us/reviews/id334848600","version":"1.9.5","score":1,"title":"Connections","text":"A lot of problems to program and still some of the bulbs do not get connected \nReally frustrating","updated":"2019-07-26T06:07:09-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1760102137","userName":"737488257849577284957","userUrl":"https://itunes.apple.com/us/reviews/id589176341","version":"1.9.0","score":1,"title":"REALLY","text":"I thought this was going to be a good app I spent $40 for this price of crap that can't even connect I tried at least a million times but I can't connect don't make my mistake DO NOT BUY IT!!!!!","updated":"2017-08-29T15:13:42-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"4532429097","userName":"gregsnewcc","userUrl":"https://itunes.apple.com/us/reviews/id29540052","version":"1.9.5","score":1,"title":"Not being supported.","text":"App Updates no longer work.  Lights drop off system frequently. Poorly engineered software with poor support.","updated":"2019-07-28T09:07:47-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1797217556","userName":"Rollingwood","userUrl":"https://itunes.apple.com/us/reviews/id543434561","version":"1.9.0","score":1,"title":"App is absolutely horrible!!","text":"I understand tech pretty dang well but this app is as unintuitive as I've ever seen. Plus, the dang thing barely does what I want it to do. Please hire a new app developer and start from scratch - smh","updated":"2017-09-18T17:24:16-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1528273249","userName":"Leo. G","userUrl":"https://itunes.apple.com/us/reviews/id123801417","version":"1.7.1","score":1,"title":"Poor execution. Doesn't work with Alexa.","text":"Can't change color or scene on a group of bulbs. \nDoesn't work with Alexa unless you cough up another $90. \n\nStay with Philips Hue. \nWorks better and executes more efficiently.","updated":"2017-01-22T12:30:21-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1402660033","userName":"jamescarballo","userUrl":"https://itunes.apple.com/us/reviews/id34521369","version":"1.6.1","score":5,"title":"Awesome App","text":"Worked beyond what I was expecting.  Fantastic.","updated":"2016-06-29T18:15:03-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1283867575","userName":"WariusDalker","userUrl":"https://itunes.apple.com/us/reviews/id132544509","version":"1.3.1","score":3,"title":"Some Bugs","text":"Overall good app, but please fix the dimmer, sometimes it performs a smooth dim, and at random times it performs a choppy dim.","updated":"2015-11-08T09:36:49-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3370350124","userName":"OR1978","userUrl":"https://itunes.apple.com/us/reviews/id38880470","version":"1.9.5","score":2,"title":"No support","text":"This app is terrible.  It needs an update to support iOS 12.  Is there any plans for this?  Very disappointed with this app.","updated":"2018-11-01T17:43:39-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1567382969","userName":"Avmac50","userUrl":"https://itunes.apple.com/us/reviews/id426421220","version":"1.7.1","score":1,"title":"App Doesn't Work","text":"Scheduler doesn't work. Cannot delete schedule created. The app in general needs work because many features don't work.","updated":"2017-03-18T15:09:25-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1452476993","userName":"mvijayan","userUrl":"https://itunes.apple.com/us/reviews/id28188857","version":"1.7.1","score":3,"title":"A bit quirky but good","text":"A few idiosyncratic features but a good solid start. But please PLEASE add Apple HomeKit integration. This would be huge!!!","updated":"2016-09-19T10:28:47-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1452710125","userName":"Sunny21289","userUrl":"https://itunes.apple.com/us/reviews/id267395015","version":"1.7.1","score":1,"title":"Scenes don't work properly","text":"None of my scenes are applied properly & light take ages to respond to any changes in brightness or colour. Really frustrating & disappointing. Philips rgb lights are much better.","updated":"2016-09-19T22:37:06-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1432966807","userName":"Mikethecarguy","userUrl":"https://itunes.apple.com/us/reviews/id27379703","version":"1.6.1","score":1,"title":"Works great!","text":"Worked great initially until update time. System goes out of sync all the time. I've spent hours resetting this many times and now it won't reset. DO NOT BUY!","updated":"2016-08-14T14:56:43-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1722378975","userName":"Wolfboi7","userUrl":"https://itunes.apple.com/us/reviews/id461831578","version":"1.8.1","score":1,"title":"Useless very limited poorly designed","text":"Title says it all no help website \"under construction\" little to no features and no assistance to show u how to navigate the app","updated":"2017-08-10T20:07:14-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1487334413","userName":"Desibartender","userUrl":"https://itunes.apple.com/us/reviews/id8540784","version":"1.7.1","score":1,"title":"Unable to update.","text":"Tried everything but the hub and lights fail to upgrade. No error messages either. Totally frustrated.","updated":"2016-11-19T07:12:59-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"4846144936","userName":"JoeD1234567890","userUrl":"https://itunes.apple.com/us/reviews/id476639086","version":"1.9.5","score":1,"title":"Needs an update","text":"The app is calling for the SSID on my gateway, but I get an error that I’m not connected to the correct SSID because warning window shows a 02 infront of the SSID.  Guessing an issue with IOS 13.0","updated":"2019-09-27T05:22:49-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1730277525","userName":"JokerQue","userUrl":"https://itunes.apple.com/us/reviews/id412745060","version":"1.9.0","score":1,"title":"The worst","text":"This app is horrible, lights won't stay connected, app had an update that it won't accept, so I am returning all of this mess. Several hundred dollars and it's all junk.","updated":"2017-08-16T06:03:08-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1344902850","userName":"SeaEles","userUrl":"https://itunes.apple.com/us/reviews/id22641888","version":"1.5.0","score":1,"title":"Doesn't work","text":"App only found one light, the one it came with, but not the other 2 Purchased.  Deleting app and returning lights.  No wonder they were halt off.","updated":"2016-03-08T13:43:10-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2680775183","userName":"Spudley NY","userUrl":"https://itunes.apple.com/us/reviews/id637381075","version":"1.9.4","score":1,"title":"Great bulbs, horrible controls","text":"The bulbs have great color and a bright white. No complaints with the physical product. The app and ZB controls are horrible and do not play well with full home automation systems.","updated":"2018-06-12T01:58:45-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1789652288","userName":"Bothrops7","userUrl":"https://itunes.apple.com/us/reviews/id120418686","version":"1.9.0","score":1,"title":"Terrible app!","text":"One bulb started flashing when turned on. Tried everything and finally did a system reset. Now the gateway won't pair any of my 5 bulbs.","updated":"2017-09-14T05:57:46-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1497851572","userName":"Lioneye9","userUrl":"https://itunes.apple.com/us/reviews/id388673764","version":"1.7.1","score":1,"title":"What a waste","text":"Okay product horrible app, unfortunately that ruins it for me. As others said no support and a poorly preforming app that cannot complete its built in functions","updated":"2016-12-07T18:27:18-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1332462077","userName":"Mstone5056","userUrl":"https://itunes.apple.com/us/reviews/id201372397","version":"1.4.0","score":1,"title":"Upgrade?","text":"In app upgrade won't download so can't use the app or control my lights spent close to 2 grand on light would like them to work. Please fix your app","updated":"2016-02-13T10:05:23-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1303083302","userName":"Davep71965","userUrl":"https://itunes.apple.com/us/reviews/id141444445","version":"1.4.0","score":1,"title":"Upgrade not good","text":"Can't get the app to work at all. Deleted everything and tried to get it reinstalled and it won't set up again","updated":"2015-12-19T14:25:15-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2284295292","userName":"Gypse Boxten","userUrl":"https://itunes.apple.com/us/reviews/id350805606","version":"1.9.2","score":1,"title":"Quit connecting to AP","text":"Worked flawlessly for 2 months. Then, for no reason, stopped connecting to my AP.  Terrible app. Terrible customer support. Huge waist of money.","updated":"2018-03-08T06:44:58-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1994318707","userName":"EECSProf","userUrl":"https://itunes.apple.com/us/reviews/id273125720","version":"1.9.0","score":1,"title":"Excellent lights; dreadful software","text":"Scenes are flakey, the UI is one of the worst I've ever used.  I'm trying right now to figure out how to add a device to an existing scene, and it doesn't seem possible.","updated":"2017-12-13T15:43:14-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3002313921","userName":"aftuhvfd","userUrl":"https://itunes.apple.com/us/reviews/id875699902","version":"1.9.5","score":1,"title":"Money waste buying this product","text":"Always goes offline","updated":"2018-08-01T11:19:13-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1511973537","userName":"Royale Dressage","userUrl":"https://itunes.apple.com/us/reviews/id33250596","version":"1.7.1","score":1,"title":"Avoid.","text":"What a huge waste of time. Clunky software.  Endless updates. What update takes 15 minutes a pop?","updated":"2016-12-30T04:12:15-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1468440935","userName":"Srndpt","userUrl":"https://itunes.apple.com/us/reviews/id31275702","version":"1.7.1","score":4,"title":"Missing IFTTT integration with Osram Gateway","text":"Would rate 5-stars if had IFTTT channel","updated":"2016-10-17T09:17:12-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3002313921","userName":"aftuhvfd","userUrl":"https://itunes.apple.com/us/reviews/id875699902","version":"1.9.5","score":1,"title":"Money waste buying this product","text":"Always goes offline","updated":"2018-08-01T11:19:13-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1511973537","userName":"Royale Dressage","userUrl":"https://itunes.apple.com/us/reviews/id33250596","version":"1.7.1","score":1,"title":"Avoid.","text":"What a huge waste of time. Clunky software.  Endless updates. What update takes 15 minutes a pop?","updated":"2016-12-30T04:12:15-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1352348435","userName":"Octobear","userUrl":"https://itunes.apple.com/us/reviews/id124411986","version":"1.5.0","score":1,"title":"Update Issue","text":"Same issue as all the others, the app requires an update within it but it won't update.","updated":"2016-03-23T11:39:32-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2002686767","userName":"Edutecher","userUrl":"https://itunes.apple.com/us/reviews/id132155304","version":"1.9.0","score":1,"title":"Not working","text":"Will not find all my bulbs. Cannot connect to Alexa app. Philips hue system works much better...wish I had not bought so many sylvania.","updated":"2017-12-16T20:13:27-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1544688170","userName":"joshuableu","userUrl":"https://itunes.apple.com/us/reviews/id138390630","version":"1.7.1","score":1,"title":"Truly Terrible","text":"It works less than 50% of the time.   You can set a maximum of 6 scenes!   Update, per support, is 'coming' !   PLEASE DONT BUY LIGHTIFY.  The only way that Sylvania will understand is if sales stop.","updated":"2017-02-14T20:11:49-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1349797810","userName":"martinsva","userUrl":"https://itunes.apple.com/us/reviews/id42347696","version":"1.5.0","score":1,"title":"Confused","text":"Same problems as others with fw update, then reset gw, but can not reset app, always force to update, but gt not connected to wifi anymore","updated":"2016-03-18T11:54:51-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1429469034","userName":"MarinFan","userUrl":"https://itunes.apple.com/us/reviews/id18286270","version":"1.6.1","score":2,"title":"Working well","text":"Vacation mode just gives errors and will not enable.","updated":"2016-08-08T16:10:43-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1391736534","userName":"street crime unit","userUrl":"https://itunes.apple.com/us/reviews/id119115353","version":"1.6.1","score":1,"title":"What a piece of junk","text":"Don't buy this! Countless resets and still does not work at all the way it should. What a waste of money! I wish I could return it!","updated":"2016-06-09T15:28:16-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1574128434","userName":"DanValdivia","userUrl":"https://itunes.apple.com/us/reviews/id100224379","version":"1.8.0","score":1,"title":"No Apple Home support.","text":"No Apple Home support and the widget for the app stops working every other month until a new update is released.","updated":"2017-03-27T15:15:41-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1493120016","userName":"BigDawg6169","userUrl":"https://itunes.apple.com/us/reviews/id411856612","version":"1.7.1","score":1,"title":"Bulb doesn't work","text":"I've tried two bulbs and they both turn themselves off  I will be returning the product tomorrow","updated":"2016-11-29T17:04:45-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1453090028","userName":"Friendly neighborhood salesman","userUrl":"https://itunes.apple.com/us/reviews/id490401819","version":"1.7.1","score":1,"title":"Mr.","text":"Got a bunch of these as a sample through work(electrical supply co.) would not sell any of this product to a customer. Save your money the app is awful and the lamps are way over priced!","updated":"2016-09-20T14:53:00-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1442504942","userName":"Natertater1701","userUrl":"https://itunes.apple.com/us/reviews/id216317312","version":"1.7.0","score":1,"title":"Not worth the price","text":"Force and slow update makes the light not work right. The app is also. Very badly made.","updated":"2016-08-31T16:46:04-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1511022296","userName":"trippfay","userUrl":"https://itunes.apple.com/us/reviews/id32749321","version":"1.7.1","score":1,"title":"Hardly useable","text":"Everything from the performance on the bulbs to the (lack of) function of the app is painful. I'm tearing out everything I installed and ordering Phillips Hue.","updated":"2016-12-28T17:26:15-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1442586193","userName":"Unhappy ....","userUrl":"https://itunes.apple.com/us/reviews/id522607265","version":"1.7.0","score":1,"title":"Was working good but not now","text":"The recent app upgrade of August 31 does not work. App opens and immediately closes. Your equipment is useless without it. Please fix ASAP!","updated":"2016-08-31T20:39:12-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1716940850","userName":"Sahewdg","userUrl":"https://itunes.apple.com/us/reviews/id202066698","version":"1.8.1","score":1,"title":"Is very hard to fix once it's been knocked offline","text":"I actually really hate this, was a good idea but somehow it failed","updated":"2017-08-07T02:55:07-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1444693822","userName":"Jubilee Joel","userUrl":"https://itunes.apple.com/us/reviews/id6421775","version":"1.7.0","score":1,"title":"App won't stay open long enough to do anything","text":"App won't stay open long enough to do anything. Taking the kit back to Lowe's","updated":"2016-09-04T18:52:06-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1656526566","userName":"RMS6621","userUrl":"https://itunes.apple.com/us/reviews/id105822396","version":"1.8.0","score":1,"title":"Junk! SCAM !","text":"You must buy the gateway in order to set up an account and make the light turn on!\nRip off.\nI did return for a refund.","updated":"2017-06-24T19:24:51-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1515410129","userName":"philion","userUrl":"https://itunes.apple.com/us/reviews/id24202289","version":"1.7.1","score":1,"title":"Nope.","text":"Just doesn't work. I've spent a couple of days now trying to get it to work. Nope. And no support, either. Waste of time and money.","updated":"2017-01-04T13:18:53-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1391197531","userName":"Copper fish","userUrl":"https://itunes.apple.com/us/reviews/id279348441","version":"1.6.1","score":1,"title":"Junk","text":"Total junk. Spent five hours trying to update the firmware. With multiple resets. Still won't work. Returning it. Don't waist your money.","updated":"2016-06-08T16:37:59-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1316456211","userName":"Khmallard","userUrl":"https://itunes.apple.com/us/reviews/id4253023","version":"1.4.0","score":1,"title":"M","text":"Can someone help me with this app? It crashes when it's looking for my home network and I can't get past that. Is it me or the app?","updated":"2016-01-14T11:44:15-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3370665108","userName":"BK is me","userUrl":"https://itunes.apple.com/us/reviews/id464088238","version":"1.9.5","score":1,"title":"Doesn’t work 1/2 the time","text":"Very frustrating lights only work half the time😐","updated":"2018-11-01T19:51:29-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2188622299","userName":"mannybre","userUrl":"https://itunes.apple.com/us/reviews/id476679827","version":"1.9.1","score":1,"title":"Help me","text":"Went to set it you and said already have a linked account","updated":"2018-02-09T16:24:53-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1478415663","userName":"BobbyM24","userUrl":"https://itunes.apple.com/us/reviews/id274128805","version":"1.7.1","score":1,"title":"Stuck on help screen","text":"Help screen on top of actual app does not go away. Annoying!","updated":"2016-11-04T05:47:37-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1605410821","userName":"arpytoo","userUrl":"https://itunes.apple.com/us/reviews/id49597781","version":"1.8.0","score":1,"title":"fragile","text":"... with less-than-straightforward reset/recovery features/documentation. might suggest that, while the hardware seems sound, the software seems to be not quite ready for general consumer use and the (english language) documentation could benefit from review/editing by a native-speaking professional","updated":"2017-05-04T21:28:00-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2970134826","userName":"Abub14","userUrl":"https://itunes.apple.com/us/reviews/id171720988","version":"1.9.5","score":1,"title":"Buggy","text":"Doesn’t connect to the gateway or the devices. Buggy App and product.","updated":"2018-07-25T21:34:32-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3482459105","userName":"stevehops","userUrl":"https://itunes.apple.com/us/reviews/id11246606","version":"1.9.5","score":1,"title":"Doesn’t work most of the time","text":"No customer service. Don’t buy.","updated":"2018-12-01T11:59:24-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3305786803","userName":"AmsterQ","userUrl":"https://itunes.apple.com/us/reviews/id32480811","version":"1.9.5","score":1,"title":"Totally unreliable","text":"Every updates screws everything up.","updated":"2018-10-15T12:52:29-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1495441925","userName":"Dissatisfied customer 65323556","userUrl":"https://itunes.apple.com/us/reviews/id422132528","version":"1.7.1","score":1,"title":"Don't waste your money.","text":"Slow, clunky, hardly responsive app. No where near worth the money.","updated":"2016-12-03T13:19:21-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1447298990","userName":"Brandoanimal","userUrl":"https://itunes.apple.com/us/reviews/id172884058","version":"1.7.0","score":1,"title":"Absolutely terrible","text":"Just garbage! Connectivity issues every step of the way!!","updated":"2016-09-09T23:16:44-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2591069754","userName":"jmsdallas","userUrl":"https://itunes.apple.com/us/reviews/id168235119","version":"1.9.4","score":1,"title":"Terrible","text":"Won’t work at all with Alexa now. Stand alone iPhone app works but cannot remove groups.","updated":"2018-05-24T12:52:51-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2002162066","userName":"Mulehead","userUrl":"https://itunes.apple.com/us/reviews/id38488760","version":"1.9.0","score":1,"title":"Avoid at all cost","text":"The app goes offline all the time.  The lights stop responding daily and now on sits and blinks.  The worst system I have ever owned.","updated":"2017-12-16T15:30:06-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1732382356","userName":"Tommycheek","userUrl":"https://itunes.apple.com/us/reviews/id234614207","version":"1.9.0","score":1,"title":"Buggy mess","text":"Very poor in every aspect after last update.","updated":"2017-08-17T19:36:39-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1517442059","userName":"Paul Bryman","userUrl":"https://itunes.apple.com/us/reviews/id461874013","version":"1.7.1","score":1,"title":"Not user friendly at all","text":"Very disappointed.","updated":"2017-01-07T15:47:45-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3600236639","userName":"Me23hydtx","userUrl":"https://itunes.apple.com/us/reviews/id127081061","version":"1.9.5","score":1,"title":"Terrible","text":"Spent much less Monet on WiFi plugs and bulbs that do not need a gateway....they work....this is a piece of junk....don’t waste your money","updated":"2019-01-01T09:41:29-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1297038337","userName":"Evilbuggs","userUrl":"https://itunes.apple.com/us/reviews/id481869117","version":"1.3.1","score":1,"title":"Cool idea if it worked.","text":"Just not user friendly. I can't get pass the thing updating.","updated":"2015-12-06T17:46:58-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1568166473","userName":"razrbakwrangler","userUrl":"https://itunes.apple.com/us/reviews/id42065791","version":"1.7.1","score":1,"title":"Extremely hard to set up","text":".","updated":"2017-03-19T16:20:16-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1477063460","userName":"Bokehgirl52","userUrl":"https://itunes.apple.com/us/reviews/id301964505","version":"1.7.1","score":1,"title":"Constantly failing","text":"It fails so much that bulbs never stay wking and being disabled this is very frustrating!!!","updated":"2016-11-01T20:07:53-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1401328131","userName":"Mike Honcho 3000","userUrl":"https://itunes.apple.com/us/reviews/id24278811","version":"1.6.1","score":5,"title":"Recent review","text":"After reading several bad reviews and a couple recent good ones, I decided to give the lights and the app a shot.  I bought a starter kit at the hardware store and downloaded the app.  After setting up the network, which was simple, and downloading a few firmware updates, everything worked flawlessly.  I've since purchased several more lights for the house.  I assume a recent update solved whatever bugs people were complaining about earlier.\n\nThe lights are wirelessly controlled from your phone with the app, and are dimmable.  You can also adjust the color temperature from soft white to daylight, 2700k-6500k, on bulbs which come with that option.\n\nThe app allows you to control lights individually, group lights by room, and set various scenes.  It enables you to set schedules and program vacation modes, but my favorite feature is the morning wake-up...it's hard to beat waking up to the lights in your bedroom slowly coming on over the course of 20 minutes.  I'll take that over a jarring alarm clock any day.  It also has sounds you can pair with this feature that are supposed to play from your phone, such as chirping birds, but I haven't gotten that to work yet.  If the program has a bug, this is the only one I've found so far.  I'd like to try it once it's fixed.\n\nMy only suggestion, aside from fixing the audible portion of the morning wake-up, would be to allow programming of scenes or somehow more intuitively set the ending color temperature and brightness level for the wake-up feature.\n\nBut overall a great start on what I think will be the future of home lighting, and I'm definitely grateful for the improved start to my day.","updated":"2016-06-27T08:53:52-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2030417397","userName":"irishkid90","userUrl":"https://itunes.apple.com/us/reviews/id217808436","version":"1.9.1","score":1,"title":"Color Loop Does Not Work","text":"Color looping doesn’t work and there are no other apps to make it loop.  Save time and just buy HUE","updated":"2017-12-26T16:47:37-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1379256945","userName":"Resident4545","userUrl":"https://itunes.apple.com/us/reviews/id161123475","version":"1.6.0","score":1,"title":"Doesn't work","text":"Updates refuse to install, but are mandatory, so nothing works. How can they sell this!?","updated":"2016-05-15T16:08:19-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2070083711","userName":"pliskan","userUrl":"https://itunes.apple.com/us/reviews/id143811486","version":"1.9.1","score":2,"title":"Will not stay on settings that I set as default.","text":"Y","updated":"2018-01-08T12:53:24-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1560954247","userName":"Phynigan","userUrl":"https://itunes.apple.com/us/reviews/id162548701","version":"1.7.1","score":1,"title":"One of the worst","text":"Day after day, week after week...reinstall, reregister, connect disconnect reconnect, waiting...waiting...waiting...POS!","updated":"2017-03-09T14:37:26-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1723948260","userName":"Murdock630","userUrl":"https://itunes.apple.com/us/reviews/id107647859","version":"1.9.0","score":2,"title":"Not happy","text":"Not happy.. lights won't stay connected","updated":"2017-08-11T20:47:56-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1577408584","userName":"batmancooldude","userUrl":"https://itunes.apple.com/us/reviews/id184773886","version":"1.7.1","score":1,"title":"Doesn't work","text":"The system doesn't work. The lights are not detected on wifi. It's hopeless.","updated":"2017-03-31T14:02:15-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1392688411","userName":"Jase298","userUrl":"https://itunes.apple.com/us/reviews/id144345281","version":"1.6.1","score":1,"title":"Do not buy their product.","text":"Disgrace of all German companies. 20 fkng tries just to turn off the lights.","updated":"2016-06-11T07:23:56-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2007784792","userName":"Mosh5150","userUrl":"https://itunes.apple.com/us/reviews/id259180657","version":"1.9.0","score":1,"title":"Horrible","text":"Avoid lightify unless you want to constantly trouble shoot your lights joy!","updated":"2017-12-18T17:39:15-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1689517115","userName":"oddjob54321","userUrl":"https://itunes.apple.com/us/reviews/id34731096","version":"1.8.1","score":4,"title":"Works for me","text":"I'm happy","updated":"2017-07-19T16:30:30-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1679844431","userName":"CamoMantis","userUrl":"https://itunes.apple.com/us/reviews/id136230771","version":"1.8.1","score":1,"title":"Crap product, crap app","text":"Don't buy this product, it is horrible","updated":"2017-07-12T17:00:50-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1605704388","userName":"Richiebee48","userUrl":"https://itunes.apple.com/us/reviews/id114741924","version":"1.8.0","score":1,"title":"Terrible","text":"I can't emphasize enough how awful this system is.  I wish I could give it negative stars.  I've had it in my house for over 2 months now. When I first put the system in, everything worked as advertised. I was able to create groups and schedule times for lights to come on and even controlled all of my lighting using my Alexa dot. Loved it. That lasted about 2 weeks. I started noticing lights randomly coming on outside their schedule and at times not responding to commands. After about a week of that, I decided to reset the gateway and that's when it all fell apart.  I have 6 lights in my home and now NONE of them will show up in the app no matter what I do. Ive tried to follow all the instructions through the technical support and through google research to fix this but nothing has worked. I've reset the gateway a dozen times. I've deleted and reloaded the app just as many times. The gateway will successfully connect to my wifi but none of the lights will show up in the discover area of the app no matter what I do.  I've reset my wifi system but nothing I've done has changed anything, the lights will never show up in the app any longer. \nOh, and the reset selection in the app now does not respond when I click on it. The app keeps telling me stupid things like I can't create any more groups because my groups are full when I have NO groups created. It tells me to upgrade my firmware but when I click on that option, It does not respond. \nI'm totally frustrated because I've emailed customer support and got nothing back except the thank you for your email response. I'm so glad I used a gift card from Lowes to buy this system because I don't have much invested accept my time and that is to valuable to mess with this anymore. How does it go from working perfectly to not working at all??  After 2 weeks of messing with this and completely reinstalling everything from the beginning and getting zero results, I'm done with this stupid system. \nI should have listened to the reviews here but I thought I could make this work. Don't buy this, you will be so disappointed.","updated":"2017-05-05T03:23:22-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2277669773","userName":"Albertralston","userUrl":"https://itunes.apple.com/us/reviews/id188838696","version":"1.9.2","score":4,"title":"Technical support saved the day!","text":"I bought this system over a year ago to control he brightness of our entry light, which is on the same switch as the lights on our gatepost and walkway lights.  The entry light is in the ceiling, and I wanted to use the LED faux-can light replacement as a solid structure to cover the hole in the ceiling, so wasps and critters couldn’t get in there.\n\nThe problem with this is that conventional LED replacement lights for can fixtures are all very bright (65-watt equivalents) and usually 3000K or whiter light, and I wanted something about 25-watt equivalent and 2700K.  The Lightify system allowed me to tune my LED can light replacement to 20% brightness and 2700K and then keep it that way after I turned the power off and back on at the switch.\n\nIt worked fine for about a year, and then all of a sudden quit controlling the brightness, thus making a blinding 100% bright light come on every time I turned on the switch.  It did keep the 2700K setting.  I could still dim it to 20% with the app, but that was very bothersome.\n\nSo I emailed tech support, and Stephan responded quickly, saying that my light had not upgraded properly and thus couldn’t \"remember\" my custom dimmer setting as the default.  He said it would require my leaving the light on so that he could downgrade the light, thus allowing me to re-upgrade the app and light.\n\nIt took a while for us to coordinate on the fix (mostly my fault), since tech support is 6 hours earlier than my Eastern time zone in the US, but, once we finally got synced up, he performed the operation.\n\nI re-upgraded and set the 20% brightness/2700K settings as the default (in the \"device\" option at the bottom of the app—just customize your settings, tap the light switch icon at the top right of the app, and follow the prompts to \"add\" the custom defaults).  Now it works again the way it always used to, so I’m very satisfied.\n\nObviously, the system shouldn’t have done this to begin with, so 4 stars not 5, but tech support really came through and went the extra mile to make it work.  Before you rate this product too low, check with tech support.  You may just need to get your lights reprogrammed from the source!","updated":"2018-03-06T09:35:05-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1605704388","userName":"Richiebee48","userUrl":"https://itunes.apple.com/us/reviews/id114741924","version":"1.8.0","score":1,"title":"Terrible","text":"I can't emphasize enough how awful this system is.  I wish I could give it negative stars.  I've had it in my house for over 2 months now. When I first put the system in, everything worked as advertised. I was able to create groups and schedule times for lights to come on and even controlled all of my lighting using my Alexa dot. Loved it. That lasted about 2 weeks. I started noticing lights randomly coming on outside their schedule and at times not responding to commands. After about a week of that, I decided to reset the gateway and that's when it all fell apart.  I have 6 lights in my home and now NONE of them will show up in the app no matter what I do. Ive tried to follow all the instructions through the technical support and through google research to fix this but nothing has worked. I've reset the gateway a dozen times. I've deleted and reloaded the app just as many times. The gateway will successfully connect to my wifi but none of the lights will show up in the discover area of the app no matter what I do.  I've reset my wifi system but nothing I've done has changed anything, the lights will never show up in the app any longer. \nOh, and the reset selection in the app now does not respond when I click on it. The app keeps telling me stupid things like I can't create any more groups because my groups are full when I have NO groups created. It tells me to upgrade my firmware but when I click on that option, It does not respond. \nI'm totally frustrated because I've emailed customer support and got nothing back except the thank you for your email response. I'm so glad I used a gift card from Lowes to buy this system because I don't have much invested accept my time and that is to valuable to mess with this anymore. How does it go from working perfectly to not working at all??  After 2 weeks of messing with this and completely reinstalling everything from the beginning and getting zero results, I'm done with this stupid system. \nI should have listened to the reviews here but I thought I could make this work. Don't buy this, you will be so disappointed.","updated":"2017-05-05T03:23:22-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1349809378","userName":"Lordhavemercy6","userUrl":"https://itunes.apple.com/us/reviews/id497050684","version":"1.5.0","score":1,"title":"Wasted time","text":"Upgrade loop. Do not try with iOS 9.2.1 if you did try, return asap.","updated":"2016-03-18T12:35:11-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1467216804","userName":"Cache53","userUrl":"https://itunes.apple.com/us/reviews/id86364796","version":"1.7.1","score":1,"title":"Difficult to use","text":"Im an engineer and I can't figure out how to use this app. Needs a redesign badly","updated":"2016-10-15T07:26:33-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1409265741","userName":"Dane1955","userUrl":"https://itunes.apple.com/us/reviews/id100274678","version":"1.6.1","score":1,"title":"Poor App","text":"Don't bother with this app, poor design and hard to understand.","updated":"2016-07-10T14:18:14-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1459324669","userName":"Aalexthegamereviewer","userUrl":"https://itunes.apple.com/us/reviews/id334351768","version":"1.7.1","score":5,"title":"It rocks","text":"I love it","updated":"2016-10-01T17:01:16-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2450140165","userName":"tgdre","userUrl":"https://itunes.apple.com/us/reviews/id423231070","version":"1.9.3","score":1,"title":"Not working with Alexa","text":"Doesn’t work with Alexa anymore. What a waste of money.","updated":"2018-04-21T08:29:44-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2380145452","userName":"tpauly","userUrl":"https://itunes.apple.com/us/reviews/id27741610","version":"1.9.3","score":2,"title":"App is weak","text":"The lights are fine and the color is good but the app is sooo clunky.","updated":"2018-04-03T14:10:46-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1522230890","userName":"Vampyrvet","userUrl":"https://itunes.apple.com/us/reviews/id33862211","version":"1.7.1","score":1,"title":"NO Stars!","text":"I bought several Osram smart bulbs and a smart-things hub to control them. The smart-things hub was fine but I was disappointed because I could not find a way to use Alexa voice commands to change the colors of the bulbs. So I bought an Osram hub, hoping it would solve the problem, then I installed their app. Not only did it not solve the voice command-color control problem, but the controls are so confusing and awkward that I found the app extremely frustrating to use. I'm a person of average computer intelligence, and I cannot figure out how to accomplish what I want with the Osram app, versus the SmartThings app which I found to be extremely easy and user-friendly. The Osram App seems to offer no advantages over smart-things, and I don't see the point in having both so I will be sending their hub back and staying with smart-things which is much more versatile and can do much more than just control light bulbs. \n\nOsram loses another star due to their lack of email tech-support and non-searchability of their support forums.  And I deducted another star for their lack of IFTT support, which seems like it should be mandatory for any home automation product. Seems to me like their software and presentation isn't quite finished yet.  Good thing I got the bulbs on Black Friday sale, or I'd be sending those back too and exchanging for something that performs as promised\n\nAddendum: Jan 14, 2017. Lightify suddenly stopped working with Alexa voice control today. Attempts at troubleshooting only resulted in a \"API internal server error\". Customer service only available Monday through Friday from 8 to 5, so since I work for a living I won't to be able to contact them. Other users are reporting the same issue on Alexa forums. I highly advise everyone to avoid Osram products until these issues are resolved","updated":"2017-01-14T14:39:04-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"2002243384","userName":"Scottieb2","userUrl":"https://itunes.apple.com/us/reviews/id236248890","version":"1.9.0","score":1,"title":"Terrible is the only word","text":"Worthless","updated":"2017-12-16T16:17:51-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1568239150","userName":"Raulgsr","userUrl":"https://itunes.apple.com/us/reviews/id100989117","version":"1.7.1","score":1,"title":"Very unstable full of bugs","text":"Cmon guys take time to fix this app","updated":"2017-03-19T19:16:54-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1657627997","userName":"Jfarris0499","userUrl":"https://itunes.apple.com/us/reviews/id38520422","version":"1.8.0","score":1,"title":"App is horrible!","text":"Would be nice if it worked...","updated":"2017-06-25T17:23:07-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1350351037","userName":"Update Loop","userUrl":"https://itunes.apple.com/us/reviews/id186454487","version":"1.5.0","score":1,"title":"Update H!?@\"","text":"Is Tech support even reading these reviews? Looking at date stamps thinking no!","updated":"2016-03-19T13:05:17-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1738695481","userName":"Al1941","userUrl":"https://itunes.apple.com/us/reviews/id169641106","version":"1.9.0","score":1,"title":"Rarely works","text":"Crashes, resets and scheduler does not work. Would be graded \"F\" if done by middle schoolers as homework.","updated":"2017-08-22T03:17:33-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1755573458","userName":"drlong","userUrl":"https://itunes.apple.com/us/reviews/id43270444","version":"1.9.0","score":1,"title":"Junk!","text":"Total waste of money and time!\nDO Not BUY!","updated":"2017-08-27T19:22:46-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1760238281","userName":"hax0rmort","userUrl":"https://itunes.apple.com/us/reviews/id100613442","version":"1.9.0","score":5,"title":"Works, LEDVANCE is a good company","text":"I support this LEDVANCE, Sylvania, and OSRAM 🇺🇸","updated":"2017-08-29T16:55:53-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1931243115","userName":"BBraun","userUrl":"https://itunes.apple.com/us/reviews/id35173885","version":"1.9.0","score":1,"title":"Horrible","text":"This app is crap. Renders the Osram lights much less functional.","updated":"2017-11-18T17:06:58-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1556157367","userName":"Vengeful shepherd","userUrl":"https://itunes.apple.com/us/reviews/id174004320","version":"1.7.1","score":1,"title":"Terrible - There are NO SCENES","text":"The user guide explains how to set up scenes. But there are no scenes in the iOS version of the app.","updated":"2017-03-02T18:26:07-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1512194025","userName":"Igorkiev72","userUrl":"https://itunes.apple.com/us/reviews/id190086064","version":"1.7.1","score":1,"title":"Just plain bad","text":"Poorly written. Period.","updated":"2016-12-30T12:01:33-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"4591835554","userName":"samsntha a","userUrl":"https://itunes.apple.com/us/reviews/id719508611","version":"1.9.5","score":1,"title":"No","text":"Doesn’t ever connect","updated":"2019-08-09T09:46:54-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1616652020","userName":"cunninghamj","userUrl":"https://itunes.apple.com/us/reviews/id3923809","version":"1.8.0","score":1,"title":"Fickle","text":"Is fickle... logs me out often... password reset failing... I'm often resetting base unit at outlet.","updated":"2017-05-17T18:13:50-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3756456525","userName":"Dkfdk11","userUrl":"https://itunes.apple.com/us/reviews/id456011307","version":"1.9.5","score":1,"title":"AWFUL","text":"THE LIGHTS DO. NOT. WORK. Please don’t buy these, they are too buggy.","updated":"2019-02-10T20:20:37-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1301793675","userName":"⚡️ iThor ⚡️","userUrl":"https://itunes.apple.com/us/reviews/id132497515","version":"1.4.0","score":1,"title":"No HomeKit and Siri","text":"New update, but still no HomeKit integration and no Siri control!","updated":"2015-12-17T01:06:14-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1460632657","userName":"Ur dad911","userUrl":"https://itunes.apple.com/us/reviews/id248436605","version":"1.7.1","score":5,"title":"Awesome!","text":"This is super chill! Love it!","updated":"2016-10-03T20:58:36-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1542316633","userName":"Sowellus","userUrl":"https://itunes.apple.com/us/reviews/id211787233","version":"1.7.1","score":1,"title":"Good concept / poor performance","text":"I bought these at Lowe's because I wanted to have the ability to program the outdoor lights at the house. It said that everything worked off Wi-Fi and was user-friendly.\n\nHere's what I found out. The lights are indeed easy to install. They work like any normal lightbulb. You screw them in you turn them on and off. Where this product miserably fails is the programming of the gateway and connection to the lights. \n\nLet's start with the app. The app itself is easy enough to download and the features are easy enough to figure out to program the lights and to connect them to the Wi-Fi. However the gateway has a tendency to continuously fail and sometimes cannot always connect to the lights.\n\nYou find that you have to, several times a week, reconnect the gateway to the Wi-Fi and even then it takes longer to then try to have the gateway find the lights again. My lights are not far away from the gateway. In fact the furthest away would be about 20 to 30 feet. I have the gateway set up exactly where I needed it, close to the front of the house to program the front lights. I even bought a Wi-Fi range extender to also put at the front of the house just in case that was an issue. However neither should've been an issue because the primary Wi-Fi in the house gives a strong signal everywhere.\n\nThe programing for these lights is poorly done. It cannot maintain connections to the wi-Fi or the lights and needs to always need to be reset.\n\nNow, here's the worst part. I've had them for a couple of months now and now the gate we won't even connect it all to the lights. Just simply won't find them. The light still turn on and off but either the gateway or the lights are now malfunctioning after just a few months of use.\n\nBottom line, I would suggest finding some other product out there because this one is a MAJOR FAIL.","updated":"2017-02-11T08:36:37-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1355217085","userName":"iDavidperalta","userUrl":"https://itunes.apple.com/us/reviews/id399991791","version":"1.5.0","score":1,"title":"Worst app ever","text":"It doesnt work at all","updated":"2016-03-28T21:48:35-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5549622181","userName":"CHEKO1971","userUrl":"https://itunes.apple.com/us/reviews/id269774159","version":"2.0.1","score":5,"title":"Muy bueno","text":"Muy bueno","updated":"2020-02-18T14:47:49-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1722329149","userName":"Jwillgoesfast","userUrl":"https://itunes.apple.com/us/reviews/id42454865","version":"1.9.0","score":2,"title":"Widget","text":"PLEASE PLEASE fix the widget configuration for iOS 🙃","updated":"2017-08-10T19:26:55-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1613312362","userName":"BigTalkingBatteryDrainer","userUrl":"https://itunes.apple.com/us/reviews/id37440595","version":"1.8.0","score":1,"title":"App","text":"Poor app","updated":"2017-05-13T20:51:38-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1461715791","userName":"TOR.1","userUrl":"https://itunes.apple.com/us/reviews/id528403542","version":"1.7.1","score":1,"title":"None","text":"Yuck!","updated":"2016-10-05T17:08:48-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3675688781","userName":"Ndhxizbs","userUrl":"https://itunes.apple.com/us/reviews/id117664308","version":"1.9.5","score":1,"title":"DOESNT WORK","text":"Horrible BOUGHT EXPENSIVE LIGHTS THAT DONT EVEN CONNECT!!!!!!","updated":"2019-01-20T17:45:09-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"8038738509","userName":"animal_bob","userUrl":"https://itunes.apple.com/us/reviews/id15092828","version":"4.1.0","score":5,"title":"One of the few","text":"One of a few of the maybe about 100 - 150 apps I've used that really has done what it's supposed to do every day. Great app.","updated":"2021-11-18T18:08:04-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"5256966005","userName":"fhjute","userUrl":"https://itunes.apple.com/us/reviews/id1109224463","version":"2.0.0","score":1,"title":"No invierta en algo que no funciona bien","text":"No vale la pena en esta marca","updated":"2019-12-10T12:02:30-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1572613084","userName":"Sitioty","userUrl":"https://itunes.apple.com/us/reviews/id558674205","version":"1.7.1","score":5,"title":"Bombilla","text":"Deja de funcionar muy rápido","updated":"2017-03-25T14:55:43-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"7140811637","userName":"ZC78","userUrl":"https://itunes.apple.com/us/reviews/id116618837","version":"2.0.3","score":1,"title":"Issue connecting to gateway","text":"I have recently updated gateway firmware and now the app cannot connect to it. I tried multiple options including different Wifi but still having problems. I think that gateway version 1.7.15.0 broke the device. If your gateway is working don't update the firmware until support sorts this out. Also, prior to this event when gateway was working, I had intermittent issues while communicating with the LED lights. This use to be a great product but I noticed that with each update it got worst.","updated":"2021-03-24T15:44:25-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6784457495","userName":"Express 93","userUrl":"https://itunes.apple.com/us/reviews/id503576679","version":"2.0.3","score":1,"title":"Very unreliable product","text":"One item that is most important to me is bring able to control the devices remotely\nfor security purposes. Particular lights have failed several times since i have owned this product. The light bulbs are very expensive\nand are not reliable in programing on and off times. Right now i have 2 lights out of 6 that are not functioning. Support is very slow to\nrespond and normally refer you to FAQ.\nThe whole system is going dead as of 8/31/21, need i say more.","updated":"2020-12-23T03:48:53-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6655664227","userName":"cr442085","userUrl":"https://itunes.apple.com/us/reviews/id379001270","version":"2.0.2","score":1,"title":"App Doesn’t Worm","text":"I downloaded the app and right when I got prompted to create an account, I’m asked to scan the code. Once you do that, you are pretty much screwed because when you are done creating an account, you’re asked to scan the code again, and guess what, ITS ALREADY IN USE!!!!!!  So you can’t proceed until you scan anew code.  I then you either have to buy a new device or wait until RV way fix this glitch!  I’ve emailed a few times and I’m assuming their offices are overseas so don’t expect them to reply in a timely manner and expect the same “robo “ questions.","updated":"2020-11-17T06:48:27-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6602503581","userName":"walkntrack","userUrl":"https://itunes.apple.com/us/reviews/id536353042","version":"2.0.2","score":2,"title":"Scheduler","text":"Pain in the butt getting this to work","updated":"2020-11-02T14:48:02-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6592063693","userName":"Icabod43","userUrl":"https://itunes.apple.com/us/reviews/id32406053","version":"2.0.2","score":1,"title":"Ending support","text":"Ending support","updated":"2020-10-30T18:43:50-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"6328648027","userName":"CatCreekJim","userUrl":"https://itunes.apple.com/us/reviews/id71006852","version":"2.0.2","score":1,"title":"One year from now they stop working","text":"OSRAM divested Lightify in 2016. They have no funding and are left to die a slow death. They will not be updating anything. So on August 31, 2021, they are turning off their servers. No more interaction with Amazon Echo, Google Home, or anything else. If you want to control the lights you are left to your own to see if a Zigbee controller will even talk to it. Or you can put another switch like a KASA in front of the power to control it. So glad I didn’t rely on OSRAM for any of my other needs. Good riddance.","updated":"2020-08-16T22:24:06-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1730959755","userName":"Teafan2","userUrl":"https://itunes.apple.com/us/reviews/id225972646","version":"1.9.0","score":2,"title":"Ehh","text":"Unimpressed","updated":"2017-08-16T19:43:58-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"1700735768","userName":"Catbit","userUrl":"https://itunes.apple.com/us/reviews/id104992723","version":"1.8.1","score":1,"title":"Unreliable.","text":"Unreliable.","updated":"2017-07-27T08:49:43-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3782824397","userName":"Twenty nine 20","userUrl":"https://itunes.apple.com/us/reviews/id458634861","version":"1.9.5","score":2,"title":"Good night","text":"Fix the good night feature \nDefault is 38 minutes...it's lasts maybe 2 minutes and goes completely out. I got this specifically for my daughter at night. Please debug fix and update. Thank you!\nHow about a switch on my Apple Watch to turn the light on and off?\n\n2-17-2019\nAre you planning on fixing the presets? Only about three of them work which is disappointing to say the least. I guess after you make a killing off our wallets you just let it slide downhill. 😐","updated":"2019-02-17T18:06:05-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"4920957673","userName":"Nonameguy72","userUrl":"https://itunes.apple.com/us/reviews/id115704443","version":"1.9.5","score":1,"title":"Garbage","text":"Garbage","updated":"2019-10-10T19:05:46-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"4498664905","userName":"wacollin","userUrl":"https://itunes.apple.com/us/reviews/id103371088","version":"1.9.5","score":1,"title":"No longer works app wants a new email each time","text":"I hadn’t used my system in a while because I moved. I was shocked when I plugged it in it just worked. I had to remove and reinstall my 2 bulbs to get it to work with the Alexa show, but was quite pleased. \n\nThe next day it stopped working and I have been fighting with it for a while. The worst issue is that I reset the bridge and each time it asks me to re-register requiring a new userID and email. I went through the 3 emails I have trying to get it to work. It turns green indicating it is on my network, but the app doesn’t see it. \n\nHow can I get back to one email address. Is there a way to bypass the new user setup?\nThere is no option for this but one must exist. \n\nWhen the system does work, when paired with Alexa it is awesome. Problem is getting there has always been a pain in the butt.","updated":"2019-07-21T14:05:37-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"4494421704","userName":"itsderrikkk","userUrl":"https://itunes.apple.com/us/reviews/id512043305","version":"1.9.5","score":1,"title":"WORST COMPANY","text":"Ok first of all who the heck seperates a remote and a controller?😂 LIKE WT*? I bought an Led Strip from them today and to my surprise I needed to buy a “gateway” which is another product TO F-ING CHANGE THE COLORS OF THE LIGHT!!!! LIKE OMGGGGGGG I WASTED $$ FOR THIS LED STRIPS!!!!!Yall need that money so much that you dont put the “gateway” with the product? That’s just BS!!","updated":"2019-07-20T18:01:59-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3942590585","userName":"Romeyn2","userUrl":"https://itunes.apple.com/us/reviews/id265936521","version":"1.9.5","score":1,"title":"Worthless Piece of Dog Poop","text":"You plug it in and then download the app. The first thing it asks is to scan the bar code or plug in the serial numbers. Well, I’ve scanned it a million times and I’ve punched in every single numbers and digits on the entire box and nothing works. That’s it!! No going passed step two. You can’t even bypass it or try some other configurations. That’s it! See pictures. \n\nIt’s a total scam and it doesn’t even come with the outlet plug you need, but forget about that when you can’t even get the app going. I would give it a zero, if it let me. \n\nI contacted support and haven’t heard anything from them and it’s been two weeks.","updated":"2019-03-29T10:41:16-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3414202312","userName":"motthehopple","userUrl":"https://itunes.apple.com/us/reviews/id329617149","version":"1.9.5","score":1,"title":"don’t bother","text":"Terrible app, garden lights lose connection frequently and reconnecting is a process that more often then not does not work. If you want garden lights get solar ones. Even trying to send this review is a process with ever nickname taken.","updated":"2018-11-13T10:07:36-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3375692188","userName":"Trampas Sisk","userUrl":"https://itunes.apple.com/us/reviews/id121063699","version":"1.9.5","score":1,"title":"Ughhh","text":"**Update: Now I wish I would have just spent the money and went with all Phillips Hue bulbs. As if 11-3-18 I have not been able to find another app that can control these bulbs other than the horrid and basic Osram Lightify App. I previously had used an app called Scintillator to control all my smart bulbs and loved the Lightify bulbs. Well that all changed when Osram changed the API and it appears now that Scintillator programmers have completely removed support all together for Lightify. \n\nThis app is so Not User Friendly. Needs to have dynamic light scene control that works. Get the app Scintillator instead, it allows me to control Hue and Lightify bulbs together plus the dynamic scenes are 10,000 times better that this lightify app.","updated":"2018-11-03T03:47:55-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"},{"id":"3099829075","userName":"i want to make this better","userUrl":"https://itunes.apple.com/us/reviews/id32098519","version":"1.9.5","score":1,"title":"Sometimes works. Usually resets everything.","text":"Sometimes works. Usually resets everything.","updated":"2018-08-22T08:59:47-07:00","url":"https://itunes.apple.com/us/review?id=911362586&type=Purple%20Software"}]