[{"id":"2098269681","userName":"Pyk","userUrl":"https://itunes.apple.com/us/reviews/id34942571","version":"1.6.3","score":3,"title":"It could use some improvement, but it’s not terrible.","text":"I haven’t encountered any major issues so far with my Playbulb sphere. From the perspective of 10 years ago this is quite a cool thing. However, compared to other contemporary products it leaves a bit to be desired. For about the same price I can buy a Phillips Hue white and color ambience bulb. It will have similar color functionality plus the ability to act as a standard dim-able 60W bulb with white temperature selection. And most importantly, the Hue will integrate with HomeKit and respond to Siri voice control. The one unique feature of the Playbulb is the ability to remove it from its base and use it wirelessly. I can’t say I have used this feature much but it is the one thing that sets it apart. You really do get quite a bit more than you get with a Hue for the price though in most situations I would prefer a Hue. If they would just add HomeKit support it would make a world of difference. Additionally, the app could use some work in the design department so that it feels like a quality application and not something thrown together at the last minute. Lastly, the build quality of the device is quite good, though this is a review of the app and not the hardware.","updated":"2018-01-17T07:03:22-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"2779691697","userName":"Mr.Wheelzies","userUrl":"https://itunes.apple.com/us/reviews/id156358539","version":"1.6.5","score":2,"title":"IMO The App Needs Redesigned","text":"First, I’d like to start with a request for a new feature. I’m begging you to add HomeKit and Siri control. The competitors seem to have that down. That would be a game changer for me. Ok onto the review... The bulbs are a bit delayed but that’s more of a hardware thing. The app is organized in a super weird way. I feel like the whole app could be redesigned in a more up to date and aesthetically pleasing way. The different features seem to be unorganized and very randomly placed. Instead of tapping settings to access ALL settings for that individual bulb, you only get the option to rename or reset it. Every other setting is located in its own very short menu. There’s a couple small things like when you open the menu, the only way to close it is that same button again. The problem is that it’s in a completely different and inconvenient spot at the top right of the screen. I know there are better/multiple ways to go about that. When I tap “group” there is always a solid white bar at the bottom of the screen. I’d also like a way to set any features for specific groups rather than having to select every bulb individually. I love having the option to dim lights, turn individual bulbs off, change colors and every other cool thing. I just think the app itself needs a full and complete revamp. I hope this helps at least a little.","updated":"2018-06-27T00:32:33-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1835449736","userName":"bryantcafe","userUrl":"https://itunes.apple.com/us/reviews/id104019212","version":"1.6.3","score":3,"title":"App Still needs work","text":"I love the clean look of the candle. But I am having trouble keeping candles connected. And I would like the \"candle\" feature to display all the rainbow colors. And I thought you could \"blow out\" candle with breath. And it would be nice to have softer colors. The colors are beautiful, however. Timers hard to figure out. I have no idea what scenes are. Documentation is very sparse.","updated":"2017-10-08T09:36:17-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"2157708783","userName":"Maxxavier","userUrl":"https://itunes.apple.com/us/reviews/id38146095","version":"1.6.3","score":1,"title":"Whomp whomp ... truly disappointing.","text":"I have a small collection of the Playbulb items including a regular bulb, studio Bulb, and a set of 3 of the original candles. I gave this app the benefit of the doubt since it was new, but it seems to be all the developers are concerned about- whatever new product they are developing. THIS APP HASNT BEEN UPDATED IN FOREVER!!! They have such cool items but lack in improving the app that runs the devices. Allow for different scene modes, let the lights match the music, something that at least makes it comparable to the competition, because the features offered here are last place.","updated":"2018-02-02T04:32:14-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"3218567722","userName":"SibghaR","userUrl":"https://itunes.apple.com/us/reviews/id370590393","version":"1.6.6","score":5,"title":"It won’t connect.","text":"I could specifically go into my Bluetooth settings to connect the speaker and now I can’t see that. It doesn’t play a sound when I connect my PLAYBULB through my app... this is frustrating, I use the speaker so often.","updated":"2018-09-22T12:32:48-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1629080139","userName":"Chiwiw games","userUrl":"https://itunes.apple.com/us/reviews/id489304914","version":"1.6.3","score":3,"title":"Still not easy use","text":"App is ight..although the music system don't work for me whichinor one star...also not fast use....every time you have to get into the app,..it would be nicer if y'all add a widget for iPhone ....just to turn on or on and switch colors....if y'all do that I would literally buy 20 extra bulbs for my new home...and stripes","updated":"2017-05-30T20:16:30-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1980844951","userName":"Johnxone","userUrl":"https://itunes.apple.com/us/reviews/id328698970","version":"1.6.3","score":3,"title":"I hope new upgrade","text":"The app need a work same time no connected whit the bulb","updated":"2017-12-08T12:26:17-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1692936244","userName":"ArchB J. McH-T","userUrl":"https://itunes.apple.com/us/reviews/id187848214","version":"1.6.3","score":2,"title":"App NEEDS some significant work.","text":"Great concept, the bulbs themselves are good except for the \"hospital white fluorescent\" nature of the white setting. The app, however has a number of problems:\n- white background is too bright and ruins the ambiance when adjusting in a dark room.\n\n- Natural looking candle-flame color is nearly impossible. \n\n- generally only the solid color settings are consistent.  The color wheel is off... e.g., the yellow is green-tinged\n\n- switching between effects and candle and regular is poor, colors are reset, the effects often do crazy ambiance-ruining things that are quite unexpected. \n\nWould not have bough the candles had I known how underdeveloped the app was.","updated":"2017-07-21T22:17:51-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1653793926","userName":"Hamad_AJ","userUrl":"https://itunes.apple.com/us/reviews/id486764995","version":"1.6.3","score":1,"title":"PLAYBULB won't connect with iPhone","text":"Device I bought: PLAYBULB Rainbow.\n\nI just bought this today and unfortunately it's not connecting via Bluetooth on my iPhone. I just updated my device and I still can't pair the device through Bluetooth because it's not showing up. However, I tried connecting to them through a Samsung device, it worked fine. I hope the developer will work on this issue asap!","updated":"2017-06-22T13:09:07-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"3156418243","userName":"kevnallen62","userUrl":"https://itunes.apple.com/us/reviews/id38969436","version":"1.6.6","score":2,"title":"PLAYBULB X functional, but not delightful","text":"I have a PLAYBULB Color. I haven’t figured out how to get the speaker to work, but then again, would it be better than an iPhone or iPad?\n\nI use the PLAYBULB in my bedroom and would really like a way to turn my PLAYBULB on, set it to the color and brightness I want, and be able to turn it off using Siri, Alexa, or my Apple Watch.","updated":"2018-09-05T08:01:24-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1876896075","userName":"EssaLynn009","userUrl":"https://itunes.apple.com/us/reviews/id424582731","version":"1.6.3","score":2,"title":"worked for 2.5 years ... then","text":"worked fine on my iphone 5... upgraded to an 8 today and it simply will not show up as a device when i turn on bluetooth. yes, i've had it and used it every single nite for the past 2.5 yeats so i know how it works and never had any significant problem (the sleep/wake light features don't always go gradually but that has been only problem) now, despite my phone searching for devices (and finding other bluetooths) for now more than 30 minuets.. still no connection","updated":"2017-10-26T11:44:41-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"3730721644","userName":"Faylene F.","userUrl":"https://itunes.apple.com/us/reviews/id207768652","version":"1.6.7","score":1,"title":"Needs work","text":"Candle does not stay connected, constantly needs to be reconnected and does not remember preferences or settings. What is the point of having an option to set the light to come on each morning st a certain time, if the device doesn’t stay connected and doesn’t remember the setting?","updated":"2019-02-03T18:19:15-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1870994425","userName":"cafedissapointment","userUrl":"https://itunes.apple.com/us/reviews/id646865417","version":"1.6.3","score":1,"title":"No connecting","text":"The connectivity is spotty, delayed to non-existent. I still end up having to turn off the lights by hand. And how does TapTap work? I customize it but don't know how to activate the sequence that I've customized. Am I supposed to tap on the candles to initiate sequence? Tattooing doesn't work and there's no instructions on how the featured on the app works.","updated":"2017-10-23T23:56:35-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"8105686535","userName":"Old_Beddit_Needs_Support","userUrl":"https://itunes.apple.com/us/reviews/id311161758","version":"V1.6.8","score":1,"title":"Not intuitive and hard to understand","text":"I have a lot of smart apps for lights and plugs and this one is not at all easy to use. I can’t even figure out how to automate a schedule. Only a timer option seems to be available.","updated":"2021-12-07T12:09:21-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1935816099","userName":"Scrozarts","userUrl":"https://itunes.apple.com/us/reviews/id418554069","version":"1.6.3","score":5,"title":"Since the newest update my iPhone has no connectivity to the bulb","text":"I love this bulb it’s a great product","updated":"2017-11-20T15:03:02-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"4604452241","userName":"wesley86*","userUrl":"https://itunes.apple.com/us/reviews/id957552032","version":"1.6.7","score":5,"title":"Light","text":"I love it I can read  or go to bed with and wake up with music ‘I want to get some more of them,Ferry Usefol","updated":"2019-08-11T18:14:54-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"3070198107","userName":"Oh idc","userUrl":"https://itunes.apple.com/us/reviews/id487564423","version":"1.6.6","score":2,"title":"It DOES work but....","text":"Why in GODS UNHOLY NAME does this app not have a calendar alarm schedule?? \nI love having my light wake me up, but ONLY on the days that I work. Why do I have to reset it every week???\nWhy is this not a feature? Are your app developers just lazy? \nDo you enjoy your competition Actually being better than you? \nAlso, why TF is this not compatible with Alexa??\nI AM buying a different smart bulb set that DOES have these features btw. And I’ll discourage anyone I know from buying this brand.","updated":"2018-08-15T18:38:49-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1938430913","userName":"KhalidNikon","userUrl":"https://itunes.apple.com/us/reviews/id207314606","version":"1.6.3","score":1,"title":"Non-responsive","text":"The app seems easy to use, although the bulbs seem to connected yet unresponsive to my actions. If I’m lucky, it would be just a huge lag, but as of now, the bulbs just switch on and off on their own. They’re literally no more than standard lightbulbs right now.","updated":"2017-11-21T14:58:58-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"6066736371","userName":"frfjr","userUrl":"https://itunes.apple.com/us/reviews/id8914655","version":"V1.6.8","score":1,"title":"Not working","text":"Bulb doesn’t show in app. Cannot control anything. Bluetooth connects but bulb not show in app. Only thing that works is speakers. If you play video on phone then sound comes from bulb. Totally waste of money at this point","updated":"2020-06-12T05:36:33-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1669450873","userName":"IAMKrow","userUrl":"https://itunes.apple.com/us/reviews/id436374879","version":"1.6.3","score":5,"title":"Simple, Just works","text":"The app in the lights work perfectly well.","updated":"2017-07-05T00:13:44-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"3845248275","userName":"webapprentice","userUrl":"https://itunes.apple.com/us/reviews/id36005596","version":"1.6.7","score":1,"title":"Please fix","text":"The candle is really cool for the price.  But with the app it will not hold the color and mode settings.  The scheduling works but nothing else keeps.. if you change the battery you have set up all over again.","updated":"2019-03-05T04:21:28-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"2647967709","userName":"Queen Na","userUrl":"https://itunes.apple.com/us/reviews/id218709069","version":"1.6.4","score":2,"title":"Temperamental app","text":"This app chooses when it feels like working.  On several occasions, it failed to show the connected bulbs despite my efforts.  😡 when it does work...it is pretty cool...when it chooses to work.","updated":"2018-06-05T19:02:02-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1670461879","userName":"BenM4124","userUrl":"https://itunes.apple.com/us/reviews/id42358300","version":"1.6.3","score":2,"title":"Ehhhhh","text":"I mean it works but one of my bulbs out of three only glows red or white now. I also miss the old app where there was a  rainbow gradient  feature where each bulb changed independently. That's was awesome.","updated":"2017-07-05T17:59:41-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1157326168","userName":"Dick Hamilton","userUrl":"https://itunes.apple.com/us/reviews/id212720596","version":"1.2.36","score":3,"title":"Has a lot of potential","text":"The product looks great and the bulb itself is quite functional! The app is not so much...it feels very outdated, like many have said there are a lot of glitches with effects. The color selector wheel works well but it feels a bit glitchy as well.\n\nOne CRITICAL feature missing is geolocation. The app should enable/disable the bulb based on proximity, that would be a great enhancement!\n\nAnother thing I'd like to see is notification alerts via the bulb. I'd like to choose the service, for example, SMS and have my bulb flash green for 2 seconds. Or Facebook and it flash blue for 2 seconds.\n\nOne last feature would be if the bulb could adjust the color throughout the day, similar to a service called f.lux for your phone. It adjusts your screen temperature to match the time of day so that in the night everything has a warm color temperature to go easy on your eyes. If the bulb could be a bright white from 10am-12pm and then start turning warmer as the sun was setting I think that would be great.","updated":"2015-02-23T22:15:00-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1704620260","userName":"Roeark","userUrl":"https://itunes.apple.com/us/reviews/id126876145","version":"1.6.3","score":1,"title":"Doesn't work on pure white","text":"Cannot use my bulb for pure white after the update. Only color options work. Anytime you select pure white to mimic a normal bulb it just shuts off. Model BTL201","updated":"2017-07-30T01:05:22-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"2258319045","userName":"Saeed Verson","userUrl":"https://itunes.apple.com/us/reviews/id431374620","version":"1.6.3","score":2,"title":"Stay in red light","text":"I have a problem, the app can’t find my playbulb but its speaker is connect. How to fix it?","updated":"2018-02-28T22:53:23-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1594481203","userName":"katmcwallace","userUrl":"https://itunes.apple.com/us/reviews/id41075444","version":"1.6.3","score":1,"title":"App is useless","text":"All this app does is change the color of the lights. It doesn't even have a timer.","updated":"2017-04-21T17:50:20-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1620172213","userName":"Dough30i","userUrl":"https://itunes.apple.com/us/reviews/id103762032","version":"1.6.3","score":2,"title":"please have one in iPad app","text":"Hello, PLEASE add a new feature where it have colored time set at certain time! please.... thank you","updated":"2017-05-21T07:02:22-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"3449870100","userName":"Km80","userUrl":"https://itunes.apple.com/us/reviews/id155392051","version":"1.6.7","score":1,"title":"Very bad","text":"Not worth a penny. I bought 3 and none work properly and the application is even worse. DO NOT BUY. go for the hue its way better.","updated":"2018-11-22T23:16:42-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"7831219094","userName":"Havfunwithit","userUrl":"https://itunes.apple.com/us/reviews/id419586613","version":"V1.6.8","score":1,"title":"No longer works.","text":"Does not work with iPhone 12 max. Can’t set time.","updated":"2021-09-21T16:24:34-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"2670474777","userName":"Aligrm","userUrl":"https://itunes.apple.com/us/reviews/id255121404","version":"1.6.4","score":1,"title":"Worst app ever","text":"The app sometimes works but sometimes doesn’t!! I don’t know why!!\nI emailed them and asked for an update but they didn’t answered me!","updated":"2018-06-10T01:54:17-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"5070691100","userName":"Jeremy Grech","userUrl":"https://itunes.apple.com/us/reviews/id85464892","version":"1.6.7","score":1,"title":"I used to love Playbulb X","text":"I used to live playbulb but they haven’t kept up with today’s standards, no HomeKit, or Alexa cabability. Time to get a new system","updated":"2019-11-02T05:38:31-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"3859060927","userName":"Harleyrider-1","userUrl":"https://itunes.apple.com/us/reviews/id171068284","version":"1.6.7","score":1,"title":"You’re app","text":"Totally disorganized. Start a new one because you will never fix this crap.","updated":"2019-03-08T17:59:23-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"2093214161","userName":"BryanCalabro","userUrl":"https://itunes.apple.com/us/reviews/id217027057","version":"1.6.3","score":1,"title":"App Stops Working After A Day","text":"Such a waste. How can people sell this junk and get away with it.","updated":"2018-01-15T18:16:34-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"6563699799","userName":"JemmaF","userUrl":"https://itunes.apple.com/us/reviews/id237399239","version":"V1.6.8","score":1,"title":"Horrible","text":"Bulb keeps disappearing from app and there’s nothing to troubleshoot. Never consistent","updated":"2020-10-22T17:38:16-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"2034906970","userName":"Enano10394483","userUrl":"https://itunes.apple.com/us/reviews/id126876348","version":"1.6.3","score":1,"title":"waste of money","text":"Doesn’t work. Don’t waste your money.","updated":"2017-12-28T04:37:11-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1786436377","userName":"Sam'13","userUrl":"https://itunes.apple.com/us/reviews/id179785471","version":"1.6.3","score":2,"title":"blue & purple color not working perfectly","text":"please fix this problem, blue & purple not working perfectly & only working sometimes","updated":"2017-09-12T03:42:59-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1913025631","userName":"pouyan74","userUrl":"https://itunes.apple.com/us/reviews/id168790320","version":"1.6.3","score":1,"title":"update app","text":"please update application , it crashes always","updated":"2017-11-11T03:29:40-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"2404557577","userName":"mohammad.gholamshahi","userUrl":"https://itunes.apple.com/us/reviews/id252257727","version":"1.6.4","score":1,"title":"IPHONE X!!!!","text":"update for iphone X\nchange design!!!","updated":"2018-04-09T22:27:27-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1504985698","userName":"Caitie Boshers","userUrl":"https://itunes.apple.com/us/reviews/id365719107","version":"1.5.1","score":2,"title":"CHANGE THE APP ITS REALLY NOT THAT HARD","text":"Whoever designed this app needs to seriously step up their game or just give it to me and I'll make it better. I've worked with apps before and this is on the same level a three year old could do. Come on people, it's 2017 already and this is the best you can do? Some suggestions: if it has a scene button, it should probably work, but it doesn't. The effects on the taptap options for settings should probably let you change the speed and the color of the effect, but it doesn't. Mipow should also look into making an option to preset colors that you like as your favorites so you can easily go back to them. These are very basic suggestions that I'm surprised aren't in the app in the first place. Seriously though, Mipow, if you're reading this, give the app to someone who knows what they're doing, because it's seriously affecting your revenue. I love your products and they are the cheaper version of some products already out there, but the reason people are still paying 50$ extra for those products are because their apps actually work and have really cool effects, whereas yours doesn't.","updated":"2016-12-19T10:37:26-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1491453854","userName":"hondatom","userUrl":"https://itunes.apple.com/us/reviews/id149349429","version":"1.5.1","score":2,"title":"The designer of this app is lame","text":"Most of these features in this app could easily be explained if the designer wasn't so lame you know you could say that the flash have flashes the light on and off and with the slider you can change the interval of the flashing. But the designer is so lame that he did not write any of this information down so I have these features who knows what they do. It would've been nice to have written all the stuff down and shared it with everybody so they knew how to use all the features in the app. And let me give you advice on a Nother feature a time where the lights would shut off and stay dormant until the next day they don't need to run all night and a lot of people would prefer not to go out in the snow just to shut them off so let's make it a feature in the app to shut them off at a certain time and then resume the next day.","updated":"2016-11-26T11:36:10-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1100447159","userName":"mrmcweird","userUrl":"https://itunes.apple.com/us/reviews/id39404478","version":"1.2.26","score":2,"title":"Needs work","text":"The candles work well, but the app needs work. First of all, if you make changes to the color of a candle and then want to add effects, you have to go adjust the color again. Also, if you have the color set and then adjust the brightness, the brightness gets set to full every time you change the color. \n\nThe candle also switches between orange and red when I use the slider for a orange-red color on the candle setting. It should only flicker the color I picked. Also, the candle flickers on/off when the candle brightness is about 25%. It should flicker as nicely as when it's at 100%. \n\nThe app is quite frustrating to use right now. I've basically had to resort to just using it as a solid color because that's all that works smoothly right now. I'm really hoping these issues are resolved quickly in an upcoming update.","updated":"2014-11-21T01:07:12-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1191849985","userName":"KD1589","userUrl":"https://itunes.apple.com/us/reviews/id213920256","version":"1.2.40","score":1,"title":"Sorry :( This App Still Stinks!","text":"Update to my original review from Dec 4th: \nThis app STILL stinks! It continues to crash. You cannot create new groups— it keeps telling me that the Group name has been taken… come again? Seriously! Without the app, the entire idea of having these candles work is simply a waste of time and money. \n\nReview from Dec. 4th\n\nOK, I really like the candles you created which I got through Kickstarter but this app is a royal pain! \n\nFirst off, colors cannot be synched once grouped. Names (when changed) for individual candles do not show up correctly. I have 9 candles and it’s a mess to figure out which one I am trying to change the coloring on. Plus, whatever I change the color to does not get stored properly. \n\nAlso, on a side note, you could have skipped on the scent disks as they smell artificial and not enticing at all. Better use of your resources would have been to make this app work 100%. I’d suggest to work on improving on the app! Having spend $99 on these candles now feels like a waste of my money.\n\nI saw you moved on to the next project already. Do one thing well and put in your 100% before moving on. As a supporter, I feel cheated and will not support another one of your projects.","updated":"2015-05-03T10:14:30-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1239756945","userName":"CrybabyJr","userUrl":"https://itunes.apple.com/us/reviews/id112882460","version":"1.2.6","score":5,"title":"Mea culpa","text":"I wrote an irate review after hours of frustration with a defective Rainbow and out of fear the shop I bought it from wouldn't take it back...my bad on both counts! iStudio happily replaced it with one that works, and Playbulb's customer-support dep't responded quickly and helpfully despite my huffy email. Whatever shortcomings the app may have with multiple lights--and there do seem to be a few, e.g. the \"group name already exists\" error--it works fine for me with just the one bulb, and Playbulb is a sleeker, cheaper alternative to Philips Hue...also apparently the only easily obtainable one here in Thailand.","updated":"2015-08-07T23:41:14-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1452213576","userName":"Betaomicron","userUrl":"https://itunes.apple.com/us/reviews/id158806709","version":"1.4.0","score":3,"title":"Great product, app needs development","text":"I'm using the app through my iPhone controlling 2 bulbs in my room. So far everything has worked, sometimes the effects can be buggy, or if you go from individual control to group control, it takes a moment for the bulbs to \"sync\". The color wheel is kinda bleh, it's much too sensitive for touch control, and the brightness effects the colors greatly. I give it 3 stars for working, but would like to see them add swatches for more colors instead of just red, green, blue and white, and simplify the color wheel","updated":"2016-09-19T00:17:11-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1398256498","userName":"FT1691","userUrl":"https://itunes.apple.com/us/reviews/id250367185","version":"1.2.12","score":1,"title":"Disappointing","text":"The bulb itself seems to be constructed pretty well, but I haven't had it long enough to test the longevity. On the other hand, the app is terrible. The UI is not very friendly, and the timer functionality is basically useless (which was the main reason I had purchased this bulb). \nI wanted to be able to set the bulb to slowly come on in the morning. The timer page shows a duration, but this does absolutely nothing - it just stays on whether I put in 1 min or 30 min. It also gives that illusion that the increase light mode will do just that, but it just comes on full brightness immediately. \nI'd really love to see an update to the app that fixes at least the timer functionality.","updated":"2016-06-21T17:44:45-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1481638779","userName":"Katmauro","userUrl":"https://itunes.apple.com/us/reviews/id227147519","version":"1.4.0","score":1,"title":"This app is terrible","text":"I almost never write app reviews…but this app is so terrible I have to. If I could give it a negative star rating, I would. \n- It's near impossible to rename the lights, so I never know which one I'm working.\n- if it actually does adjust to the setting I am choosing, there's a response lag (i'm walking back-and-forth in my yard trying to figure out which one I've even chosen. \n-the optional effects are kind of lame. \nUltimately, I wish these were as good a product as the Phillips hue lights, or that Phillips made a garden hue set I could have purchased instead.  Overall, i'm not really that pleased with this product, and it's like they never even used the app before putting it out.","updated":"2016-11-09T14:25:41-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1522900739","userName":"GageBratz14","userUrl":"https://itunes.apple.com/us/reviews/id163171263","version":"1.5.1","score":5,"title":"Great app works great on my light!","text":"I love the app and light, it's really cool, being able to change to whatever color I want. The regular light mode is also not too bad even as one light. Although I do not have any complaints with the functionality of the light, I would like to see a way to save a color you choose so you could go back and pick that color instead of trying to get it spot on the color wheel every time.","updated":"2017-01-15T11:01:52-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1212920596","userName":"thisdetailguy!","userUrl":"https://itunes.apple.com/us/reviews/id20357188","version":"1.2.41","score":1,"title":"Why give 3 stars if groups doesn't work???!!!!!","text":"The whole kick starter campaign was pushing that you can control more than four or five lightbulbs at the same time. And that was my reason for supporting it I don't know if there were others who were doing the same. But this isn't the case with this product. groups isn't working it's crashing application. there's a lag and for the number of products that they put out the application still isn't working properly or how the company stated it would work. Please fix the problem. Instead of putting money in to make more products fix the application we all believe it has potential.","updated":"2015-06-15T15:57:46-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1307256855","userName":"Akraw1986","userUrl":"https://itunes.apple.com/us/reviews/id210877963","version":"1.2.8","score":1,"title":"Awful app great product...","text":"The lights are amazing and when the app works they are great!!!! The problem is the app is glitchy and there should be better options for setting the lights on a timer.  Also only one phone can access the lights at a time.  Making the lights impractical for a working house.  You have to shut the lights off from your phone and turn them on from your phone it's just clunky and overall a pain.  If the lights loose power the settings reset.  Maybe a good update would make these 40$ a pop bulbs worth the money until then save your hard earned money.","updated":"2015-12-27T17:42:28-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1167911242","userName":"tensider_T","userUrl":"https://itunes.apple.com/us/reviews/id42018295","version":"1.2.36","score":3,"title":"Potential, but flawed","text":"The company is rushing a lot of various lightbulb products to the market via kickstarter. The problem is the “rush” part. I have the candle and the lightbulb products. When scanning for devices, if both the lightbulb and the candle are turned on, it will disconnect the lightbulb. Sometimes the lightbulb is simply unreachable. \n\nYou can tell their team’s native language isn’t English. Overall, the UX could use some polish. Still, I’d want them to get functionality rock solid before improving the UX.","updated":"2015-03-14T11:03:03-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1100800527","userName":"jbwaterman","userUrl":"https://itunes.apple.com/us/reviews/id19475785","version":"1.2.26","score":2,"title":"Not useful","text":"Bought the candles via a kickstarter deal.  Totally underwhelmed.  And the app is of no help.  When directed to the Mipow website for full instructions there is only the quick start blurb in several different versions and languages.  There is a “security” feature that is unexplained.  There is a page with several timer devices which is unexplained.  And the candle effect for the candles is the last listed effect.  What’s up with that!  For the candle effect there is a color slide, for everything else there is a color wheel.  The packaging for the candles was nice.","updated":"2014-11-21T16:48:38-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1101931176","userName":"JohnJoshson","userUrl":"https://itunes.apple.com/us/reviews/id227415161","version":"1.2.26","score":3,"title":"Needs work","text":"It seems like it's off to an okay start, and it seems like you guys are listening to everyone and adding updates but it needs more work. \n\nThe UI is pretty funky and needs to be cleaned up a lot. It's very inconsistent design-wise. Looks like stuff from the sdk was just thrown at it.\n\nAlso, in the future, this app would be great with widget support. It's WAY easier to control lights from the lock screen vs unlocking it, navigating to the app, and doing it there.","updated":"2014-11-23T11:09:43-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1371560061","userName":"SkylarEC","userUrl":"https://itunes.apple.com/us/reviews/id36787679","version":"1.2.12","score":1,"title":"Awful","text":"The app itself is terrible to use.  It's not easy to get precise colors within the app.  It should allow the user the ability to save colors and fine tune colors.  The user can do neither of those things.\n\nWant to set a timer for the light to come in at another brightness, forget about it.  The light strip always comes on at full brightness.  You have to set a second timer for a minute later the dim the lights to the desired setting.\n\nWant to set repeating timers, say to turn the lights on at a certain time each day, tough.  Timers must be manually set each and every day.\n\nThe hardware itself is even worse.  It's only a month old and has already stopped communicating with the app entirely.  I have to leave the lighting strip on all day and all night, now.\n\nThe lighting strip had also does not produce an acceptable white light.\n\nI will never buy another Playbulb product again.","updated":"2016-04-30T21:01:47-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1105219570","userName":"GeoRockOn","userUrl":"https://itunes.apple.com/us/reviews/id104488332","version":"1.2.26","score":3,"title":"Works but can be improved","text":"Agree with most of the comments already written. Just to add also when you take a picture for example I used a real candle and did a scene color pick on the yellow portion of the picture taken- the playbulb only changed its color to pink or green no yellow color even when using the wheel - hopefully a new update is in the works soon to fix some of these items - thx","updated":"2014-11-29T06:35:52-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1436766327","userName":"Kgamer++","userUrl":"https://itunes.apple.com/us/reviews/id40650268","version":"1.3.0","score":5,"title":"Easy Pairing & Works Great!","text":"I was surprised to see some negative reviews of this app.  I installed my Playbulb and had it paired with the app in a matter of seconds.  I was able to control the color of the bulb easily.  I did have to restart the app once to get the music pairing to work, but as soon as I did that, there were no issues.","updated":"2016-08-21T06:34:56-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1398249686","userName":"EddieB02148","userUrl":"https://itunes.apple.com/us/reviews/id16038832","version":"1.2.12","score":2,"title":"Music in only one bulb","text":"I bought two of the \"cheaper\" white led/sound bulbs and can only play music on one bulb at a time. I can call group them and fade/on/off the light at the same time, but cannot find a way to play music through both bulbs at the same time. Disappointing, as I was planning to group 10-20 bulbs for more whole-house system; don't believe this is an option of the white only bulbs cannot group/mesh to deliver sound through all at once.","updated":"2016-06-21T17:21:47-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1317545340","userName":"Gribbly Snard","userUrl":"https://itunes.apple.com/us/reviews/id103555757","version":"1.2.8","score":3,"title":"Missing features want.","text":"I would like to use this as a speech or count down timer. I wish the app would let me set 3 times with a corresponding color (green, yellow, red). Or just add a visible timer to the controls so I can manually change the color at the appropriate time. I would also like the ability to change the preset color buttons to my choosing (add yellow).","updated":"2016-01-16T14:36:54-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1498419228","userName":"waterman88","userUrl":"https://itunes.apple.com/us/reviews/id25770037","version":"1.5.1","score":1,"title":"Group setting doesn't work!!!","text":"I bought a few of these bulbs. I installed them. Individually they work with the app. But in the group setting there's no control for them. I can't do anything with them in fact there's no group setting it all!!! You guys need to fix this app it's complete garbage!!! Don't buy these lights and don't buy their products until they fix their apps. I'm sending all these lightbulbs back. You get what you pay for cheap LED Bluetooth lights that don't work with the remote app!!","updated":"2016-12-08T17:11:55-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1561108629","userName":"Uke or Seme","userUrl":"https://itunes.apple.com/us/reviews/id211725489","version":"1.6.2","score":4,"title":"Works well","text":"Just got this and it works fine and is easy to use. My only complaint is that I would like to be able to change the brightness while using some of the effects options like the rainbow effect. But other than that this app functions well.","updated":"2017-03-09T20:27:30-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1346343438","userName":"NiteMan0nerr","userUrl":"https://itunes.apple.com/us/reviews/id176445940","version":"1.2.12","score":3,"title":"Awesome, but..","text":"I like your app and I love that I can control my lighting now but I'd like for my girlfriend to have access to control the lighting as well. I'm not always home and her phone cannot connect to the bulb. I'm assuming only one device can connect to the bulb at a time or at all. Please fix!! I would pay extra so that we can have that option.","updated":"2016-03-11T12:41:33-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1479935026","userName":"Dwo4life","userUrl":"https://itunes.apple.com/us/reviews/id173778091","version":"1.4.0","score":3,"title":"Nice products but the app needs a new overhaul","text":"App needs work and new features would be nice.  The app needs to be updated for iPhone 7 and 7 plus because when clicking group to control PLAYBULB garden the app goes back to the front screen and will not let you make any changes.","updated":"2016-11-06T14:24:58-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1534438832","userName":"GuideWire424","userUrl":"https://itunes.apple.com/us/reviews/id526626055","version":"1.6.2","score":5,"title":"They fixed it!","text":"The latest update fixed all the problems and it runs perfectly. They listened to the comments. It is user friendly too.","updated":"2017-01-31T14:04:57-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1530763247","userName":"Robert121571","userUrl":"https://itunes.apple.com/us/reviews/id20955395","version":"1.6.2","score":5,"title":"Fixed","text":"So glad to see an update that fixed the group control that was broken in the last two updates. \n\nDevs really need to fully test stuff before pushing out reversions.","updated":"2017-01-26T00:41:10-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1559473410","userName":"saadsolaiman","userUrl":"https://itunes.apple.com/us/reviews/id211616229","version":"1.6.2","score":4,"title":"Good but one suggestion","text":"It's a great system. I have some grouped playbulbs, works flawlessly. The only thing I would suggest is to add a widget for this app so that it is easily accessible from the swipe left screen. Just some simple buttons there like turning on or off groups of lights.","updated":"2017-03-07T07:50:40-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1171975308","userName":"Nubman","userUrl":"https://itunes.apple.com/us/reviews/id100483467","version":"1.2.36","score":5,"title":"Does what it says it will","text":"I see a lot of complaints with it and people are right... I can be more and i think it will get there. For what it does do and what it says it will do i think it does very well.","updated":"2015-03-22T16:17:20-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1329953956","userName":"joelvk","userUrl":"https://itunes.apple.com/us/reviews/id85487468","version":"1.2.10","score":1,"title":"Ditto....Do not upgrade","text":"After update security feature is gone and that was the only way I could set recurring times for the candles to turn and off by themselves.  If anyone has the old app let me know please.  This app needs a LOT of work.  The timer feature does not always work and resets to nothing after it goes on once.  Not what I wanted at all.  The candles are awesome but the app makes them pretty worthless.","updated":"2016-02-08T10:43:09-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1366594477","userName":"MvrkDrmr","userUrl":"https://itunes.apple.com/us/reviews/id501659146","version":"1.2.12","score":3,"title":"Almost perfect!","text":"Everything seems fine for the price of the bulb! But please add the ability to have multiple people controlling the bulbs and for alarm clock memory so that the alarm clock doesn't have to be set every single time! Thank you for an awesome product so far!","updated":"2016-04-21T06:41:11-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1525441103","userName":"NoGoNoShow","userUrl":"https://itunes.apple.com/us/reviews/id130007450","version":"1.6.1","score":1,"title":"Disaster","text":"This last update is a complete mess. In group it's no longer possible to shut all lights off. It is also no longer possible in group to turn the lights to the regular white color just some light blue. In group the colors aren't synced so you might try to make all lights red but the other lights are different going to be different. I'm sure I'll find even more errors so please just fix this.","updated":"2017-01-18T21:44:47-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1135069961","userName":"Thaeryn","userUrl":"https://itunes.apple.com/us/reviews/id26020080","version":"1.2.35","score":4,"title":"Needs iPad Support!","text":"Like the app, works well with the 3 Playbulb Candles I have, put I need an iPad version of the app.\n\nCurrent version does not allow me to control the Playbulb candles in the least. Can't reset or remove them either. Please restore the functionality.","updated":"2015-01-23T20:13:39-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1310894493","userName":"Jeanreau","userUrl":"https://itunes.apple.com/us/reviews/id85183880","version":"1.2.8","score":3,"title":"Works with iOS 9.1... Wish could sync with music","text":"Works well. Don't suggest putting on a dimmer. I had to switch out to a standard rocker. I had bought some cheap color changing lights out a couple years ago and they could sync with the music but were underpowered.","updated":"2016-01-03T17:49:30-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1187084793","userName":"The Bald Baker","userUrl":"https://itunes.apple.com/us/reviews/id123482315","version":"1.2.40","score":3,"title":"Gourp Contro!?! Ugh!","text":"Grouping lights wont work properly. It keeps crashing \n\nAnd when it does work, everything in group doesn't turn on. \n\nAlso wish that the timer can be automatic already. We don't need to keep setting it everyday.","updated":"2015-04-23T18:20:12-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1505721579","userName":"hosein khalil","userUrl":"https://itunes.apple.com/us/reviews/id203943565","version":"1.5.1","score":5,"title":"Apple Watch and home kit","text":"I'm in love with ur gadgets but I have some problems \nFirst with the home kit plz make the app compatible with home kit \nAnd the second plz make an Apple Watch app to control it with Watch.\nThnx🙏🏻","updated":"2016-12-20T15:29:37-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1249147675","userName":"Titusmurf","userUrl":"https://itunes.apple.com/us/reviews/id160695853","version":"1.2.7","score":2,"title":"Flawed","text":"App crashes. User experience and usability of app is poor. The bulbs are great, but the overall product experience is ruined by the app. There hasn't been any updates or response from manufacturer so apparently customer satisfaction post purchase is low on the priority list. Would love to see some updates.","updated":"2015-08-26T22:57:07-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1530178473","userName":"flaxattax","userUrl":"https://itunes.apple.com/us/reviews/id42102843","version":"1.6.2","score":5,"title":"Back to normal","text":"Now that the groups are fixed and I can dim and turn off my lights as a group again I am very happy and love all of my PLAYBULB products","updated":"2017-01-25T04:38:37-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1333179857","userName":"Cdarksmith","userUrl":"https://itunes.apple.com/us/reviews/id166991879","version":"1.2.10","score":1,"title":"Update","text":"It's amazing that when a update comes out to \"fix\" bugs then list all bug fixes, and yet when I go to use the app it won't even connect to anything I own from playbulb. Truly amazing that the developers don't test the patch fix before they release to public. This is common sense, test your product before you release it!!!","updated":"2016-02-14T19:58:13-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1526665722","userName":"iUSHnt","userUrl":"https://itunes.apple.com/us/reviews/id245293338","version":"1.6.1","score":3,"title":"Latest update has lots of bugs","text":"It takes more time to connect with the lights. \nNo default color option in group.\nAll lights can't be turned off in group. Please fix this.","updated":"2017-01-20T10:48:11-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1407677859","userName":"Booaleez","userUrl":"https://itunes.apple.com/us/reviews/id181290260","version":"1.3.0","score":2,"title":"Lacks repeating timer","text":"Bought this bulb just to go off when my alarm goes off but I have to manually turn the timer on every single time which is frustrating and annoying!\nThere must be an update to address this issue!","updated":"2016-07-08T05:32:04-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1120200361","userName":"BAGZ42","userUrl":"https://itunes.apple.com/us/reviews/id172777525","version":"1.2.30","score":4,"title":"Good","text":"I like the app and of course I also like the bulb. I only have one problem and that's the timer, we should be able to choose the song we want to play.","updated":"2014-12-27T11:54:59-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1520994087","userName":"Rainbow Owner","userUrl":"https://itunes.apple.com/us/reviews/id510564000","version":"1.6.0","score":3,"title":"Group Mode Went Downhill","text":"The new features in group mode are nice, but that's not a reason to take away other features and functionality. Group mode is really rough around the edges now and harder to control.","updated":"2017-01-12T21:56:35-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1167161182","userName":"tony1234512345","userUrl":"https://itunes.apple.com/us/reviews/id141662346","version":"1.2.36","score":3,"title":"Not bad but needs work","text":"The candle hardware works great. Blowing out the candles could be a tad more sensitive but it works. \n\nThe software is very beginner level. I'd like to see timer so I can save a ton of battery life by turning them on/off at certain times.","updated":"2015-03-12T20:39:34-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1311968082","userName":"Dubz559","userUrl":"https://itunes.apple.com/us/reviews/id22866412","version":"1.2.8","score":1,"title":"Terrible app. GREAT PRODUCT!","text":"I love the lights, and when they work with the app they are amazing. Most of the time the lights do not show up on the device list. It has become ridiculous to shut them off so I have resorted to plugging them in and unplugging them. This app is terrible, and I don't understand why the company isn't fixing this issue.","updated":"2016-01-05T20:30:28-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1526842157","userName":"J.Og.Dawg","userUrl":"https://itunes.apple.com/us/reviews/id25600043","version":"1.6.1","score":1,"title":"Aspect ration issues","text":"I just got the app and I can't control the lights fully in group mode because the sizing issues are all off. I can't even contact you through the app because the \"email\" line is off screen. Thought I found a good alternative to the wifi lights. Should have known better.","updated":"2017-01-20T18:18:19-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1421688606","userName":"KShawPA","userUrl":"https://itunes.apple.com/us/reviews/id27483022","version":"1.3.0","score":2,"title":"Need longer timer duration","text":"If you're thinking you'll use this for home security- think again. The longest timer duration is 30 minutes. \n\nWe need the ability to set a repeating timer every morning or every evening for up to 6 hours.","updated":"2016-07-28T12:03:15-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1275533131","userName":"2012 dday","userUrl":"https://itunes.apple.com/us/reviews/id164446191","version":"1.2.8","score":3,"title":"Was working good until now","text":"I purchased it a month ago it was working good until now it cannot connect with my phone now and then","updated":"2015-10-22T12:34:21-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1347313876","userName":"Good mmmore","userUrl":"https://itunes.apple.com/us/reviews/id496353561","version":"1.2.12","score":5,"title":"Good hope for more","text":"I like it and look forward to more products. Please keep up your good work.","updated":"2016-03-13T08:19:07-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1346735108","userName":"perfect improving","userUrl":"https://itunes.apple.com/us/reviews/id496192360","version":"1.2.12","score":5,"title":"It's constantly improving","text":"The timely update of  this app makes it almost perfect.","updated":"2016-03-12T06:15:32-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1204583760","userName":"WritingNelli","userUrl":"https://itunes.apple.com/us/reviews/id40650540","version":"1.2.40","score":1,"title":"This App needs serious edits","text":"This app seriously needs edits!! Some of the functions don't work at all and as of today, opening the app causes all of the lights to turn off, rendering them completely useless! Can't change colors, can't do anything, just turn on and off like regular lights. Please fix your app!","updated":"2015-05-29T22:00:01-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1428202063","userName":"Halowidow","userUrl":"https://itunes.apple.com/us/reviews/id412881123","version":"1.3.0","score":1,"title":"Disappointed","text":"This app requires you to set an interval just to have candles turn off/on. Needs an automatic just on and off function without the interval part. Since the last update in July 2016 the security feature doesn't work anymore. Expected the app to improve not get worse.","updated":"2016-08-06T16:24:21-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1482677837","userName":"Tontonnn477484","userUrl":"https://itunes.apple.com/us/reviews/id395431484","version":"1.5.0","score":5,"title":"Good but....","text":"Please make the white more white in the main menu. Its not like the white used in the pulsing white function. Please!!!","updated":"2016-11-11T10:21:09-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1251936141","userName":"merheylie","userUrl":"https://itunes.apple.com/us/reviews/id35643536","version":"1.2.7","score":4,"title":"Great product, interface ok","text":"We have 5 bulbs in 2 groups. Love the colors, app mostly works - can't figure out if our bulbs don't support it or candle mode is broken.","updated":"2015-09-01T23:23:25-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1098775895","userName":"Charleston SC Homes","userUrl":"https://itunes.apple.com/us/reviews/id180584217","version":"1.2.22","score":1,"title":"Joking right?","text":"This app has probably had about 10 minutes spent on it's design. Even though it's an app for a candle the flame effect is not one that you can set as default. \nThis was one of those kickstarter campaigns that should have been flagged for a scam. \nHope you look at the app review before you purchase the candles","updated":"2014-11-17T16:58:03-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1304672088","userName":"DuKeNuKeM83","userUrl":"https://itunes.apple.com/us/reviews/id139178729","version":"1.2.8","score":4,"title":"Party in my room!","text":"Just got it and works great, connects super fast with my 6s plus, pretty bright for my needs. Just wish they could add Iwatch support then I'll give it a 5","updated":"2015-12-22T17:04:46-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1531187402","userName":"Mewtot","userUrl":"https://itunes.apple.com/us/reviews/id117032120","version":"1.6.2","score":5,"title":"Incredible","text":"Group function is fully restored, strobe is back. Thanks for listening.","updated":"2017-01-26T14:48:55-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1533810134","userName":"dwayne.ii","userUrl":"https://itunes.apple.com/us/reviews/id31633243","version":"1.6.2","score":5,"title":"FIXED.","text":"Group mode is fixed! Once again a super dope app. Best for controlling the vibe of your place. Very essential to my home","updated":"2017-01-30T14:54:14-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1507641077","userName":"bapuga","userUrl":"https://itunes.apple.com/us/reviews/id39619549","version":"1.5.1","score":1,"title":"Pretty cool app, but not always clear","text":"UPDATE: THE APP NO LONGER SEES DEVICES ON THE IPHONE 7.  \n\nThe app does an adequate job of controlling the one bulb I have.  Turning off lighting effects is not entirely clear, and the concept of passwords if a bit confusing, but there's still time to figure these out. \n\nWould be great to have Watch app, as having to track down an iDevice just to turn off a light of a bit of a pain. \n\nThat said, my one bulb test has gone well enough that I'm going to invest in more bulbs and some of their globes. \n\nWill update my review as necessary.","updated":"2016-12-23T14:06:59-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1437463599","userName":"Rollcage","userUrl":"https://itunes.apple.com/us/reviews/id4373087","version":"1.4.0","score":3,"title":"Effects don't stick in security mode","text":"I've set up security mode so the candle acts as a timed nightlight.  When the candle turns on, it stays on red rather than the rainbow fade effect I configured.  Not sure if this is an app or candle limitation.","updated":"2016-08-22T11:50:01-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1345168867","userName":"Startdays","userUrl":"https://itunes.apple.com/us/reviews/id184925560","version":"1.2.12","score":3,"title":"Flashing speed up please!","text":"Before the update, but the flickering faster, now a disappointment because as fast as it used to be the blink faster.","updated":"2016-03-09T03:15:18-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1417044317","userName":"former listener0","userUrl":"https://itunes.apple.com/us/reviews/id17334027","version":"1.3.0","score":2,"title":"Needs improvement","text":"Worked fine for the first 2 weeks. App keeps crashing. I've uninstalled the app tried it again still crashes.","updated":"2016-07-21T17:02:34-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1330291170","userName":"Flyer2103","userUrl":"https://itunes.apple.com/us/reviews/id29802408","version":"1.2.10","score":1,"title":"Update no longer works","text":"No longer works after update.  Connects to device but drops connect after changing setting.  Won't find any devices after that.  Last version worked fine.","updated":"2016-02-09T03:55:57-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1298645056","userName":"noiuihhh","userUrl":"https://itunes.apple.com/us/reviews/id148725943","version":"1.2.8","score":3,"title":"Needs fixing","text":"I have a play bulb comet and it sometimes connects and sometimes not also there should be an Apple Watch App","updated":"2015-12-10T07:42:20-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1200666189","userName":"EOS1111","userUrl":"https://itunes.apple.com/us/reviews/id46159437","version":"1.2.40","score":1,"title":"Very poor design","text":"App is poorly designed. Far from being intuitive, there are menu items with no explanation of how to use them (min interval?). Very difficult to switch between different devices. This app needs a complete overhaul to be useful.","updated":"2015-05-21T12:06:27-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1531365048","userName":"Treybo4","userUrl":"https://itunes.apple.com/us/reviews/id323435778","version":"1.6.2","score":5,"title":"Thank You","text":"Thanks for fixing bugs. These are working like a champ.","updated":"2017-01-26T20:44:36-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1300676657","userName":"Codyyy14","userUrl":"https://itunes.apple.com/us/reviews/id265718020","version":"1.2.8","score":2,"title":"Needs Apple Watch support!","text":"The grouping with two bulbs works with mine. I just wish there was more customizable options. I really want to be able to control them with my Apple Watch. Come on guys","updated":"2015-12-14T15:04:05-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1098786283","userName":"Beijoquera","userUrl":"https://itunes.apple.com/us/reviews/id38573628","version":"1.2.22","score":1,"title":"No good","text":"Just got the candles. I can turn them on manually and they shift through the color spectrum on their own, but my iPhone cannot discover them through Bluetooth. That means I can't adjust them at all... not so special. Suggestions to make them functional?","updated":"2014-11-17T17:26:41-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1487007980","userName":"Dinodax","userUrl":"https://itunes.apple.com/us/reviews/id221301409","version":"1.5.1","score":4,"title":"Great but...","text":"The app works well except for one current bug. The scene feature is not working","updated":"2016-11-18T20:09:14-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1259552121","userName":"Hmmmmmmmmmmmmi","userUrl":"https://itunes.apple.com/us/reviews/id86978879","version":"1.2.8","score":1,"title":"No Longer Plays Music From iPhone","text":"This used to be a great app.  But since the update, you can not connect through BlueTooth settings on iPhone and because of that you can only change color but NOT stream music anymore… DOES NOT WORK….","updated":"2015-09-18T23:08:53-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1162839672","userName":"davehdaveh","userUrl":"https://itunes.apple.com/us/reviews/id27820563","version":"1.2.36","score":2,"title":"A little disappointed","text":"Just felt like there is a lot more potential for this to be cooler. Needs integration into other programs and apps. Also the scene color match is not very close at all.","updated":"2015-03-03T18:31:13-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1535180662","userName":"Палом","userUrl":"https://itunes.apple.com/us/reviews/id157506737","version":"1.6.2","score":3,"title":"No apple home kit integration","text":"The app doesn't have a widget or apple home kit integration, pretty hard to access it. Please make it available at least at widgets panel \nThanks","updated":"2017-02-01T18:00:03-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1317723518","userName":".samahsa.","userUrl":"https://itunes.apple.com/us/reviews/id454277920","version":"1.2.8","score":3,"title":"Saman Golpayegani !","text":"mamnoon, thanX, .","updated":"2016-01-16T22:50:16-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1260252096","userName":"Ian Sane - BHM","userUrl":"https://itunes.apple.com/us/reviews/id41978700","version":"1.2.8","score":2,"title":"Love the lights but the \"GROUP\" lights needs serious update","text":"Love the lights but this app needs a serious update on the group setting!\n\nIf you try to create a new group it states it already has a group by that name. So, you try to create a new group with a different name and it states the same thing - the name already exists.\n\nHave over ten bulbs - really would be nice to group them!\n\nPlease update and I'll update my star rating.","updated":"2015-09-20T07:10:15-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1257241431","userName":"Camillodi","userUrl":"https://itunes.apple.com/us/reviews/id158151042","version":"1.2.7","score":1,"title":"Poor experience","text":"Comm'on how a company wants to make a smart product if the most important is missing? Customer experience... Where's the Ipad and watch version for the app? If I looked before buy the candle my decision would be different...","updated":"2015-09-13T20:04:54-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1284055614","userName":"ihavenoneedforanickname","userUrl":"https://itunes.apple.com/us/reviews/id327355557","version":"1.2.8","score":1,"title":"Disappointed","text":"I bought a color bulb that also has a Bluetooth speaker and due to problems within the app i cant play music through the bulb, just my phone. Please fix it soon. :(","updated":"2015-11-08T19:19:03-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1530518720","userName":"OFWGKTA Golf Wang","userUrl":"https://itunes.apple.com/us/reviews/id295386603","version":"1.6.2","score":5,"title":"Thanks for fixing it!","text":"Thanks for fixing group mode!!!!!","updated":"2017-01-25T16:37:55-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1523456096","userName":"Mokrischev","userUrl":"https://itunes.apple.com/us/reviews/id313003423","version":"1.6.1","score":5,"title":"Optimize to iPhone 6,7 screens","text":"Optimize please screens to iPhone 6,7","updated":"2017-01-16T05:36:05-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1482693643","userName":"Levi N.","userUrl":"https://itunes.apple.com/us/reviews/id85039197","version":"1.5.0","score":1,"title":"Timer feature gone!!!","text":"These lights use to wake me up. Now the timer feature was completely removed on this app update. Very disappointing.","updated":"2016-11-11T11:10:18-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1400223860","userName":"Tyty 1111","userUrl":"https://itunes.apple.com/us/reviews/id190817327","version":"1.2.12","score":1,"title":"Doesnt work","text":"Product seems good, but app wont recognize the device, meaning cannot control light from phone. Music via bluetooth is okay via other apps","updated":"2016-06-25T08:56:14-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1214969815","userName":"Brianb2","userUrl":"https://itunes.apple.com/us/reviews/id20560184","version":"1.2.41","score":1,"title":"Horrible","text":"Keeps crashing. Not connecting to bulbs. Playbulbs keep resetting then can't connect. Would not recommend this app or bulbs. Sorry I backed them on kickstater. Stay away from this product.","updated":"2015-06-19T22:19:47-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1308240284","userName":"Phonoodoh","userUrl":"https://itunes.apple.com/us/reviews/id316435101","version":"1.2.8","score":1,"title":"Needs improvement","text":"This app will get a 5 star when the Bluetooth is fixed and I'm able to play music through the bulb.💀","updated":"2015-12-29T15:05:56-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1520777613","userName":"Abadi Almehairbi","userUrl":"https://itunes.apple.com/us/reviews/id434531211","version":"1.6.0","score":1,"title":"Group function","text":"The group function in this version is useless now, I can't turn off or turn on the lights in group mode. Please fix this ASAP!","updated":"2017-01-12T14:17:23-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1524517867","userName":"Autumn_dreams","userUrl":"https://itunes.apple.com/us/reviews/id272239665","version":"1.6.1","score":1,"title":"Terrible update","text":"All I want is the ability to set all the lights in a group to a natural, warm light.  Instead, all I can do is bring them up to a dim blueish tint.  Fix please and I will update my review!","updated":"2017-01-17T17:03:59-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1522938869","userName":"ArawrBear","userUrl":"https://itunes.apple.com/us/reviews/id122993377","version":"1.6.0","score":1,"title":"Update removed functionality","text":"There's no excuse to take away features that worked. Group mode is useless now. Please fix!","updated":"2017-01-15T12:36:33-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1375363204","userName":"Gaulho","userUrl":"https://itunes.apple.com/us/reviews/id181934445","version":"1.2.12","score":1,"title":"Need a timer","text":"Stupid that there is no repeating timer to light the bulbs on everyday.\nGoing to manual on/off switch is absurd.\nI wanted to put them in the garden but then it's impossible.\nPlease improve the app !\nTks","updated":"2016-05-08T03:10:36-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1406256120","userName":"MdWwDm312","userUrl":"https://itunes.apple.com/us/reviews/id415780641","version":"1.3.0","score":1,"title":"Very poor","text":"Collects your data.  Really doesn't work well.  And now has somehow completely stopped working.  Stay away!","updated":"2016-07-05T23:20:19-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1117429887","userName":"Andreaisonline","userUrl":"https://itunes.apple.com/us/reviews/id134316788","version":"1.2.30","score":1,"title":"Disaster","text":"The app does not work.  It should discover the playbulb but it fails to do so.  Honestly, it should not be that hard to make a functional application.  Very disappointed.","updated":"2014-12-22T05:01:35-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1285745180","userName":"Recon917","userUrl":"https://itunes.apple.com/us/reviews/id8842346","version":"1.2.8","score":1,"title":"Nope","text":"Doesn't play music as others have stated. How can they not have addressed this on their website or here?  Will be returning it don't bother with buying it","updated":"2015-11-12T15:59:01-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1140165105","userName":"JOIIIIIIO","userUrl":"https://itunes.apple.com/us/reviews/id113964675","version":"1.2.36","score":2,"title":"Update has bugs","text":"This update took the sync away the colors do not pair anymore real bummer guys ...","updated":"2015-02-01T15:37:37-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1521855677","userName":"Humandalek1","userUrl":"https://itunes.apple.com/us/reviews/id148920759","version":"1.6.0","score":1,"title":"Garbage app","text":"Can no longer turn lights off in group mode! Have to turn them off one at a time","updated":"2017-01-14T02:48:04-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1512836925","userName":"mamikonnik","userUrl":"https://itunes.apple.com/us/reviews/id299488694","version":"1.5.1","score":1,"title":"App doesn't see iPhone","text":"Bluetooth does not work. Very very bad. I have bought it like a present and was disappointed","updated":"2016-12-31T12:17:31-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1328578480","userName":"That_Mann","userUrl":"https://itunes.apple.com/us/reviews/id291671608","version":"1.2.10","score":1,"title":"Dosent work","text":"I can't have the light turn on by it self anymore, timer function is one time use, then you have to reprogram... DO NOT UPDATE!!!!!!","updated":"2016-02-05T22:40:22-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1519884227","userName":"UNTED STATES MAN","userUrl":"https://itunes.apple.com/us/reviews/id402794585","version":"1.5.1","score":4,"title":"It's okay,but should support the apple HomeKit!","text":"This LED lights it's good,but why don't support to HomeKit?","updated":"2017-01-11T06:11:08-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1306018908","userName":"RedAllstar1","userUrl":"https://itunes.apple.com/us/reviews/id225075672","version":"1.2.8","score":1,"title":"No music! Only lights","text":"Just bought 2 for Christmas. I can get the lights to work but it does not play music. Junk!","updated":"2015-12-25T08:54:53-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1376209727","userName":"MarioMRC","userUrl":"https://itunes.apple.com/us/reviews/id430609645","version":"1.2.12","score":1,"title":"Horrible","text":"This product would be great if it atleast worked half the time.","updated":"2016-05-09T19:45:55-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1317650000","userName":"Awesome Allgood","userUrl":"https://itunes.apple.com/us/reviews/id191233600","version":"1.2.8","score":2,"title":"HOLD UP THE MUSIC DOESNT WORK","text":"the lights are awesome but the music doesn't sync with it??!?! like that's all I want is the music. no music=2 stars sorry fam","updated":"2016-01-16T19:28:22-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1523234914","userName":"Scarfaceman1","userUrl":"https://itunes.apple.com/us/reviews/id271593501","version":"1.6.1","score":1,"title":"Ruined app","text":"Ever since the update i cant dim my lights all the way off, and they do not go normal white.","updated":"2017-01-15T22:51:20-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1272129812","userName":"amnesia-kei","userUrl":"https://itunes.apple.com/us/reviews/id131479750","version":"1.2.8","score":1,"title":"Doesn't work","text":"On iOS 9 with iPhone 6s.... Have to control it now with an old phone. Please update!","updated":"2015-10-15T16:01:51-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1328284928","userName":"Ketzu cc","userUrl":"https://itunes.apple.com/us/reviews/id437344960","version":"1.2.10","score":1,"title":"Didn't work after update","text":"DO NOT UPDATE IT!!! I paid a lot for this bulb and now I can't control it anymore!","updated":"2016-02-05T08:34:43-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1423455196","userName":"Yuckaf","userUrl":"https://itunes.apple.com/us/reviews/id408998409","version":"1.3.0","score":2,"title":"😓","text":"Music doesn't work","updated":"2016-07-31T05:48:23-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1281459605","userName":"Macleod__UA","userUrl":"https://itunes.apple.com/us/reviews/id163453480","version":"1.2.8","score":1,"title":"Does not work iOS 9","text":"Does not connect to lamp after iOS 9 update.","updated":"2015-11-03T09:10:43-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1520394466","userName":"Mike326432","userUrl":"https://itunes.apple.com/us/reviews/id535922500","version":"1.6.0","score":2,"title":"Scene mode","text":"Crashes is group mode","updated":"2017-01-12T00:49:03-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1273166160","userName":"Hieloblaze","userUrl":"https://itunes.apple.com/us/reviews/id185077452","version":"1.2.8","score":2,"title":"iOS 9","text":"Doesn't work","updated":"2015-10-17T10:21:59-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1345437744","userName":"CanadianSnuggleBunny","userUrl":"https://itunes.apple.com/us/reviews/id164819512","version":"1.2.12","score":1,"title":"Not connecting","text":"Playbulb Rainbow bulbs will no longer connect at all:(iPhone 6s iOS 9.2.1)","updated":"2016-03-09T16:43:52-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1503783065","userName":"Kosloko","userUrl":"https://itunes.apple.com/us/reviews/id539863313","version":"1.5.1","score":1,"title":"App not working","text":"App isnt finding my devices","updated":"2016-12-17T14:52:31-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1509937506","userName":"Kemo 22222","userUrl":"https://itunes.apple.com/us/reviews/id152696255","version":"1.5.1","score":5,"title":"Nice","text":"Great app!! Thanks","updated":"2016-12-27T00:49:15-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1523406656","userName":"bo7amza..","userUrl":"https://itunes.apple.com/us/reviews/id485933503","version":"1.6.1","score":1,"title":"fix it","text":"now i cant turn off the lights in group mode!! ..","updated":"2017-01-16T04:13:50-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1244685060","userName":"Anaalsema","userUrl":"https://itunes.apple.com/us/reviews/id284989231","version":"1.2.7","score":5,"title":"Nice..","text":"I like it..","updated":"2015-08-17T16:29:55-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1634035357","userName":"Skillbo3","userUrl":"https://itunes.apple.com/us/reviews/id564839508","version":"1.6.3","score":3,"title":"Amazon Echo","text":"Get this to be a skill on amazon Echo so she can control the lights by Bluetooth!!","updated":"2017-06-04T22:37:46-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"7585514124","userName":"xsie","userUrl":"https://itunes.apple.com/us/reviews/id42376670","version":"V1.6.8","score":1,"title":"Malfunction","text":"It has been three years and still no fix to make white light work?!?  When selected, the light turns off.  Need to set white as #FFFFFF not #000000 !\n————————-\nWhite color no longer works with the last update.  Wish I could downgrade to the previous app.  Please fix!","updated":"2021-07-16T21:44:51-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1355977391","userName":"PureCash","userUrl":"https://itunes.apple.com/us/reviews/id195532537","version":"1.2.12","score":1,"title":"One dollar junk product selling for $19.99 in the USA","text":"Junk just like the product. The candle does not blow on or off. There is no customer support telephone number on the packaging of this made in China garbage.","updated":"2016-03-30T10:41:49-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1312927151","userName":"Sultan Shata","userUrl":"https://itunes.apple.com/us/reviews/id101264406","version":"1.2.8","score":5,"title":"👍🏻😍😘😚","text":"والله انها جداً جداً حلوة وبالذات الي فيها بلوتوث ، انصحكم فيها .\nغالية لكن سعرها فيها والله راح احول اضاءة بيتي لها .","updated":"2016-01-07T17:58:11-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1305774084","userName":"Gchanp","userUrl":"https://itunes.apple.com/us/reviews/id211198912","version":"1.2.8","score":1,"title":"Garbage","text":"Won't work with iOS 9 for some reason won't connect at all. Says iOS 7 or later so return this if you have iOS 9 and don't waste your time trying to figure it out.","updated":"2015-12-24T21:35:41-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"},{"id":"1190497130","userName":"Unhappy, the other dwarf","userUrl":"https://itunes.apple.com/us/reviews/id29068867","version":"1.2.40","score":1,"title":"Great idea, could be fantastic, sad app","text":"I've got to say I was really happy with the concept on these candles, then bulbs. Got them both via kickstarted and thought they were ingenious until I got to the app. I have to tell you nothing really works as advertised and if it does it's for a short window. This is one of the deciding point on the garden lights. I'll have wires buried thanks and control the with a switch. Suddenly after this 4-22-15 update we can't control either of our bedroom lights or candles. What is the point of that. Or if one of us can the other can't so the ambient nightlight ( aka where is the puppy sleeping) light is useless. Thanks mipow.","updated":"2015-04-30T20:10:11-07:00","url":"https://itunes.apple.com/us/review?id=911359856&type=Purple%20Software"}]