[{"id":"5084372933","userName":"farfromreality","userUrl":"https://itunes.apple.com/us/reviews/id323894014","version":"4.0.1","score":4,"title":"Good but could be better","text":"Pretty decent app, and I like their temperature sensors but this app needs to have an accompanying apple watch app that can have sensor information on complications of specific rooms. If not for all homekit senors, than at least for the Room or Degree sensors they make which is whole reason I even downloaded the app. I would love to see this feature implemented.","updated":"2019-11-04T04:03:16-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6836638865","userName":"Shaprepenr","userUrl":"https://itunes.apple.com/us/reviews/id41427505","version":"5.0.1","score":5,"title":"A must-have app for advanced HomeKit users— even if you don’t own an eve product!","text":"This app is a must for all HomeKit users, especially those wanting more advanced features for their home. In short: it allows for much greater control of all of the accessories in your home. It works with all HomeKit accessories, even if they are not made by Eve, and it fully integrates with all of your scenes and automations. \n\nThis app takes automations further, by allowing you to do things you just can’t do in the regular Home app, such as setting conditions, in addition to the standard automation trigger. These conditions sync with the Home app, so nothing is controlled by the Eve app. \n\nScenes are a snap to make, especially with smart bulbs. You can drag a color from one bulb to another, across the entire app, to instantly duplicate the color and brightness. \n\nThis app is not simple, but I don’t think it’s meant to be. This app is for those wanting to take full advantage of HomeKit and have access to advanced features. It offers a certain level of control you just don’t get with the Home app. \n\nThe Home app is great for everyone else in the home, but for the one in charge, this is the app for them.","updated":"2021-01-05T23:20:43-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6977202809","userName":"Left0verture","userUrl":"https://itunes.apple.com/us/reviews/id33145683","version":"5.0.2","score":5,"title":"A strong contender","text":"There aren’t a wealth of choices when it comes to dashboard-type apps for Homekit. None of the ones I’ve tried are slam dunks, and a lot of the better ones will set you back a few dollars. Eve is the standout exception. It’s a solid, functional, configurable (to a point) app... and IT’S FREE. That means you can try it out for as long as you need, twist it, tweak it and get a better idea what your needs are vis a vis a dashboard app. My hat’s off to the Eve Home folks - this is a well designed, solid, dependable, USEFUL app and they give it away. Heck, it might even inspire a person to buy a couple Eve devices (not the least expensive HK gear on the market) in appreciation...","updated":"2021-02-10T04:18:23-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"5060082604","userName":"Boscovec","userUrl":"https://itunes.apple.com/us/reviews/id203815952","version":"4.0.1","score":5,"title":"Good HomeKit App","text":"There are a few HomeKit apps besides the native iOS app, but this one has the most logical and useful interface for us. Although one occasionally has to use the individual apps relative to the HomeKit accessory, this one can be used with almost all of ours with a minor exception of some of our Philips products which we had purchased to just try out. Those simply work best with other Hue devices. \n\nWe have ended up purchasing many of the Eve devices, they all consistently work well for us, and we are quite pleased without as well.","updated":"2019-11-01T02:13:54-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6083031871","userName":"nicolasd","userUrl":"https://itunes.apple.com/us/reviews/id19408867","version":"4.3","score":1,"title":"Eve 4.3 can’t connect","text":"UPDATE: Eve App had a big update with 4.3 and now upon launch it just says “initializing homekit” forever. I hope I don’t have to delete and set up everything from scratch! UGH.\n\nThis app, with the Eve home sensor can NOT trigger an automation based on a reading (temperature/humidity/air quality). What’s the use?! The device takes measurements only every 10 minutes. The app has to update data every time you launch... you sit there watching “3 days without data, 2 days without data, 1 day without data” as the app pulls measurement data from the device. Those things are deal breakers for me. As for the app itself, you can’t pinch-to-zoom on a graph. And the app doesn’t remember your view settings (everything’s collapsed and I have to open everything up again).","updated":"2020-06-16T06:31:24-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"7673276319","userName":"Ndzlow","userUrl":"https://itunes.apple.com/us/reviews/id42765349","version":"5.2.1","score":5,"title":"Thread Support","text":"Truly enjoying the performance of your products and I have many as well, but I have a question about the thread network information which you have graciously provided your customers. Currently, when I look at the network it shows everything that supports thread but why does it say “unknown room” for all five of my HomePod minis? Such as, router 08, 18, 2C, 38, 40 & 4C. Even though it lists all the other thread devices by name and what room they are currently located in. Will there be an update to the thread network fixing this?","updated":"2021-08-09T08:07:36-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"4198629805","userName":"Johnny Dont","userUrl":"https://itunes.apple.com/us/reviews/id137881405","version":"3.7.2","score":5,"title":"A robust app","text":"Ok, It’s well known that I’m an Eve fanboy, but I do have a request.  Can you make the tiles on the At a Glance screen smaller (or adjustably sized) so those of us with many devices can actually see them all At a Glance, and improve the contrast between the states?  If you do this I’ll improve my rating to 6 stars.\n\nIf you put out a Bluetooth range extender I’ll give you ten stars.  I have my suspicions why you don’t (can’t).\n\n——————-\n\nThis is a robust app that never gives me any trouble.  There are some features I’d like to see added but nothing that hasn’t been discussed on their blog.  There is some functionality that I’d like to see, too, but can’t be implemented because of Apple’s restrictions.  But as for this app, everything works in a straight forward fashion, intuitive enough.  I hope Elgato keeps supporting their products and starts delivering on the long awaited products like a bluetooth range extender and smoke detector.","updated":"2019-05-23T18:13:53-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1820763533","userName":"majorgearhead","userUrl":"https://itunes.apple.com/us/reviews/id41139483","version":"2.9.3","score":5,"title":"Great app probably one of the best HomeKit vendors as well","text":"I use Elgato Eve door switches for now but plan on getting their new Eve smoke detectors all throughout my house. One this is certain, these guys eat sleep and breath HomeKit and find new and novel ways to support it. This app is a perfect companion to the iOS Home app. It integrates perfectly and doesn’t overstep. It presents the info in such a way that it is superior for controlling your smart home. \n\nBottom line, Elgato is a great company who makes great products and software. Oh and their engineers are ultra accessible and helpful. Hope to get a ton more HomeKit stuff from them.","updated":"2017-10-01T06:43:31-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"4876596632","userName":"RobbieHunter","userUrl":"https://itunes.apple.com/us/reviews/id41696263","version":"3.8.3","score":5,"title":"Works well.  Range Concerns Haven’t Been an Issue","text":"Very happy with my Eve Energy.  Was initially worried about range with a single router in a larger house but it hasn’t been an issue.  After updating to iOS 13 I was getting delayed system status updates for a bit due to the latest Apple TV OS not yet being released.  Otherwise it has been very reliable.  Do wish I could ask Siri to turn my Eve Energy on for a set time and have it turn off automatically.  I use it for a hot water circulation pump and sometimes forget to turn it off.","updated":"2019-10-02T23:06:55-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"2327036021","userName":"jcao","userUrl":"https://itunes.apple.com/us/reviews/id27883631","version":"3.1.1","score":1,"title":"Slow, irritating firmare update process.","text":"I have several elgato motion sensors in my house. Whenever they need a firmware update, I have to update each individual sensor one-at-a-time. The app downloads the same firmware payload for each individual sensor, despite the fact that they are all using the same update. This is exacerbated by the fact that each individual update takes forever, and requires you to keep the app running uninterrupted for the entire update\n(Or the update will fail and you get to start all over again). You should be able to update multiple devices concurrently, as you can with the iDevices app. As it stands, updating firmware on elgato devices is painstakingly slow and fraught.","updated":"2018-03-20T08:35:53-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"3628082917","userName":"NineSevenZero","userUrl":"https://itunes.apple.com/us/reviews/id152629718","version":"3.6.3","score":5,"title":"More Powerful Than Apple Home","text":"I think I’ve seen this mentioned in other reviews, but it’s important to stress. This app is better, and more powerful than Apple’s native Home app. It actually extends the flexibilities and capabilities of your HomeKit environment beyond what you can do with the Home app. This is both amazing, and sad... for Apple. The app is also quite powerful and can connect with other HomeKit systems... honestly, when I’m setting things up I use this app over any other.","updated":"2019-01-08T16:20:34-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"3766613497","userName":"Ratwurkz","userUrl":"https://itunes.apple.com/us/reviews/id34165583","version":"3.6.3","score":1,"title":"Last update deleted all my data","text":"All my data for the last year has been removed by the app update!  I’ve upgraded from iOS 10 to iOS 11 to iOS 12 and my collected home data (air, humidity, air pressure etc) has remained intact but the eve app update wiped it all out. Sometimes this data is used for more than just flipping on fans, and dehumidifiers!\n\nUpdate: One out of four of my door sensors is stillAWOL on the app. The firmware update rendered the last one a ghost as far as the Eve app is concerned. It will no longer connect to the app. The app sees it via Bluetooth but it will not connect, or receive any data. It’s as if the firmware update decided to veto the 4th sensor and went on permanent Holiday! Boo-hiss!","updated":"2019-02-13T14:35:41-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1869016514","userName":"CT Mom 12","userUrl":"https://itunes.apple.com/us/reviews/id33827084","version":"2.9.3","score":2,"title":"Not user friendly","text":"As another user says, while it’s great to plug in and turn my switch on or off by phone, there seems to be no way to program it at all. At one point I got to something which looked like it might be able to turn my lights on at sunset, but it didn’t save my setting, and I could never get to that point again. There are minimal instructions with the product or on the app. I have used a lot of NEST products in my home without any difficulties but received this switch as a gift- I will not be buying other products in this brand unless the user friendliness improves.","updated":"2017-10-23T03:56:43-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6834580000","userName":"outer limits fan","userUrl":"https://itunes.apple.com/us/reviews/id38475228","version":"5.0.1","score":3,"title":"Buggy","text":"I’ve been trying to update the firmware for the thread feature but it either doesn’t finish the update or fails. It also thinks my 85% battery is low! Like the convience, but wish it worked better.\nYesterday I was allowed to add sensor to my favorites in the home kit app but now that option has vanished and the icon became a small circle again above the other HomeKit devices.\nThis will be nice if they ever get the app to work properly.","updated":"2021-01-05T09:58:56-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6779098960","userName":"Spv0Spv","userUrl":"https://itunes.apple.com/us/reviews/id145567196","version":"5.0","score":5,"title":"Great for more complex automations","text":"These things really stand out:\n\n1. Easy editing of more complex automations, and specifically triggers and conditions. Example: start the “heating 2nd floor” at 7am but only when the sensor is below 17C (63F) \n\n2. Support for additional devices like energy meters. My utility’s smart meter (electricity and gas) and the production meter of my PV installation are connected to HomeKit but not supported in the Home app. Eve shows them just fine. \n\nMy only wish it that the makers would release an Apple TV app as well. Preferably with some debug / reset functionality as I feel that the automations on my iPhone are not properly synced to the Apple TV","updated":"2020-12-21T14:10:51-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6468273540","userName":"Frank 035971","userUrl":"https://itunes.apple.com/us/reviews/id128295998","version":"4.5.1","score":4,"title":"Worse product ever","text":"The customer services is a joke . There is not a 1800 number, never got response to my email. The Smart Water Controller link water from inside the battery housing after 4 months of used. Don’t buy any off there products. They don’t respond to emails you, will be loosing your money.","updated":"2020-09-25T14:03:53-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"5877586453","userName":"BK_man","userUrl":"https://itunes.apple.com/us/reviews/id41874579","version":"4.2.1","score":5,"title":"Version 4.2.1 forgot all customizations!!!","text":"When iOS silently updated the app to the 4.2.1 version, my home screen is a mess: many devices that were before no longer a favorite, and new devices appeared there. Although, the number of favorites stays the same. Ruined my UX. Otherwise, a good app.","updated":"2020-04-28T18:59:03-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6956982425","userName":"ratt5425","userUrl":"https://itunes.apple.com/us/reviews/id28810803","version":"5.0.1","score":1,"title":"Useless thermostat","text":"There is no mention anywhere that eve is ONLY compatible with Danvos for all others you’d need an adapter that you have to order.\nCustomer service is a joke, if I want to install something and need help, then I don’t need help in a few days no I need it right away.\nGarbage goes back and will order competitors products and if that doesn’t work either than it’s back to manual operation until someone is customer friendly and has products that work right out of the box.","updated":"2021-02-05T05:23:56-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"3324441921","userName":"arajul","userUrl":"https://itunes.apple.com/us/reviews/id38142526","version":"3.5.2","score":3,"title":"Rough around the edges","text":"I have both the eve room and the eve room 2. Overall the app is okay. However, the syncing has a mind of its own and is, to the best of my knowledge, quite unpredictable - you never really know when it’s going to sync, even if you try to refresh.  Also here’s an example of a UI issue: “Accessory is unreachable, last connected now” - huh? I do, however, like that eve is concentrating on creating a bunch of good HomeKit compatible hardware. Thanks.","updated":"2018-10-20T13:27:26-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"4793463739","userName":"Ballplyr10","userUrl":"https://itunes.apple.com/us/reviews/id25381313","version":"3.8.2","score":4,"title":"Needs color transition option for Eve Flare!","text":"This app is fairly intuitive and well coded but a big mystery as to why my Eve Flare has an option for transition speed but no actual option to make it color cycle. If it could color cycle and or “breathe” as in fade to dim then bright again it would be a lot more compelling a product. I’m not convinced I’m keeping mine due to this limitation.","updated":"2019-09-16T17:46:42-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6127187716","userName":"Tigzola","userUrl":"https://itunes.apple.com/us/reviews/id26397780","version":"4.3.1","score":2,"title":"What am I missing?","text":"I installed the device today.  It took me some time to tighten everything up to help eliminate leaks.  I kept testing the device on my phone and it kept working fine.  I get home from work and try to use the HomeKit app, and there is trouble connecting.  Used my iPad and got the same results.  I tried to set up a schedule, and I was told again that there was trouble communicating.  Extremely frustrating!","updated":"2020-06-27T01:13:18-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6114761887","userName":"hen008","userUrl":"https://itunes.apple.com/us/reviews/id307363664","version":"4.3.1","score":4,"title":"Pretty good but..","text":".. it misses two important features from what I can tell: (1) a timer function that could turn off outlets after x minutes, (2) a randomized automation to simulate that someone’s at home when away. I hope that can be integrated.","updated":"2020-06-23T21:11:29-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"2273309085","userName":"sgmiller","userUrl":"https://itunes.apple.com/us/reviews/id19546798","version":"3.1.1","score":5,"title":"Latest version wonderful!","text":"I have gotten away from this app because of various issues, particularly with the air-quality monitoring but I find the latest version to be flawless. In fact, it’s so good it’s my go to app for all HomeKit functions as it works even when the others fail.\n\nGreat job devs!","updated":"2018-03-05T03:48:08-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"4233408720","userName":"munpip214","userUrl":"https://itunes.apple.com/us/reviews/id85046080","version":"3.7.2","score":3,"title":"Problem Loading temp","text":"This app has been having issues downloading data from eve weather. It doesn’t always start the download. Sometimes I have to refresh multiple times or force quit the app. Even though I am right next to it, if it works, it only downloads about 5 days worth of data. I wish it could download automatically in the background","updated":"2019-05-29T22:45:49-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6323623820","userName":"BeamerDude","userUrl":"https://itunes.apple.com/us/reviews/id5111133","version":"4.4","score":2,"title":"Unreliable & Useless with HomeKit","text":"Not sure what people are rating when it comes to giving this app anything more than 2 stars. This app is unreliable. When you ask Siri what the temperature is, she always responds with the previous reading. Today, it was over 100 degrees and Siri said it was 92. You have to MANUALLY open the Eve app for the temperature to update. What’s the point of HomeKit integration, then? This app is unreliable and useless with HomeKit.","updated":"2020-08-15T13:59:37-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"7711184835","userName":"an idiotic nickname","userUrl":"https://itunes.apple.com/us/reviews/id520829480","version":"5.2.1","score":1,"title":"Unreliable device, cumbersome app","text":"My experience with Eve mirrors that of the HomeKit “ecosystem” overall. Features, performance and reliability are all lacking, especially by comparison with competing platforms. Bluetooth based Thread is a complete failure compared to mature home automation technologies like Z-Wave and Zigbee. Eve’s tech support was of no help resolving device communication issues. The Eve app seems little more than another layer on top of the HomeKit platform with a less intuitive UI than the native Home app.","updated":"2021-08-19T08:22:20-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6724673759","userName":"一-一","userUrl":"https://itunes.apple.com/us/reviews/id27086842","version":"4.6","score":5,"title":"Works with any temp sensor for automation of switches","text":"Bought the EVE air quality sensor which is great can detect when cooking, but the app requires access to the HomeKit data to function. Works with any temp sensor for automation of switches will add temperature automation into HomeKit, which isn’t supported natively in HomeKit","updated":"2020-12-06T11:50:04-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"3556568862","userName":"LiquideFeline","userUrl":"https://itunes.apple.com/us/reviews/id37912558","version":"3.6.2","score":5,"title":"iOS 12 connectivity problems?","text":"I was having iOS 12 connectivity problems until yesterday. My house lost power so every device reset. Now eve works perfectly again! Nothing like a good old hard reboot!","updated":"2018-12-21T10:58:08-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"3386649734","userName":"ScottNelson","userUrl":"https://itunes.apple.com/us/reviews/id43758","version":"3.5.3","score":4,"title":"Lost all my devices and settings","text":"This may be an Apple issue, but since all my devices are from Elgato Eve, they should have a back up system in place.  Now I have to spend half a day re connecting all my devices and reprogramming all me scenes and automations.  What a pain!!","updated":"2018-11-06T01:15:16-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"4237343895","userName":"ApplePayForever","userUrl":"https://itunes.apple.com/us/reviews/id6170329","version":"3.7.2","score":5,"title":"Like magic","text":"Quick and easy to get it installed and running. My mother has difficulty walking and the elgato eve has been a game changer. Now she just use voice commands to turn things on and off without getting up!","updated":"2019-05-30T16:09:16-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"7553840918","userName":"DRA1952","userUrl":"https://itunes.apple.com/us/reviews/id256700509","version":"5.2.1","score":1,"title":"Caveat emptor","text":"I love Apple products and decided to start with HomeKit products as I begin setting up home security technologies for my time away. This product reports data as advertised, but it has NO capability to initiate email or text alerts if temp or humidity falls outside certain parameters.  It will now only provide backup for me after I purchase other reasonably priced products that can accomplish this winter essential task for freeze protection security.","updated":"2021-07-08T09:32:44-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"5985982744","userName":"Sid007364238582784557","userUrl":"https://itunes.apple.com/us/reviews/id43270130","version":"4.2.2","score":5,"title":"Love the app","text":"I love the app. One thing I’ll love for the developers to add is a temperature trigger that works with the local weather temp in my area and with location like if I’m going home on a day that’s 90 degrees for example.  Thanks for the app.","updated":"2020-05-23T19:25:16-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"4328069136","userName":"jmco","userUrl":"https://itunes.apple.com/us/reviews/id20177886","version":"3.7.2","score":1,"title":"Kind of does not work!","text":"I’ve used it for a few years now. First on an iPhone 6 and now XR. \nI wish it had a dark mode.\nBut the biggest problem by far is that it often does not work. You may get a partial sync or no sync at all. Either way, it usually takes forever to complete. \nIt is an unpredictable and buggy app. I thought is was because of the iPhone 6 but, all this is still happening with an XR.","updated":"2019-06-16T20:34:23-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"5479483442","userName":"Pavel Bystrov","userUrl":"https://itunes.apple.com/us/reviews/id128986018","version":"4.1.1","score":4,"title":"Multi-tariff for electricity consumption needed","text":"Great app, nice interface, but multi tariff setup option is missing - you can setup one price, however it is quite common to have 2 or 3 levels of tariff for electricity, depending on the time of the day/night.","updated":"2020-02-02T08:38:19-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6098056703","userName":"1492999","userUrl":"https://itunes.apple.com/us/reviews/id24332683","version":"4.3.1","score":5,"title":"Problem solved","text":"This application works well and the developers were very prompt in correcting a problem with the previous version.","updated":"2020-06-19T17:10:20-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"5571874517","userName":"AndreiD2017","userUrl":"https://itunes.apple.com/us/reviews/id360893214","version":"4.1.1","score":5,"title":"Top products","text":"Everything works as expected. Be warned though: you can’t control from wan if you don’t have an Apple TV or HomePod. You can’t even update the statistics.","updated":"2020-02-23T16:27:29-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"4841590485","userName":"epishkin","userUrl":"https://itunes.apple.com/us/reviews/id43955736","version":"3.8.3","score":5,"title":"The best free homekit app","text":"It doesn’t group devices like apple home app does.\nYou can create an automation with a condition on a temperature or humidity sensor.\nIf you get a weather station or a homebridge plugin for weather this app even shows the history of measurements!","updated":"2019-09-26T10:59:57-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"7980806849","userName":"antonkhoff","userUrl":"https://itunes.apple.com/us/reviews/id483649330","version":"5.3.2","score":4,"title":"Add Search in Automation Rules","text":"Great app, much better than the standard one. Please just add a search or filtering to the automation rules. I’ve got close to a hundred rules and sometimes it’s really time consuming to find something.","updated":"2021-11-02T05:22:45-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6067207657","userName":"Adam-san","userUrl":"https://itunes.apple.com/us/reviews/id34460707","version":"4.2.3","score":4,"title":"Great so far","text":"Can you guys please make an option to export all data from my Degree (i.e. combined temp/hum/press data) instead of having to export three separate files? Thanks!","updated":"2020-06-12T07:58:30-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"5732396848","userName":"GMBSEA","userUrl":"https://itunes.apple.com/us/reviews/id138193796","version":"4.1.1","score":1,"title":"Unusable at this point","text":"iOS 13.3.1, fresh install, then deleted, iPhone rebooted and new install of the app. \nYour app erroneously says that “iCloud Data Sync is currently in progress...” and doesn’t allow me to register my devices. \nThis is false as I also tested it\n1. In Airplane mode\n2. After explicitly turning off both WiFi and Cellular connections\n- in both of the above cases iCloud Sync could not be possibly occurring.\nPlease fix this bug ASAP, I didn’t buy your devices to manage them manually!\n\nRating stays @ 1 star until your app is fixed.\n\nBTW: link to your support page provided with this app keeps timing out (and no, it is NOT my connection issue).","updated":"2020-03-29T13:06:11-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"2950307228","userName":"travoose1","userUrl":"https://itunes.apple.com/us/reviews/id30772669","version":"3.4.1","score":1,"title":"Good Idea, Doesn’t Deliver.","text":"Purchased the outdoor weather sensor.  Weather readings update in Apple’s Home App as well as this app...however, it does not update the historical graph within this app, it keeps telling me that there is no data found.  The main reason I got this product was to see the historical graph...without this feature working I’d say I wasted 45 bucks and could have gotten something a lot cheaper.  \n\nPS: Elgato support is terrible.","updated":"2018-07-22T11:08:33-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"5146190773","userName":"Vladicom","userUrl":"https://itunes.apple.com/us/reviews/id159636417","version":"4.0.1","score":1,"title":"Something happened and now I can’t set it up.","text":"I had this app for more then a year, and had a lot off setup there. Until last week everything just disappeared and now it on set up page , where I can even start a new home because it resets to the beginning every time it start searching for accessories","updated":"2019-11-15T20:11:09-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6644261226","userName":"Distorted Fox~","userUrl":"https://itunes.apple.com/us/reviews/id6753099","version":"4.6","score":5,"title":"I love this app","text":"This is so well designed and you’re able to do a ton with the app. The developers are also really great and responsive!","updated":"2020-11-14T05:59:57-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6093744353","userName":"MrBlanston","userUrl":"https://itunes.apple.com/us/reviews/id23002004","version":"4.3","score":1,"title":"Took a bit to get 4 stars","text":"Back to 1 Star - stuck on “ initializing HomeKit”\n\nIt appears that everything is fine after 3-4 updates since Jan 2016. \nUsing with Eve Weather, and early on it was very slow to get data, and had an unreliable connection 7 feet from the Apple TV.\nNow appears to be okay; updates to weather are very fast.","updated":"2020-06-18T17:42:06-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"8024879830","userName":"spike112399","userUrl":"https://itunes.apple.com/us/reviews/id1290269439","version":"5.3.2","score":3,"title":"Can’t get it to work right","text":"It seems it can’t see the thread network anymore.  I have Apple TV and multiple HomePod mins, and 2 eve energy.  When I click to view the thread network, it just spins.  Am I doing something wrong?","updated":"2021-11-14T16:21:24-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6087671257","userName":"BBdAmaral","userUrl":"https://itunes.apple.com/us/reviews/id105217319","version":"4.3","score":5,"title":"Invaluable Tool for my Cellar","text":"I’m stuck on Initializing HomeKit screen (update 4.3). We need you to fix this please.\n\nUpdate: problem solved, thank you.","updated":"2020-06-17T08:00:32-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"2733567458","userName":"Kwtf2016","userUrl":"https://itunes.apple.com/us/reviews/id16010804","version":"3.4","score":5,"title":"A Better HomeKit App","text":"With very well thought-out design , especially with extremely helpful grouping , it makes particularly informative glances and time tracking of all sorts HomeKit enabled measurements","updated":"2018-06-20T12:45:19-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"3183966286","userName":"Markisdaman","userUrl":"https://itunes.apple.com/us/reviews/id425410070","version":"3.5","score":1,"title":"App doesn’t work on all iOS 11 builds","text":"I’m on IOS 11.1.2. Every time I try to setup the app when I get to the “searching for device” part of the setup, the setup just completely restarts. \n I remember before buying the device I specifically checked to make sure that iOS 11.1.2 was supported (because updating iOS for NOT an option for me. it clearly stated it was supported. \n\nI’ve tried exiting all home kit apps and restarting. This does nothing to help. \n\n  I hope the devs can help because that would be truly unfortunate to spend $40 on a device just to find out that the software doesn’t provide the support it states it does.","updated":"2018-09-13T01:42:30-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"5566487076","userName":"Phillysdon04","userUrl":"https://itunes.apple.com/us/reviews/id349456959","version":"4.1.1","score":5,"title":"Home++","text":"This give you extra features that the Apple Home app doesn't have. Thanks!","updated":"2020-02-22T09:42:32-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"7902771643","userName":"FergyR","userUrl":"https://itunes.apple.com/us/reviews/id143413354","version":"5.3.2","score":4,"title":"Works great!","text":"With the latest update they fixed the bug with the Thread Network display and it now working again!  Great app for home automation","updated":"2021-10-11T07:08:16-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"4804249194","userName":"lonepalm","userUrl":"https://itunes.apple.com/us/reviews/id37120013","version":"3.8.3","score":4,"title":"Unable  to enable Dark mode","text":"You just released an update which includes support for iOS 13. Yay. The problem is that there is no setting to enable dark mode support !!!!","updated":"2019-09-19T06:30:26-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"5156226788","userName":"Toshibo","userUrl":"https://itunes.apple.com/us/reviews/id106698538","version":"4.0.2","score":5,"title":"Request to add flash lights","text":"Please add option to add Flash and change the color for the scenes and automation. I like to flash the light red when sensor is activated.","updated":"2019-11-16T22:13:26-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"7976364175","userName":"JT-Reviews","userUrl":"https://itunes.apple.com/us/reviews/id117325233","version":"5.3.2","score":3,"title":"Separate tab for eve products only","text":"Can we have a separate place that only displays Eve products, so that we can more easily manage firmware updates, thread, etc.?","updated":"2021-10-31T23:26:32-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"2980653785","userName":"jmfkell","userUrl":"https://itunes.apple.com/us/reviews/id86334836","version":"3.4.1","score":3,"title":"Nothing Spectacular","text":"Bring back the “year” option on the weather graphs, please! \n\nOtherwise, does its job. Occasionally unable to read the sensor even in close proximity and with full battery (in sensor).","updated":"2018-07-27T21:22:56-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6836070461","userName":"elfindley","userUrl":"https://itunes.apple.com/us/reviews/id31298482","version":"5.0.1","score":2,"title":"No Guest Admin Support","text":"I think this app could have been good. But unfortunately, I couldn’t use it. I have full admin permissions to our home, but the main account is my husbands. With Eve, it only sees that I’m a guest and doesn’t allow me to create automations.","updated":"2021-01-05T19:16:08-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"2152700747","userName":"Just Flint","userUrl":"https://itunes.apple.com/us/reviews/id37687898","version":"3.0","score":3,"title":"Notifications and alerts needed","text":"I would like to see notifications and set alerts   of detected VOCs, humidity , and temperatures ... Wish list, it would be nice to see what individual VOC’s are being detected... I want my iOS and macOS equipment to read it","updated":"2018-02-01T00:24:19-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6756954432","userName":"swunderlich","userUrl":"https://itunes.apple.com/us/reviews/id46288833","version":"4.6","score":1,"title":"eve snoops on homekit","text":"just becuase your app  and devices are homekit enabled does NOT give you the right to snoop on all the other Homekit devices without express consent - hiding behind the generic EUA is coward and crooked. I dont need or want you to have access to my Circle View camera's which by the way have MUCH BETTER night vision - sayonara EVE","updated":"2020-12-15T11:59:10-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"4848638960","userName":"Remanman","userUrl":"https://itunes.apple.com/us/reviews/id29681606","version":"3.8.3","score":2,"title":"Can’t make it work","text":"I have tried and tried but I cannot get Rules to work. I am trying to automate non-Eve equipment. Maybe that is the issue. I would pay for an app that would let readings from one accessory trigger an action on another manufacturers accessory.","updated":"2019-09-27T16:34:43-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6355369545","userName":"ChristianRiley","userUrl":"https://itunes.apple.com/us/reviews/id27717973","version":"4.5","score":4,"title":"Latest firmware","text":"The latest firmware seems to have helped with reliability. Thanks!","updated":"2020-08-24T04:34:39-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"2682203928","userName":"jimmywwy","userUrl":"https://itunes.apple.com/us/reviews/id211759031","version":"3.4","score":5,"title":"Thank you!!!","text":"This app provides more functions/automations than HomeKit app. With this app we can utilize our HomeKit accessories with the comprehensive rules.","updated":"2018-06-12T07:11:05-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"7597855402","userName":"Dadie G","userUrl":"https://itunes.apple.com/us/reviews/id26502239","version":"5.2.1","score":3,"title":"No support when the Eve outlets lose signal","text":"I’ve purchased 14 Eve outlets to replace WeMo outlets. They’ve stopped working a few times, and I’ve opened the app and they worked again. \nToday, 6 of them are not working. Opening the app does not help b\n\nI cannot find an answer on the website. \nAND NO PHONE SUPPORT!\n\nI thought the thread network would be better. \nBack to WeMo?","updated":"2021-07-20T06:08:29-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6660791190","userName":"173773725151781","userUrl":"https://itunes.apple.com/us/reviews/id539494761","version":"4.6","score":1,"title":"no longer shows consumption data","text":"I have a single power strip purchased for one of its main purposes of showing electricity consumption and the new app versions no longer show this. Going to return","updated":"2020-11-18T16:19:41-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"7300979301","userName":"Bleecker44","userUrl":"https://itunes.apple.com/us/reviews/id201902829","version":"5.2.1","score":3,"title":"Overly complex","text":"The device seems to work but the app is overly complex. Things like setting up an alert if the temperature is too high are a mystery.","updated":"2021-05-05T06:17:10-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"2859511958","userName":"BK_man (US)","userUrl":"https://itunes.apple.com/us/reviews/id357071007","version":"3.4.1","score":5,"title":"Better than Home app from Apple!","text":"I love the way this app is designed, no regrets for Elgato Eve products.","updated":"2018-07-07T15:57:22-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"7939884140","userName":"BrewMeiater_S","userUrl":"https://itunes.apple.com/us/reviews/id1109253847","version":"5.3.2","score":4,"title":"Works better than Home","text":"A major upgrade versus Apple Homekit","updated":"2021-10-21T17:58:45-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"5478768192","userName":"48 user since 1989","userUrl":"https://itunes.apple.com/us/reviews/id35808450","version":"4.1.1","score":1,"title":"Poor User Interface","text":"There are several places to rename an Eve device, and the different names show up in different parts of the app\n\nThis makes it almost impossible to know which room a particular sensor is in!\n\nWorse, there is no indication which of these names is linked to Apple Home app.\n\nGood luck managing more than one Eve product!!!\n\nPS:  the press and hold to open a sensor in the app is annoying, a simple press would do there guys","updated":"2020-02-02T05:16:07-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"4491391733","userName":"Kyle312","userUrl":"https://itunes.apple.com/us/reviews/id104367802","version":"3.8","score":5,"title":"Great","text":"Easy to use and can do complicated conditions.","updated":"2019-07-20T05:43:38-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"4955475187","userName":"سلمان آلشهري","userUrl":"https://itunes.apple.com/us/reviews/id459716687","version":"4.0.1","score":4,"title":"I hope to support Arabic as your application is widespread in the Middle East.","text":"I hope to support Arabic as your application is widespread in the Middle East.","updated":"2019-10-16T06:20:11-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"2253940997","userName":"Happygirl218","userUrl":"https://itunes.apple.com/us/reviews/id26384670","version":"3.1.1","score":5,"title":"Beautiful Layout","text":"It is simple, straightforward, easy to use!","updated":"2018-02-27T15:36:46-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6092339270","userName":"antiguat","userUrl":"https://itunes.apple.com/us/reviews/id181623937","version":"4.3","score":1,"title":"Terrible update","text":"With the 4.3 update app just shows initializing home kit. Can’t get past this screen. You really should test updates before releasing them. Please advise where I can return for refund.","updated":"2020-06-18T09:16:00-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6248022458","userName":"JaegerBob","userUrl":"https://itunes.apple.com/us/reviews/id40596991","version":"4.4","score":3,"title":"Water Consumption","text":"It shows water consumption to 10 decimal points? Really? Even 1 might be too much.","updated":"2020-07-27T07:54:49-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"3569522201","userName":"RiPpeRdUdE12","userUrl":"https://itunes.apple.com/us/reviews/id32200236","version":"3.6.3","score":1,"title":"Updates Keep Breaking Scenes","text":"Not sure why, but after the last two updates my scenes no longer work.  I’ve attempted to delete and recreate but the only fix I’ve found is to rename the scene... strange but works.","updated":"2018-12-24T19:28:19-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6177159783","userName":"vnizzz","userUrl":"https://itunes.apple.com/us/reviews/id86767609","version":"4.3.1","score":4,"title":"HomeKit TVs","text":"Still doesn’t support HomeKit TVs, however as reported by the developer it’s due to Apple limitations","updated":"2020-07-09T08:28:30-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"5732463832","userName":"HokieIPad","userUrl":"https://itunes.apple.com/us/reviews/id27372447","version":"4.1.1","score":1,"title":"Poor range","text":"Eve devices may be fine in Germany where the average house is as big as a North American bedroom closet, but here the range is dreadful. It’s virtually impossible to get a reliable connection to the Aqua devices, even with the Eve Connect bridge.","updated":"2020-03-29T13:27:23-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"2630952443","userName":"hekkio","userUrl":"https://itunes.apple.com/us/reviews/id356424043","version":"3.2.1","score":5,"title":"Good job","text":"Design is not so pretty, but automation and organization better than in HomeKit app.","updated":"2018-06-02T04:13:35-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"3745586026","userName":"strellyman","userUrl":"https://itunes.apple.com/us/reviews/id101423120","version":"3.6.3","score":4,"title":"maybe you’ll see this...","text":"would like to have the ability to better fine tune the detection interval for my onvis motion sensors.","updated":"2019-02-07T22:41:07-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6091977357","userName":"Starr_Man","userUrl":"https://itunes.apple.com/us/reviews/id127065916","version":"4.3","score":1,"title":"Last Update Not Working","text":"The last update for this app will launch but stops there, fix this issue please, please fix it’s broke","updated":"2020-06-18T07:34:59-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"3520739222","userName":"redigerjr","userUrl":"https://itunes.apple.com/us/reviews/id14164702","version":"3.6","score":1,"title":"Eve Room 2","text":"After finding the device the app keeps searching for something else.  It never takes me to the next step of the setup process.","updated":"2018-12-11T16:46:06-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"5134095537","userName":"NoHoWarlord","userUrl":"https://itunes.apple.com/us/reviews/id35101647","version":"4.0.1","score":1,"title":"Why do you keep asking","text":"The app is fine. When you keep bugging me for a rating and review it’s gets really annoying so I do this. Knock it off.","updated":"2019-11-13T15:56:28-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"3323721996","userName":"inazarv","userUrl":"https://itunes.apple.com/us/reviews/id25457037","version":"3.5.2","score":5,"title":"Awesome","text":"It’s functional, intuitive and beautiful. Great job, Eve team.","updated":"2018-10-20T08:53:02-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"2176087074","userName":"Mobi194","userUrl":"https://itunes.apple.com/us/reviews/id181218202","version":"3.1","score":3,"title":"Works ‘ok’","text":"work alright, but is always saying bluetooth is disabled when it is not.","updated":"2018-02-06T19:26:51-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6197099800","userName":"Sjsm423","userUrl":"https://itunes.apple.com/us/reviews/id193420709","version":"4.3.1","score":1,"title":"What happened","text":"The app doesn’t tell you when the door opens or closes anymore.","updated":"2020-07-14T07:35:57-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6087412328","userName":"Mike987977654335689","userUrl":"https://itunes.apple.com/us/reviews/id34813415","version":"4.3","score":3,"title":"Initializing HomeKit issue - Tap and hold worked","text":"IPhone X - Tap and hold worked.","updated":"2020-06-17T06:51:18-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"2094586231","userName":"Crazy at Christmas","userUrl":"https://itunes.apple.com/us/reviews/id505912053","version":"3.0","score":2,"title":"Last update Jan 2018","text":"Ever since last update 4 days ago my eve reads temp but won’t fill in graph. Loved it before that.","updated":"2018-01-16T04:20:38-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"5519581175","userName":"Zachysmack","userUrl":"https://itunes.apple.com/us/reviews/id240006609","version":"4.1.1","score":1,"title":"App won’t open","text":"It reads that it’s “Initializing HomeKit”, but it never goes beyond that. I’ve restarted the app. I restarted the phone. Nothing works.","updated":"2020-02-11T20:19:43-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"8062172655","userName":"Pete Mayhem","userUrl":"https://itunes.apple.com/us/reviews/id127922450","version":"5.4","score":1,"title":"Changing Light Icon Changes Device Name","text":"Bad update. Changing device icons steamrolls your device names with the name of the icon.","updated":"2021-11-25T08:39:31-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"3549344636","userName":"Travel Clarkie","userUrl":"https://itunes.apple.com/us/reviews/id41143492","version":"3.6.2","score":2,"title":"Reachability is still an issue.","text":"I contacted support about the reachability issue and they told me to contact Apple.","updated":"2018-12-19T10:56:02-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6099184088","userName":"The Bat Outta Hell","userUrl":"https://itunes.apple.com/us/reviews/id43321760","version":"4.3.1","score":5,"title":"Great app","text":"It works!","updated":"2020-06-19T23:40:18-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"5881425855","userName":"username12345","userUrl":"https://itunes.apple.com/us/reviews/id25176840","version":"4.2.1","score":2,"title":"Sync fails","text":"Don’t promise syncing of the “at a glance view” if you can’t deliver.","updated":"2020-04-29T17:15:49-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"2914090680","userName":"Elektbtkflsndbvedk","userUrl":"https://itunes.apple.com/us/reviews/id85638678","version":"3.4.1","score":1,"title":"App keeps restarting the setup menu","text":"Completely unusable at the moment.   I open the app, create the home and the setup just restarts...","updated":"2018-07-15T15:26:13-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"2865777466","userName":"arie76","userUrl":"https://itunes.apple.com/us/reviews/id107490777","version":"3.4.1","score":1,"title":"Useless on Iphone 6s plus","text":"Useless as the “edit” and “next” buttons in app dont work so inpossible to finalize settings. Expensive junk.","updated":"2018-07-08T13:00:23-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"2218571214","userName":"MandevilleMike","userUrl":"https://itunes.apple.com/us/reviews/id38799265","version":"3.1.1","score":2,"title":"Work great but.....","text":"These door contacts work great but updating the firmware via THEIR app is a nightmare. Total FAIL on their part.","updated":"2018-02-17T07:38:36-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"3680950685","userName":"flyWhy","userUrl":"https://itunes.apple.com/us/reviews/id25837614","version":"3.6.3","score":5,"title":"Best HomeKit App","text":"While not perfect, it is probably the best HomeKit app.","updated":"2019-01-22T02:35:12-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6083169561","userName":"JoeNyongesa","userUrl":"https://itunes.apple.com/us/reviews/id216409787","version":"4.3","score":1,"title":"New update","text":"Can’t get past the “initializing HomeKit” page on iPhone 11.\n\nFix this","updated":"2020-06-16T07:08:44-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"4900596118","userName":"Eddie Hazel11","userUrl":"https://itunes.apple.com/us/reviews/id25134825","version":"3.8.3","score":3,"title":"Actions and alerts for temperatures!","text":"Daily notifications on highs and lows!","updated":"2019-10-06T12:28:54-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6082343780","userName":"krimco1","userUrl":"https://itunes.apple.com/us/reviews/id41083921","version":"4.3","score":2,"title":"Swing and a miss","text":"4.3 can’t get past “initializing HomeKit”. iOS 13.5.1 on iPhone X.","updated":"2020-06-16T03:25:11-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"5674670117","userName":"Merchon","userUrl":"https://itunes.apple.com/us/reviews/id39784511","version":"4.1.1","score":1,"title":"Unreliable","text":"The is an unorganized mess. Eve products are unreliable and constantly disconnect from WiFi and HomeKit.","updated":"2020-03-17T16:22:09-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"4870587489","userName":"USPilot","userUrl":"https://itunes.apple.com/us/reviews/id33853700","version":"3.8.3","score":1,"title":"No iOS 13 Dark Mode","text":"Still no dark mode support for iOS 13. iOS 12 has it, but not iOS 13.","updated":"2019-10-01T13:52:29-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"3830471684","userName":"Jim314159","userUrl":"https://itunes.apple.com/us/reviews/id110175158","version":"3.6.3","score":1,"title":"Totally Non-Functional","text":"All it ever does is complain and refuse to do anything.","updated":"2019-03-01T17:53:31-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"3215985048","userName":"Unnameddd","userUrl":"https://itunes.apple.com/us/reviews/id29791639","version":"3.5","score":1,"title":"Won’t connect to aqua","text":"Says aqua is unreachable and it is unable to pair it again.","updated":"2018-09-21T21:47:54-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1485044223","userName":"GummyKibble","userUrl":"https://itunes.apple.com/us/reviews/id25448773","version":"2.5","score":4,"title":"Much more than I'd expected","text":"I installed the Eve app a year ago when I got Room and Weather sensors for Christmas. I'd expected it to stay a nice, but simple, interface for fetching data from those devices. It's turned into a far more ambitious way to configure and use all of HomeKit.\n\nI had never expected that Eve's little app would grow to become my favorite way to automate our home, but here we are. Nice job!","updated":"2016-11-15T08:26:04-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"5815957125","userName":"Jertodd","userUrl":"https://itunes.apple.com/us/reviews/id493198643","version":"4.2","score":2,"title":"Good but........","text":"No HomeKit tv support? Why?","updated":"2020-04-15T09:57:29-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"3259608990","userName":"Leapole","userUrl":"https://itunes.apple.com/us/reviews/id42883438","version":"3.5.1","score":1,"title":"Forced to review","text":"Forced me to review","updated":"2018-10-03T09:03:44-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1394495754","userName":"Dookie 2x","userUrl":"https://itunes.apple.com/us/reviews/id25672372","version":"2.0","score":3,"title":"Amazingly simple and direct","text":"Setup was amazing in how crisp it is including automagically integrating via HomeKit. I am just starting out with an Eve Weather and after setting it up which took nearly 1 minute (the \"difficult\" part was realizing the batteries needed to be installed). As soon as it was enabled and I approved HomeKit which also required I use iCloud Keychain (I thought I had already enabled it months ago when I actives my new 6s+ at the time). \n\nAdding others to have access to Eve Weather was just as simple but honestly the logical thing is it Apple automatically enabled family members that I have via iCloud Family Sharing. Still it was simple enough. You can add/invite via the Eve app or via HomeKit in Settings. \n\nThe whole thing is so wonderfully simple I feel like I must be missing something. Now I'm lusting for either an Eve Room or perhaps even dumping my Nest Thermostat (v2) which seems like a dinosaur not having HomeKit and lacking features that EcoBee3 or other new HomeKit enabled thermostats have. I hoped I would be able enable triggers and conditions with Eve/HomeKit and it's all super easy and accessible via the Eve app as its fully integrated with HomeKit.","updated":"2016-06-14T16:22:13-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1370060620","userName":"balooba","userUrl":"https://itunes.apple.com/us/reviews/id34693004","version":"1.6","score":3,"title":"Good product, app could be better","text":"The Eve is a solid HomeKit device that does what it says. The app makes it easy to control these devices. Where it falls short is for those who bought the Eve to track power usage. It collects all the relevant data but the UI is lacking. It plots graphs of the daily consumption but can't add up weeks, months etc. this is silly since the data is all there inside! I specifically bought the Eve to track the power usage over time but if I want to see how much power was used during a month I have to open up a calculator and do it manually. Come on Elgato!\n\n Also, the graph labels are in a teeny tiny an light gray font. The only way to read it is to take a screen shot and view using zoom in the photos app.","updated":"2016-04-28T03:02:39-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1543746866","userName":"Xna","userUrl":"https://itunes.apple.com/us/reviews/id85903395","version":"2.5.2","score":5,"title":"Best HomeKit app","text":"Update: Feb, 2017 - still the best and getting better with updates! Love it!\n******\nI've been working on fitting HomeKit devices into our house and have to say, this app is the best in the HomeKit space. Is it perfect? No. But what you get is way better than Apple Home (terrible), Lutron, iDevices etc. You can set schedules, timers and, what's most important in a smart home, conditions and rules/dependencies. Unfortunately, this is still a little clunky in this app since you have to do it separately from the scene and it took me longer than I wanted to figure this out, but it works well once set up!","updated":"2017-02-13T07:47:17-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1318021803","userName":"yopaulmiranda","userUrl":"https://itunes.apple.com/us/reviews/id27148992","version":"1.2","score":1,"title":"Lacks Push Notification - Door & Window Sensors","text":"Got the door & window sensors. Hardware works. App lacks notification functionality. Kind of defeats the purpose of getting the sensors. I would like to get a push notification when my door has been opened. Having to open the app just to check if my door is close or someone might have opened it is kind of dumb. That is especially crucial if I'm away from my house, out of town. Until the functionality is added, I give a it one star. \n\nIt does connect to my HomeKit compatible deadbolt (which is nice) but again same issue I have with the app for that hardware, doesn't have push notification functionality to let me know that my door has been locked or unlocked.","updated":"2016-01-17T10:01:26-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1505053074","userName":"philbikes","userUrl":"https://itunes.apple.com/us/reviews/id145318833","version":"2.5.1","score":1,"title":"Automated switch plug anything but","text":"I found the automated switch plug and associated eve app to be very difficult to use.  All I wanted to do was turn my Christmas tree on following a schedule and off five hours later every day. That seems to be nearly an impossible task with the logic built into the app. For example it offers a start time but not a stop time. I read through the instructions but they make no reference on how to use the switch as an on off timer.  I have two programmable web enabled thermostat's and the Hue Philips lighting system so I have some experience programming such devices so I don't really think it's all me.  I would definitely not recommend purchasing this device unless such deficiencies are corrected.","updated":"2016-12-19T14:18:42-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1271776158","userName":"Ddubbbbbb","userUrl":"https://itunes.apple.com/us/reviews/id14426934","version":"1.1.1","score":1,"title":"Doesn't work","text":"Spent an hour on trying to get the weather info to show on the iPhone or iPad, no luck.  Both recognize the device but no luck producing any weather screens. Other items of concern: it appears that this will only provide info when you are in range of the device, thus you can not connect it to the wifi and check it from wherever you are (check the weather at home from work or wherever you may be), and, you have to activate your ICloud Keychain for your device to be recognized, I did this to try to get it to work, but really don't like my phone or tablet remembering passwords...","updated":"2015-10-14T23:43:46-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1330182607","userName":"bugs181","userUrl":"https://itunes.apple.com/us/reviews/id279134911","version":"1.2","score":5,"title":"Great app!","text":"I can't attest to the products they make but I got this app to control other HomeKit products. For that, I absolutely love it! Best clean and working user interface. Easy setup. Works flawlessly with all of my current HK devices. Can't beat it for the price of free. I only wish it had the new HomeKit triggers. All other apps Ive tried failed miserably and had clunky interfaces - this ones a keeper!","updated":"2016-02-08T22:42:57-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1481597690","userName":"J0HNBLAZE","userUrl":"https://itunes.apple.com/us/reviews/id18043680","version":"2.1.2","score":3,"title":"Response time is very slow","text":"The response time is very slow. Especially for the motion detector to trigger an action. When you walk past the motion detector, it takes forever for a rule to make a light go on. It takes so long it makes you think the motion detector isn't working, but it is. For some reason the activation after that is extremely long, almost to the point of being unacceptable.\n\nEven when you tap a button just to turn a light on, it takes a very long time for it to activate.\n\nI had a WeMo system and the response time is much faster. Don't know why this one is so slow. (Although WeMo doesn't work with HomeKit).\n\nOtherwise, this would be a good system. The app interface is good.\n\nI hope they fix the response time of actions.","updated":"2016-11-09T11:54:24-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1302378933","userName":"ci0","userUrl":"https://itunes.apple.com/us/reviews/id29578902","version":"1.1.3","score":4,"title":"Almost perfect","text":"One of the few apps on the App Store that really has complete HomeKit support - not just elgato's devices. \n\nHowever, the at-a-glance page is *really* laggy when you have multiple devices. It slows down the whole device by being on that page. I hope they will resolve this in the future.","updated":"2015-12-18T04:57:23-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1292987080","userName":"Tulitre","userUrl":"https://itunes.apple.com/us/reviews/id41273942","version":"1.1.3","score":5,"title":"Great app to control multiple HomeKit devices","text":"Even though I'm not using any Elgato HomeKit devices, this app controls my Hue lights and iHome outlets. It has an easy to use interface for setting up devices, rooms, scenes etc. If it had an interface for triggers it would be the perfect HomeKit app. Best HomeKit app I've used so far.","updated":"2015-11-28T10:55:55-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1673001542","userName":"Imuser364","userUrl":"https://itunes.apple.com/us/reviews/id32755128","version":"2.9","score":4,"title":"It's a good enough first version(Eve degree)","text":"I originally thought that the temperature was way off, but it just takes some time for the sensors to adjust.\n\nBe very careful with rules.  I set one up with my Honeywell thermostat and a power outage somehow messed with the rule.  The thermostat was trying to kick on but the rule I set with the Eve app clogged it.  Once I removed the rule the thermostat kicked on.","updated":"2017-07-07T10:58:53-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1287516854","userName":"Prius Envy","userUrl":"https://itunes.apple.com/us/reviews/id28156793","version":"1.1.3","score":4,"title":"Working great with two Room sensors.","text":"I have two Eve Room sensors and a Ecobee3 all tied together with the newest Apple TV.  So far so great. Sometimes there is a short delay when the app is downloading latest sensor data, but it is never more than a few seconds. I am hoping to get a few more Room sensors to cover the entire house.","updated":"2015-11-16T10:17:50-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1544350909","userName":"CplToast","userUrl":"https://itunes.apple.com/us/reviews/id35094163","version":"2.6","score":5,"title":"Great for automation","text":"This app does a much better job at setting up automations compared to the built in home app, allowing for multiple triggers and rules. It also has a nice, clean interface that provides a lot of power without being overly complex.","updated":"2017-02-14T05:59:03-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1289908413","userName":"WoodyGA","userUrl":"https://itunes.apple.com/us/reviews/id33923415","version":"1.1.3","score":1,"title":"Difficult to use, doesn’t consistently display device names,","text":"I tried this app with my Hue kit with the version 2 bridge. It’s very difficult to set up rooms, because you create them in one place, then add devices in a different place. In most places, it doesn’t display the correct names, just “Hue Color Lamp 1” and so on. In the Service Groups setting, it is showing old names for the Hue lamps (at one point, I changed my mind and renamed the lamps, but this happened even before downloading this app.)","updated":"2015-11-21T19:10:03-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1320755846","userName":"stumantexas","userUrl":"https://itunes.apple.com/us/reviews/id35914308","version":"1.2","score":4,"title":"Much better after update - keep me coming","text":"Reading updates are so much better after this update. Having the little spinner and dimmed text to let you know things are being updated is very nice. \nKeep the updates coming.","updated":"2016-01-22T19:10:49-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1473471495","userName":"EastSideHorns","userUrl":"https://itunes.apple.com/us/reviews/id42007213","version":"2.1.2","score":1,"title":"Not working in IOS 10.1","text":"Got my first Eve outlet. Setup was easy. The Home app then informed me I needed to update the device in the manufacturer's native app. So I did. No problem. But then the switch was unreadable. And looking at its settings in the Eve app, the UI jitters as it repeatedly scrolls through info while trying to find the device. I unplugged the device. It worked first try after re-plugging and then became unresponsive within two minutes. Not a good first impression. Please fix this.","updated":"2016-10-26T14:31:42-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1266661324","userName":"Backer on iOS 9","userUrl":"https://itunes.apple.com/us/reviews/id106598223","version":"1.1","score":1,"title":"Doesn't work at all and no way to reset.","text":"I have had the door and window sensor for a month now. It connected once when I first set it up and only lasted 2 hours. I cannot get it to connect now on  either my iPhone or iPad, both of which are on iOS 9. I looked on the help section of the website and it says to remove the home if there are issues, but there is no way to do this from the app. This is a great concept with poor execution.","updated":"2015-10-03T22:12:20-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1239120596","userName":"Z User","userUrl":"https://itunes.apple.com/us/reviews/id85107823","version":"1.0.2","score":5,"title":"Excellent Easy Fast","text":"Super easy to use! If you have -52.5 degrees and 100% humidity. Just use different batteries and put it inside the unit. I was so frustrated by this formerly.... I would like this app to allow us to change units such as from F to Celsius. I typically use international units as an American.","updated":"2015-08-06T17:39:02-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1552294763","userName":"JimAtVerizon","userUrl":"https://itunes.apple.com/us/reviews/id38768867","version":"2.6","score":4,"title":"Good app but not perfect","text":"Very slow to respond. On the graphs, the temp, humidity and barometric pressure should scroll together or at least have an option to do so. But overall a great idea.  You may well find that you need more than one Apple TV to get coverage for gadgets in even a midsize house.","updated":"2017-02-25T05:22:25-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1608826876","userName":"ClimbrJohn","userUrl":"https://itunes.apple.com/us/reviews/id24079912","version":"2.8","score":2,"title":"Barametric Pressure Wildly Inaccurate at Higher Elevations","text":"Beware if you plan on using the Eve at higher elevations there's a bug with the app where it won't actually correct the barometric pressure for elevation, even though there's a section in the app to detect your elevation. I've submitted multiple calls and emails to support; even a hardware replacement without the issue being resolved and it's been 6+ months.","updated":"2017-05-08T18:11:06-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1441842564","userName":"CLKOREAMG","userUrl":"https://itunes.apple.com/us/reviews/id101824411","version":"2.1.1","score":4,"title":"Little slow.  But great.","text":"Needs notification for user set temperature so it can notify me if it passes a certain temperature so I can open my windows etc...  Or remind me to turn my AC on etc....\n\nAlso, if you own an Apple TV you can find out your temperature as long as Eve is near your Apple TV.","updated":"2016-08-30T10:19:23-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1561517177","userName":"JohnJoshson","userUrl":"https://itunes.apple.com/us/reviews/id227415161","version":"2.6","score":4,"title":"Please add timers to rules!","text":"Other than adding timers the only thing I have a problem with is the fact that I have to 3D Touch my devices to get more info while in at a glance. Doesn't really make any sense.","updated":"2017-03-10T07:52:08-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1346841258","userName":"melbp","userUrl":"https://itunes.apple.com/us/reviews/id126061766","version":"1.4","score":5,"title":"Works great so far!","text":"I received one of their HomeKit controllable outlets and so far so good. Setup was a breeze and control either by Siri or by the app has been flawless. Well done. \nMy suggestion for improvement:\nApple Watch app. Thanks!","updated":"2016-03-12T10:07:08-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1327914082","userName":"Maynard Handley","userUrl":"https://itunes.apple.com/us/reviews/id24263575","version":"1.2","score":1,"title":"Elgato devices do not work with more than one iOS device","text":"HomeKit is supposed to allow you to access your devices from any iOS product you own. This works with many HomeKit products, but NOT with Elgato Eve. So don't expect you can use both your iPad and your iPhone, whichever is more convenient.\n\nYou have been warned... (And IMHO Apple should not allow products that are SO non-compliant to even use the HomeKit logo...)","updated":"2016-02-04T17:20:55-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1330540472","userName":"ohtinsel","userUrl":"https://itunes.apple.com/us/reviews/id31303311","version":"1.2","score":3,"title":"Works great, but...","text":"Does exactly what it says and does it well. My only complaint is the device only syncs with a single iOS device. Thus you and your spouse can't both check it or your iPhone and iPad can't check in etc. HomeKit doesn't prevent this so its a developer choice or oversight.","updated":"2016-02-09T15:38:11-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1236432086","userName":"ELIrish","userUrl":"https://itunes.apple.com/us/reviews/id37001390","version":"1.0.2","score":5,"title":"Easy Setup and Use","text":"Works great out of the box with Eve Weather.  Love having access to the historical data.  Hopefully we’ll see an update that allows us to export the data.","updated":"2015-08-01T06:11:39-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1461423714","userName":"Darth Pikachu","userUrl":"https://itunes.apple.com/us/reviews/id33607577","version":"2.1.2","score":3,"title":"Complete mess since iOS 10.  Please fix. 🤔","text":"Eve Room and Weather pairing lasts one check, and then I have to remove accessories and hard reboot them. Very tiresome... 😞\n\n*Update: After enabling \"2-factor authentication\" things appear to be much more reliable sans triggers. Also Siri does not respond to all commands. Thanks 🙏😀👏","updated":"2016-10-05T04:53:26-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1603122821","userName":"Bostn","userUrl":"https://itunes.apple.com/us/reviews/id38346797","version":"2.7.1","score":4,"title":"Powerful Automation settings","text":"the triggers > conditions > scene setup is great. You can do some very cool and specific stuff with the conditions control.  \nMuch more advanced than Apple's Home app automation capabilities.\n\nI'd love to see an auto off timer added.","updated":"2017-05-02T05:32:24-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1412139971","userName":"TripHopHiker","userUrl":"https://itunes.apple.com/us/reviews/id37701767","version":"2.0.1","score":4,"title":"Eve Weather update","text":"This now adjusts the air pressure from Eve Weather based on an elevation setting, which fixes my main complaint about it. It's a really nice device!","updated":"2016-07-14T20:52:00-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1399866310","userName":"james.gerbeville","userUrl":"https://itunes.apple.com/us/reviews/id183228019","version":"2.0","score":5,"title":"Great App","text":"I don't have any Elgato products (yet!) but this app works with my Hue lights and is much better than the app Hue offers. So easy to set up scenes and integrate multiple rooms. Very impressed!!","updated":"2016-06-24T19:18:45-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1632430408","userName":"Apps2Use","userUrl":"https://itunes.apple.com/us/reviews/id31882811","version":"2.9","score":1,"title":"Disarm","text":"The Eve motion sensors work great, the only issue with them is that you cannot add a scene to schedule them.  It would be nice if you could disarm the sensors individually, the only option available is to add or delete the assessoreis.  This software is a bit cumbersome but once you get use to it, it'll make you long for options that are not compatible with your accessories.","updated":"2017-06-03T06:24:30-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1321810776","userName":"kes601","userUrl":"https://itunes.apple.com/us/reviews/id36379894","version":"1.2","score":5,"title":"Good HomeKit App","text":"Others have been reviewing the Eve hardware. I don't have any Eve hardware, but the app is great for managing HomeKit devices.  I have several Hue bulbs and am controlling my Nests via HomeBridge and the Eve lets me manage them all at once.","updated":"2016-01-24T12:49:07-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1312434085","userName":"Nicholasxuu","userUrl":"https://itunes.apple.com/us/reviews/id116821544","version":"1.1.3","score":3,"title":"Work, beautiful, but laggy","text":"It works perfectly.\nIt looks beautiful.\nBUT what's happening with the rendering performance? When when there are 3 items in a page, you can see the laggy animation. And it's using the latest iPhone.","updated":"2016-01-06T18:55:39-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1520021033","userName":"mrose17","userUrl":"https://itunes.apple.com/us/reviews/id16635796","version":"2.5.2","score":5,"title":"best homekit app","text":"i agree with Xna and others... this is the best homekit app, by far. i've used over 20 of the homekit apps here, and elgato eve and hesperus are the clear standouts! (i only recently started using hesperus)","updated":"2017-01-11T11:07:06-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1394004768","userName":"Dennis.Joseph","userUrl":"https://itunes.apple.com/us/reviews/id190069219","version":"2.0","score":5,"title":"Boom!","text":"Great update! This app has so much potential and I hope to see further enhancements in the future. Thank You for this update.","updated":"2016-06-13T18:48:00-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1359593237","userName":"PJGlassey","userUrl":"https://itunes.apple.com/us/reviews/id28625830","version":"1.5","score":1,"title":"Horrible design","text":"App is completely counter-intuitive, impossible to edit room names (doesn't save edits after they are edited), etc., etc. Air quality on my unit always says 450 ppm VOCs, no matter if the unit is set inside a paint can, out on the deck, or in the middle of the smoke of a campfire. Don't waste your money buying the unit, and don't waste your frustration on this free app!","updated":"2016-04-06T16:47:37-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1233191399","userName":"94goldenbear","userUrl":"https://itunes.apple.com/us/reviews/id22379165","version":"1.0.2","score":1,"title":"Setup? Perfect. Use following? Nothing","text":"I set the Eve Weather up upon receiving it (finally) today. Initial setup was a breeze, with temp, humidity and air pressure readings showing up on devices. Went to shower, then tried to show to the family later, and nothing. Won't connect at all. Tried deleting and reinstalling. Still nothing. Growing pains, for sure. Please fix.","updated":"2015-07-25T20:43:41-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1557493829","userName":"Sttmissouri","userUrl":"https://itunes.apple.com/us/reviews/id150039153","version":"2.6","score":1,"title":"Cant set up","text":"I have attempted numerous times to set up this product. It keeps saying invalid serial number. I can't get a hold of tech service and after service say the only way to get help is to have tech-support email me. I have called numerous times I have still not got an email. I'm returning the product in the store. Do not buy!! beware!","updated":"2017-03-04T11:52:34-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1656140974","userName":"chokypur","userUrl":"https://itunes.apple.com/us/reviews/id48680760","version":"2.9","score":1,"title":"inacurate weather graphs for day, week and month","text":"after last update, weather graphs for day, week and month are unusable because they are so inacurate. Who is responsible for this step backward? Fortunately in app store is still old version Elgato Eve for old iOS 9, which still works with latest iOS with better graphs.","updated":"2017-06-24T09:38:47-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1620171328","userName":"DChew","userUrl":"https://itunes.apple.com/us/reviews/id37075828","version":"2.8","score":4,"title":"More HomeKit options than Apple's own Home app","text":"Much better suited for a power user than the stock Home app, in terms of automation options.","updated":"2017-05-21T07:01:25-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1487548796","userName":"The Ultimate iCritic","userUrl":"https://itunes.apple.com/us/reviews/id42510518","version":"2.5","score":1,"title":"Doesn't work with HomeKit - rooms broken","text":"Used to work fine. Now the only room it shows is a default room with no devices. It won't let me add the room where all my devices are or move my devices. No configuration changes, Home works properly, Insteon+ works properly, so it is the Eve update that's broken.","updated":"2016-11-19T17:08:01-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1314630112","userName":"jengo","userUrl":"https://itunes.apple.com/us/reviews/id31044656","version":"1.1.3","score":1,"title":"Unreliable","text":"Very unreliable and it only gets worse.  I should have returned it when it required a reset within the first few days.\n\nIn the past few months I have had to reset it three times.\n\nNow it won't connect at all!  The devices show up, but won't pair.","updated":"2016-01-10T19:07:53-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1427739338","userName":"1rdrd","userUrl":"https://itunes.apple.com/us/reviews/id34850213","version":"2.1.1","score":2,"title":"Needs a Wi-fi connection","text":"Connects via Bluetooth only, which means that if you phone is any distance from the unit, it won't update the data. Would be a much better product if it connected to the local wi-fi network.","updated":"2016-08-05T22:39:49-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1504382908","userName":"Num10ck","userUrl":"https://itunes.apple.com/us/reviews/id30356979","version":"2.5.1","score":5,"title":"Works great","text":"Very nice intuitive and detailed.   I don't even own any elgato products but it is worth using for HomeKit in general..","updated":"2016-12-18T11:44:04-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1532489245","userName":"Product manager","userUrl":"https://itunes.apple.com/us/reviews/id35888800","version":"2.5.2","score":5,"title":"Best HomeKit automation app","text":"I use the Home app to control my stuff, but Eve lets you create some awesome rules - combining all sorts of conditions and triggers.","updated":"2017-01-28T12:51:15-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1488703089","userName":"James in NJ","userUrl":"https://itunes.apple.com/us/reviews/id36805685","version":"2.5","score":1,"title":"SO doesn't work...","text":"I'm savvy with technology - there was nothing intuitive about this product, and it did NOT work at all. Firmware update rendered my first one completely unresponsive, and the second one was a nightmare to try to setup on a timer. Returning ASAP. Concept is great, product nowhere near ready.","updated":"2016-11-21T17:26:34-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1348864086","userName":"me@@&","userUrl":"https://itunes.apple.com/us/reviews/id113679377","version":"1.5","score":2,"title":"Can't control devices from outside the home","text":"Can't control devices while outside of the home.  Only when on wifi in my house. Lurton app and ecobee let me control my HomeKit devices when I'm not home. Please fix","updated":"2016-03-16T13:44:47-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1276174000","userName":"denverdefense","userUrl":"https://itunes.apple.com/us/reviews/id39608496","version":"1.1.2","score":4,"title":"The best so far","text":"Great, UI, intuitive and works great with the new Hue bridge.","updated":"2015-10-23T21:16:33-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1627123411","userName":"al_ladd4","userUrl":"https://itunes.apple.com/us/reviews/id38766039","version":"2.8","score":1,"title":"None of the accessories work!","text":"I've bought some things from these guys and have never been able to successfully pair the devices.  Absolute junk.  Total waste of money.  Get something from Nest that actually works instead!","updated":"2017-05-28T16:29:44-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1315606709","userName":"oneilroth","userUrl":"https://itunes.apple.com/us/reviews/id21530320","version":"1.2","score":1,"title":"Not useful","text":"Bought this product thinking it would work with home kit. Well that's true if you're standing within 5 feet of the product. If you're upstairs or across the house, forget it. \nI would return it if I could find my receipt...","updated":"2016-01-12T19:14:48-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1271630423","userName":"DATR","userUrl":"https://itunes.apple.com/us/reviews/id41138273","version":"1.1.1","score":1,"title":"Doesn't work!!!!","text":"Haven't been able to pair the device for over two weeks now, even after waiting 4 day for  support to reply to my email and following their instructions!\nTerrible...","updated":"2015-10-14T14:32:14-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1564393517","userName":"Sdexplorer","userUrl":"https://itunes.apple.com/us/reviews/id9493781","version":"2.6","score":1,"title":"Setup doesn't work","text":"I've tried three different Eve devices and none will connect.  Spoke with the manufacturer and they'd had me replace units and still the same problem.  Obviously a problem with the app.","updated":"2017-03-14T08:58:04-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1640079093","userName":"T Bolt","userUrl":"https://itunes.apple.com/us/reviews/id26432813","version":"2.9","score":3,"title":"Temp ok","text":"My weather eves are 8% and 12% inaccurate for humidity. This renders them useless for humidity. Everything else is good. Love the compare mode. Would rate 3.5.","updated":"2017-06-10T12:09:57-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1611361712","userName":"Coray21","userUrl":"https://itunes.apple.com/us/reviews/id205808834","version":"2.8","score":1,"title":"Can't believe no notifications","text":"Can't believe I cannot be notified on my phone when the door opens. Best camera is loaded with notifications. Wow!","updated":"2017-05-11T17:03:08-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1288526621","userName":"mikey.neeley","userUrl":"https://itunes.apple.com/us/reviews/id188235563","version":"1.1.3","score":5,"title":"Easy","text":"Great app and easy to set up.","updated":"2015-11-18T19:30:39-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1349070453","userName":"Blair Schwanewede","userUrl":"https://itunes.apple.com/us/reviews/id43714564","version":"1.5","score":1,"title":"Does not work","text":"Just got in the mail yesterday try to set it up. You can't get it to pair picture back to the set up screen.","updated":"2016-03-17T00:37:44-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1286327059","userName":"2015ESLP","userUrl":"https://itunes.apple.com/us/reviews/id154678977","version":"1.1.2","score":1,"title":"Gimmick","text":"Plastic case designed to look like an apple product. This one stopped working after a few days.","updated":"2015-11-13T22:26:25-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1260857036","userName":"plusbryan","userUrl":"https://itunes.apple.com/us/reviews/id100692211","version":"1.1","score":1,"title":"Cannot connect to Eve Room","text":"When I click add accessory, it just jumps back to the first screen and never connects with the device.","updated":"2015-09-21T11:58:12-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1447749783","userName":"Qwertyui upping sac","userUrl":"https://itunes.apple.com/us/reviews/id488855544","version":"2.1.1","score":4,"title":"Read plzzzz!!","text":"It is an awesome app so helpfullll please try","updated":"2016-09-10T18:16:40-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1647815538","userName":"AppEagle","userUrl":"https://itunes.apple.com/us/reviews/id42582945","version":"2.9","score":1,"title":"Eve Room incredibly slow to sync","text":"I have 4 Eve Room devices throughout the house. It takes for ever for them to sync. Not a good show. :(","updated":"2017-06-17T08:58:39-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1487691445","userName":"Alphawav","userUrl":"https://itunes.apple.com/us/reviews/id21441798","version":"2.5","score":1,"title":"Doesnt work. Not ready for Prime Time","text":"The most difficult product to setup Ive ever used and the app crashes, its worthless","updated":"2016-11-19T22:32:51-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1355075562","userName":"Sherman Farms","userUrl":"https://itunes.apple.com/us/reviews/id215220595","version":"1.5","score":1,"title":"Cool concept; need Wifi, not Bluetooth","text":"Cool concept but having it connect over Bluetooth is not ideal; it was enough for me to return the device.","updated":"2016-03-28T14:31:27-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1262326909","userName":"Wsantiago4","userUrl":"https://itunes.apple.com/us/reviews/id17255939","version":"1.1","score":1,"title":"Broken","text":"Will no connect to eve room .. After 21 sep update. Worked perfectly before this recent update.","updated":"2015-09-24T18:11:46-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1315478293","userName":"morecowbell74","userUrl":"https://itunes.apple.com/us/reviews/id39616576","version":"1.1.3","score":3,"title":"Needs triggers","text":"I love the hardware, but this app is a bit behind the curve. Once they add triggers, (like IFTTT) it will be fantastic.","updated":"2016-01-12T12:26:34-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1348597044","userName":"Sergey Saks","userUrl":"https://itunes.apple.com/us/reviews/id206423021","version":"1.5","score":1,"title":"Idea is 5 stars","text":"You missed when you decided to make a smart house via Bluetooth. Hopefully next Eve and CEO will be smarter...","updated":"2016-03-16T01:05:50-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1556206211","userName":"Chahe Demian","userUrl":"https://itunes.apple.com/us/reviews/id11561285","version":"2.6","score":1,"title":"Useless","text":"Gets stuck at set up, tried many times, gave up.....","updated":"2017-03-02T19:55:31-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1465024973","userName":"spotone55","userUrl":"https://itunes.apple.com/us/reviews/id197202774","version":"2.1.2","score":1,"title":"Fail","text":"Fails immediately. Can't even add their device into system","updated":"2016-10-11T10:05:54-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1313572295","userName":"benshep","userUrl":"https://itunes.apple.com/us/reviews/id42463252","version":"1.1.3","score":2,"title":"Can't change to Celsius","text":"Please let me change the units to Celsius!!","updated":"2016-01-08T23:36:40-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1332204005","userName":"Kirn Malinus","userUrl":"https://itunes.apple.com/us/reviews/id37409444","version":"1.3","score":4,"title":"Good HomeKit Management Tool, but Matching Hardware Lacks Functionality","text":"The Elgato Eve app is by far one of the best HomeKit system management apps. The interfaces are very quick to load and the app is very responsive, both in terms of HomeKit devices responding to commands it sends and in terms of the UI of the app itself on iOS. There is also a moderate level of configurability, with a decent icon set for devices and the way it uses photos as blurry backgrounds is cool (you can take a pictures of your rooms and set them as the background for the room’s views in the app and it isn’t annoying or tacky because the app blurs the photo).\n\nA couple nit-picky things about the app would be the lack of trigger configuration support, but none of the hardware manufacturer’s apps seem to support that yet. The way the app handles scene execution is also pretty inelegant compared to the rest of the app, like it was tacked on as an afterthought. This seems to be true of manufacturer apps in general as well though, I have yet to find one where scene execution isn’t tucked away into a menu or other not very logical view/location in the app.\n\nAlso, for some reason my door/window sensor still calls itself a “Door” and displays the door icon in the status line even though I’ve changed the “Used For” parameter to the large four-paned window icon in the accessory settings view. \n\nEve’s hardware, however, leaves a lot to be desired. I own the outdoor weather station and one door/window sensor. \n\nThe door/window sensor looks nice (much more aesthetically pleasing than competitive products), installs easily and is relatively inexpensive. However, at this time it doesn’t support HomeKit triggers, which renders a sensor fairly useless as a component in your SmartHome system. I bought one to try it out and installed it on a large window in my living room, intending to trigger a scene that turns off my thermostat if the window is opened, but without trigger support I can’t do that. As others have pointed out in reviews, pretty much everything you would want to do with a door or window sensor as part of a SmartHome system isn’t possible without triggers.\n\nElgato has promised an app and firmware update soon that will provide trigger support for the devices (I’m not sure about actually setting triggers up in the app though, so you’ll probably still need a third party app for that). I contacted their support team to find out when I could expect the update last week, and the response I received didn’t commit to a release date but did state that developers are working on it and that it will hopefully be soon. They’ve also said the fix will require an app update, which they released yesterday, so it is possible the firmware update is close behind.\n\nThe outdoor weather station is OK. It provides temperature, humidity and air pressure. You can export the data from the app and view basic graphs of it in the app with minimal manipulation of the graphs (changing view timeframes, comparing the current data to the previous hour/day/week/month). I only have the eve outdoor station, but I also have the netatmo outdoor station that is sold packaged with an indoor device and I like the netatmo weather experience better overall even though it isn’t HomeKit compatible (although there is a homebridge plug-in that works fairly well, I don’t have a stable homebridge host working yet). Netatmo’s app is able to focus on weather related features only and is a bit more robust in that regard, and it also has a web interface and nice iPad app. Netatmo also has a rain gauge and will be releasing a wind gauge soon.\n\nMy hope is that the upcoming firmware updates will add support for triggers based on characteristics of the weather station as well as the door/window sensor.","updated":"2016-02-13T00:06:14-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1379965865","userName":"tech302","userUrl":"https://itunes.apple.com/us/reviews/id38549929","version":"1.6.1","score":1,"title":"Slow","text":"Eve room is so slow to update temp.  It is the slowest home device I've ever used.","updated":"2016-05-17T04:45:40-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"3101094506","userName":"woofwoof75","userUrl":"https://itunes.apple.com/us/reviews/id35617125","version":"3.4.1","score":4,"title":"Finally they fixed it","text":"For a long time the battery level on Eve Room was horrible, they don’t notify user to replace battery until it shut off itself. Now they fix it! Still not very durable hardware, and no easy way to send for repair, as I refused to send it to some horrible / dark place for service, and now already out of warranty. Data doesn’t store on central iCloud, every device has to sync their own data, old data just disappear.","updated":"2018-08-22T17:20:46-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1288872028","userName":"SonofOsirys","userUrl":"https://itunes.apple.com/us/reviews/id164995070","version":"1.1.3","score":1,"title":"Lame","text":"Doesn't pair and support online is non-existent.","updated":"2015-11-19T14:56:39-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1561808114","userName":"museum_skeptic","userUrl":"https://itunes.apple.com/us/reviews/id34772886","version":"2.6","score":1,"title":"Setup requires Keychain.","text":"I refuse to activate Keychain just to get outdoor temperature readings with Eve Weather.","updated":"2017-03-10T19:31:07-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1382075824","userName":"TongueJedi","userUrl":"https://itunes.apple.com/us/reviews/id132696256","version":"1.6.1","score":1,"title":"Eve room broke on 9.3.2","text":"Fix it","updated":"2016-05-21T11:53:24-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1312431001","userName":"Bioklein","userUrl":"https://itunes.apple.com/us/reviews/id104548158","version":"1.1.3","score":1,"title":"iPad 2nd genaration","text":"It doesnt work","updated":"2016-01-06T18:47:21-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"4902690502","userName":"Yerpaderp","userUrl":"https://itunes.apple.com/us/reviews/id86555217","version":"3.8.3","score":2,"title":"Lost dark mode","text":"After last update dark mode option is gone for me.","updated":"2019-10-06T20:34:34-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6158162924","userName":"LostInTheTrees","userUrl":"https://itunes.apple.com/us/reviews/id21251326","version":"4.3.1","score":2,"title":"Interesting look, but currently unusable","text":"The app is unusable for a simple reason. I have a large number of accessories in one room and I cannot edit and change the order of the tiles in the window. You drag a tile into the position you want it in and it snaps into some other order, seemingly at random. This single simple bug makes the app unusable.\n\nI am an iOS developer and I have written code that does this drag and drop editing. It’s not that hard. Please fix it. I’ll look again after a few weeks.","updated":"2020-07-04T16:48:56-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"6085436602","userName":"DesignatedDriver","userUrl":"https://itunes.apple.com/us/reviews/id37315877","version":"4.3","score":1,"title":"Guys, hire some professional programmers","text":"Every release is worse the the previous release. Now it just sits there “Initializing HomeKit” and never gets any further. Apple Home has no issues at all. If you can’t code better than this, CONTRACT IT OUT!!!","updated":"2020-06-16T19:50:58-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"5057149488","userName":"gliderflyer","userUrl":"https://itunes.apple.com/us/reviews/id30141177","version":"4.0.1","score":1,"title":"Power strip powerless","text":"I purchased a power Strip. It came with no instructions. No code. After scouring the EVE site I found almost no info on pairing the strip to anything. Lack of support is unfortunate. The eve app does not recognize the strip. Not happy. No more eve products.","updated":"2019-10-31T12:29:47-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"4399679573","userName":"dk2319","userUrl":"https://itunes.apple.com/us/reviews/id25980819","version":"3.7.2","score":1,"title":"Please fix your time parameters!!!!!","text":"I’m sorry, but no home kit app out there has time parameters so botched up the way this app does. After an intense lesson on how the mind works a** backwards you begin understand how this app functions rule wise. Instructions are required with this app BUT with apps this typically isn’t available so the group who designed this app failed foremost. Translation: it’s not intuitive. My ultimate hope is that Apple mite invest a little more effort into their home kit app which puts this one out to the pasture for good!! Apple is actually a thoughtful company because all the eve product line is done better by other product designers period. There are a few unique items out elgato produces but a valve that turns a sprinkler on and off at the command of Siri will eventually be surpassed. So if anything you have going for you it is foremost, your app, but when something so small such as a time parameter is overlooked it makes me have extremely little faith in the future of this company in the smart device category. Why do I keep coming back to the eve app you ask? It’s because of all the little possibilities that can happen around a home that other apps tend to not pay attention to like light sensitivity of a room, or humidity level. Even one device triggering another. The idea is there, but the execution is begging for another developer to make it better. This cute crap with the time parameter is a prime example of it. Rip off the home app verbatim if you have to please!!! Here is an example: light A goes on between 3:00pm and 4:00pm when motion B is a trigger. Boom! Done! What is this after 3:00pm and then adding a second parameter for before 4:00pm? After all that, guess what?! The rule doesn’t  work at all because it’s so dumb the app doesn’t even understand. Take it seriously and fix it the way I take dishing out $49 usd for a motion sensor that in every way design and execution Phillips Hue does freaking better and for 10 dollars less! Yet I’m an idiot and hope that you people will get with the program. Fix it!","updated":"2019-07-01T23:07:13-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"4006927952","userName":"JakeT2","userUrl":"https://itunes.apple.com/us/reviews/id38782000","version":"3.7.1","score":1,"title":"It has potential.","text":"One problem I found is that it won't work without turning on iCloud keychain. I don't know why that is necessary. \n\nAnother problem is that it doesn't say what is causing poor air quality. It usually says my air quality is excellent, but sometimes it goes all the way to poor, for no apparent reason. My Withings scale measures CO2, so I put it next to the Eve for comparison. The Withings CO2 level seems to remain constant.\n\n4/2019 update. It doesn’t look like you guys have bothered to fix any of the problems, so I’m downgrading my star rating.","updated":"2019-04-13T04:35:17-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"3188850102","userName":"SethteS","userUrl":"https://itunes.apple.com/us/reviews/id29333540","version":"3.5","score":3,"title":"I got my hopes up...","text":"I wanted to find a replacement app for Apple Home with more automation conditions. Although this one looked promising, there were too many UI bugs to be usable. For instance, when trying to add a value trigger for Light Level, the slider range is 1.0–130000.0 lux. So it's impossible to select any number under 100, which is what you would typically want.","updated":"2018-09-14T08:54:39-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1261864546","userName":"Tibble","userUrl":"https://itunes.apple.com/us/reviews/id33993222","version":"1.1","score":5,"title":"Great so far","text":"I won't fault the developer for home kit bugs. The parts that they control work great!!!!\n@Tibble","updated":"2015-09-23T16:18:52-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"},{"id":"1318128810","userName":"The Crow 93","userUrl":"https://itunes.apple.com/us/reviews/id35734224","version":"1.2","score":1,"title":"Inconsistent","text":"I've been patient and good thing Amazon has been great swapping pieces out, but it's very buggy; very frustrating! I occasionally am able to connect when not at home. My setup is with the AppleTV 4th and 3rd Generation (added 3rd with the hope it would help the Eve devices that are \"far away\").","updated":"2016-01-17T15:08:16-07:00","url":"https://itunes.apple.com/us/review?id=917695792&type=Purple%20Software"}]