[{"id":"5167049222","userName":"jpspyro","userUrl":"https://itunes.apple.com/us/reviews/id29910979","version":"5.8","score":2,"title":"Asks for “Always Allow” location","text":"Why does this app need location always, or location at all? Lame update.\n\nOtherwise works, slow over LTE as expected. Very brutish User Interface could use some love. Editing settings is cumbersome and annoying.","updated":"2019-11-18T20:24:42-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"6866522566","userName":"Consumer Woman","userUrl":"https://itunes.apple.com/us/reviews/id446111750","version":"5.9","score":1,"title":"Zero stars.  Needs location all the time!  None of your business","text":"This app worked fairly well for a couple years however,  over the last year or so you were unable to view your camera if you were not at home(which defeats the purpose of a security camera.  They also now require your location AT ALL TIMES and they need to have access to all devices on your home network!  The product will not work unless you give them these accesses.  Ridiculous! In this time in the world I am not giving out my personal information for anybodyAnd Samsung does not need this kind of information at all and for any reason. It went in the garbage!!! I also changed my router name and pass phrase.  I will never purchase another Samsung product again whether a washing machine,  TV, or camera. There is no reason for you to need this kind of information in order to use your app, no matter what your bogus reason is stated on the location portion of app.  Shame on you trying to get American information!","updated":"2021-01-13T15:25:14-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"4641451585","userName":"JBowlingKnox","userUrl":"https://itunes.apple.com/us/reviews/id25380734","version":"5.7","score":5,"title":"Great system!  Took a while to get here.","text":"I have been using this app and the Panasonic system for quite a while with both the cheap cameras that come with the HNB600 hub and the newer Homehawk KX HNC800. The cheap cameras aren’t much to speak of but the Homehawks are great. \n\nThe app has given me fits. The network configuration has been challenging but with the latest update everything is working great with really no configuration. I have removed all port forwarding and it is working fine. \n\nThe system is quick to alert you when a sensor alarms. The sensors all take batteries so you have to periodically change them out but it isn’t too frequently. \n\nAfter the last update I am very pleased. \n\nIt would be really nice if the developers made an Apple Watch app that could just change the arm state of the system. I have the disarm key fob but an Apple Watch app would be more convenient. \n\nAlso it would be nice if there was a way to make the hub chirp or beep when a door is open in the at home alarm state. That way I could know if my kids went out the door without having an alarm.","updated":"2019-08-19T05:44:03-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"2109856649","userName":"Miggy Flo","userUrl":"https://itunes.apple.com/us/reviews/id108048720","version":"5.0","score":1,"title":"Useless","text":"If I can give it negative stars, I would. Most useless app I have on my iPhone. I bought 5 cameras and a water sensor last year. I was so happy with their products that I’ve told friends and family about how awesome this system was. Worked flawless and wonderfully until they updated. First, LTE connection stopped working and only home WiFi worked, which defeats the whole purpose of having this. Then now even the WiFi connection stopped working. Not only did I throw the cameras in the garbage since Panasonic can’t even be bothered to respond to emails, much less fix this useless app and hardware; I now vow to never buy ANY Panasonic products ever again and have told many friends and acquaintances to stay away.","updated":"2018-01-20T18:01:37-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"2621393326","userName":"Waugh2000","userUrl":"https://itunes.apple.com/us/reviews/id36511646","version":"5.5","score":5,"title":"Works flawlessly for the last 10 Months","text":"I’ve used this system for about 3 years.  As you can see from reviews there’s been many ups and downs with the app.  For me, for the last 10 months, the system has worked flawlessly.  I have a complicated setup that I’ve enjoyed adding devices to.  The software updates for the app seem to happen monthly so Panasonic is actively still very much supporting this system.","updated":"2018-05-31T04:54:37-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"4833931613","userName":"Rajeshn","userUrl":"https://itunes.apple.com/us/reviews/id43227191","version":"5.8","score":4,"title":"Much improved","text":"It monitors the home without having to rely on other companies. Easy to install and operate. Has become reliable over time and rarely has any false alarms. I wish it would show the battery level in the peripherals and warn us in a timely manner to replace. 2 times when I was away the battery failed and alarms went off.\nAlso, an announcement option when a door window opening when unarmed may be a good option.\nThanks","updated":"2019-09-24T17:53:54-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"5096815211","userName":"Grizzley50","userUrl":"https://itunes.apple.com/us/reviews/id846417561","version":"5.8","score":5,"title":"Love it!!! Oldie but goodie","text":"This system and app anit for everybody.  Only the sexy people can handle it.  Got a new WiFi router had to give the hub the new network and password.  And it’s humming along just like a song. It remembers the cameras.  Just google how to reset the hub.  Wait for the color changes on the LED and it walk you through the setup.  Had this system for over 5yrs.  Outdoors.  Hardy cameras.  Bueno bye.","updated":"2019-11-06T21:06:46-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"2506001022","userName":"Gun Six","userUrl":"https://itunes.apple.com/us/reviews/id44046325","version":"5.3","score":5,"title":"Excellent clarity","text":"Very nice HD view, works perfectly so far. Motion sensor is very accurate, drove to gas station and connected via LTE it took about 30 seconds but connected fine. Very happy with this app, very user friendly no wondering what to click to change this or that. Easy to navigate. If it continues to work well I will definitely buy a 2nd one","updated":"2018-05-04T19:34:34-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"2253415409","userName":"Moapapp","userUrl":"https://itunes.apple.com/us/reviews/id506748842","version":"5.2","score":4,"title":"Finally seems to be working","text":"When it works, its amazing. When the app doesn’t work, it’s very frustrating. Lately the app seems to be working, both on WiFi and on cell service, for both my IPad Air 2 and iPhone SE, which are both on ios11.  If the app breaks in the future, I’ll lower my rating, but at the moment everything seems to be working fine.","updated":"2018-02-27T11:03:54-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"4819251923","userName":"Virella1959","userUrl":"https://itunes.apple.com/us/reviews/id14354036","version":"5.8","score":1,"title":"Horrible and useless","text":"99% of the time is down, don't buy Panasonic their system is so  useless and tech support is even worst. They charge customers for their useless and helpless tech support.\nMoney waisted on the Panasonic wireless camera system, they just don't have the technology to make work.\nI'm just turn off with Panasonic junk.\nOn top of that their system is one the one the worst when a comes to setup if you lucky to get them to work.\nMy cameras are 10 feet away and still no signal 99% of the time.\nThe app doesn't work either, just garbage all the way around.\nYou can’t not view your cameras away from home either, are you kidding me Panasonic with horrible system.\nI done buying Panasonic, eventually Panasonic will be out business for building products that are so horrible when you compare to others brands.","updated":"2019-09-21T12:21:14-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"6781787837","userName":"Chofrins","userUrl":"https://itunes.apple.com/us/reviews/id294072289","version":"5.9","score":5,"title":"Good camera.","text":"I’ve had this camera for over a year, and it stills works great. Sometimes there are connection issues with updated phone software or bad router connectivity, but it is usually resolved.","updated":"2020-12-22T08:35:54-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"3732768448","userName":"Bolu's","userUrl":"https://itunes.apple.com/us/reviews/id149726523","version":"5.6","score":1,"title":"No updates in 8 months","text":"Panasonic really dropped the ball on this one . This system is not even 2 years old and they stop selling the hardware and haven’t backed up theirs products in all of this months. If you bought this system pretty much will be junk any moment now. Is out of the market and Panasonic doesn’t care for the customers that bought their products . It wasn’t a cheap system to use only for couple months. Stay away from Panasonic . No support from their part.","updated":"2019-02-04T07:11:34-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"2655587217","userName":"Naut2","userUrl":"https://itunes.apple.com/us/reviews/id284987668","version":"5.5","score":1,"title":"LTE connection broken after iOS 10.3.3","text":"Remote connection with LTE has been broken after iOS 10.3.3 and is still not fixed in iOS 11.0.3. The app is useless as I cannot get any notifications or turn on/off alarms. Could you please fix it? I am a T-Mobile user and do not know if the issue is service provider dependent.\n\nUpdated on 6/7/18\nI understand that T-Mobile on iPhone only supports IPv6 connection on LTE. This app only supports IPv4 that is why it doesn’t work. This app needs changes to support IPv6.","updated":"2018-06-07T05:27:36-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"3343401211","userName":"jess836484","userUrl":"https://itunes.apple.com/us/reviews/id175835632","version":"5.6","score":1,"title":"App doesn’t work","text":"Everything worked great for the first couple of months. I was able to view my cameras from the app. But then it stopped working (app buttons don’t respond except for the button that takes you to their store to buy more products... go figure). I can’t get a hold of them for help. The worst customer service. Panasonic, if you read these reviews, please let your customers know how to get a hold of you when the app stops working. Thank you.","updated":"2018-10-25T14:10:53-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"2419264490","userName":"drnimrod","userUrl":"https://itunes.apple.com/us/reviews/id42719106","version":"5.3","score":4,"title":"Takes about 3 minutes for the main menu to work","text":"When launching the app into the main screen, there's a \"Please wait...\" message with a spinning circle. This takes about 3 minutes to finally give me a communication error pop up and then I can access my cameras. \n\nIf I need to go into settings and then back out to the menu, the whole \"Please wait...\" scenario happens again. \n\nEvery single time I have to go back to the main menu, I wait 3 minutes.  It's quite ridiculous.\n\nEdit: Updated the hub firmware and now everything is much quicker.","updated":"2018-04-13T15:54:14-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"3244237860","userName":"MTB-29","userUrl":"https://itunes.apple.com/us/reviews/id196092142","version":"5.6","score":5,"title":"Great solution","text":"I love my connected home system. It allows me to monitor the exterior of my home, garage door, entry doors, windows and turn on and off light with out a monthly fee.\n\nI am disappointed that it appears that Panasonic is discontinuing marketing this product in the US.","updated":"2018-09-29T08:52:08-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"3599478061","userName":"C5 Vette Girl","userUrl":"https://itunes.apple.com/us/reviews/id216736376","version":"5.6","score":1,"title":"Home Network System","text":"Model KX-HN600. This is THE worst money trap ever! My husband bought me this home security system for Christmas, but we have not been able to connect this to my mobile device or set the system up, period. We followed all the steps and are told “hub not found” even though the lights indicate a connection.\nIf you are reading reviews in consideration of purchasing this system....don’t. Your hard earned money will be wasted.","updated":"2019-01-01T05:26:12-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"4054349303","userName":"Gas Hawg 55","userUrl":"https://itunes.apple.com/us/reviews/id176090875","version":"5.6","score":3,"title":"Where’s the sound????","text":"Used this app successfully for over 3 years now. All of a sudden there’s no 2 way audio. I can hear what the camera is seeing but I cannot talk to anyone at the camera end. I’ve looked at settings but there’s no longer a button for access to microphone. ???","updated":"2019-04-24T07:18:51-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"2828707692","userName":"conceptR","userUrl":"https://itunes.apple.com/us/reviews/id155839062","version":"5.6","score":3,"title":"Arming error","text":"I'm now getting an error that says I can't change the arm mode remotely. It is also saying that the device is in use when my phone is the only device that has access to the hub. I've tried logging out and back in with the same error.","updated":"2018-07-03T08:51:28-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"2688442471","userName":"Dumpemout2000","userUrl":"https://itunes.apple.com/us/reviews/id288756252","version":"5.5","score":1,"title":"newest update still doesn't work on cellular","text":"It has been 10 months and still doesn’t work. The app requires me to be on a wifi network (any WiFi network, home or public) to connect to my hub. When I go on celular data (3G, 4G, LTE), it throws an error to check my connection. I have checked my settings and allowed cellular data access to the app and still no luck. Please fix.","updated":"2018-06-13T09:44:33-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1904715280","userName":"LEELO64","userUrl":"https://itunes.apple.com/us/reviews/id85158148","version":"4.8","score":3,"title":"Non home connection is broken","text":"Wont connect over lte or wifi out of the home, please fix. LTE is ATT\nUpdate( i actually re installed the app and it works a lot better now. Still glitchy but at least it works. Hopes that helps some of you with the same Issue)","updated":"2017-11-07T15:07:37-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"2793931805","userName":"Alexjai123","userUrl":"https://itunes.apple.com/us/reviews/id569288558","version":"5.6","score":2,"title":"It really needs to change","text":"It is so ugly and slow. They need to improve it and change the face of app. It isn’t user friendly. I couldn’t find some of other products to add to my system. I mean some add on products are not available . \nHurry up guys. This is 2018 and we need better service","updated":"2018-06-29T00:14:40-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"3829016658","userName":"Ken4846","userUrl":"https://itunes.apple.com/us/reviews/id246822321","version":"5.6","score":1,"title":"One star is over-rated","text":"The camera itself, is very good but not of much use if you can’t access it. The connection gets lost daily and not because of a weak house internet. Access from iPad says not found. You reset, it works, an hour later, camera not found again. Save your money for a more reliable unit. Too bad....I always places great trust in Panasonic quality.","updated":"2019-03-01T09:09:36-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"2561321570","userName":"phillippjohn","userUrl":"https://itunes.apple.com/us/reviews/id689048560","version":"5.3","score":3,"title":"iPhone upgrade","text":"I had It working good really liked it. But now I upgraded my iPhone and now it doesn’t send me notifications when the alarm goes off. So now I am just thinking on getting a different system. Too bad because they had a good thing going.","updated":"2018-05-17T18:49:15-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"5391224611","userName":"Burrow0424","userUrl":"https://itunes.apple.com/us/reviews/id150881140","version":"5.9","score":1,"title":"Zero stars","text":"This is the most useless device. You pay $300 for a baby monitor with a home system only to find out the app doesn’t work. What’s the point? Your better off throwing this in the river, it would be more efficient floating down the river than attached to a wall taking up space doing NOTHING! Don’t buy this- buyer be warned!","updated":"2020-01-11T12:46:57-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"2026524448","userName":"fistsoffiore","userUrl":"https://itunes.apple.com/us/reviews/id34970709","version":"4.9","score":1,"title":"What happened to this app???","text":"This used to allow me to connect when not on WiFi and on my LTE. That stopped. Now it’s not even me allowing me to connect on my home WiFi. I’ve deregistered from the hub even and reconnected and have the same issue. The support online is garbage too. Please fix this! You’re not a small company and need to step up the support Panasonic.","updated":"2017-12-25T08:37:27-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"2263284726","userName":"SickMarky","userUrl":"https://itunes.apple.com/us/reviews/id32819507","version":"5.3","score":4,"title":"Update for iPhone X","text":"I haven't had that many problems!! I would like to know if you are coming out with support for the iPhone X soon?? Also will we be getting Alexa support in the states??","updated":"2018-03-02T08:25:53-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"6725643726","userName":"crosslessly","userUrl":"https://itunes.apple.com/us/reviews/id173771464","version":"5.9","score":5,"title":"A great home security app without monthly fee","text":"A great home security system with real time remote access and without monthly fee.","updated":"2020-12-06T19:08:42-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"4913681225","userName":"Mkybx21","userUrl":"https://itunes.apple.com/us/reviews/id137575896","version":"5.8","score":1,"title":"Horrible","text":"This app is absolute garbage, might get lucky and actually connect to the hub after 30 minutes of trying (even if you’re standing right next to it). Does not matter if your WiFi signal is strong or cell service has full bars, it’s the same issue every day.","updated":"2019-10-09T06:48:08-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"2116464443","userName":"Apps evaluation","userUrl":"https://itunes.apple.com/us/reviews/id166123410","version":"5.1","score":1,"title":"Not connecting on lte connection","text":"Will not connect outside Home network & app crashes, fix the issue please\n\nUpdated - even after updating their app \nIt will still not connect through lte connection, so I am returning camera back & buying something better","updated":"2018-01-22T16:06:39-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"4503100666","userName":"dichek;728;","userUrl":"https://itunes.apple.com/us/reviews/id994236948","version":"5.7","score":1,"title":"TERRIBLE","text":"It was working perfectly fine at first then all of a sudden I had been logged out and I had to do it all over again but this time it said that the device has been already registered so I couldn’t get into it can you add some sort of login option?","updated":"2019-07-22T13:28:05-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"3901704697","userName":"nicenonny","userUrl":"https://itunes.apple.com/us/reviews/id277780319","version":"5.6","score":1,"title":"Need to ask permission for microphone","text":"We used this same security system about a year ago and had no problems. We hooked it up again and the app doesn’t even request permission to use microphone rendering the feature useless. An update must have screwed this up.","updated":"2019-03-19T14:45:29-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"2395678410","userName":"hudojni4kata","userUrl":"https://itunes.apple.com/us/reviews/id376263520","version":"5.3","score":1,"title":"Does not work outside of home wifi","text":"I am only able to view the cameras when at home, connected ti my home wifi. It does not work with other wifis or through my cell service. Useless since the whole purpose is remote viewing. I guess I will be returning them to costco.","updated":"2018-04-07T13:44:37-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"5371366128","userName":"larybirtk","userUrl":"https://itunes.apple.com/us/reviews/id549782136","version":"5.9","score":1,"title":"Now requires location always","text":"You can’t even use the app now without enabling location information at all times. Worked fine without before. This is silly. It should not be rehired.","updated":"2020-01-07T01:07:29-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"5929449402","userName":"JohnnyHoang","userUrl":"https://itunes.apple.com/us/reviews/id44036047","version":"5.9","score":1,"title":"Why the system need to access my location 24/7?","text":"Why the system need to access my location 24/7. I selected allow to access my location while I’m using the app but it doesn’t work","updated":"2020-05-10T16:53:22-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1811854279","userName":"millionmilion","userUrl":"https://itunes.apple.com/us/reviews/id150017897","version":"4.7","score":3,"title":"Please fix bug","text":"Every time I open the app, it causes black screen on my iPhone 6s+ camera. My iOS version is 10.3.3. Would be very happy to give 5stars once the bug is fixed.","updated":"2017-09-26T17:42:46-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"2079817530","userName":"jkrwc","userUrl":"https://itunes.apple.com/us/reviews/id16660870","version":"5.0","score":1,"title":"Remote access still broken in 5.0","text":"Remote access from cellular connection used to work. Was hopeful the 5.0 update would fix this but no such luck.  My router doesn’t have uPNP so proceeded with using static IP and port forwarding exactly as the user guide suggests. Really disappointed in Panasonic... Judging by other reviews I am not alone","updated":"2018-01-11T15:36:09-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"2080619774","userName":"SorrythatIupdatedtheapp","userUrl":"https://itunes.apple.com/us/reviews/id549263583","version":"5.0","score":1,"title":"Doesn’t work over LTE","text":"Tried a reinstall as another reviewer suggested but still didn’t work. App immediately closes when trying to access the camera over LTE or non-home WiFi. Only works when your on the same WiFi as the camera.","updated":"2018-01-11T21:37:59-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"6200982628","userName":"RA_AI","userUrl":"https://itunes.apple.com/us/reviews/id471759306","version":"5.9","score":1,"title":"Suspicious app!","text":"Why does it need to access my location while I am not using the app?\nIf they don’t fix it I’ll delete it and trash the cameras. I will never get Panasonic again, their technology is 20 years behind others.","updated":"2020-07-15T07:03:18-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"2591462949","userName":"no_2u","userUrl":"https://itunes.apple.com/us/reviews/id46220772","version":"5.3","score":1,"title":"App didn't connect camera to Wifi","text":"Had to return my new Panasonic KX-HN1003 camera because Setup in this app wouldn't connect the camera to my WiFi network.  Gave up after trying a second router.  I don't know if it's Apple or Pathetic app's fault but I'm keeping the iPhone and returning the camera.","updated":"2018-05-24T15:48:43-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"5276985331","userName":"hdfyjng","userUrl":"https://itunes.apple.com/us/reviews/id36250921","version":"5.9","score":1,"title":"Requires full time location access","text":"After a recent update the app now requires full access to your location all the time, not just when using the app.","updated":"2019-12-15T12:11:14-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"2251199411","userName":"Kuttenz","userUrl":"https://itunes.apple.com/us/reviews/id549239655","version":"5.2","score":5,"title":"Great product","text":"I have been using this app for a year now. I love it","updated":"2018-02-26T19:26:36-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"5285920002","userName":"Lb18c","userUrl":"https://itunes.apple.com/us/reviews/id143670559","version":"5.9","score":1,"title":"Ask for location all the time","text":"The app is asking for full time location now. I guess they want to sell location data. Will not use anymore.","updated":"2019-12-17T22:17:02-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1918582272","userName":"Mymarch","userUrl":"https://itunes.apple.com/us/reviews/id21543149","version":"4.8","score":1,"title":"Connection Issues. VERY SLOW TO CONNECT","text":"VERY SLOW to connect to hub and camera. Why does it take a minute or longer for connection?\n\nSince the beginning it has been slow but even slower on IOS11.","updated":"2017-11-13T10:46:45-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"2268400101","userName":"Peterdy","userUrl":"https://itunes.apple.com/us/reviews/id438480098","version":"5.3","score":1,"title":"Useless","text":"LTE connection does not work which makes security system useless.\n\n2/3/18 update: version 5.3 did not fix the issue. Remote connection works on WiFi ONLY - when on LTE - still useless!","updated":"2018-03-03T18:29:21-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1957701427","userName":"Mrspapi","userUrl":"https://itunes.apple.com/us/reviews/id39079956","version":"4.9","score":1,"title":"Incredibly Slow","text":"Takes forever to connect via app - particularly if you aren’t connected to the same WiFi as the camera and are using LTE.","updated":"2017-11-29T08:02:53-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"2983851231","userName":"mrstriggins1960","userUrl":"https://itunes.apple.com/us/reviews/id218065702","version":"5.6","score":1,"title":"Terrible cameras and no customer support","text":"I wish I had opened the cameras before my warranty expired- the app is useless- finally got it hooked up and now the hub and cameras won’t connect.  I’m so disappointed","updated":"2018-07-28T12:10:13-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1844993804","userName":"Craig Alan","userUrl":"https://itunes.apple.com/us/reviews/id188207847","version":"4.7","score":1,"title":"Please fix bug for ios11","text":"Motion notifications come through fine over wireless or work WiFi, but I cannot connect to the hub unless I’m on the same wireless network.","updated":"2017-10-12T19:34:33-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"6064952442","userName":"EWF7","userUrl":"https://itunes.apple.com/us/reviews/id105927400","version":"5.9","score":1,"title":"Stopped working ever since iOS 13.5","text":"iOS 13.5 broke the app. Waiting for an update. Right now it’s useless.","updated":"2020-06-11T17:43:39-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"2375915797","userName":"Dallas morning","userUrl":"https://itunes.apple.com/us/reviews/id369980264","version":"5.3","score":1,"title":"Does not work on T-Mobile","text":"Can’t connect through T-Mobile. Works fine on AT&T.","updated":"2018-04-02T12:35:53-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"2637075270","userName":"Danieltri30","userUrl":"https://itunes.apple.com/us/reviews/id100423016","version":"5.5","score":2,"title":"IPhone X app please","text":"I like the app but it’s not optimized for iPhone X. Please update.","updated":"2018-06-03T10:44:53-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1870652168","userName":"hclinde","userUrl":"https://itunes.apple.com/us/reviews/id449589722","version":"4.7","score":1,"title":"Does not work over Cell Phone LTE","text":"Cannot use my cell phone to access the HuB.  Complete waste of money.","updated":"2017-10-23T20:25:44-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"2123714026","userName":"Frenz610","userUrl":"https://itunes.apple.com/us/reviews/id130994224","version":"5.1","score":1,"title":"Please fix the app.!!!!!","text":"The Lte data plan does not work!!! Why?!? You guys need to update on the latest update for the app!!","updated":"2018-01-24T19:16:00-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"4096171834","userName":"mygearshop","userUrl":"https://itunes.apple.com/us/reviews/id288039498","version":"5.6","score":1,"title":"Worst. Don’t buy","text":"Doesn’t work period\n\nApp just sits there.  Can open cameras \n\nTotal waste of money","updated":"2019-05-03T14:54:10-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"4517762041","userName":"anil.s16","userUrl":"https://itunes.apple.com/us/reviews/id113563596","version":"5.7","score":1,"title":"App is broken.","text":"App is broken. Getting E5-06 error when trying to configure Wi-Fi.","updated":"2019-07-25T19:22:38-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1653868364","userName":"JustBob4Now","userUrl":"https://itunes.apple.com/us/reviews/id102349772","version":"4.3","score":2,"title":"I could cook on my phone when it's running","text":"Better than nothing and meets most of my needs, but when it's running and I am monitoring my cameras my iPhone gets so hot I could fry an egg on it. I can watch the battery drain in real time. Given that I can watch HD video in other apps without it scorching my hand and battery bleeding away, there should be some way to make this app less hungry for CPU and battery.","updated":"2017-06-22T15:22:40-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"2160775806","userName":"AGFan#1","userUrl":"https://itunes.apple.com/us/reviews/id243040518","version":"5.1","score":1,"title":"Bad app support","text":"Not working with cellular LTE. No help from customer service!","updated":"2018-02-02T21:41:57-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"2332587720","userName":"mr boooo app","userUrl":"https://itunes.apple.com/us/reviews/id213904501","version":"5.3","score":1,"title":"Negative star","text":"This is not working Panasonic don’t help, don’t buy this cámaras","updated":"2018-03-21T22:46:01-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"4092957588","userName":"fruitea.v","userUrl":"https://itunes.apple.com/us/reviews/id133895074","version":"5.6","score":1,"title":"Cabbage","text":"Waste money! Do not buy it!","updated":"2019-05-02T23:09:51-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1436513158","userName":"Nikhilsamkumar","userUrl":"https://itunes.apple.com/us/reviews/id519920690","version":"3.5","score":1,"title":"Unable to receive notifications for motion detection alerts.","text":"App bought on US app store does not post notifications\n\nI have bought Panasonic Home monitoring security system from US back to India.\n\nModel : KX-HN6002\n\nI created a new Apple id to download the 'Home Network' app to access the US app store.\n\nI successfully setup the cameras and I am able to view my cameras remotely in my office.\n\nI have a problem - As claimed by Panasonic and other users the system does not send notification/alerts to iPhone when we have motion detection in the outdoor cameras. But, I am not receiving any notifications/alerts in my iPhone (IOS 9.3.4).\n\nI have executed all the necessary actions required to get the notifications.\n\nPanasonic FAQs/communities/forums does not offer any technical help with regards to this problem.\n\nCurrently, I have logged into US apple id account in my iTunes just to make sure I don't miss the notifications from the Home monitoring system - but this did not help.\nI was going through a thread If you're not getting Apple push notifications - Apple Support .... !!\n\nDo you think I need to setup the TCP ports in my router ??\n\nOr Is it due to my apple id (USA) and my iPhone (bought in India) I am not receiving the notifications ?\n\nWat could be done from Apple to resolve this issue ??\n\nThanks for reading my lengthy thread.","updated":"2016-08-20T21:00:28-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1199881067","userName":"Lucky to gave this app","userUrl":"https://itunes.apple.com/us/reviews/id155760783","version":"2.0","score":5,"title":"This is awesome!","text":"No joke, this system is great!  I'm a skeptical person about stuff like this, but I must say this works!  Too fun controllability and options. Panasonic thought through the setup and control work flow. \nI dont want to over sell but I'm very impressed about how well the hub based management system works. \nI spent a few hundred on the home security hardware options and I'm so happy, wife too!  I like all of the mobile control options. \nEnough said. After your first camera you will only want to add more to your control. \nDenverite","updated":"2015-05-19T20:09:50-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1194487140","userName":"Ipad_Upad","userUrl":"https://itunes.apple.com/us/reviews/id108303245","version":"2.0","score":5,"title":"It still needs work. UPDATE!","text":"All of the issues from my previous review have been fixed. Smart Control can have multible devices start cameras and power outlets. They can be enabled/disabled by any combination of Arm home, Arm away, or Disarmed. I recieved a firmware update today and once it completed all of the fixes worked and the app's UI now makes sense. The Wifi and Cellular connections work great. Notifications work like they should. Apparantly there is now a Siren and Water detector available, but I don't see it online yet. Very pleased.","updated":"2015-05-08T21:38:28-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1352881796","userName":"cgbeer","userUrl":"https://itunes.apple.com/us/reviews/id74028622","version":"3.0","score":4,"title":"Love the product, App still needs more love","text":"Overall, for what it is, it's great.  Security, home automation, etc... All in one.  The biggest complaint I have is figuring out what the badge notifications I get are for and how to remove them as I hate seeing them after I read all alerts, and 2 figuring out all it can do is a bit overwhelming.  However, once you figure it out its great","updated":"2016-03-24T11:26:02-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1380109388","userName":"Jsgddmr4562","userUrl":"https://itunes.apple.com/us/reviews/id124827725","version":"3.2","score":3,"title":"Minor adjustments would make this great!","text":"In general I'm pretty pleased. I setup the home network with 4 cams and some leak detection devices.\n\nThere is 1 flaw - when setting the record, i would like to record for 10-15 minutes but get a 10 second preview without having to download the entire video to my phone for monitoring. I would like to have high sensitivity and allow quick deletion of false motion activation.\n\nCameras are not HD- and i knew that going into this, works well for my need - i do however wish i didn't need to download entire videos to review. 2 simple solutions - allow a preview (10 sec would do it) or allow multiple recordings lomg and short.\n\nOverall a decent system with an obvious defect in usage gui.","updated":"2016-05-17T10:50:12-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1383038248","userName":"andregao","userUrl":"https://itunes.apple.com/us/reviews/id240004055","version":"3.2","score":3,"title":"difficult to view footage","text":"The camera recording list does NOT have any preview or thumbnail pictures so it's really difficult to go through the footage quickly because for each recording you'll have to spend at least 30secs downloading the video file before you can watch it. It'll take forever if you need to find something without knowing the exact time stamp.","updated":"2016-05-23T10:42:15-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1457604699","userName":"DK LA","userUrl":"https://itunes.apple.com/us/reviews/id192404235","version":"3.6","score":1,"title":"NOT SO SMART - SIMPLY DOESN'T WORK","text":"I bought this system right when iOS 10 was just released. \n\nUpon trying to download the software to setup the system, it warned me that this app wont work with the new iOS. So for 10 days, this system stayed in the box. \n\nThen they released the updated app on Sep 23. I tried to do the setup and it failed to setup. I tried different wireless device to see if it will somehow work with it and I got the same results. \n\nIf you read a lot of negative reviews, its simply because the app doesn't work. Sadly this means THIS SYSTEM WONT WORK AT ALL. SMART SYSTEM that doesn't work is NOT VERY SMART INDEED. \n\nI hope Panasonic read this and start taking their customers seriously by making an app that actually works and reliable. Especially on home security systems.","updated":"2016-09-28T21:13:38-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1514587572","userName":"Quit peeps!","userUrl":"https://itunes.apple.com/us/reviews/id44062834","version":"4.0","score":2,"title":"Slow connection","text":"The app works ok, but it takes forever to connect to the wifi network! Every time you log in it has to find the wifi connection, which sometimes it doesn't.  When you want to use a security camera you don't want to wait... It would be great if it didn't have that issue!","updated":"2017-01-03T06:45:32-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1571269984","userName":"DAT2000","userUrl":"https://itunes.apple.com/us/reviews/id42239982","version":"4.2","score":1,"title":"Needs a fix right away (Update 3/24)","text":"As someone before me mentioned, this app is sloooww. Being that it uses sd cards for storage, I don't that would ever change.\nI must say, this whole system is totally worthless. There is a huge security risk. The system does not record if it looses internet access. Why is this the case? The cameras don't use wifi to communicate with the hub. On top of that, You don't get notified to let you know the system isn't recording.","updated":"2017-03-23T21:59:55-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1334980629","userName":"Nmdlr2","userUrl":"https://itunes.apple.com/us/reviews/id163451147","version":"2.7","score":3,"title":"Video recording time is too short.","text":"I would like the option to be able to record for more than 15 minutes. I would also like to be able to log in faster. The app takes too long and I can't disarm fast enough to get the alarm to stop ringing.","updated":"2016-02-18T10:06:54-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1258501517","userName":"deviouspanda","userUrl":"https://itunes.apple.com/us/reviews/id24772172","version":"2.4","score":2,"title":"WARNING - video streaming doesn't work in iOS9","text":"App is okay in iOS 8 but streaming video from the camera no longer works after upgrading to iOS 9.\n\nNeeds an update quickly otherwise it looses important security functionality.","updated":"2015-09-16T19:15:27-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1492532700","userName":"رائد الملا","userUrl":"https://itunes.apple.com/us/reviews/id86482467","version":"3.7","score":1,"title":"Application is slow","text":"Very few updates, no server support and requires a static IP address. The hub also freezes a lot and need a reset. So if ur traveling it becomes useless. Unless you hook another hub to be able to switch off and on the main hub!!! This really needs a major update. Am using another brand for my baby monitor and its flawless to bad I invested a lot in Panasonic smart home equipments. I really need to replace it all.","updated":"2016-11-28T11:54:18-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1341240422","userName":"guy23452","userUrl":"https://itunes.apple.com/us/reviews/id18569218","version":"2.9","score":4,"title":"surprisingly good","text":"This was pretty easy set up works good nice feature such as intercom app runs in background but can be stopped via settings \n\ncon :has no hdmi or tv plug so you have to run app to see the camera not that big of a deal.","updated":"2016-03-01T15:23:50-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1651337142","userName":"Working miku","userUrl":"https://itunes.apple.com/us/reviews/id267590855","version":"4.3","score":1,"title":"Cannot connect with lte for remote viewing","text":"Before I could be at the park and see who is inside my house. Fast forward to 2 days later after I updated, the camera would give me a connection error and now I am stuck with a camera that can be only seen in my house. Get your app together pansysonic.","updated":"2017-06-20T11:52:02-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1464922594","userName":"Lkobra","userUrl":"https://itunes.apple.com/us/reviews/id39434400","version":"3.7","score":3,"title":"Decent functionality needs work","text":"Overall it works, but lacks in ease of use. Smart control and notifications are limited to only a couple parameters. It really needs a lock screen widget for arm/disarm.","updated":"2016-10-11T06:34:58-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1455597751","userName":"Cutch61","userUrl":"https://itunes.apple.com/us/reviews/id235347250","version":"3.6","score":3,"title":"Ok","text":"When it works it's great. Half the time when i open the app it opens to the main page and won't do anything. The app is the only way to control the system. Please fix so it's more reliable.","updated":"2016-09-25T04:15:16-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1503758370","userName":"Rhumba Jones","userUrl":"https://itunes.apple.com/us/reviews/id224894067","version":"3.8","score":3,"title":"Quirky now","text":"Talking through the camera used to be a cool feature, but doesn't work now.  Kind of important for a camera you want to talk with someone at your door before you answer it.","updated":"2016-12-17T13:27:41-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1505748840","userName":"shingoodan","userUrl":"https://itunes.apple.com/us/reviews/id38627134","version":"3.8","score":1,"title":"Remote Access Stopped Working.","text":"Remote access function on the cell network stopped working after upgrading my phone and using iOS 10.\n\nCalled customer service 10 times to get to the right department, then tech support just read me through the the trouble shooting off the manual which I tried already.\n\nBasically no one can help to solve this problem.  No point of having home monitoring system when you can't access while you are away.\n\nVery disappointing.  Recommend getting other brands.","updated":"2016-12-20T16:47:23-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1224388788","userName":"big bad wolf 888","userUrl":"https://itunes.apple.com/us/reviews/id24204118","version":"2.1","score":1,"title":"Stopped working","text":"Stopped working after update. You need to have the option of turning off the lights on the camera at night to stop the reflection. Option to turn off motion sensor when you disarm system. Option to flip image upside down when hanging camera upside down.","updated":"2015-07-08T22:50:59-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1454772123","userName":"Telugu boyz","userUrl":"https://itunes.apple.com/us/reviews/id42725837","version":"3.6","score":2,"title":"Unreliable","text":"For a smart security home app, I expect reliability and nimble response. I'm amazed why Panasonic didn't get that. Hope there will be improvements. Hope Panasonic pays attention to reviews and does something about it.","updated":"2016-09-23T18:54:38-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1510744102","userName":"j123431","userUrl":"https://itunes.apple.com/us/reviews/id311706481","version":"4.0","score":1,"title":"Not working on iOS 10.2","text":"Remote access stop working after iOS 10.2 update. Been waiting for this update for weeks, finally saw the update this morning. However, still not working. Hope this problem get solved soon.","updated":"2016-12-28T05:36:38-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1376193536","userName":"Gamer.gamecenter","userUrl":"https://itunes.apple.com/us/reviews/id481681801","version":"3.2","score":1,"title":"Does not work","text":"1 star because it barely functions correctly. Other times it stays on the loading screen, nothing is selectable, voicemails can't be deleted... Horrible. I wish I could return my Panasonic cameras. I do not recommend anyone to buy any Panasonic product that relies on this app.","updated":"2016-05-09T18:59:58-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1351602465","userName":"Fyhock","userUrl":"https://itunes.apple.com/us/reviews/id302191759","version":"3.0","score":1,"title":"Update","text":"Usually never have a problem with this app but since the new iPhone update whenever I go to click on the camera to view why the sensor is going off it says \"device is in use\" even though no one else has the app open.","updated":"2016-03-22T00:40:36-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1297333059","userName":"David Kritck","userUrl":"https://itunes.apple.com/us/reviews/id180000028","version":"2.8","score":1,"title":"access from 4G, LTE, strong wifi does not work","text":"When I try to access camera from out side of home network, it does not work at all. I always getting “Connection unsuccessful” error, even though I have strong wifi connection or LTE. This is useless….","updated":"2015-12-07T08:45:40-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1292607745","userName":"Chuck 352","userUrl":"https://itunes.apple.com/us/reviews/id133618635","version":"2.7","score":3,"title":"Only one Hub can be accessed","text":"Please update the app so that more than one Hub/System can be monitored. Why put that kind of limitation into the app? If someone wants to get another system they can't monitor it.","updated":"2015-11-27T18:02:51-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1313467428","userName":"m_ruiz14","userUrl":"https://itunes.apple.com/us/reviews/id19590804","version":"2.8","score":1,"title":"Takes forever to connect","text":"I am experience a problem when i get an alert and after the app opens It take 30-40 second to connect to my system to clear the alert. It has so much more potential but falls short.","updated":"2016-01-08T18:52:25-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1352343762","userName":"Cmartino88","userUrl":"https://itunes.apple.com/us/reviews/id197292166","version":"3.0","score":1,"title":"New update is horrible","text":"Since the new update their is now an extra step to get to my smart plug... Oh and I can't connect to my alarm system and control it away from home anymore! Also hate that the home phone comes through my cellphone","updated":"2016-03-23T11:24:49-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1530401291","userName":"Dannypl44","userUrl":"https://itunes.apple.com/us/reviews/id226829594","version":"4.1","score":1,"title":"Worst support ever","text":"Good luck getting support for this system. Online chat directs you to call support. Support has you go through an automated circle hell. Then it hangs up.\nRecommend buying a better camera system with better video quality.","updated":"2017-01-25T10:52:06-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1629864810","userName":"Hotrob637","userUrl":"https://itunes.apple.com/us/reviews/id230565490","version":"4.3","score":1,"title":"App won't work on LTE after iOS 10.3 update","text":"App won't work on LTE after 10.3 update. This system is useless at this point. I've notified Panasonic a few months ago and still no fix at this point. Very disappointed.","updated":"2017-05-31T16:45:47-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1454503783","userName":"spudlingly","userUrl":"https://itunes.apple.com/us/reviews/id35608159","version":"3.6","score":1,"title":"Update broke remote access","text":"After spending a full day getting Remote access working, and having it working for me for several weeks, I love this update and now cannot get my remote access. Great job, idiots.","updated":"2016-09-23T06:35:51-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1743090165","userName":"gksultan","userUrl":"https://itunes.apple.com/us/reviews/id42910318","version":"4.6","score":1,"title":"After updated","text":"Panasonic Please fix .still does not work remotely using cellular connection on iOS 10.3 and up spend lot of money and time waiting to u to fix.","updated":"2017-08-23T13:10:32-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1519905846","userName":"dbpiano","userUrl":"https://itunes.apple.com/us/reviews/id41528853","version":"4.0","score":3,"title":"Needs improvement","text":"The app works okay. It would be nice if it's updated to fit the new iPhone screen sizes.","updated":"2017-01-11T06:48:02-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1321970350","userName":"noClue223","userUrl":"https://itunes.apple.com/us/reviews/id16011801","version":"2.9","score":1,"title":"Battery drain","text":"The app runs constantly in the background and drains battery to a point that the phone turns off! Surprisingly Poor quality app form a company like Panasonic. Was there any QA done with the app?","updated":"2016-01-24T20:27:58-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1310872903","userName":"reachAlok","userUrl":"https://itunes.apple.com/us/reviews/id140477950","version":"2.8","score":1,"title":"Good quality product but connection unsuccessful","text":"C'mon Panasonic- don't lose customers due to this App not allowing us to connect back to home monitoring. These reviews can turnaround if you fix this NOW!","updated":"2016-01-03T16:46:25-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1524380256","userName":"Tina Becker2","userUrl":"https://itunes.apple.com/us/reviews/id177108811","version":"4.1","score":1,"title":"Broken in iOS 10.2","text":"Could not access remotely using cell network connection (3G, 4G, LTE). Only works with wifi. Please fix it.","updated":"2017-01-17T10:32:28-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1520328386","userName":"Xyz9901","userUrl":"https://itunes.apple.com/us/reviews/id149231940","version":"4.1","score":1,"title":"Remote monitor does not work in 10.2","text":"Remote monitor (using cellphone signal, LTE, 4g etc) does not work in 10.2. \n\nWifi works though.","updated":"2017-01-11T22:51:30-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1763320096","userName":"campbellandy","userUrl":"https://itunes.apple.com/us/reviews/id42679481","version":"4.5","score":1,"title":"\"Please Wait...\"","text":"\"Please wait\" on every page in the app makes arming and disarming the alarm a slow, tedious process.","updated":"2017-08-31T01:05:29-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1462219865","userName":"Rikins bro-in-law","userUrl":"https://itunes.apple.com/us/reviews/id213347549","version":"3.7","score":1,"title":"Don't upgrade to IOS 10!","text":"Was working fine until I updated my 5s to OS 10","updated":"2016-10-06T12:18:43-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1451424965","userName":"HHLLZOO","userUrl":"https://itunes.apple.com/us/reviews/id217083894","version":"3.5","score":3,"title":"Mr","text":"The app does not work with iOS10 yet. Can you please update for iOS 10 ASAP ? Thanks","updated":"2016-09-17T15:17:41-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1526507091","userName":"Poor jay","userUrl":"https://itunes.apple.com/us/reviews/id280288819","version":"4.1","score":1,"title":"Useless","text":"Remote connect doesn't work! Please fix asap!!","updated":"2017-01-20T06:03:00-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1452964005","userName":"lavalavalaval","userUrl":"https://itunes.apple.com/us/reviews/id525591330","version":"3.5","score":3,"title":"does not work with ios 10","text":"does not work with ios 10，please fix","updated":"2016-09-20T08:22:27-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1923443948","userName":"VTabs","userUrl":"https://itunes.apple.com/us/reviews/id181265642","version":"4.8","score":2,"title":"Recent update 10/2017 made it worse","text":"Noticed app would close on its own whenever i tried to open it with my phone not in wifi range and just using cell service.\nIt wasn’t like that before the update 2 weeks ago","updated":"2017-11-15T12:45:13-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1322345834","userName":"Ronger923","userUrl":"https://itunes.apple.com/us/reviews/id147690942","version":"2.9","score":1,"title":"Worst !","text":"It always froze and not working most of the time.","updated":"2016-01-25T13:50:59-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1451867314","userName":"Dj Pengster","userUrl":"https://itunes.apple.com/us/reviews/id8524278","version":"3.5","score":1,"title":"Does not work for iOS 10","text":"Does not work for iOS 10. Please fix.","updated":"2016-09-18T08:19:21-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1390220519","userName":"nope.pdf","userUrl":"https://itunes.apple.com/us/reviews/id21333519","version":"3.2","score":1,"title":"Worst app ever","text":"Nice looking hardware. The software just flat out does not work most of the time.","updated":"2016-06-06T21:13:29-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1490229597","userName":"Jmx_gkxl","userUrl":"https://itunes.apple.com/us/reviews/id441141903","version":"3.7","score":1,"title":"Not Recommended at All","text":"Total and complete junk","updated":"2016-11-24T08:04:37-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1318600633","userName":"Nth tee","userUrl":"https://itunes.apple.com/us/reviews/id257075932","version":"2.8","score":1,"title":"Worst app","text":"Worst app ever, never connects when you're out side.","updated":"2016-01-18T13:11:57-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1459274737","userName":"Java0087","userUrl":"https://itunes.apple.com/us/reviews/id486732314","version":"3.7","score":1,"title":"bad stuff","text":"too slow. easy breakdown. not recommend at all","updated":"2016-10-01T14:24:05-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1308991831","userName":"Tulliandar","userUrl":"https://itunes.apple.com/us/reviews/id32577976","version":"2.8","score":1,"title":"Terrible app","text":"Slow, crashy battery hog","updated":"2015-12-31T03:37:48-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"7133355719","userName":"fatal 🤬","userUrl":"https://itunes.apple.com/us/reviews/id1171280479","version":"5.9","score":1,"title":"🤬😡","text":"Fatal no puedo activar mis cámaras  y son tres \nGaste demasiado para nada","updated":"2021-03-22T17:00:03-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"5522249948","userName":"AskEric","userUrl":"https://itunes.apple.com/us/reviews/id32389374","version":"5.9","score":1,"title":"Recent update requires Location all the time!!","text":"I like this app until the most recent update. The app now requires location to Be “Always on”.  This is ridiculous and unnecessary. The app has worked well for years without this.  At least allow me to use the “white using app” option for location.  By making be do this the app runs down my battery and is tracking me all the time!  So in an effort to get security I have to give up my personal security (location)?!?!? This is against Apple’s code of conduct.  PLEASE DO THE RIGHT THING DEVELOPERS AND GO BACK TO THE location option of “only while using app”.  If you do this I will change my review and continue using the product. But in till then thumbs down!  👎👎","updated":"2020-02-12T09:14:16-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"5332186794","userName":"NC Living","userUrl":"https://itunes.apple.com/us/reviews/id149023668","version":"5.9","score":1,"title":"Breaches Apple’s code of conduct","text":"After the last update, the app will not work with a location setting of “while using”, it now requires “always allow” to be selected!  \n\nThis makes no sense and does not meet Apple’s code of conduct.  \n\nPANASONIC, DO THE RIGHT THING AND GO BACK TO WHILE USING!","updated":"2019-12-28T14:48:35-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"2225423357","userName":"Yarano","userUrl":"https://itunes.apple.com/us/reviews/id109551110","version":"5.1","score":4,"title":"Not as bad as people are saying","text":"I get why people 1 Star this, it was working one way and then changed and everyone had a hard time connecting. I had the same issues. The thing is- people need to investigate issues before complaining about them, because 9 times out of 10, you’ll find the fix for it. But instead of just complaining, I did a little research and found that they modified the way the app works, and you need some changes made on your router. These changes were necessary for better security and performance, not just to screw with people. Once that’s done, everything was fast and smooth sailing for me. \n\nFor those too lazy to look:\n\n1. Set your hub to a static IP address. \n2. Forward ports 62000-63000 on your router to the static IP you assigned to your hub. \n3. Enable UPnP on your router if it is not already. \n\nOnce I made these changes, I can access the app without issues from my home WiFi and on LTE from my cell when away from my home.","updated":"2018-02-19T06:49:16-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1965550950","userName":"BobaFettie","userUrl":"https://itunes.apple.com/us/reviews/id164859380","version":"4.9","score":1,"title":"Garbage","text":"This is hands down the dumbest smart device I’ve ever used.  I have successfully installed nest, Phillips Hue, chamberlain myq smart products throughout my home. This Panasonic hub and especially the app are a joke.  The app spins for over a minute each time I open it... and each time I switch screens within it, always ending with an error code... then after the minutes of waiting for the error, I can use the app... just don’t switch screens.  It’s junk... spent hours working with it, reinstalling it... JUNK.","updated":"2017-12-02T12:18:51-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1881323936","userName":"Applebox","userUrl":"https://itunes.apple.com/us/reviews/id33851438","version":"4.8","score":1,"title":"It was great when it worked.","text":"Second review update:\nNo remote of any kind via iOS on T-Mobile via 4G or LTE. Works fine via android. \n\nI've updated this review to reflect software and firmware changes. \n\nThe companion app for the Panasonic Home Monitor hardware is decent. Remotely connecting to the system is an exercise in patience as all connections route through their cloud but it has improved greatly over the past few months. \n\nThe programming logic has improved greatly over the original version. Now, multiple layers of scenarios can be enabled.\n\nThe app continues to lack persistence. It will always return to the home page and restart the linking process. There should be a way for it to stay direct connected for short period of time and to remember where you left off.","updated":"2017-10-28T09:43:19-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1805543532","userName":"Vzw2att","userUrl":"https://itunes.apple.com/us/reviews/id22885217","version":"4.7","score":1,"title":"Still will not connect over cellular","text":"With each update I've been hoping this is one that will fix the cellular issue. Sad to report that the update today 7/31/2017, it is still unable to connect through cellular connection. Even at home on wifi, I'd have to fiddle with it by closing and reopening several times before it will connect. I really can't understand why Panasonic is unable to solve this major issue after many updates. \n\nI also have this app on an Android device and it has neither of these issues.\n\nApp no longer opens on iOS 11. \n\nVersion 4.7 update ***still*** unable to connect via LTE. What’s worse is with iOS 11, the app won’t even open when connected to Wi-Fi. The strange thing is I still get alerts when it detects motion, but the app just closes itself when I open it. If I disconnect from Wi-Fi, the app will open but will not connect via LTE. \n\nIt is a completely useless product as it is right now.","updated":"2017-09-23T06:52:17-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1811655722","userName":"Faister","userUrl":"https://itunes.apple.com/us/reviews/id35450278","version":"4.7","score":3,"title":"Pls fix app for iOS11","text":"Since I'd updated my iPhone to iOS 11 I can't see the camera view across all my cameras. Same thing on my wife's iPhone on iOS 11. camera view only worked on my old Android phone. Please fix it asap. Thanks","updated":"2017-09-26T14:48:59-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1687811308","userName":"Oommen","userUrl":"https://itunes.apple.com/us/reviews/id121178377","version":"4.4","score":1,"title":"App not working","text":"After updating the iPhone app is not able to connect remotely. Android app works well and connect remotely.","updated":"2017-07-18T12:20:44-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1360157496","userName":"Feh2","userUrl":"https://itunes.apple.com/us/reviews/id494422123","version":"3.0","score":1,"title":"na","text":"This system, consisting of cameras (both indoor and outdoor), along with the other accessories will work fine provided I’m connected to my home wifi.  Once I go out of range and onto data then the problems start.  I usually have to close and open the app between 4 to 15 times before it will come up.  If you get a trip alarm, it could take you up to fifteen minutes to see the camera.  I say fifteen minutes because that is the point I flatly gave up.\n\nYou must invest in a hand set because it speaks what was tripped where the phone only beeps and you have to read it.  The handset must stay within the hub range though.  \n\nThe point I became really upset with the system is when I went to enter a sixth door sensor.  When I went to register it, it picked up the identity of a certain sensor already registered.  When it tripped, the handset (operating on the hub) correctly stated which sensor it was.  My Iphone on the other hand, said something else.  I deregistered them and reregistered them and always the same.  I called Panasonic about it and they had me reset the hub at least twice, meaning I had to redo all my set up work.  The Panasonic tech has not been able to resolve my issue.  He said he would look further into it and get back to me.  He did call back but was still unable to resolve the problem and said he would do more research and call back.  I have not heard back from the tech support, so I am returning the sixth sensor.  They say the app will take up to 50 devices, but I have only been able to get 5 to work.\n\nI tried reregistering one last time.  The handset spoke the wrong sensor and my Iphone said yet another.  The app does NOT SYNC with the hub!   That was the last straw, I am sending it back and not adding over five sensors.\n\nLike I said, if you use this for inside the home security, you should be fine.  If you want to access from away, then you will be very disappointed in the system.  I have well over $500 spent and I really wish I would have gone a different system.  If it worked the way they said it should, it would be great.  I would highly recommend NOT investing in this system at least until they get some of the bugs worked out.\n\nOne last thing to add here.  If a device doesn’t work right, you have to send it to their warehouse in Texas at YOUR own expense.  Make sure to test it fully so it can be returned within the thirty days or so of purchase so you can return it to the vendor.","updated":"2016-04-07T21:14:52-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"},{"id":"1591051153","userName":"glmccready","userUrl":"https://itunes.apple.com/us/reviews/id144398062","version":"4.3","score":3,"title":"Finally...but..iOS update..,","text":"Not working. AGAIN after last iOS update.....4-17-2017\nThis quirky app finally, after 1 1/2 years is usable.  Before it would take forever to connect, and often fail, making it nearly worthless, esp remotely.    Now it connects fast and with much more success.  Went from 2 to 4 stars!!","updated":"2017-04-17T06:00:12-07:00","url":"https://itunes.apple.com/us/review?id=918066994&type=Purple%20Software"}]