[{"id":"3659417476","userName":"ttripp1","userUrl":"https://itunes.apple.com/us/reviews/id32232061","version":"1.19.0","score":2,"title":"Basic monitoring, does its job","text":"This is a no-thrills app. Hasn’t been updated to fit to newer iPhones and displays with black bars on top and bottom. App will keep you logged in for a while and arbitrarily log you out. Interface is sluggish, and feels like it is a web interface encased in an iOS app.\n\nBut it does what it needs to do. Just wish it had a more up-to-date appearance, and some of the bugs ironed out. Based on other reviews it seems like this app is no longer maintained.","updated":"2019-01-16T22:45:57-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"4632918918","userName":"Masq","userUrl":"https://itunes.apple.com/us/reviews/id43165225","version":"1.19.2","score":4,"title":"So far so good","text":"Lots of negative reviews regarding responsiveness of the app...so far so good for me (just installed today 8/17). I would take those with a grain of salt as the apps responsiveness is heavily dependent on the connection speed and quality of the homes wifi network. For reference, I have a Netgear Orbi mesh system, am seeing plenty strong WiFi speed/strength at my main panel. Install was relatively easy, though I ended up having to invert my phases after install, which took a bit of support searching to find the advanced settings to do so. I also have solar monitoring and can confirm that the real time feedback of Neurio mirrors the generation figures I am seeing on my separate monitoring app supplied by my solar installer. On the consumption side, the reporting is near instant when a device cycles on (example A/C, pool pump, microwave, coffee machine). Loving the data so far and can’t wait to see what kind of stats I can play with once it does some learning. For all of those complaining about the iphoneX scaling—BFD...the app UI works just fine, regardless of not scaling full screen. People are petty. For what it’s worth, I was originally going to install a Sense CT monitoring system, but their CT clamps were too large for my bottom fed bus bar style main panel. Neurio’s “universal CT” clamps were the PERFECT low profile fit for my setup, so that alone made this system worth it!","updated":"2019-08-17T14:59:31-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"3481495902","userName":"Sunny Boy NC","userUrl":"https://itunes.apple.com/us/reviews/id943323575","version":"1.19.0","score":1,"title":"Great when it works","text":"My solar installer installed this device with my solar system as he owed me a whole home monitoring system.  I’m starting to think this must have been the cheapest one available.  It won’t stop crashing or locking up forcing me to crash. Sometimes it’s so bad I have to reboot my iPhone just to get the app to open.  I’ve only had the app 5 days.  \nWhen it does work, I like it. I have 2 Sunny Boy inverters by SMA and this app is more responsive and timely with the data then the SMA app.  It would be nice if it would auto refresh. Every time you view it, you have to switch screens and switch back to get the history chart to update. It would also be nice to be allowed to zoom out on the run chart.  Other whole home monitor systems also allow you to label the devices that turn on and off.  You can instantly see the spike when turning a device on or off, but there isn’t anyway to label it and then see a list of what’s on.   \nAll in all, a decent entry level monitoring system, but they must first get the app to be stable; this is very frustrating as it is today.","updated":"2018-12-01T06:25:48-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"8023797035","userName":"Freddy3386","userUrl":"https://itunes.apple.com/us/reviews/id49617635","version":"1.20.3","score":1,"title":"Generac does not seem to care about quality","text":"Generac is completely aware of issues with this app, I have spoken to them about it. They give it lip service and say they will fix, but they don’t even try as can be seen by frequency of releases. It’s probably safe to assume that if they don’t care about the quality of the app they probably also don’t care about the quality of their generators, so I will find another brand that cares. Very disappointed. Seriously it’s amazing that a major brand simply does not care about the propensity of one star reviews. Unbelievable.","updated":"2021-11-14T08:47:36-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"6583850454","userName":"Cincinnati's Finest","userUrl":"https://itunes.apple.com/us/reviews/id104301694","version":"1.20.2","score":1,"title":"App is Lame at best","text":"Neurio does it’s job and it is consistent as a hardware device. I’d even go so far as to say I like the hardware a lot. \n\nThe software has always been abysmal though. And generac buying neurio has not changed that. Since then, the only thing that’s changed has been the app name and icon, twice. \n\nIt’s slow to load/open w data.\nStill no support for recent iPhone resolutions (looks like some kind of clown app).\nThe detection algorithms need to be completely retaught and re thought. They are useless and that section of the app barely works anyway. \nYou can’t export the entire history of data at once in app or online.\nNo integrations with other platforms ie SmartThings.\n\nGenerally speaking you literally can just watch watts and watt-hours and if that’s enough for you then OK. But don’t expect anything smart. This is basic required functionality for a meter.","updated":"2020-10-28T11:24:39-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"7153086868","userName":"Scotty-Odd-Job","userUrl":"https://itunes.apple.com/us/reviews/id183834225","version":"1.20.2","score":1,"title":"What is going on?","text":"Hard to tell. Am I generating power? I don’t know. Am I using power? I don’t know. How much does electricity cost? I know this! But not in the terms the app wants. Does the sensor seem to work? Yes! But doesn’t translate the information into anything useful. Overall the app and system are worthless to me. I listened to my electricians make fun of the solar guys but my expectation is that the solar guys know how to install and configure it properly which clearly is not the case. This really shouldn’t be that hard but I don’t know.","updated":"2021-03-27T20:16:34-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"6148578317","userName":"Bhilt1299","userUrl":"https://itunes.apple.com/us/reviews/id620726414","version":"1.20.0","score":1,"title":"Very Unfortunate","text":"I have designed and sold Solar Electric systems for over 12 years now. I got a Neurio device from my company and was really excited to install it. The app literally crashed after 20 minutes of use and now tells me there is no information available at my site. I have restarted my phone, deleted and reinstalled the app etc. same thing every time.  Generac obviously doesn’t care about this product or app because they have done nothing to fix it. GENERAC, HAVE YOU LOOKED AT THESE HORRIBLE REVIEWS LATELY???","updated":"2020-07-02T07:09:59-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"4831837673","userName":"Bstubbz","userUrl":"https://itunes.apple.com/us/reviews/id241532746","version":"1.19.3","score":2,"title":"Turning into a waste of money","text":"I’ve had nothing but issues with this system. It rarely stays linked and the app is anything but detailed. Currently my Neurio is connected but my location doesn’t show up in the app or on the web interface. I’m giving up and moving onto something else. Save yourself some money and frustration and look elsewhere.","updated":"2019-09-24T04:44:18-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"6807934779","userName":"S&J","userUrl":"https://itunes.apple.com/us/reviews/id13986959","version":"1.20.2","score":1,"title":"The lights are on....but no one is home!","text":"App hasn’t been updated in ages.  History tab no longer works. No push notifications work any longer. Generac bought out Neurio but it’s clear they don’t intend on investing anymore in the product other than adding their name to the app.  Only gives the basic usage information currently. \n\nI wouldn’t buy any Generac products based on this type of experience.","updated":"2020-12-29T12:09:42-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"5930354492","userName":"Buncha","userUrl":"https://itunes.apple.com/us/reviews/id42739244","version":"1.20.0","score":3,"title":"Not for inverter appliance","text":"It’s pretty good to track large ampere appliances. It’s not so capable for the newer type of appliance that ramp up slowly like the new laundry machine or HVAC with inverter function.  I wish though that it had an analysis function on laptop so i can compare year-on-year usage. So far i can track about 70% of my total electricity usage.","updated":"2020-05-10T22:29:14-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"2553537233","userName":"Connor Fagin","userUrl":"https://itunes.apple.com/us/reviews/id41825193","version":"1.18.0","score":3,"title":"Wanted to love it","text":"I'm disappointed. I was an early adopter and the app/interface was great for a while then things changed. The hardware is the best out there but the software is holding the whole thing back. I haven't seen a single improvement in over a year. In fact, it's gotten worse as time has gone on. Neurio WILL NOT make it if you guys don't step it up.","updated":"2018-05-15T22:43:58-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"5412584903","userName":"Wade747373","userUrl":"https://itunes.apple.com/us/reviews/id86079421","version":"1.19.6","score":1,"title":"Next to useless","text":"Interface and reporting is very limited. Variable production rates for solar are not available, despite having time of use charges. Seems like some one started building this app and never finished. Has the potential to be really useful if they improved the functionality. The always on reporting doesn’t work and neither does appliance analytics if they actually turn it on for you.","updated":"2020-01-16T16:03:51-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"5394959059","userName":"ReviewAHolic2","userUrl":"https://itunes.apple.com/us/reviews/id224360767","version":"1.19.6","score":2,"title":"This app has gone downhill.","text":"Ever since Generac took over Neurio, the app has slowly lost functionality.  First it was missing history, then the “ Always On” data stopped updating, now the app persists in coming up with the “ No Data Available” thing and fails all together.  I am sad.  This used to be a great app, now, not so much.","updated":"2020-01-12T09:00:35-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"7262578709","userName":"killermoves","userUrl":"https://itunes.apple.com/us/reviews/id42032767","version":"1.20.2","score":1,"title":"PWRview crap","text":"I started using the app when I had a generator installed last November 2020. It worked initially but now does not. By the looks of things this has been a problem for a couple of years. I will leave this here and I’m going over to the generator review site and let the future customers know that generac is providing false advertising for part of their product.","updated":"2021-04-25T07:07:23-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"6273789095","userName":"NetSecAdmin","userUrl":"https://itunes.apple.com/us/reviews/id137251763","version":"1.20.0","score":1,"title":"Nearly unusable in iOS night mode.","text":"Can’t switch locations in night mode because locations are in black text on a black background. Need to make this app more user friendly otherwise people won’t continue buying these units. Make it easier to switch locations from the main screen or a bottom button.","updated":"2020-08-02T23:00:39-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"6584596667","userName":"El Guapo ✔","userUrl":"https://itunes.apple.com/us/reviews/id29342628","version":"1.20.2","score":2,"title":"Outdated app","text":"Generac needs to get with the program. This app is obviously neglected. Neurio was much better before Generac bought it. An old school brand takes over a new school product and quickly ruins it.","updated":"2020-10-28T16:39:19-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"4913542417","userName":"aricbny","userUrl":"https://itunes.apple.com/us/reviews/id46197814","version":"1.19.3","score":1,"title":"Broken garbage app","text":"It’s worse than the original neurio app. It hangs constantly, the features don’t work, you can’t enter any appliances, can’t adjust your cost per kWh, can’t change your profile, all this really does is tell you how much energy you’re using now, but the history doesn’t even work. This is trash. So disappointed, it could have been a great app. They obviously just don’t care.","updated":"2019-10-09T06:13:24-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"2815331415","userName":"N6rbv","userUrl":"https://itunes.apple.com/us/reviews/id42042485","version":"1.19.0","score":5,"title":"Well I did like it","text":"Just updated app and now completely useless will not open.. I tried deleting app reinstall still will not open on iPhone X","updated":"2018-07-01T16:45:53-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"6284320212","userName":"Hueypilot68","userUrl":"https://itunes.apple.com/us/reviews/id665165475","version":"1.20.0","score":1,"title":"Sure Miss Neurio App","text":"The app worked much better and was more reliable when it was Neurio.  The app used to have solid performance in reporting in real time our solar generation Vs. consumption for over 2 years of operation.  Since Generac has taken over the app it stays in a learning mode and the app, hardware and software are virtually useless","updated":"2020-08-05T14:14:08-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"4853109311","userName":"jspeciner","userUrl":"https://itunes.apple.com/us/reviews/id101186272","version":"1.19.3","score":1,"title":"Still a crummy app","text":"If you thought that an app “makeover” would mean bringing the app up to date for home-button-less iPhones, you were wrong. If you thought Neurio being acquired by a large, publicly traded company would allow more resources for an improvement to the design and UI of this app, you were wrong. This is still a really crummy app.","updated":"2019-09-28T06:34:42-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"6466123376","userName":"FeiPod","userUrl":"https://itunes.apple.com/us/reviews/id35059390","version":"1.20.1","score":1,"title":"No big screen (iPhone X) support","text":"5 months since the last update and was getting excited for some changes and still no support for iPhone X big screens? Seriously? You have big screen support for your other PWRView apps (for PWRCell), when can we expect the same?","updated":"2020-09-25T00:40:58-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"5192519676","userName":"Dr. Miguelito Loveless","userUrl":"https://itunes.apple.com/us/reviews/id30697501","version":"1.19.5","score":1,"title":"This app keeps getting worse every update","text":"Since Generac bought Neurio this app has deteriorated, and now is no longer functional. \n\nI updated the app today and it refuses to show me my history tab, insisting I update the app first, which I JUST DID. \n\nMy Neurio system  is now worthless.","updated":"2019-11-24T11:13:44-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"4831048527","userName":"ekay31337","userUrl":"https://itunes.apple.com/us/reviews/id28717211","version":"1.19.3","score":2,"title":"New update","text":"They emailed us with this promise “ The app will function the same as it always has, but with a fresh, new look. “.\n\nBut guess what? They just changed the color scheme. Still doesn’t scale to fit the iPhone X screen!!!","updated":"2019-09-23T23:26:34-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"5400779400","userName":"iu8ttdrtdxgch","userUrl":"https://itunes.apple.com/us/reviews/id204843778","version":"1.19.6","score":1,"title":"Worthless Crap","text":"I’ve had the Neurio home monitor for several years. It used to work back before General took over the app and cloud software.\n\nNow, accessing your energy use from their app only functions about 1/3 of the time. It will say “No power data available.” \n\nI’ve contacted General and was told they were fixing it, but, the app function has continued to deteriorate.\n\nI imagine soon, it will never function at all.\n\nStay away from this lousy company.","updated":"2020-01-13T19:32:38-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"6071902858","userName":"mjchernis","userUrl":"https://itunes.apple.com/us/reviews/id37640880","version":"1.20.0","score":2,"title":"Needs some work..","text":"This app has real potential but needs some cleaning up.  At the very least, it should fill the entire screen.","updated":"2020-06-13T11:51:29-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"4830438030","userName":"starkgray","userUrl":"https://itunes.apple.com/us/reviews/id102779379","version":"1.19.3","score":2,"title":"App has some issues","text":"Updating the Neurio app to the rebranded version changed some graphics and colors only but in order to see historical data I had to delete the app and re-install","updated":"2019-09-23T19:03:46-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"5301741241","userName":"Picky eater 123","userUrl":"https://itunes.apple.com/us/reviews/id20029941","version":"1.19.6","score":1,"title":"Don’t bother","text":"App doesn’t even show data even though the device is connected with a strong signal. Will probably wait a few days, then remove the system entirely.","updated":"2019-12-21T13:58:21-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"4833097413","userName":"Hotel Abroad","userUrl":"https://itunes.apple.com/us/reviews/id145167104","version":"1.19.3","score":2,"title":"Generac","text":"Generac version is not showing history for me on my iphone. It also does not show the solid sliding graphics of power real time as nicely as the blue and white graphics by Neurio did.","updated":"2019-09-24T12:09:55-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"6864978086","userName":"prescottCountryGirl","userUrl":"https://itunes.apple.com/us/reviews/id323283438","version":"1.20.2","score":1,"title":"Worst app ever","text":"I have never gotten this to work properly to see the data. I have to remove it and reload..I will get one time info then it goes blank again. Seriously the worst product!","updated":"2021-01-13T06:30:32-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"6499979421","userName":"Jason4568832579","userUrl":"https://itunes.apple.com/us/reviews/id219818485","version":"1.20.1","score":1,"title":"Junk","text":"When Neurio wasn’t owned by generac everything worked fine, since they “joined generac” the app is trash, it won’t even display live usage, yes I have the most up to date version. Should have left it alone.","updated":"2020-10-04T08:23:21-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"5253896530","userName":"charris9999","userUrl":"https://itunes.apple.com/us/reviews/id24921574","version":"1.19.5","score":1,"title":"Perform worthwhile updates","text":"I regret buying Neurio, I had hopes that they would make improvements as time went on but they sold off to Generac.  Now Generac only seems concerned with updating icons rather than fixing their inherited buggy app.","updated":"2019-12-09T16:29:50-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"5186988362","userName":"Nick LkWorth","userUrl":"https://itunes.apple.com/us/reviews/id42510905","version":"1.19.4","score":1,"title":"Absolute garbage","text":"The original neurio app wasn’t anything to write home about, but this one should be taken to the curb on garbage pickup day. Keeps breaking, doesn’t use the full screen and seems like a fourth-grader developed it as their first hello world app. Sad fail!","updated":"2019-11-23T07:09:39-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"7266382739","userName":"Don hu","userUrl":"https://itunes.apple.com/us/reviews/id102121466","version":"1.20.2","score":1,"title":"Doesn’t work!!!!!!!","text":"Fix this app.   It takes forever to load and then zero data.  I’ve deleted it and reinstalled and still same thing.","updated":"2021-04-26T07:41:40-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"5175017107","userName":"Chuck Norris 365","userUrl":"https://itunes.apple.com/us/reviews/id71033850","version":"1.19.4","score":1,"title":"History Broken","text":"Tired of this app being reworked and breaking features. \n\nHistory no longer works. It displays a Generac web page instead.","updated":"2019-11-20T19:27:27-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"3517334313","userName":"mentalmoxie","userUrl":"https://itunes.apple.com/us/reviews/id630301691","version":"1.19.0","score":1,"title":"App crashing and lack of development","text":"I’ve had my neuron for 2 years now and the App has now started crashing.   So it’s basically useless to me now.   It seems the developers have abandoned updates and UI improvements.","updated":"2018-12-10T17:14:48-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"3130279824","userName":"wlbryce","userUrl":"https://itunes.apple.com/us/reviews/id39124984","version":"1.19.0","score":1,"title":"Developers are MIA","text":"In the past this was the best system to monitor your power usage or production. But they seem to be doing the death dance by failing to update the app and leaning to commercial systems. \n\nWon’t work on a IPhone X so save your money and roll the dice on another product.","updated":"2018-08-29T13:34:20-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"4835724833","userName":"tj2d","userUrl":"https://itunes.apple.com/us/reviews/id114029267","version":"1.19.3","score":1,"title":"IFTTT","text":"The new Generac PWRView site no longer seems to work with IFTTT. With the move to Generac, one must reconnect to IFTTT. Attempting to connect enters and endless loop in which one allows IFTTT access to PWRView but when IFTTT attempts to connect, it redirects back to the PRTView site for authorization. I can no longer record my power usage....","updated":"2019-09-25T04:47:32-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"3181779779","userName":"blzzrd","userUrl":"https://itunes.apple.com/us/reviews/id35798470","version":"1.19.0","score":1,"title":"Crash on startup - app useless","text":"Have been on 1.19.0 for weeks, but crash on startup started today. Reboot/re-install doesn’t resolve. At least the website works, the app is currently useless...","updated":"2018-09-12T09:06:00-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"4831884854","userName":"zrci","userUrl":"https://itunes.apple.com/us/reviews/id416326848","version":"1.19.3","score":1,"title":"Got worse","text":"You just broke a good system. This new update makes it really slow to the point that is not real time anymore...","updated":"2019-09-24T05:00:19-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"3610189874","userName":"Sean reynoldscs","userUrl":"https://itunes.apple.com/us/reviews/id16497807","version":"1.19.0","score":1,"title":"Crashes","text":"App now crashes...\nIf you are going to abandon your product the least you can do is open source it!","updated":"2019-01-03T23:27:06-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"7368445218","userName":"beltbuckle2344","userUrl":"https://itunes.apple.com/us/reviews/id136093742","version":"1.20.2","score":1,"title":"Piece of junk.","text":"Doesn’t work a lot of the time. This app has gone way down hill.","updated":"2021-05-20T20:43:19-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"2985027399","userName":"innlinesk8r","userUrl":"https://itunes.apple.com/us/reviews/id4460332","version":"1.19.0","score":1,"title":"New version crashes upon opening","text":"The app just crashes now when I try to load it.","updated":"2018-07-28T19:22:07-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"5177637100","userName":"Stvelkpv","userUrl":"https://itunes.apple.com/us/reviews/id34288599","version":"1.19.4","score":1,"title":"Lousy","text":"This used to work fine until Generac took it over.","updated":"2019-11-21T10:03:25-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"5043752939","userName":"VegasDad","userUrl":"https://itunes.apple.com/us/reviews/id71031042","version":"1.19.4","score":1,"title":"Worthless","text":"They keep taking away features. Support is non-existence.","updated":"2019-10-28T18:53:29-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"8037514630","userName":"neo16769","userUrl":"https://itunes.apple.com/us/reviews/id103576215","version":"1.20.3","score":1,"title":"Generac let this go bad","text":"App history does not work. Very slow and dated. Generac does not care.","updated":"2021-11-18T09:01:08-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"4830112555","userName":"Thiggins1990","userUrl":"https://itunes.apple.com/us/reviews/id106726117","version":"1.19.3","score":1,"title":"New branding update","text":"New update won’t load any of my settings from the Neurio. Thumbs down","updated":"2019-09-23T16:50:16-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"2979392471","userName":"ttdduubb","userUrl":"https://itunes.apple.com/us/reviews/id473141016","version":"1.19.0","score":1,"title":"No longer works","text":"The app jist keeps crashing, will not open!","updated":"2018-07-27T14:49:15-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"7246988913","userName":"lindsaywalter","userUrl":"https://itunes.apple.com/us/reviews/id574851789","version":"1.20.2","score":1,"title":"Provides data, sometimes..","text":"app is very dated","updated":"2021-04-21T05:20:28-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"4830478606","userName":"Dalmightyone","userUrl":"https://itunes.apple.com/us/reviews/id19350075","version":"1.19.3","score":1,"title":"Modernize app.   Max xs or iphone 11 pro max support","text":"Need to update app.  Dark mode.  How about supporting iPhone XS Max and iPhone 11 pro Mac screens.","updated":"2019-09-23T19:19:12-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"3770703535","userName":"crashjason","userUrl":"https://itunes.apple.com/us/reviews/id41071546","version":"1.19.1","score":3,"title":"Please Update to support NEW iPhone Screens.","text":"Please.","updated":"2019-02-14T18:09:27-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"1404662320","userName":"wjm2222","userUrl":"https://itunes.apple.com/us/reviews/id27070979","version":"1.14.0","score":2,"title":"Slow to develop and release updates","text":"I'm disappointed that several months after being notified of a serious problem, there is not a fix. When an appliance runs past midnight, the system stops accumulating time for that appliance. My electric car charges off-peak starting at about 11:00 pm, so Neurio only reports about one hour per day. Bummer.","updated":"2016-07-03T04:55:53-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"4881267337","userName":"ET:","userUrl":"https://itunes.apple.com/us/reviews/id105495728","version":"1.19.3","score":1,"title":"Come on...","text":"Really needs an update guys...","updated":"2019-10-03T20:56:11-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"2807490884","userName":"Gwitt69","userUrl":"https://itunes.apple.com/us/reviews/id37559140","version":"1.19.0","score":1,"title":"Crappy App","text":"The app keeps crashing","updated":"2018-06-30T17:43:14-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"1384856253","userName":"tbitson","userUrl":"https://itunes.apple.com/us/reviews/id34548613","version":"1.12.0","score":5,"title":"The best power monitoring program available","text":"First, this app only works with the Neurio power sensor module. This goes in your power panel and sends power usage data to Neurio's servers using WiFi. It's not cheap, but it's worked reliably for me for over a year. \n\nI've owned several power monitoring systems, but the Neurio is the best I've had. It has separate input for mains power and solar power so you can track your generation and compare to the grid. \n\nIt has a feature that attempts to identify which appliances are active and maintains a running total. This gives you insight into how much power a specific appliance uses. It tracks things like AC, microwave ovens, refrigerators, heaters, and virtually any other device that pull significant power. It will generally not be able to detect small appliances or devices that use less than 400 watts. \n\nThe feature I use most often is the 'Always On'. This attempts to identify your lowest power usage that is always on. When I first started using this app, I had over a 1000 watts that was always on. This was items like wall AC adapters, lights, and various electronic devices. By converting to LED bulbs, adding some timers, or just unplugging unused devices, I was able to get my always on to under 500 watts.  That's still a bit high, but 500 watts saved that was on for 24 hours a day really adds up!\n\nThis app does has a few flaws, but the Neurio team is issuing updates on a regular basis.","updated":"2016-05-27T06:20:24-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"1268708934","userName":"James Turner","userUrl":"https://itunes.apple.com/us/reviews/id36999808","version":"1.2.8","score":5,"title":"Great app and product","text":"The good:  excellent app, great energy monitor, and reasonable price. For keeping an eye on minute to minute or day to day energy use at the household level this product can't be beat. The app is super clever with all sorts of useful ways to look at the data -- far better than competing platforms I looked at. Not as good: the appliance recognition...if you want granular and reliable data about how much energy your a/c or heat pump or oven is using, this isn't the product.. Sometimes it works, often it doesn't. Despite that, I'm very happy with the app and product.","updated":"2015-10-08T06:44:15-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"1178537443","userName":"Ajablu","userUrl":"https://itunes.apple.com/us/reviews/id103185389","version":"1.0.2","score":5,"title":"Excellent product","text":"Paired with the Neurio home electrical monitor this becomes a very powerful product. You can keep tabs on how much electricity you are using in real time. This has allowed me to identify several energy wasters in our home including a refrigerator that was malfunctioning, using about three times as electricity as it should. It can record very small changes, letting you know if a single LED light has turned on. It could even be used to detect if someone is home who shouldn't be or if someone isn't home who should be.","updated":"2015-04-05T18:54:40-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"1179817281","userName":"2fieros","userUrl":"https://itunes.apple.com/us/reviews/id303220363","version":"1.0.2","score":4,"title":"Good so far","text":"This app is designed to be used with the Neurio home power monitor. It is still in its early stages of development but so far it looks like it is going to be great.\n\nCurrently it shows power being consumed and a cost per hour at $0.13/kWh. You can change the cost but it is not saved. Appliance detection is not supported yet but it will be in the next update.\n\nI rated 4/5 only because it doesn't do everything it's supposed to yet.","updated":"2015-04-08T09:18:15-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"1440182307","userName":"CamDbro","userUrl":"https://itunes.apple.com/us/reviews/id35007479","version":"1.15.0","score":4,"title":"Great access to data. Needs UI improvement","text":"Love having access to all my energy consumption and production data. Needs pinch to zoom, and a cursor with a crosshair that doesn't take up half the screen.\nAlso needs custom time of use rate entry capability for weekends. Will update to five stars when these features exist.","updated":"2016-08-27T09:14:06-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"1507666519","userName":"Groucho M.","userUrl":"https://itunes.apple.com/us/reviews/id26341029","version":"1.15.3","score":2,"title":"Needs updating","text":"This app doesn't seem to get any updates, and frequently hangs on screen rotation. Does the job when it runs, but has been stagnant since it came out. Definitely needs UI polish, and upgrade to iPad.","updated":"2016-12-23T15:24:37-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"1384607558","userName":"47t's","userUrl":"https://itunes.apple.com/us/reviews/id102939393","version":"1.12.0","score":4,"title":"App doesn't do what it says","text":"It's a little quirky, but works. Had to contact support and they got everything corrected (for the most part) Love being able to monitor and watch in real time. Had no idea the amount of power some appliances uses.","updated":"2016-05-26T18:29:42-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"1471806852","userName":"waffentrooper","userUrl":"https://itunes.apple.com/us/reviews/id43298739","version":"1.15.1","score":2,"title":"App crashes!","text":"App worked fine for a day. Next day it crashes when opening. Rebooted everything still the same. Can still access via IP on webpage. Is this a version issue!","updated":"2016-10-23T09:06:47-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"1511017526","userName":"Pac90","userUrl":"https://itunes.apple.com/us/reviews/id49368892","version":"1.15.3","score":2,"title":"Leaves a lot to be desired","text":"Missing support for multi-period time of use. Lots of discrepancies between calculation in the app and on the web. Really wish they would updated to iPhone 6/7 res.","updated":"2016-12-28T17:14:54-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"1603483712","userName":"Siriuslistener","userUrl":"https://itunes.apple.com/us/reviews/id85122318","version":"1.17.1","score":2,"title":"Screen Optimization gone","text":"They finally updated the app recently to take advantage of the larger screens but then this update un-did that for some reason.","updated":"2017-05-02T18:09:19-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"1437568929","userName":"jamierytlewski","userUrl":"https://itunes.apple.com/us/reviews/id38403190","version":"1.15.0","score":3,"title":"Great device","text":"The app needs a bit more work. It's still not optimized for the plus size phones","updated":"2016-08-22T17:50:49-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"1609314769","userName":"Karedjearns","userUrl":"https://itunes.apple.com/us/reviews/id26067209","version":"1.17.1","score":2,"title":"Update looks terrible on 7+","text":"The resolution is now horrible. Please fix asap!!","updated":"2017-05-09T05:05:14-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"1491532918","userName":"psnncsres","userUrl":"https://itunes.apple.com/us/reviews/id129759584","version":"1.15.0","score":1,"title":"What does it require a password?","text":"I just want a quick and simple check of power consumption, I don't understand why it's password protected. Al Queda doesn't care what my refrigerator costs to run.","updated":"2016-11-26T16:22:29-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"7215865310","userName":"chuck8773","userUrl":"https://itunes.apple.com/us/reviews/id38339866","version":"1.20.2","score":1,"title":"Should have gone with Sense","text":"Bought the nuer.io many years ago. Should have gone with Sense. This app has has zero functionality improvements. Wish I could switch to Sense for little cost.","updated":"2021-04-12T17:59:54-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"1332416014","userName":"caseyswett","userUrl":"https://itunes.apple.com/us/reviews/id485136924","version":"1.5.0","score":5,"title":"Awesome app and product!","text":"I've been very impressed!   Was super easy to install the Neurio hardware in my panel.   The App and website both work great!\n\nI researched all the other offerings out there and this one kept staying at the top of my list.\n\nGlad I bought it.   I wanted to figure out why my electric bills were consistently $300+.   With Neurio over the course of 3 months..... We have reduced our bill to less than $110/month.   I foresee being under $100/month within the next month.\n\nI had used a killawatt meter to check various appliances before but you don't get to see the whole picture.   I just used it to make sure I knew my fridge and freezer didn't have a stuck defrost timer leaving the heating coil on and that they were drawing less than the name plate rated amps.\n\nUsing Neurio, quickly saw various improvements could be made.   Checking what various items used.   Lights, lamps, TV's, ceiling fans, furnace, AC, fridge, freezer, dishwasher, dishwasher with heated wash and dry cycles, outdoor lights, dehumidifier and various vampire loads like satellite receivers, computers in sleep, monitors in standby...etc.\n\nInvested in some inexpensive LED bulbs from Menards.   Adjusted refrigerator and freezer set points to the temps they should be.... We're too low before.   Got the family to make sure they stop leaving lights on all over the house and start turning ceiling fans off when not needed.\n\nAmazingly, my ceiling fans are horrible energy wasting devices.    Researching further.... They make decent ones, they just cost more, so keep in mind.... It all adds up, so pay attention to the wattage each device uses and note that better more efficient models are available.\n\nThis all possible due to being in the know because of Neurio.","updated":"2016-02-13T08:19:05-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"1331042823","userName":"Lolz4lifeman","userUrl":"https://itunes.apple.com/us/reviews/id396326690","version":"1.5.0","score":5,"title":"Wow","text":"Much wow much work","updated":"2016-02-10T16:26:42-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"6206423710","userName":"dnjuniorg","userUrl":"https://itunes.apple.com/us/reviews/id41618841","version":"1.20.0","score":1,"title":"Cannot edit any settings","text":"I can’t edit any settings or type in anything. When I try there is no entry and attempting to back out leaves you stuck with an error message stating “invalid value integer must be between 0-1000000” forcing me to close the app and restart. Without the ability to edit these fields any budgeting features are useless! Used to be a great app when I first purchased Neurio 4 years ago...","updated":"2020-07-16T15:18:17-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"5613569045","userName":"ajoekent","userUrl":"https://itunes.apple.com/us/reviews/id285460440","version":"1.19.6","score":1,"title":"Stuck in the .com era, full of glitches","text":"Just installed PWRView monitor at the house. Hardware went in easily but when I tried to set up my account on the app I continually got an error message and the text color was light gray on a white background and almost impossible to read. Finally got my account set up using the PC web browser version and it worked on my phone app too. Phone app is glitchy and cumbersome. Some sections of information are stuck in a perpetual loading state. It does give the basic energy usage info, but is not very interactive, is clumsy to use, and graphically unappealing. I work for a solar energy contractor and we use a variety of these products. The hardware is good but software is stuck in the dot com era.","updated":"2020-03-03T21:20:56-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"5369897441","userName":"Macinlover","userUrl":"https://itunes.apple.com/us/reviews/id12612275","version":"1.19.6","score":1,"title":"Unstable App","text":"This app has never been stable, it crashes and hangs frequently.   I’ve been trying to use it to monitor my home power consumption, for the last two years.  Since Generac has taken over, it’s only gotten worse.  If the app is not going to be made stable, Generac should make the source code, open source, so we can write a stable app for the power monitoring hardware.","updated":"2020-01-06T15:07:13-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"},{"id":"5057612944","userName":"CyberKunky","userUrl":"https://itunes.apple.com/us/reviews/id104977869","version":"1.19.4","score":1,"title":"I miss Neur.io - this app is terrible","text":"I have never written a review for an app, but this one deserves one because it is just not an app, it’s also hardware in my house. \n\nI spent a few hundred dollars on the device which I found superior to Smappee and the original app was quite nice. This app looks like a first “hello world” app written by a non-user. As mentioned - it does not support the dark them so you cannot see your characters for user and pwd. So even if you switch, the credentials you give it say “invalid”. This really sticks and whoever is now responsible for the app should apologize to long-time users.","updated":"2019-10-31T15:03:16-07:00","url":"https://itunes.apple.com/us/review?id=924803249&type=Purple%20Software"}]