[{"id":"6767525120","userName":"itz jus me","userUrl":"https://itunes.apple.com/us/reviews/id610984170","version":"2.8.0","score":2,"title":"Cameras are finicky","text":"The lights are stylish and I do love the look! I agree with many others, since they did an update the cameras are DEFINITELY slow to load and often freezes (especially compared to before).\nThe cameras and video are so finicky. Sometimes it captures stuff and many times it doesn’t (naturally when I need it to it fails)\nI feel like if I don’t “snooze” the notifications at night I get woken up with alerts all through the night (including because of bugs flying in front of the camera)\nOf course because you can only go back 2 hours to review (if you don’t pay for the subscription) you may not have a recording what you need.\nI’ve had problems with the lights coming on even though the setting in the app is off and not on motion or I’ve turned them off through the app it comes back on. Plenty of times I’ve just had to flip the inside switch to off. But mostly all the activity that is misses is bothersome and disappointing.","updated":"2020-12-18T10:43:13-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7618867254","userName":"Planet J.","userUrl":"https://itunes.apple.com/us/reviews/id143860336","version":"2.9.0","score":1,"title":"Save your money","text":"These products are unreliable as other reviews have stated. It works fine (though video/audio is very laggy/freezes) and then for no reason the wifi connection stops working. The only way to resolve the issue is to reboot the entire device including reconnecting to the app, reconnecting to the wifi, etc. This is a pain and more trouble than it’s worth. At first I called my wifi provider and they could recognize the other smart devices connected to the wifi but they had no indication that the kuna doorbell was even attempting to try to connect to the wifi. I called kuna support the first time and they just said reboot the whole thing. This solved the issue for about a month then went out again for no reason (all other devices continues functioning as normal, no power outage, nothing). Im tired of paying money for a service whose free version I cant even take advantage of since the smart doorbell is now a dumb doorbell. It just acts like a normal doorbell, cant record or show anything. Also even when it did work, it would ghost ring randomly - it would ring and I’d check the door and check the camera history and no one was there. Thankfully the ringing doorbell doesn’t stress out my dog. Save your money.","updated":"2021-07-25T22:50:25-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7131271697","userName":"Tickednmad","userUrl":"https://itunes.apple.com/us/reviews/id1243917007","version":"2.8.2","score":1,"title":"Junk cameras","text":"Bought 4  of these cameras about 2 years ago! Have had nothing but trouble! Camera’s loose connectivity, and constantly have a picture that is not viewable. They appear to not be very good at being water proof. I have taken them down and found they have water inside them. So I tried putting caulking anywhere that water could get in but that didn’t work either. They still get water inside. Now the pictures on 2 of the cameras is not viewable due to what looks like lines running through picture, and taking them down to dry out is not a good option because who wants to get a ladder out every time it rains to take down so they can be dried out? I sent 1 back while it was under warranty. They took my new camera and gave me a refurbished camera. I have frequently checked connectivity and the numbers are always excellent, around -53. I even went out and bought a new WiFi system to make sure I had good connectivity but that made no difference! I would say buyer beware! If you plan on placing under a roof or eve they may be ok, but mine are out in the open! I don’t recommend these to anybody! Don’t waste your money!","updated":"2021-03-22T04:56:15-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7255642090","userName":"Sean R69","userUrl":"https://itunes.apple.com/us/reviews/id126815466","version":"2.8.2","score":2,"title":"Never, and I mean never, works when needed","text":"If you want to look at nothing they’re great. But, whenever someone or something is moving around in the cameras area it never works. You get the previous image when it did work and a loading icon spinning in perpetuity. By the time the camera loads whatever was there is long gone with no video to save. \n\nThe delay is excessive as well. It is like a full second and I understand the relay but it is significant. \n\nThe image is clear, when it works, and the light is decorative and of good quality. Much to be desired camera wise though. It is not a substitute for an actual surveillance system.","updated":"2021-04-23T11:27:18-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7476015934","userName":"IM LP","userUrl":"https://itunes.apple.com/us/reviews/id14974553","version":"2.9.0","score":1,"title":"Kuna New Security Update iOS devices","text":"Was very disappointed to discover that important security updates did not load on my iOS device since Apple no longer supports updates on iPhone 6 + models. Now there is nothing wrong with my cellphone mechanically or cosmetically, looks like new. The disappointment is that Kuna is a software that is installed on my iPhone 6 it no longer can load new version updates from Apple so am unable to install Kuna important security update 2.9.0. Now I ask you Kuna, does this seem right to you. If Apple does not see the importance for the end-user to access Kuna important security updates then why does Kuna do something to bring this issue for discussion. Kuna, do you value your customers? Does the Kuna security brand have loyalty to its end-users? Then why has Kuna not considering the needs of its users when it come to security updates not being restricted by the decision of Apple. Please help give us a voice and help Apple to do the right thing.","updated":"2021-06-17T13:21:45-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7140864082","userName":"dgdw","userUrl":"https://itunes.apple.com/us/reviews/id28450664","version":"2.8.2","score":4,"title":"A good purchase","text":"We have three Kuna cameras that have been on our house for years now.  They’ve just worked, we get alerts as expected and no major issues.  \nThe only missing feature (and why I’m knocking off a star) is the development team opening this app up to Apple Silicon Macs as Blink has with their cameras (we also have several Blink cameras). One of my biggest complaints with both systems (and many other apps these days) was they’re only accessible from phones and tablets. This would fix that issue and, based on what I’m reading, doesn’t seem to be high effort unless they decide to also do optimizations which I don’t see as necessary","updated":"2021-03-24T16:06:09-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6840119490","userName":"Marty84736268","userUrl":"https://itunes.apple.com/us/reviews/id457466391","version":"2.8.0","score":2,"title":"Used to work better. Camera do but support 5ghz","text":"App is now crashing consistently every other launch on my older iPhone 6s.  Will see if newer phone has same issue\n\nOne feature severely missing is dual band support.  These cameras only operate in 2.4 GHz frequency which is very crowded and will cause you camera to go offline frequently. This means missed recordings!  This was the car when my neighbors truck was stolen and my front door camera was offline at the time and missed the theft.\n\nVery disappointed and I am now looking to replace my 4 cameras with hardwired ones from another vendor.","updated":"2021-01-06T20:47:06-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6641807671","userName":"This gsme suckssss","userUrl":"https://itunes.apple.com/us/reviews/id86474381","version":"2.8.0","score":2,"title":"CRASHES SLOW LOAD","text":"When I first got KUNA it was so fast app never crashed cameras would load quick after opening the app.\n\nNow... crashes allllll the time sometimes need to open close the app multiple times for it to finally stream. When it does open and I click on a live it takes forever to load... I have 4 channels it’s a real big headache. Luckily the preview before you open the app usually works so atleast I get an idea who’s here. \n\nPlease fix the crashes and go back to the update of when the cameras would stream quick.","updated":"2020-11-13T13:56:51-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7942652065","userName":"Dissatisfied Gamer","userUrl":"https://itunes.apple.com/us/reviews/id116654591","version":"2.9.1","score":1,"title":"More expensive in the long run than competitors","text":"Kuna forces you to purchase a subscription plan for more than 2hrs of historic footage. Our neighborhood had thieves trying to steal from cars just after the initial free subscription ended (that we didn’t realize we had) so we were unable to check any footage from 3hrs earlier to determine if they had tried our vehicles. This basically means without the subscription plan, you cannot check what occurred in the night where your security camera is located. \nMany competitors offer local storage or free cloud storage for days - try one of those if you’re looking for home security","updated":"2021-10-22T12:23:02-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7693751349","userName":"Flygirlhp","userUrl":"https://itunes.apple.com/us/reviews/id103355273","version":"2.9.0","score":1,"title":"Cameras online/offline so often","text":"I’ve had a paid subscription for several years. It used to be awesome. Lately my notices are delayed so much that I can’t answer the door when the people first get there and my 3 cameras all go offline all the time. Sometimes they come back automatically but lately I have to keep rebooting the whole system. It seems they are offline every time I need them. At least 1 of the 3 is offline daily this past week. I have extremely fast WiFi and a satellite that I even moved into a window close to the cameras. Doesn’t help. Ready to rip them all out.","updated":"2021-08-14T18:06:30-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7474770227","userName":"The R Team","userUrl":"https://itunes.apple.com/us/reviews/id109762175","version":"2.9.0","score":1,"title":"Only keep recording 2 hrs??? Seriously?","text":"I’ve had this camera and app for a while now (over 2 years) and I’ve decided they’re not worth the time or space in my life anymore. My biggest complaint is unless you “upgrade” to a subscription you can not keep or view the recordings beyond 2 hours from when they happen.  What if something happens in the middle of the night ??? You would never know even if the camera saw it and recorded it. Basically it’s only good for seeing who’s at the door right when you look at it.  Forget about home security! It’s a glorified overpriced door peephole.","updated":"2021-06-17T06:20:28-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7523786431","userName":"MzzKitKatt","userUrl":"https://itunes.apple.com/us/reviews/id1070773129","version":"2.9.0","score":2,"title":"Need Upgrades","text":"I definitely agree with others. I’ve had these lights for years but I stopped using them. When I moved, I decided to reinstalled them in my new home I thought things would have changed/upgraded with Kuna app by now. I was wrong nothing had changed/upgraded since 2018 including delays with the recording or sometimes you won’t capture a recording, that’s not good. What’s going on with the developer? These would be great lights if Kuna would catch up with time and UPGRADE them so they will work, correctly.","updated":"2021-06-30T09:51:19-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7047841395","userName":"Stinkfight","userUrl":"https://itunes.apple.com/us/reviews/id26652337","version":"2.8.2","score":2,"title":"Camera and App worked great!...Until....","text":"I’m not sure what has changed in the last month or so, but whatever it was made my floodlight nearly inoperable. It used to be wonderful. Now, it won’t stay connected to the wifi network, doesn't load the video to my  phone, and because it won’t stay connected, I can’t turn the light off when it now constantly comes on. It’s wildly irritating. The only change from my end was allowing the update from the app. Please resolve the weird issues.","updated":"2021-02-27T23:23:35-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7904547111","userName":"Chifffiibgergibfefvhh","userUrl":"https://itunes.apple.com/us/reviews/id422555578","version":"2.9.1","score":2,"title":"Poor quality software…","text":"Software is probably from the Mario bros era. Super slow images, freeze all the time, have to reset the app constantly, ohh and yes, they do look stylish, but… What does it matters most, style or reliability…?\n\nFor the price of each camera I shouldn’t have to compromise on anything, however here I am with 4 of this cameras around the property and does bug me that they cost $260 plus e/a and DON’T Work PROPERLY. \n\nThey do deserves one star.","updated":"2021-10-11T17:45:22-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7474449103","userName":"Racer XD","userUrl":"https://itunes.apple.com/us/reviews/id227612682","version":"2.9.0","score":5,"title":"Best outdoor camera","text":"Don’t listen to the “so called bad review”. \nThese people can’t screw in a light bulb without reading a how to book. Kuna works great, we’ve had no problems whatsoever. \nThe app is very informative and I don’t subscribe to their service. It’s a door bell, Motion detector, security camera, and it’s well hidden. I installed it myself, very simple.","updated":"2021-06-17T04:37:45-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7997312534","userName":"Sith101","userUrl":"https://itunes.apple.com/us/reviews/id25636614","version":"2.9.2","score":1,"title":"Worthless as a Security Camera","text":"NO LIVE CAMERA FEED.! VIDEO DOWNLOAD HAS NO SOUND! AI will pick up no people so good luck getting a alert for a person at the door. Recordings never play back. Like it says in the title Worthless As A Security Camera. Trying to talk to a person Live with the speaker is a joke. They also do not respond to BBB complaints. Stay away from this worthless garbage. Going with another Camera instead when these die. I am also going to get a Ring Camera because like I said this is worthless as a security camera.","updated":"2021-11-06T21:17:04-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7272123053","userName":"artlm2003","userUrl":"https://itunes.apple.com/us/reviews/id18102732","version":"2.8.2","score":2,"title":"Semi good","text":"Flakier than corn chips. App icon missing on my screen - have to go to Apps store and open from there. Can’t download app because it thinks it’s already there! Can’t delete and reinstall because desktop doesn’t know it’s there!! Sometimes saves videos, sometimes not. No detectable pattern. Customer service is very nice. They try to help. They don’t know wtfis wrong either.","updated":"2021-04-27T20:35:13-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7564911743","userName":"Moe112","userUrl":"https://itunes.apple.com/us/reviews/id103688991","version":"2.9.0","score":1,"title":"1 minute recordings only","text":"I been a paying user for years and still waiting for them to offer continuous recording. The worst part is you get 1 minute video and that’s it you can’t go back and play before the recording started and after as the person still in my front door and you don’t see if they leave or go to your back yard. I am switching for another service with continuous recording","updated":"2021-07-11T09:27:31-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6711607258","userName":"GrampsTech","userUrl":"https://itunes.apple.com/us/reviews/id484508323","version":"2.8.0","score":1,"title":"Program crashed","text":"Dec 2, 2020.  We have 3 cameras running on the Kuna app.  They are all getting a good WiFi signal, but for the last couple of weeks, the feed frequently shows \"offline\" messages and requires a full off-on-reboot.  But wait, it gets worse.  Yesterday and continuing, the program loads, connects to the first camera, then crashes a few moments later.  No luck with any kind of fix so far.  So frustrating!","updated":"2020-12-02T20:06:25-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7861637160","userName":"runner027","userUrl":"https://itunes.apple.com/us/reviews/id6478369","version":"2.9.0","score":2,"title":"iOS 15 video doesn’t load","text":"I just updated to iOS 15 and the video doesn’t load. I can hear street sounds but the camera is stuck on one frame. This is for both live and recorded video. Family members still on iOS 14 do not have this issue.","updated":"2021-09-30T06:18:00-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6923749574","userName":"ghg Ohyou nowj OK","userUrl":"https://itunes.apple.com/us/reviews/id143650015","version":"2.8.0","score":1,"title":"Videos disappear or don’t happen","text":"I’ve had this app for a couple years and I’d say in the last 6-9 months it’s gone downhill! \n\nThe cameras don't pick up videos that I know happened and like this morning I see several notifications of movement and I go to the videos and there’s not one there out of 8!\n\nWhat good is security if it’s not working?","updated":"2021-01-28T05:57:14-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6666167849","userName":"deviLean23","userUrl":"https://itunes.apple.com/us/reviews/id39173617","version":"2.8.0","score":2,"title":"What happened","text":"Is there no support?  The cameras now keep going offline. Have reset, reconnected, turned off & back on.  There is a daily non connection.  Unfortunate because it was a good product when I first purchased so I purchased more.  Now, it’s constantly not working.","updated":"2020-11-20T05:31:17-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6972182892","userName":"lawdogsouljah","userUrl":"https://itunes.apple.com/us/reviews/id104330278","version":"2.8.0","score":2,"title":"Loading problems","text":"Slow to load and mine just stopped working. Was great in the beginning but over time problems with motion detection and loading problems.","updated":"2021-02-08T21:51:40-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7886363222","userName":"duncxxxxxxxxxxxx","userUrl":"https://itunes.apple.com/us/reviews/id1304628632","version":"2.9.1","score":1,"title":"New release does NOT WORK. LIGHT DOES NOT WORK","text":"release does NOT work.  Have had problems with constant on or off for no reason.  Now it will not come back ON AT ALL. I Want the OLD release back - how do i get it. At least that worked SOMETIME.  .   The light NEVER worked.   \nHorrible performance - constAnt pic problems. \nIt is NOT my high speed 200 wifi.   \n\nPlease advise. ASAP","updated":"2021-10-06T18:59:18-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7915442518","userName":"Genyzme","userUrl":"https://itunes.apple.com/us/reviews/id146845009","version":"2.9.1","score":1,"title":"Worked for 3 years","text":"We have 2 of these cameras for 3 years and they’ve worked well. But two months ago one of them stopped working and now both of them have stopped working. Manufacture warranty is only for 1 year, so the tech support guy says there’s nothing else they can do .","updated":"2021-10-14T17:42:47-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7270520844","userName":"ThatZMoxy","userUrl":"https://itunes.apple.com/us/reviews/id85054846","version":"2.8.2","score":1,"title":"Subscription needed!","text":"I purchased one of these door light/camera from Costco a while back. I can’t rewind back to see any recordings without paying for premium subscription! I don’t need another subscription in my life. Just wanted a camera that I can see who was at the door yesterday.","updated":"2021-04-27T10:06:30-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7302027640","userName":"pretrook","userUrl":"https://itunes.apple.com/us/reviews/id24067032","version":"2.8.2","score":1,"title":"Started good, horrible now","text":"App has never had features added. Syncing Companions never works anymore. Cameras have become less reliable over time. Cannot recommend this product. I’m $1000 in to Kuna lights and will eventually replace them all with something better that is HomeKit enabled.","updated":"2021-05-05T11:52:25-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7714745921","userName":"nan!!!!!!!'","userUrl":"https://itunes.apple.com/us/reviews/id111073194","version":"2.9.0","score":1,"title":"Needs an update","text":"Since ios14 cameras won’t connect, slow to load, and freeze up. I have contacted support numerous times and they tell me the cameras are too far from router. The cameras have been in the same place for years and so has the modem and router. This only started 12-18 months ago.","updated":"2021-08-20T07:24:01-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"8094612463","userName":"I'veeliminatedallzejuice","userUrl":"https://itunes.apple.com/us/reviews/id215451837","version":"2.9.4","score":1,"title":"App Doesn’t even work anymore","text":"You guys are so despicable. Crappy customer service sounds like people working from home with parties going on in the background or TV, app doesn’t work, over priced, no support when camera stops working. Buy ANYTHING else other than this.","updated":"2021-12-04T08:26:46-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6937335084","userName":"LiquideFeline","userUrl":"https://itunes.apple.com/us/reviews/id37912558","version":"2.8.0","score":3,"title":"Wifi unreliable on hardware makes app seem bugged","text":"Update to the fourth power: app is solid for me but camera wifi has significant issues. Wifi disconnects and reconnects to my network about once every 5 minutes. There is a chance this is due to my mesh network (but it’s the only way I can get reliable wifi to my smart home). This wifi bug is a long standing issue and I really hope they fix it as the hardware misses visits during this disconnect/reconnect. \n\nUpdate cubed: delete and reinstall app to fix the current set of bugs 🐛 \n\nAnother update: I have to power cycle these lights every few weeks or so else they become unreliable. In order to pick up night time activity, the AI sensitivity must be turned up extremely high. Clean spider webs 🕸 on a very regular basis else you’ll both miss alerts and get ghost alerts. \n\nBelow is my old review. I’ve since added two more lights and have turned on AI for alerts which have changed the entire way these cameras sense people and cars. There is a lot of configuration available for the AI alerts and tweaking them all takes time!\nThe night sensitivity is distinctly less than daytime, but I’m still configuring AI so maybe I’ve yet to tune things in correctly. \nKuna stopped alerting when holiday sounds have been added so I just have to keep checking the app to see if Halloween, Thanksgiving 🦃, or other holiday sounds have been added. \nEach camera style is slightly different in its night time lighting and glare. The original square camera probably has the worst glare of them all even with the additional glare blocks added, the best at lighting is probably the huge swooping light with glass that isn’t completely fogged. \nOverall great replacement for door lights!\n—-\nI installed the first one on the back door. Initially I received a lot of false alarms but it was pretty clear from the video that my trees were setting it off. I turned down the sensitivity to 75% and almost all false positives immediately disappeared.\n\nThe tiny camera shade had to be swapped out for one that was in the included plastic bag; this greatly decreased night glare and increased the night distance and color quality of the light. \n\nAfter a month with the back yard light I installed one on the front door and it’s performed perfectly. I may have to adjust sensitivity for blowing plants but haven’t had to yet!\n\nThe light isn’t perfect but I love it for what it is. As always these cameras require good WiFi -outdoors- where they’re installed. Most problem installs are probably related to people not understanding WiFi signal quality. A repeater near the light -might- fix most of these problems (depending on the house!)\n\nThere is a quirk with notifications: alerts appear but then quickly disappear. Often I will only see an alert if I’m using my phone at the same time it shows up.","updated":"2021-01-31T10:40:58-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7280987418","userName":"Wschneidj","userUrl":"https://itunes.apple.com/us/reviews/id108994268","version":"2.8.2","score":1,"title":"Unresponsive support","text":"I bought a new house that came with Kuna smart lights.  I was working with Support to get the lights transferred to my new Kuna account and they told me I needed to wait 72 hours.  After 72 hours I contacted Kuna support again and they were unresponsive and ghosted me.  Go with Ring.  Nest and Ring are much more reliable.","updated":"2021-04-30T06:42:08-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7517073540","userName":"Dugchek","userUrl":"https://itunes.apple.com/us/reviews/id189078449","version":"2.9.0","score":1,"title":"Doug","text":"It WAS a good setup for the past few years. Last few months (after software upgrades) it locks up, makes my iphone freeze. When phone turned sideways for full screen, does nothing.","updated":"2021-06-28T15:50:34-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6684376027","userName":"cloudjockey34","userUrl":"https://itunes.apple.com/us/reviews/id198970823","version":"2.8.0","score":1,"title":"Crap app!","text":"App crashes all the time! Apparently the designers don’t care and won’t fix. Loads slow and freezes. There are several post in here about that. I will replace with something else more efficient and user friendly.","updated":"2020-11-25T06:30:06-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7900282573","userName":"Kerri Family","userUrl":"https://itunes.apple.com/us/reviews/id29667743","version":"2.9.1","score":1,"title":"Avoid if you have anger issues","text":"Camera constantly goes off line. It takes several tries to get the camera reconnected. AI detection says the corner of my house is a person. Detection zones do not work. Very disappointed with this product.","updated":"2021-10-10T13:19:51-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7835508932","userName":"Kayelle99","userUrl":"https://itunes.apple.com/us/reviews/id87359165","version":"2.9.0","score":1,"title":"Unreliable","text":"Camera feed loads about 25% of the time, often after 10 seconds or more delay. If you hear a noise and want to look out your front door in a hurry, you’ll be highly disappointed.","updated":"2021-09-22T22:32:34-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7310441516","userName":"Emmemma","userUrl":"https://itunes.apple.com/us/reviews/id157963904","version":"2.8.2","score":1,"title":"Videos don’t load","text":"App will not load videos. I also cannot load the current view. However the device under “device health” says the signal is good.","updated":"2021-05-07T17:39:13-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6843700659","userName":"luckymea75","userUrl":"https://itunes.apple.com/us/reviews/id27317034","version":"2.8.0","score":1,"title":"App needing update","text":"One star is being generous.\nTo be paying for a service and a premium security camera price and the app keeps crashing, not to mention the Super SLOW app, by the time the app uploads the thieves are already gone.","updated":"2021-01-07T19:36:16-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7898616109","userName":"Sickofbs","userUrl":"https://itunes.apple.com/us/reviews/id491548608","version":"2.9.1","score":1,"title":"Garbage","text":"I’ve already submitted a review, but it disappeared conveniently, just like all of the footage of my neighbors running an illegal mechanic shop out of their rental home right across the street. DO NOT WASTE YOUR MONEY OR YOUR TIME!!","updated":"2021-10-10T03:52:15-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6664104228","userName":"jeepfiend34","userUrl":"https://itunes.apple.com/us/reviews/id142898861","version":"2.8.0","score":1,"title":"Must upgrade","text":"Can’t review footage over an hour old. Slow. I won’t upgrade to a premium service just for hopefully to get my footage.","updated":"2020-11-19T14:48:03-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6631646783","userName":"AppleChucker","userUrl":"https://itunes.apple.com/us/reviews/id338310747","version":"2.8.0","score":1,"title":"UPDATE KILLED THIS APP","text":"It was odd to see an update (Nov, 2020).  Maybe they decided to fix all those 1 star reviews?  NOPE. \n\nSince installing the update, NO MORE RECORDINGS SAVED. NOT EVEN THE 2 HOURS. EVEN TRIGGERED RECORDINGS.  NO LONGER OPERATIONAL.  \n\nWe all need to contact Apple.  Even the basic app IS NOT FREE.  WE PAID FOR THE HARDWARE.  \n\nWith all those 1 star reviews, WHAT MATH IS USED TO SHOW SUCH HIGH RATINGS?  The few 5 star reviews appear to be”bot” one-line comments.  \n\nTime to shop for an OPERATIONAL AND RELIABLE system.","updated":"2020-11-10T19:00:56-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7156851299","userName":"Mlu5","userUrl":"https://itunes.apple.com/us/reviews/id488634299","version":"2.8.2","score":1,"title":"Worst camera","text":"The light portion is fine but the cameras don’t work. I say they work 30% of the time. To be honest I can never really get the live stream to work.","updated":"2021-03-28T19:05:10-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7848949335","userName":"Mike213","userUrl":"https://itunes.apple.com/us/reviews/id14346499","version":"2.9.0","score":1,"title":"IOS 15 issues","text":"Is that time of year again where the app doesn't work with the new iphone and IOS.","updated":"2021-09-26T17:10:42-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"8094261025","userName":"eeandee","userUrl":"https://itunes.apple.com/us/reviews/id32372087","version":"2.9.4","score":4,"title":"Holiday greetings","text":"The holiday greetings do not show in the menu anymore.","updated":"2021-12-04T06:37:34-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7874394011","userName":"Gaheushshzjej","userUrl":"https://itunes.apple.com/us/reviews/id29854487","version":"2.9.0","score":1,"title":"Kuna is junk","text":"Do not buy anything Kuna support and products are junk and you need to pay \nextra for any storage","updated":"2021-10-03T13:24:10-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"8008114334","userName":"WBellEagle","userUrl":"https://itunes.apple.com/us/reviews/id30740038","version":"2.9.2","score":1,"title":"Camera Lifespan *DO NOT BUY HARDWARE*","text":"Purchased 8 devices and 1.5 years later only 3 still function. \nFlood lights : 1 of 3 work\nFront doorbell : dead\nOutdoor light and camera : 1 of 3 function \nAdd on light used on interior room : dead \n\nCustomer support : units on backorder will call when in stock to repurchase at discount. Nothing in 3 months","updated":"2021-11-10T01:09:35-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7466192392","userName":"Just lost $1","userUrl":"https://itunes.apple.com/us/reviews/id193492710","version":"2.8.2","score":1,"title":"Bad auto update","text":"It Cut the reviews and play back. Try to make you pay to play.","updated":"2021-06-14T22:11:21-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6626738513","userName":"Vasil Kot","userUrl":"https://itunes.apple.com/us/reviews/id606923713","version":"2.8.0","score":5,"title":"Nice app!","text":"Thank you!","updated":"2020-11-09T10:09:04-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"8000462684","userName":"petrifiedForrest","userUrl":"https://itunes.apple.com/us/reviews/id262297513","version":"2.9.2","score":1,"title":"Not functional","text":"Can’t setup device. They need to pair up with SmartThings to get some decent apps","updated":"2021-11-07T17:02:25-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7957897036","userName":"annoyedchile","userUrl":"https://itunes.apple.com/us/reviews/id1166500659","version":"2.9.2","score":1,"title":"Finicky and Tempermental","text":"Every time there is an update, something goes wrong.","updated":"2021-10-26T20:49:22-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6917185933","userName":"Go2assman","userUrl":"https://itunes.apple.com/us/reviews/id123676950","version":"2.8.0","score":1,"title":"Problems","text":"App not working with iPad Air 4th generation. Please fix!!","updated":"2021-01-26T14:30:46-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3785631719","userName":"Sharr12","userUrl":"https://itunes.apple.com/us/reviews/id274485000","version":"2.4.5","score":2,"title":"Nice but !!","text":"I have had these light fixtures on my garage for over a year. I have not enjoyed the fax that I have been robbed and the camera took the event, did not alert me that there was anyone on my property until they had robbed me and left. So not too happy about this. At night the camera will not video anyone on the property unless they stick their face in the camera. \nNot too happy. I’ve reported my problems with their system. But all they would say is my fault. Cameras always going out. But I do have to say it takes great day pictures of all the cars driving by. One of my cameras went crazy and would not stop recording. I did everything they asked me to. To much money for the bad experience. I find that when I first put up the lights. They worked great. But they did something to the system programing and now they really do not work the way they should. I have walked in front of the cameras and they did nothing and on the way back it video me coming in front of it. \nJust ways they need to fix it. The area that the smart program is, it will video pass that area in blue. Now it will alert me that car or person detected but there’s no video of it. That’s been happening for about five days now. I turned off everything restarted from beginning and still not working. There hasn’t been a up date for there program for oh I don’t know. Ever!!","updated":"2019-02-18T09:02:18-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3902325191","userName":"cthruiq","userUrl":"https://itunes.apple.com/us/reviews/id85064200","version":"2.5.1","score":5,"title":"Custom greetings are awesome!","text":"I have three of the coach light/cameras; two on the front of my house, one on the back. I have them set to come on at sunset and go off at sunrise. The LED bulbs use very little electricity and the light is a strong deterrent. With the lights on, the cameras have no problem at all detecting persons or vehicles. I find the detection to be more reliable, with many fewer falses, than my Ring Pro doorbell. Also, the speakers are nice and loud — hardly anybody can hear me when I speak through the Ring. As soon as the Maximus Answer doorbell camera is available, I will be replacing the Ring.\n\nI love that these things are so stealthy. No one ever seems to notice that a camera is there until it’s too late — they’ve been captured on video! The automated greeting is a further deterrent. It usually startles them and leaves no doubt that their presence has been detected.  My only complaint, up until now, has been that there wasn’t an appropriate greeting for every situation. For my backyard, I wanted something very aggressive, because no one has any business being in my walled and gated (locked) backyard. But, for my front yard, I didn’t want to sound obnoxious to the UPS guy.  I needed a greeting that simply advised that they were being recorded on video. Custom greetings solves the problem!","updated":"2019-03-19T19:07:06-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5068112185","userName":"nondi","userUrl":"https://itunes.apple.com/us/reviews/id101845743","version":"2.6.4","score":1,"title":"Two camera light stopped working month appart","text":"Over a year ago I replaced my Front and Back door lights by two Kuna camera lights. It did work well for a while and even from  Europe I could watch and listen nearly instantly what was happening around my house in New York State. Then after about five month the Front camera light went blind while the light part of it was still working and following schedule settings and nothing was able to resuscitate the camera part. A few month later the same thing happened to the Back door camera light. I’m now the proud owner of two Expensive fake camera lights. I have the top Fios Fiberoptic cable internet connection, a NightHawk R9000 router providing a powerful wifi signal and three other brands of camera (SV3C, Uokoo, Wyze) connected here and there around the house. They never failed me while they cost for some of them less than a fraction of the price  of kuna. I tend to think that not upgrading to a monthly subscription  has triggered some kind of targeted appliance failure. Look... they do their best for you to upgrade, no microSD card, no other option for you to save your videos locally, very little option if none in the app to take real control of your device, no factory reset.\nHonestly for the price of a Kuna camera light you nearly buy more than 5 pan and tilt $40 Wyze cameras that would do the same thing but the light and keep your old light there.\nKuna for me was just a big loss of money!","updated":"2019-11-01T23:51:10-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"4382337935","userName":"MusclesII","userUrl":"https://itunes.apple.com/us/reviews/id100451347","version":"2.5.2","score":2,"title":"This light WAS awesome","text":"I bought three of these lights one for my front porch one for my back porch and I floodlight for my driveway. I started having issues with the back porch light and the front porch light. When I first signed up for this contract with Kuna their customer service was awesome actually could talk call and talk to somebody and you could communicate very well. Now it is Communication by email and if they do you happen to call you sadly I cannot hold a conversation with them very well because it is very hard to communicate/understand. The point of this review is that my front camera has stopped working. All it does is pick up vehicles it does not detect anybody coming to the porch any longer. I have gone over and over the issue with Kuna and they keep sending me things to do and try, The solutions are not working,  I have repeated the issues to them and they continue to say that they will adjust things on their end, and for me to send videos or screenshots of what I’m speaking about which I have done several times and yet still have no solution on why this camera refuses to detect a person coming to the front door or walking in my yard, on a consistent basis it is very hit and miss on what it wants to detect. But as far as picking up vehicles it is spot on …","updated":"2019-06-28T10:55:01-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1819688012","userName":"DZJW","userUrl":"https://itunes.apple.com/us/reviews/id503003061","version":"2.2.0","score":5,"title":"Complete my outdoor security","text":"I got the Maximus Transitional Smart Security Light. The lighting fixture is really pretty and stylish; the quality worth the price with or without the smart features. This being said I am here to give my feedbacks to Kuna App. Very much wanna give it a 10-star. First of all, the whole installation and activation process is effortless. I download the App and followed the in App instruction to finish registration stuff. I was reading carefully but it took me less than 3 minutes to see myself standing in front of my door through the App. : D that's Aha moment leads me to take a selfie and post instag right after. I invite my family within the App so everyone get to enjoy the smart home experience. I choose a dusk to down lighting schedule on Kuna so my light turns on and off automatically--another effortless experience but I talk to Alexa when I wanna turn on or turn off the light, and I never used the light switch again...My neighborhood is very safe and quiet but sometimes I do love the fact that I get notifications whenever the camera detect events in my front door. Overall love the app and especially the lighting fixture.","updated":"2017-09-30T17:38:45-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5326918270","userName":"NVstanley","userUrl":"https://itunes.apple.com/us/reviews/id15145898","version":"2.6.6","score":2,"title":"Great idea but with new problems","text":"Installed the Kuna porch light hardware several years ago and it not only was a beautiful, easy way to get porch video/audio security, it felt futuristically easy & offered intercom abilities! Happily used the app, camera & audio for years until some problems appeared...\n\nSomething changed and I have been dealing with unusable live feed transmission issues and slow app response times. I called customer support numerous times (playing email tag first for days on end) and they were unable to resolve my issue, always saying they would have to email the engineers to see if they could figure out what was going on—they couldn’t.\n\nThe light and recordings and notifications still function as they should, but the live feed has been unusable now for over a year. How disappointing since that is one of the main features of the product! I keep waiting for a firmware update or that will solve the issue, but now I’m exploring other products to replace our beloved Kuna.","updated":"2019-12-27T08:54:39-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1169567782","userName":"R. Dish","userUrl":"https://itunes.apple.com/us/reviews/id23988357","version":"1.1.2","score":5,"title":"Can't wait for my Kuna to arrive!","text":"I'm excited for my Kuna to arrive and decided to check out the app in the meantime. You guys have done a fantastic job - everything looks to be easy to set up and straight forward. From a design standpoint, everything in the app is clean and looks great. It's neat to see this project come to life after backing it on indiegogo. Really great job, you guys!\n\nThe only thing I would change (and this is totally being nit picky) is the actual app icon. I wish the blue went all the way to the edge, getting rid of the tiny drop shadow - the black strips on the two sides and bottom edge of the icon - and putting it more in line with the \"flat\" look of iOS.\n\nThe only reason I thought to bring up such a superficial request is because this app will have a permanent place on my home screen, so I'll be seeing it a lot. I suppose if that's my only complaint, you guys have done an outstanding job. 😃","updated":"2015-03-17T20:05:39-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"2434510984","userName":"Techno Shaman","userUrl":"https://itunes.apple.com/us/reviews/id38068281","version":"2.3.3","score":2,"title":"Decent when it works","text":"Cameras go offline too often, even when a router is literally within 10 feet of a camera. Sometimes when they go offline, you have to manually re-add a camera which is horribly inconvenient, especially since the app doesn’t remember the settings you used when you last added the camera, so everything needs to be set again. I don’t know why a camera that has gone offline doesn’t remember its settings, but the only time it does remember and go back online on its own is when the power goes out. \n\nI’ve also had at least one issue where no recording was made, even though I received a notification. I could view the activity in real time, but for some reason no recording was ever made.\n\nKuna support is reachable, but they haven’t been able to offer a solution for any of the aforementioned problems. For $10/month (I have two cameras), the cost is steep given the issues. When I’m away from home on travel, if a camera goes offline, I’m out of luck until I return home, which defeats the purpose of having these.\n\nThere’s also no HomeKit support for Kuna products, nor IR for better vision at night. Overall, the product feels more like a beta than a refined solution at this point.","updated":"2018-04-17T13:47:29-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6044138394","userName":"PashaBuddha","userUrl":"https://itunes.apple.com/us/reviews/id101155167","version":"2.7.2","score":3,"title":"Needs new features","text":"I’ve had four cameras around my home for years and was originally very happy with their service. But I expected them to keep up with the times and evolve into full home security and automation but that hasn’t happened. Worse, the system seems sluggish now and often goes off-line or disconnects from the cameras and has to restart the app. Software updates are infrequent and don’t fix any of the issues. No new features have been launched in years and they don’t integrate with other systems. \n\nOverall a decent system but needs to be updated and new features need to be added soon or instead of upgrading with them I’ll just move on to another service provider with full home services when I eventually replace my current camera system.","updated":"2020-06-06T14:24:03-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5364480845","userName":"Waynee28","userUrl":"https://itunes.apple.com/us/reviews/id111585880","version":"2.6.6","score":5,"title":"Re-install app to fix sluggish/crashes","text":"Hello everyone. I found a fix to the sluggish and app crashing probs! I have ten cameras spanning two different properties. I’ve loved my Kuna system for about 3 years. Until recently it became very sluggish and the app began crashing often rendering it unusable. However, today I read reviews of others having similar problems. As a last resort I deleted the app and re-installed it. Everything now works GREAT!!! No more sluggish. No more crashes. PS: I recently added their new doorbell camera and it is great! Initially it was catching every car that drove past and I kept adjusting the “area of interest” down to just a small area around the door and it works great.","updated":"2020-01-05T07:05:24-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3524707056","userName":"Digital Learning Specialist","userUrl":"https://itunes.apple.com/us/reviews/id356027916","version":"2.4.4","score":1,"title":"Great when it works","text":"Originally wrote a review a couple of months ago and provided 2 stars. After months of the app/camera working approximately 10% of the time, I’ve down-graded my review from two stars to one.\n\nThe overall Kuna rating is currently 2.6, and that’s .6 higher than I’d give it. The customer service is great, but the app/camera is super unstable. Some days, we’ll get 35 notifications stating it has gone on and offline, and other days, it won’t go back online until we reset our WiFi or power off the camera at the source (which is a pain since it is on a short-term rental that we can’t access all the time). Many times, video footage also won’t fully download, so 25%+ of the footage becomes useless. I don’t think Kuna developed comprehensive enough technology to be able to support typical internet traffic and changes, and it would be great if they did some major upgrades so that the camera was more reliable.","updated":"2018-12-12T19:57:37-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"2930559220","userName":"8a8yG","userUrl":"https://itunes.apple.com/us/reviews/id184656854","version":"2.3.8","score":3,"title":"It’ ok...","text":"Customer service is great! I received a defective unit that was constantly going offline and the team quickly send me a replacement! The app is very easy to use! However, the notifications when someone is at the door is usually late to my phone. The microphone quality is great, but I have the issue that if a person at my front door starts talking while I am giving them a response through the mic, I will not be able to hear them.  The camera does not pick up motion at night very well even though I have my AI settings configured for the areas of detection. Overall, it is a good way to keep your home safe.I just wish the system will notify me as soon as it sees the car or individual during the day or night (since the device says that it is always connected to EXCELLENT wifi!).","updated":"2018-07-18T11:56:21-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1201166972","userName":"⚽️Dad","userUrl":"https://itunes.apple.com/us/reviews/id422406243","version":"1.1.6","score":4,"title":"Buggy","text":"It's hard to rate the app independent of the product. My kuna keeps showing as offline- is it an app issue, product issue, network issue? On iPad, rotating to landscape view makes the bottom screen controls (sound alarm, play msg, hold to talk, turn light on/off) inaccessible. We also really need a remote reboot button. Many times I'll check on the house from work and the kuna is unresponsive. I have  to text my kids to turn the light switch off/on to reboot the kuna. I am thinking of pairing the kuna with a wemo switch so that I can just do it remotely. It would be nice if I could just do this from the app. As a product, it was easy to set up and I am looking forward to the app updates that will make this product even better.","updated":"2015-05-22T15:11:40-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5693023413","userName":"BubbaJoeBobMac","userUrl":"https://itunes.apple.com/us/reviews/id8800633","version":"2.7.2","score":3,"title":"OK, but features desperately needed","text":"I have had Kuna enabled cameras for years now and for the most part have been happy with them, but there has been a distinct lack of improvements. Kuna does not integrate with basically anything. IFTTT, nope. Alexa, not in a useful way. HomeKit, not a chance. SmartThings, Google Home, etc... You get the picture. \n\nWhen Kuna first came out they where ahead of the game, but they have fallen behind, way behind. Outside of some bug fixes, very little has been introduced to make it better, and it is now way behind it’s competitors. I don’t know what is going on, but worry they are on their way out, which would be disappointing as I like my doorbell camera. Just wish it could talk to literally anything else in my smart home setup.","updated":"2020-03-21T11:32:11-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"2944681230","userName":"A real shopper","userUrl":"https://itunes.apple.com/us/reviews/id443923150","version":"2.3.8","score":1,"title":"Worst update ever!!!","text":"I purchased two Toucan attachments so I wouldn’t have to replace my nice outdoor fixtures. The one for the front door always worked fine. The one for the back door constantly kept going offline. However, since the last update it isn’t keeping my videos for 14 days. I pay yearly. It has dropped my videos after 2 hours and 6 hours. Their customer service is horrible. They’re only available Monday thru Friday 9:00 to 5:00pm Central time REALLY???? REALLY!!! Security is 24/7. I’ve been told to delete the app then re-install etc...  How about you fix the glitch or return my fee for the unused months left on my contract with you. I’m truly disgusted with your customer service or should I say lack of customer service. I was considering replacing my Toucans with the Maximus security lights found in Costco. But now that I know there is no one to help when you need it why would I. Fix the problem!!!!!","updated":"2018-07-21T06:48:47-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1557820633","userName":"Joe62612","userUrl":"https://itunes.apple.com/us/reviews/id210558957","version":"2.0.7","score":2,"title":"Delayed notifications","text":"Works great when it works. Half the time it either have delayed notifications or completely missed triggers. Tried many times adjusting the motion sensors and going back and forth with tech support and still the same results. I even sent it back for a replacement and it still does the same thing. My wifi have strong signals with over 90mbps detected right at the light, so I know it's not my connection.\n\nI wish the engineers can really work on those issues.\nI more thing, I wish when I speak with someone over live recording that I it records my part of the conversation as well instead of just the person at the door. I would recommend this light to my friends and families but without the fixes I don't think I can do so currently. I hope Kuna is listening.","updated":"2017-03-04T23:21:02-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"2521878460","userName":"owlowlowl","userUrl":"https://itunes.apple.com/us/reviews/id41416134","version":"2.3.4","score":5,"title":"Awesome","text":"I’ve had Kuna for a while now with no subscription. I just paid for the service and couldn’t be happier! So many times my camera would go off in the middle of the night and I would wait too long to look at it and would lose the video. Now, with the subscription I’m finally seeing all the things I was missing. Thank god no intruders but have seen lots of wildlife passing by my camera through the night. Definitely worth the purchase for peace of mind.\nI did have some initial problems after the update but realized that it was my mistake and all I needed to do was log out and sign back in and everything was golden again!👍","updated":"2018-05-08T17:57:25-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1531722202","userName":"Krrtexxas","userUrl":"https://itunes.apple.com/us/reviews/id39973679","version":"2.0.6","score":5,"title":"Extremely Happy","text":"I love our Kuna porch light.  It gives us such peace of mind when we're out.  I love having both live view options, and video recordings.  I had a really good experience with Customer Service this past December when our beloved dog passed away.  We had spent hours her final morning in our front garden together and since our Kuna premium trial had ended, we didn't have any videos of the special moments.  Chris at Kuna received my request to help retrieve the videos and extended my trial another week.  I was able to retrieve the videos from my pup's last day and so many more.  I really appreciated his kindness during such a tough time.","updated":"2017-01-27T08:22:50-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3507375192","userName":"Slick6574","userUrl":"https://itunes.apple.com/us/reviews/id285187732","version":"2.4.4","score":2,"title":"Stylish but unreliable, to expensive for quality","text":"Had high hopes, easy install, but daily issues of camera detection turning off. Sometimes when greeting comes on it’s 2-3 greetings play at same time ( max headroom, for those old enough to know who that is) have uninstalled and reinstalled app, killed power to light to reset daily. Motion activation still works but no camera, try to watch playback it tells me still recording, this is 30 mins later. Before you ask according to the app I have excellent signal and the light is less than 5 feet from the router. Online and phone help is little to no help, they tell me to do the exact same things I have already tried. Randomly it will come on and work as it’s supposed to but not a reliable source for extra home security","updated":"2018-12-08T03:32:20-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1557437516","userName":"Chris freeman","userUrl":"https://itunes.apple.com/us/reviews/id86834836","version":"2.0.8","score":2,"title":"The camera is great but buyer BEWARE!","text":"I bought two Kuna camera lights and two companion lights. So at first I was super thrilled about these as they look good and can stay powered on all the time if needed. BUT, there's always a but. They make you pay to keep the motion detections recordings. Otherwise they don't let you keep the recording for longer then 2 days. Then I have a new iPhone 7 Plus and the videos recordings are not able to be downloaded to your phone. Then I tried to share the same video and guess what, can't email, text or post to FB because the format is not compatible. Super lame of them. I bet if I paid a subscription then they would be able to be saved. Buyers beware I can barely utilize this product without paying subscription fees.","updated":"2017-03-04T09:24:48-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"2291473500","userName":"Ms Lola B","userUrl":"https://itunes.apple.com/us/reviews/id135517308","version":"2.3.2","score":5,"title":"Def Worth It!","text":"If I could give 10 stars, I would.  Just ordered my second one.  Yes, there were issues with the video pixelation but they contacted me and confirmed it was an issue with the modem channel.  So, I’m good. \n\nThe clarity is amazing. The level of sensitivity is great also (pickup movement as close as the porch or as far as cars driving down my street). \n\nI’ve actually witnessed an attempted burglary of my home. Was able to give him a piece of my mind and sound the alarm from the camera. It made the perp scatter. I was later able to distribute the video to neighbors quickly to inform them to be on the lookout.  Perfect!","updated":"2018-03-10T08:18:21-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6583279507","userName":"Knowledge1913","userUrl":"https://itunes.apple.com/us/reviews/id20904926","version":"2.7.2","score":3,"title":"Needs iOS 14/iPhone 12 update?","text":"The camera has worked well for years, though it’s not good with the live feature and talking to someone. It doesn’t seem to capture live motion and conversation at the same time. There’s always a delay.  \n\nWhat I notice now is that the live camera isn’t working at all. Only the sound is coming through, but if there’s someone actually in front of the camera, you can’t see them. I noticed this more after Apple updated the operating system. I’ve uninstalled and reinstalled the camera, socket, WiFi connection, and the app on my phone. I still cannot get the live video to work properly.","updated":"2020-10-28T08:03:52-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1562243354","userName":"21charles","userUrl":"https://itunes.apple.com/us/reviews/id266620344","version":"2.0.8","score":5,"title":"This App Started Out GREAT, and Just Continues to Improve ! ! !","text":"A while ago a criminal was arrested & convicted of stealing our mail, (several packages), due directly to how well the KUNA system operated. \n\nThe price is incredibly reasonable, especially considering everything it does, and how simple it is to operate. I was out of town, several states away, when a solicitor came to our front door.  Upon being alerted, I easily engaged them in a Back -n- Forth conversation.  As far as the solicitor knew I was inside my house, but to busy to come to the door.  \"BTW\",, I was also able to due this while in another country ! ! !","updated":"2017-03-11T07:08:25-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5553509102","userName":"Goose3281","userUrl":"https://itunes.apple.com/us/reviews/id203998206","version":"2.6.6","score":2,"title":"Going Downhill","text":"I used to be a huge supporter of Kuna cameras, recommending them to any one who would listen.  Just can’t recommend them any more.  All my recorded videos, regardless of when they were recorded, freeze around the ten second mark on playback but play fine when downloaded. \n     Customer support could not resolve the issue and closed out my case with a “will get back to you”.   Issue continues months later with no one getting back to me.   \n   Another complaint, you can NOT simply change your email in your account.  You have to jump through hoops to simply change your email unlike Kuna’s competitors that simplify this process.","updated":"2020-02-19T12:07:03-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5953436240","userName":"ComputerGod112","userUrl":"https://itunes.apple.com/us/reviews/id30697505","version":"2.7.2","score":3,"title":"Definitely agree kuna needs to integrate!","text":"I have several kuna & toucan video cameras. Very disappointed they have not evolved into smart home devices.\nThe new wireless toucan cameras use a new toucan app that does actually work with Alexa, but sadly, the app will not connect with my old kuna/toucan wired cameras. \nThere is no firmware update to make the old toucans work with the new wireless toucans, so if I purchase a new camera they will be on two different apps! \nWhy not upgrade the kuna app to integrate with smart homes and be able to see both old and new cameras in one app? \nI guess that makes too much sense. Why try to make your customers happy?...Very disappointing 😩","updated":"2020-05-16T08:21:48-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5967543459","userName":"Buggghfjcj","userUrl":"https://itunes.apple.com/us/reviews/id35052843","version":"2.7.2","score":1,"title":"Really amazing, until it wasn’t...","text":"So our first Kuna light would not connect to anything. Company graciously replaced it and our second unit worked fine. Was a few times it didn’t seem to work correctly but nothing too bad. Then we upgraded our WiFi network and now the unit won’t work. However I don’t think it has anything to do with our connection. The Kuna used to pick up 3 other WiFi networks from neighbors but now it simply says “cant fetch WiFi networks” \n\nCustomer support is usually a hard to understand Asian person and they simply tell you to email a photo of the problem.. then they do nothing. So now my expensive camera is simply a regular light. Would’ve been a 4-5 star product. Now it’s worthless.","updated":"2020-05-19T15:36:55-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"4188423605","userName":"bunn3hh4x","userUrl":"https://itunes.apple.com/us/reviews/id85553047","version":"2.5.2","score":2,"title":"Needs Updating","text":"If you aren’t bothered by the constant offline/online messages then you’ll definitely be annoyed at how long it takes the app to load the video feed (both live and recording). Most of the time the person has left the porch by time the video loads and that is assuming there isn’t horrendous graphical anomalies which occur on the phone app (iPhone 6S and the XS) or on the iPad. Their customer service never return my emails or support requests sent through the app. When I first got the camera it worked great for like a month and two years later I was dumb enough to get another for my garage. Don’t waste your money and invest in a better home security camera setup or even a RING.","updated":"2019-05-21T16:44:13-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"4838314520","userName":"Chris_Henley","userUrl":"https://itunes.apple.com/us/reviews/id11412582","version":"2.6.3","score":1,"title":"Not great","text":"purchased Kuna on June 13, 2017 (actually purchased three) and setup was easy. Worked great until I changed my WiFi SSID and that was it. Turns out the device uses the Bluetooth to connect first time to set up the WiFi connection. To my surprise, the Bluetooth stopped working and I was not able to communicate to the light to get the Wifi setup. Now I just have a really expensive light. Not sure when the Bluetooth stopped working but the warranty only covers the first 12 months. So I needed to make this discovery in the first twelve months or that was it. Called support and was told, \"sorry, you are past the twelve months and there is nothing we can do\". Really disappointed with the product and the support. I recommend the Ring at this point.","updated":"2019-09-25T18:49:35-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"2557860275","userName":"Vartan the warior","userUrl":"https://itunes.apple.com/us/reviews/id486877479","version":"2.3.4","score":3,"title":"Mission impossible!!","text":"After having installed for over a month i have nothing but issues, it doesn’t detect 100%, the motion light is useless, the customer service is joke, they keep giving you the runaround in circles repeating the same thing over and over again, they blame your router, the speed, channels, when in reality it has nothing to do with detecting, the funny thing is i have other things that are connected to my WIFI and i have absolutely no issues, by the way my router is about two feet away from the lantern, they just don’t want to admit that their product has flows and don’t even want to bother fixing it either.","updated":"2018-05-16T23:22:06-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6195527776","userName":"Why commericals","userUrl":"https://itunes.apple.com/us/reviews/id246682895","version":"2.7.2","score":2,"title":"The 2 hour free recording disappeared","text":"I heard the motion sound went on then I went to the camera recorded playback and found nothing. I am not sure why now even the 2 hour recordings are gone. Do we have to get premium to view video history even within the 2hr period? I was able to see the videos before when I first installed the light/camera 2 years ago. Not sure what happened lately. My ring is as able to capture the cat walking by but not Kuna. Kuna only made the alarm sound but didn’t record video. Please fix this.","updated":"2020-07-13T22:30:52-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"2275856305","userName":"Scootert123","userUrl":"https://itunes.apple.com/us/reviews/id35742116","version":"2.3.2","score":3,"title":"Works well for me but has some issues","text":"I have 4 cameras and 3 companion lights operating for over 2 years. There have been some growing pains with the updates have generally brought improvements. There are some continuing annoyances: 1) periodically 2 of the 3 companion lights disconnect from their parent camera. This requires a complete reset of the companions and re-pairing with the parent. 2) sometimes there is significant latency between when a person is in the field of view (6 to 10 feet from the camera) and they are detected.  I have adjusted the parameters but the results only differed slightly. 3) Kuna promised HomeKit integration years ago but this failed to happen. :-(","updated":"2018-03-05T20:53:16-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1937434765","userName":"dwscoggins","userUrl":"https://itunes.apple.com/us/reviews/id50016780","version":"2.2.3","score":5,"title":"Working again","text":"The app was down for a couple of days but is back up again. The app itself is vey good. It allows you to view live and trigger recording, speak through the cameras speaker or trigger a siren. \n\nIt allows you to control the sensitivity of the detection, receive alerts and view recordings. In addition you have complete control of the lights. It also loads quickly. \n\nMost of the bad reviews sound like WiFi issues. You can’t run IP Video on a slow network. I had to upgrade my speed and add an extender.","updated":"2017-11-21T06:25:30-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1207251073","userName":"Techgirl⌚️2015","userUrl":"https://itunes.apple.com/us/reviews/id419237008","version":"1.1.7","score":5,"title":"Pretty Smart!","text":"At first, my Kuna was sending me dozens of alerts on windy days (detected the trees moving). This was super annoying because I read that kuna was supposed to be \"smart\" and learn that it was a tree and not a person. Well, turns out you have to teach the kuna. after marking the clips as \"not a person\" the number of false alarm alerts went down. On a particularly windy day I didn't get a single alert. I walked in front of the kuna just to make sure it was actually on. Yep, kuna saw me as a person and had learned to ignore the trees! Pretty smart!","updated":"2015-06-04T14:01:19-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1334972550","userName":"Jimxyz123","userUrl":"https://itunes.apple.com/us/reviews/id12176246","version":"1.2","score":1,"title":"Unhappy user","text":"I have owned the Kuna motion sensor light for a month and find that it has many problems. First off there is quite a delay from the time someone approaches your door till you receive a notification that someone is there. Additionally, Sometimes it does not even signal that someone has approached your door. Often when you do get a signal that someone has approached your door you cannot view the camera to see who is there because you get a message that the camera is busy. If you try to view the film recorded by the camera while the camera is busy the film is not available. By the time you get use of the camera again the person has already gone and you have no idea who is there.","updated":"2016-02-18T09:42:45-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1261871250","userName":"Navdeep34","userUrl":"https://itunes.apple.com/us/reviews/id101726473","version":"1.1.13","score":4,"title":"Great product, but needs better optimization","text":"This is a fantastic product and is much better than any other security camera available. The ability to monitor from anywhere  with motion makes it one of the most enthralling products available.\n\nHowever, I have noticed that when someone is at the door, and I try to view on my device, it momentarily says camera is busy. It wouldn't matter if you are away from home but if you are at home, it is crucial to be able to see the visitor. \n\nAlso, for people that have multiples kuna's, there should be an option for the motion notification to display the exact location. Right now it says \"someone is at the door\"\nAnd under that, it says the location, but it would be more convenient to have it as the main notification.\n\nOther than that, this product works great.","updated":"2015-09-23T16:44:50-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1692014948","userName":"Jeffstoked","userUrl":"https://itunes.apple.com/us/reviews/id18693125","version":"2.1.8","score":4,"title":"Love the new Kuna AI","text":"I like how this picks up and notifies based on person or vehicle.  Looking forward to it getting smarter over time.  It would be great however if you could disable alerts for vehicles and keep enabled for persons, rather than bunching all alerts together.\n\nBy the time I'm able to open the app and start a manual recording, the 10 secs have passes so it doesn't catch the event.  Please have manual recordings grab 30 seconds before starting. I think this is enough time to get opened and start recording.","updated":"2017-07-21T06:17:26-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1519860047","userName":"J,hghj,cxC jghsKJFFSmn","userUrl":"https://itunes.apple.com/us/reviews/id151573602","version":"2.0.5","score":5,"title":"Love, love, love this","text":"I did actually use this once to answer the door. So convenient!  Love being able to see when packages are delivered, when the cat sitter arrives when we're traveling and when my husband last walked the dog. I love the possibility of answering the door with the prerecorded male voice. Other fun things you can do with this: check to see if it's raining at home when you're away and post a video of yourself on Facebook falling on the ice.","updated":"2017-01-11T05:29:36-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"2076286794","userName":"Hector578284849","userUrl":"https://itunes.apple.com/us/reviews/id168405641","version":"2.3.0","score":3,"title":"Needs work and features","text":"I’ll start with the positive remark. This app works and alerts as needed and it very rarely does not work to the point of frustration. \nNow my criticism.\nThe load time from alert to full live feed needs to be sped up, I feel like people are sometimes walking away by the time I go live.\nNeeds casting options. It would be great if I could cast to my chromecast or Apple TV when I am waiting for a guest or service worker.\nI may be a little out of place mentioning it here, but the Alexa skill does not alert on motion, I have mentioned that in the skill store.","updated":"2018-01-10T11:57:06-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1358309590","userName":"Ourdoc","userUrl":"https://itunes.apple.com/us/reviews/id9981504","version":"1.2.1","score":4,"title":"Great product needs improvement","text":"There needs to be a way to just turn on or off the light without using an app or waving your hands. They also could make an Apple Smartwatch app that would allow you to do just this. As it is now it's more difficult to normally control than a normal light.  You can't just flip the switch. \n\nFlipping the switch as normal light requires an entire new internet connection to be established so that is not the answer as the cam is wanted 24/7.","updated":"2016-04-03T23:25:59-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1355503753","userName":"Frankenawesome","userUrl":"https://itunes.apple.com/us/reviews/id43204052","version":"1.2.1","score":4,"title":"Great so far.","text":"The app and the light fixture have been great to date. I've had it since 3/1/16. The only thing that bugs me is that the video playback is not always instant. That may just be a problem with my internet connection. The notifications are on point, as soon as someone is at my door I get notified but I can't see what's happening instantly, sometimes it takes a few try's. Hopping for improvements soon. But so far it's a great product that could get even better.","updated":"2016-03-29T11:27:15-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5500588816","userName":"Kicmich","userUrl":"https://itunes.apple.com/us/reviews/id87615014","version":"2.6.6","score":2,"title":"Great at first, but very buggy","text":"I’ve had 3 Kuna cameras for 1-2 years. They were great at first, but after about a year the oldest camera randomly stops recording motion and needs to be reset often. Sometimes the app wont load the videos even though I pay for the premium plan. None of the cameras capture motion reliably, even with the sensitivity very high. Lately the app shuts down whenever I try to switch between live streaming and videos.  The cameras and the app are too unreliable for the cost.","updated":"2020-02-07T11:47:26-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5043986648","userName":"Danny r. A.","userUrl":"https://itunes.apple.com/us/reviews/id85402276","version":"2.6.4","score":1,"title":"Not worth it","text":"We purchased 4 camera lights. Immediately we had issues with 1 that would keep disconnecting and not show video. I contacted support and had to have it replaced TWICE then another camera started giving us issues but only like 1 every few months so we just deal with it. \n\nAs far as for the motion”... someone could walk by the camera, break into your car, steal stuff before you even got a notification. \n\nYou can’t depend on these cameras to actually “capture” something. They’re only good for being able to look at a live stream of your view when you want.","updated":"2019-10-28T20:28:52-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1654014031","userName":"Dunbeazy","userUrl":"https://itunes.apple.com/us/reviews/id463903666","version":"2.1.6","score":1,"title":"Cost effective but not so great","text":"If you want a little security and don't have big pockets then this is for you. It needs some work though as it is not what it seems. It misses motion often no matter the sensitivity level and alerts can be seconds to minutes. Example: I'm at work and on wifi and receive an alert that someone is at my door. I quickly open the app and click on the live camera. (A matter of 6seconds) Soon as the feed displayed, a car was already backing up. I watched the video it recorded and it was Jahova witnesses that stood at my door for prob 40 seconds. So this is what I mean by late alerts. I really can't complain though for the price.","updated":"2017-06-22T18:45:19-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"2460230866","userName":"Bangkok9958","userUrl":"https://itunes.apple.com/us/reviews/id573667704","version":"2.3.4","score":5,"title":"This a great Device!","text":"Not sure why there’s negative feedback. Must be from all the non-technical folks. Installing and setting up this device was sooooo easy. Down load the app, enter in your credentials, and pair your phone with the device. That’s it, nothing more!  Great image. There is a second of latency but that’s normal for most camera systems. Image quality is good too! The app is easy to use. Great product!","updated":"2018-04-23T19:00:07-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1926034795","userName":"GGgreen122","userUrl":"https://itunes.apple.com/us/reviews/id34065903","version":"2.2.3","score":3,"title":"So close","text":"The app is decent for me, it notifies the second someone comes to the door, but by the time it’s done loading when I want to see the person, they are leaving (like the mailman for example). Also I do not know if this is possible in a software update but when I talk to someone it needs to be dual duplex, it shuts off audio so I can’t hear their response, that’s one of the purposes of the cameras so it should work properly. It still comes in handy for me but has some major inconveniences that need to addressed.","updated":"2017-11-16T14:08:18-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5674143649","userName":"Markv14","userUrl":"https://itunes.apple.com/us/reviews/id23308119","version":"2.7.1","score":1,"title":"System Sluggish","text":"We’ve been using Kuna for a few years now and love it!  Unfortunately we’ve noticed that the app - camera connection has been slow / sluggish. Often times I’ll get a notification someone came to my door after the fact.  Or the video feed will freeze.  I thought maybe increasing bandwidth with my service provider would help, which I did, but it hasn’t made a difference.  Is there a firmware update to fix this issue!?  I noticed it had also dropped WiFi connection / gone offline a few times for no reason as well. \n\nTh","updated":"2020-03-17T13:00:49-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1550522504","userName":"Eddieavalos","userUrl":"https://itunes.apple.com/us/reviews/id240331024","version":"2.0.7","score":5,"title":"Like new updates","text":"Did notice less notifications thought it was learning my routine not sure it was update. Or if it's a good thing. I think this app is very good and so is the kuna. Tried the Arlo wireless but doesn't come close to kuna as far as app and hardware. Happy with purchase. Real like the way it gives us clip right from notification instead having to unlock phone then open app.","updated":"2017-02-22T22:20:28-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"4483356850","userName":"arevirnor","userUrl":"https://itunes.apple.com/us/reviews/id510422502","version":"2.6.1","score":5,"title":"Terrific Customer Service","text":"I had a problem with my videos not clearing automatically and  contacted customer service.\nDavid Smith contacted me back and upon checking found that there was a glitch in the system and that they will be working on an update to correct the problem.\nDavid Smith stayed in contact with me until the update was posted and the problem resolved.","updated":"2019-07-18T21:47:38-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5378135229","userName":"utah secure","userUrl":"https://itunes.apple.com/us/reviews/id108911062","version":"2.6.6","score":1,"title":"Slow. Went to hell.","text":"The shift from live to recorded used to take a second. Now that tranisition (either way takes up to ten seconds) . The whole live view takes longer to load, by far. \n\nFor instance, the front yard camera used to send a beep notification, and I’d open the app and see the UPS guy walking away. Now, it doesn’t open before his truck is gone. \n\nLooks like kuna has given up. Too bad Costco supported them. $500 for crappy service - I’ll be sending a letter to my friends in Kirkland, and I’ll go wired on the cameras. Enough. These fools gave up.","updated":"2020-01-08T15:38:24-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5670218112","userName":"kissnmemo","userUrl":"https://itunes.apple.com/us/reviews/id114794145","version":"2.6.6","score":3,"title":"Log-in Failure Since last IOS upgrade","text":"Unable to log in since Apple iPhone upgraded to IOS 13.3.1. It quits before it could log in. We are only able to view live footage on our old iPad with older operating system. We purchased 9 of these porch lights for our two homes. \n\nNo upgrade available on Apple App Store .\nI use to speak highly about Maximus Lights with camera, but not lately. I recommended these product  to dozens of friends😖.","updated":"2020-03-16T16:38:36-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"2123935260","userName":"i_Bimmer","userUrl":"https://itunes.apple.com/us/reviews/id113727989","version":"2.3.0","score":2,"title":"Unable to reconnect to new WiFi","text":"I followed every step to pair my security light, when I get to the point where my phone is next to the security light to add device and select device from the list as new device 1 (step 4), I continue the set up process however at this point the app crashes and it never gets to step 5. I’ve reset it numerous times by shutting power, I’ve also reset it by holding the reset button for 10seconds to no avail. I’m fearing that the circuit board my be bad at this point or the kuna app is glitchy.","updated":"2018-01-24T20:36:34-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1447631912","userName":"tomdoyle1948","userUrl":"https://itunes.apple.com/us/reviews/id43802510","version":"1.4.0","score":5,"title":"Great Product with very nice app","text":"I installed a Kuna Craftsman Bronze outdoor security light and camera. Install was easy as I was replacing an existing fixture (took me 25 min). Setup using the app was easy. App works great. My only suggestion is to include the \"Play Message\" button when the app is used in landscape mode (the live video image is larger when in landscape mode). That is quite easy to do so I hope they do it.","updated":"2016-09-10T11:58:31-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5728492471","userName":"Seth Stewart","userUrl":"https://itunes.apple.com/us/reviews/id38073763","version":"2.7.2","score":4,"title":"New Bug","text":"Not sure what bugs you fixed with this new version but whatever you did caused a new bug. Now when I open the app there is a grey bar up top that says “No devices detected”. I have to tap the screen multiple times before the camera feeds show up. This makes it difficult for me to rapidly see what is going on around my house. Please fix ASAP.","updated":"2020-03-28T18:01:26-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5451845950","userName":"jake tucky","userUrl":"https://itunes.apple.com/us/reviews/id1126823936","version":"2.6.6","score":1,"title":"Stay away","text":"Sluggish is one word. If you bought a camera from these people go return it. Freezes sometimes, doesn’t record all the time, somehow when you turn the light on it makes it worse. Their AI program couldn’t tell a semi trailer from a dog and if you want to record you have to pay. No way to use it on the desktop, probably because they don’t want you to have the ability to stream it to your computer so you can save it on there, instead of using their garbage platform. Just my 2 cents.","updated":"2020-01-26T09:50:11-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"2575536912","userName":"slimmershadier","userUrl":"https://itunes.apple.com/us/reviews/id12373155","version":"2.3.4","score":1,"title":"Really slid in quality over last few years","text":"I was enthralled with this a few years ago- wonderful video and audio quality, simple app, not glitchy. I moved, didn’t use for a few years, just moved again and was psyched to reinstall..... only to have this now cost money to use the same way (“premium” didn’t exist years ago!), the dusk to dawn light feature simply doesn’t work (yes I have all the latest firmware and app), and the video quality- despite my internet being 25x faster now- abysmal. So disappointed. Another startup down the toilet when they needed to monetize.","updated":"2018-05-20T21:55:16-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3527942167","userName":"munksterball","userUrl":"https://itunes.apple.com/us/reviews/id40638125","version":"2.4.4","score":2,"title":"Meh","text":"App is too slow. I get an alert but then when I open the app to check on my front door it often won’t load or takes so long that the individual is gone.   Customer service takes a long time to respond. Be prepared to try getting in touch multiple times.  When my issues were finally resolved I ended up getting another unit that didn’t work correctly.  I just deal with the issue now because trying to get another unit is far more frustrating.","updated":"2018-12-13T17:49:10-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1636685866","userName":"ILGoon","userUrl":"https://itunes.apple.com/us/reviews/id16155614","version":"2.1.6","score":3,"title":"Average. More control needed.","text":"The UI is a bit slow, but we are talking about wifi streaming HD video on a home network here. \nMore granular access control is needed: need to be able to grant addition users control of cameras during defined times. Use case: regular weekly babysitter should be able to attend to door withou opening it during the week, but doesn't need notifications when off duty... feels like a MVP release, hope more functionality is on the way.","updated":"2017-06-07T11:37:19-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5475057964","userName":"Ox072","userUrl":"https://itunes.apple.com/us/reviews/id150773127","version":"2.6.6","score":1,"title":"Absolute Garbage","text":"The cameras are a complete waste of money and this app is garbage. I installed three cameras and they haven’t worked right a single time. Every couple hours I have to reconnect them to this app. The live feed is pointless since it never loads. I’ve hit “update firmware” for each one and they won’t update.\n\nI’ve boosted wifi signal for the cameras and perform exactly the same. This system amounts to a fake security camera/great digital door bell ringer.\n\nI hope developers actually fix this garbage but no high hopes. Invest in a hardline system instead.","updated":"2020-02-01T07:59:53-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"2229304748","userName":"B.G.B. 040811","userUrl":"https://itunes.apple.com/us/reviews/id120685330","version":"2.3.1","score":2,"title":"Monthly Fee is Ridiculously High","text":"I have one light installed in my backyard, and it works well.  However, I have decided not to install one in the front yard due to the high monthly fee that Kuna charges.  $5.00 per month per light is outrageously high, when e-storage costs are so cheap.  Even the cost of Ring, $3.00, is too high, but it is still a much better deal.  If Kuna would lower their total monthly cost (for all lights, not just one) to match Ring’s cost of $3.00/month, then I’d probably recommend this product.","updated":"2018-02-20T09:53:10-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"2877374426","userName":"irhgic","userUrl":"https://itunes.apple.com/us/reviews/id22952197","version":"2.3.6","score":4,"title":"Needs Bluetooth headset support","text":"I have 5 kuna coach at my place and 5 at my parents place.  Very happy with all features and functions.  Firmware need support for Bluetooth headset now.  When I view live, Audio does Not go to Bluetooth headset which is not the case from other competitors.  I also have Logi circles and Ring cameras all of which have this feature.  This is very handy in loud environments.  Kuna Devs, please add Bluetooth audio support.","updated":"2018-07-10T04:05:45-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1840477183","userName":"Dejovas","userUrl":"https://itunes.apple.com/us/reviews/id163956018","version":"2.2.1","score":4,"title":"Great","text":"I accidentally bought 2 cameras (eventually I’ll buy 2 dummies and move 1 of each to a new location).  Sometimes 1 camera detects motion but the other doesn’t.  They’re literally 3 feet apart and someone is standing right in the middle of them.  \n\nFor the most part the system works very well.  Between the two cameras, one of them will pick up just about anyone that comes to the door.","updated":"2017-10-10T18:22:23-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3326896795","userName":"WoaowMusic","userUrl":"https://itunes.apple.com/us/reviews/id550120725","version":"2.4.1","score":1,"title":"Fake notifications unless you pay","text":"If you don’t have the premium membership (which it doesn’t even tell you the cost until you sign up) it will send notifications at three in the morning saying ‘Someone came to the door!’, luckily I was awake and able to go on my phone, but there was no recordings.\n\nThe same thing happened a few days later and I wasn’t able to get to my phone in time.  Horrible app, if you got the unit.\n\nI would suggest returning it unless you’re willing to pay the fee for the premium membership.","updated":"2018-10-21T05:20:10-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6304863962","userName":"Jose-fam","userUrl":"https://itunes.apple.com/us/reviews/id43150908","version":"2.7.2","score":1,"title":"No Security Security camera","text":"Unbelievable! I hear the alarm but when I try to view it, it tells you “SORRY CAN’T PLAY RECORDING”.  Well, how do I know that I’m about to be burglarized? Most days I can’t view recordings even when I try to play the oldest recordings on display. Lately it’s so hard to view the playbacks bc it’s  distorted and the color kept changing.  And sometimes it doesn’t capture a movement.  I know bec I went in front of the camera.  It did not record.  \nI’m so frustrated with this App.  Please fix it quick!","updated":"2020-08-10T21:36:07-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1185313485","userName":"PeterM76","userUrl":"https://itunes.apple.com/us/reviews/id172604441","version":"1.1.5","score":2,"title":"Buggy","text":"I hope the Kuna folks fix this thing. My light/camera randomly disconnects and I can't get it to reconnect. It says it has a low signal when I'm standing right next to the light and it also says it has a low wifi signal and the light is located eight feet from my wireless router (I get a full wifi signal on my phone from the same location as the light). I really like the concept and the light. I hope they get the software figured out soon.","updated":"2015-04-19T16:01:20-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1926136735","userName":"JDH9000","userUrl":"https://itunes.apple.com/us/reviews/id40244719","version":"2.2.3","score":5,"title":"Happy with Product. App is Buggy","text":"I have a WiFi Extender in my house; it’s older with a lot of walls. Before i installed the WiFi extender I received a lot of offline messages. After the extender, it’s been perfect!!!!!! If you buy one, invest in a WiFi extender especially if your modem is a good distance away from where you’re installing it.","updated":"2017-11-16T15:12:58-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6233284118","userName":"AndyBTM","userUrl":"https://itunes.apple.com/us/reviews/id29516043","version":"2.7.2","score":1,"title":"Product is not reliable","text":"I brought the Maximus Smart Security Light from Costco and it stopped working around 1 year with the bad WiFi component.  They send me the replacement (refurbished one), get it to install and work for about 90 days and the sensor stopped working.  I called and email customer service and they won’t replace with another unit because replacement unit only warranty for 90 days.  I would never buy or use any of their products.  It is not reliable and very bad customer support!","updated":"2020-07-23T11:49:33-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3623669908","userName":"Scotteman0708","userUrl":"https://itunes.apple.com/us/reviews/id145605522","version":"2.4.4","score":5,"title":"Great product!","text":"Had this for about a year now, got 6 mos. free subscription when I purchased At Costco ( gotta love Costco!).  \nDon’t need the subscription, just need notification when someone is at the door, or package received.  Dies that perfectly!\nEffortless to install.  Has more to offer than Ring, at 2/3 the price.  \nLove it!!","updated":"2019-01-07T10:54:54-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1532674433","userName":"Ldilly2017","userUrl":"https://itunes.apple.com/us/reviews/id26673163","version":"2.0.6","score":1,"title":"Awful awful awful awful","text":"Worst product and support EVER. Originally purchased in September. Worked fine, then spotty then not at all. After 3 separate emails from myself and my husband we got a replacement. HORRIBLE!  Can't call customer service as they only have email. \"Christopher\" is a computer not a person I'm certain! What's the point in having this product if my dang light won't even stay on let alone work at all! Now we are stuck cuz they've got my money! Filing BBB complaint on Monday. Please explain how this product is still selling!","updated":"2017-01-28T21:06:20-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6528165654","userName":"Michael-Tampa","userUrl":"https://itunes.apple.com/us/reviews/id34443954","version":"2.7.2","score":1,"title":"Fine. Needs Updating","text":"This company seems to have abandoned this app. Look at the TOUCAN app. Different delivery guy in the pic but SAME HOUSE. 🤔 Maybe the company is now Toucan? But here it’s a Buggy app as they don’t update very often or keep up with the new OS. Buggy system as sometime I can’t view the videos after the hour but sometimes I can for DAYS! Ha. No new features in years like Alexa or HomeKit integration. I’m needing a new one and most likely will not go with Kuna again unless something changes soon.","updated":"2020-10-12T10:59:37-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"4426361824","userName":"Kacyj1","userUrl":"https://itunes.apple.com/us/reviews/id104257095","version":"2.6.0","score":4,"title":"Clear All Recordings Not Working","text":"Yes, as others have posted, this new update has broken the “Clear All Recordings” option. I have to delete each one individually which is a real PITA. Hoping you will please get this fixed properly as soon as possible. Other than that, I have been extremely happy with the app and my Kuna cameras!","updated":"2019-07-07T12:31:20-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1462562500","userName":"KAASAVEGA","userUrl":"https://itunes.apple.com/us/reviews/id49347461","version":"1.4.2","score":5,"title":"Recording","text":"A feature should be added of manually recording an event while viewing live. An event can occur in the distance that the motion sensor can't pick up while live viewing. Other than that the app is pretty helpful. Thanks for changing back the notification ring tone.","updated":"2016-10-07T03:39:10-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5038269059","userName":"gvmydollrsbck","userUrl":"https://itunes.apple.com/us/reviews/id339402428","version":"2.6.4","score":3,"title":"Needs motion sensor sensitivity day and night settings","text":"I wish I can set a daytime motion sensitivity and night time sensitivity that will switch back and forth day and night. I have to manually switch every time I wake up and every time I go to bed the sensitivity. My phone goes off every time a car passes by and a bush wiggles if I don’t adjust it. Please add this setting. Thank you.","updated":"2019-10-27T19:01:42-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3579614295","userName":"sgv2","userUrl":"https://itunes.apple.com/us/reviews/id36274481","version":"2.4.4","score":5,"title":"Great product, Great App","text":"My experience with this app has been great.  No problems whatsoever.  I’m really impressed with camera quality and all the features with the lights and intercom.  Love the date and time stamp on all recordings.  So much better than many others for the money in my opinion.","updated":"2018-12-27T05:30:53-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"2435795933","userName":"Mkajoyfulnoiz","userUrl":"https://itunes.apple.com/us/reviews/id133529332","version":"2.3.3","score":2,"title":"Worked well now it’s not!","text":"Super frustrating... frequently went on & offline when it didn’t before. Now it’s completely shut down. We reset rebooted & did all recommended and nothing works. The quality of the camera & it’s service got poor once we signed a years contract, and there is nothing wrong with our WiFi. Is it rigged to not work properly once you commit to a monthly. So disappointed!","updated":"2018-04-17T23:01:39-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1532493103","userName":"tchin78","userUrl":"https://itunes.apple.com/us/reviews/id286577070","version":"2.0.6","score":5,"title":"Kuna porch light security camera","text":"Convenient smart light features is a nice bonus to the security aspect.  The camera is really clear and I love being notified every time someone comes to the door.  I've been using the free basic service for 6 weeks now without any problems.","updated":"2017-01-28T13:02:57-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"2485171325","userName":"idlemeson","userUrl":"https://itunes.apple.com/us/reviews/id40478035","version":"2.3.4","score":1,"title":"Weak WiFi! Router >15' away requires WiFi extender","text":"Tried to setup a security light where I have a SkyBell that works without issue and it would not connect and kept giving me a \"bad password\" error. Turns out weak WiFi is a know issue. From their website: \"Normally, we like to see the router within 15 feet of the device with no more than one wall in between the two.\"\nIf you can't relocate your router to accommodate this one device then you \"need\" to \"add a Wi-Fi extender near the device and connect to that signal\"","updated":"2018-04-29T15:47:15-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1466362413","userName":"applenut","userUrl":"https://itunes.apple.com/us/reviews/id40354502","version":"1.4.3","score":5,"title":"Halloween update is great","text":"The Halloween sounds are awesome. I would love to see more custom sounds like this. \n\nThese lights and the software are incredible. They have worked flawlessly for me. \n\nThe only feature I really want is a geofence so that it knows to turn notifications off when I am home.","updated":"2016-10-13T22:24:43-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5117549021","userName":"Jaylon Gilbert","userUrl":"https://itunes.apple.com/us/reviews/id1029433635","version":"2.6.4","score":3,"title":"Alright","text":"I really don’t have much problems, but I do hate it when I try to load up the camera it does nothing but buffer. And I have very good internet so it shouldn’t be a problem. But I like the camera quality and everything else. But I hope Kuna can get something of update and be able to fix that.","updated":"2019-11-10T02:44:59-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1487526631","userName":"Anythingthatsnottaken123456789","userUrl":"https://itunes.apple.com/us/reviews/id36042904","version":"1.4.5","score":5,"title":"Very happy so far","text":"Just set up my Kuna. Pleasantly surprised with the app UX, functionality, and features so far.\n\nSetup did fail repeatedly on my Droid but succeeded the first time when trying on my iPhone.\n\nVideo quality is good, motion alerts are quick and light scheduling is a nice feature.","updated":"2016-11-19T16:07:14-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"2619411276","userName":"Jehud","userUrl":"https://itunes.apple.com/us/reviews/id43325100","version":"2.3.5","score":2,"title":"Wish it was compatible with things like IFTT","text":"First off I had quit a few connectivity and offline problems. Literally over 5 in like 7 months; although I usually get pretty good email help right away. Even though it appears to just be cooky cutter answers. Second, I wish this app was compatible to IFTTT (if this then that) that way it can be integrated with the rest of my home security system like all the other cameras (arlo,ring).","updated":"2018-05-30T19:42:14-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1840364912","userName":"Jazz1e","userUrl":"https://itunes.apple.com/us/reviews/id185893715","version":"2.2.1","score":1,"title":"Horrible App","text":"The new update is horrible! Whenever I get notified that there's someone at my front door, I click on the app. The camera will display, however, the circle in the middle of the view from the camera doesn't display who or what is at my front door. Prior to the app upgrade I didn't experience any issues. PLEASE FIX THIS APP, its a matter of home security! The latest updates to the app are worthless. Looks like it’s time to look for another product for my home security needs.","updated":"2017-10-10T17:02:37-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1528199282","userName":"FRStss","userUrl":"https://itunes.apple.com/us/reviews/id181419485","version":"2.0.5","score":1,"title":"Update caused video to stop working","text":"Since update video stopped showing on my iPhone but was still working on my iPad which is useless if I'm away from wifi. I reported the problem by email to the company yesterday and now today no video on my iPad either. Expensive motion detector is all I have left. Since update also the alerts were going off where there was no one there. Annoying especially at 2am. Eating for someone to respond to my email but not holding my breath.","updated":"2017-01-22T09:45:28-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3771936460","userName":"LauraChristineG","userUrl":"https://itunes.apple.com/us/reviews/id150531153","version":"2.4.5","score":2,"title":"Frustrating","text":"When in “live” view mode the picture is half green and the little rotating circle never goes away. Also does not keep event videos for very long. It’s 3 am and I can’t see any videos from last night. I just get a message “Nothing to report “.  Should be able to save certain critical videos to the phone memory for ever.  Looks like an effort to push their subscription services.","updated":"2019-02-15T01:59:15-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3325646390","userName":"Jennifer C Rodriguez","userUrl":"https://itunes.apple.com/us/reviews/id564408748","version":"2.4.1","score":2,"title":"I don’t know...","text":"The light and security camera itself is AMAZING!!! The only problem I’ve been having lately with the app or light idk which one but when ever someone comes in it doesn’t seem to catch them leaving? It’s driving me crazy cause we do have people renting the back house so we don’t know when their visitors leave or when my siblings leave the house. Please fix this?","updated":"2018-10-20T21:44:58-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5765955171","userName":"SJ_1@1","userUrl":"https://itunes.apple.com/us/reviews/id37759898","version":"2.7.2","score":1,"title":"Very Disappointed","text":"I have 3 Kuna security light cameras. For the first year, I loved it. But then things got worse. Delayed movement notification which defeats the security purpose! 2 weeks ago, Kuna app got upgraded and now every time I open the app, it said no device found, and took a while for the monitor screen to come up. Then the app crashed after that. Useless piece of junk now! What was once a great product now it just a stupid light!","updated":"2020-04-05T04:57:04-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1252324793","userName":"travisn","userUrl":"https://itunes.apple.com/us/reviews/id39207764","version":"1.1.12","score":3,"title":"Mostly functional but lacks smoothness","text":"Initial BLE setup of the light works well. However is confusing that if you want to change wifi settings to \"setup\" the same light again as if it were new.  Usability is fair but video is frequently lagging or distorted. Would be better if video went full screen when rotating iPhone otherwise it's very small.","updated":"2015-09-02T20:07:47-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"4570835548","userName":"cuzinhass","userUrl":"https://itunes.apple.com/us/reviews/id129930175","version":"2.6.3","score":1,"title":"Ring notifications better","text":"I thought having this camera permanently connected to a hard wire would mean the unit would t sleep and hence I could get notified quicker than ring. Boy am o wrong. Not only is ring faster a sending me a notification, it is also more reliable. Sometime no Kuna notification at all. And, with Ron you can customize the notification sound and even volume.\nThinking about retiring this and buying the ugly but functional ring spotlight.","updated":"2019-08-04T20:09:29-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1533059751","userName":"apo81","userUrl":"https://itunes.apple.com/us/reviews/id16719414","version":"2.0.6","score":5,"title":"So far so good!!!","text":"Easy to install the light. It looks great. Easy to connect to the app and it is responsive so far. Good settings as of now. As it gets used I may find more. Also 2 hours of free viewing should be more like 24 hours of free viewing!","updated":"2017-01-29T09:30:20-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5473069901","userName":"millennial moms","userUrl":"https://itunes.apple.com/us/reviews/id16031716","version":"2.6.6","score":3,"title":"Fix for sluggish App","text":"Delete app and reinstall. I suffered from the sluggish and read a review that suggested to delete and reinstall app. Takes 20 seconds and works perfectly again. Kuna, you should really be communicating with your users. This was an easy fix that one of your users figured out","updated":"2020-01-31T22:09:12-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1817844370","userName":"Kleetz","userUrl":"https://itunes.apple.com/us/reviews/id43667931","version":"2.2.0","score":3,"title":"Doesn’t work on iPhone 7plus with iOS 11","text":"As the title suggests, I updated to iOS 11 and poof, the app will not work. I logged in and all I get is “connecting” and it just hangs.\n\nI’ve tried deleting and reinstalling, but no luck. Kuna support hasn’t been helpful so far.\n\nWhen it did work, I enjoyed it. Hope a patch comes out soon, otherwise what the hell am I paying for?","updated":"2017-09-29T19:20:18-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"4840410016","userName":"TimTheBeliever","userUrl":"https://itunes.apple.com/us/reviews/id474870937","version":"2.6.3","score":3,"title":"Need more recording time","text":"It would be nice if the default account had more recording time, at least one full day. Two hours isn’t enough if something happens overnight. The recording would be gone by the time I wake up.\nI cannot afford another monthly charge so I cannot upgrade. Please increase the recording time.","updated":"2019-09-26T05:45:13-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1207315528","userName":"Miami1777","userUrl":"https://itunes.apple.com/us/reviews/id26033482","version":"1.1.7","score":4,"title":"Great update","text":"I love that we can adjust the sensitivity now. Also the light timer is perfect. I don't like that it alerts you that someone is at the door and then you can't see live because the camera is \"busy\". Of course it's busy because it's recording. This needs to be fixed. Besides that I LOVE my Kuna.","updated":"2015-06-04T17:44:30-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5691858893","userName":"1GDAD1","userUrl":"https://itunes.apple.com/us/reviews/id240894532","version":"2.7.2","score":1,"title":"Drop whenever you want","text":"Unfortunately, I have the issue of dropping for no reason, my bandwidth is high enough to support multiple devices where no other device is having this problem, distance is not a problem when they are on opposite side of concrete wall. So when I an update comes all it say is bug fixes, what do that mean really, is it addressing my problem?\n\nThanks \nWJ","updated":"2020-03-21T06:22:45-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"2673518127","userName":"bhouse221","userUrl":"https://itunes.apple.com/us/reviews/id706285395","version":"2.3.6","score":3,"title":"Firmware update","text":"We have tried to update this new firmware update atleast 20 times since installing yesterday and it continues to fail time and again..I have called Kuna support multiple times with no resolution or help at all..we are beginning to consider returning this product with customer service not be very helpful..","updated":"2018-06-10T16:00:41-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"4860046020","userName":"MoanaArt","userUrl":"https://itunes.apple.com/us/reviews/id18156095","version":"2.6.4","score":1,"title":"No Confidence","text":"When initially installing the Security Light Camera everything worked great and I paid the yearly fee.  I wouldn’t always get some videos that my Arlo cameras picked up.  I decided it wasn’t worth the renewal when the light started coming on when it wanted to.  I need the light perhaps more than the spotty surveillance.  If they can get this right in the future the could get back my stars.  I have to remove my costly light and investment and replace it.","updated":"2019-09-29T07:13:50-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1466722319","userName":"Skinsfanoh","userUrl":"https://itunes.apple.com/us/reviews/id192429058","version":"1.4.3","score":5,"title":"Great update.","text":"Like be the new feature where the pre recorded message can play when camera is triggered. It would be cool to be able to record your own and have them played the same way. Great job Kuna.","updated":"2016-10-14T11:25:23-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"2945209236","userName":"Fly IT Guy...","userUrl":"https://itunes.apple.com/us/reviews/id100701636","version":"2.3.8","score":4,"title":"Little buggy... but works great!","text":"I got two because due to simple serpent. I would give this a 5, but no HomeKit support. All specs meet expectations. Setup was a little buggy. How to power it off once or twice and had to reset one to get motion detection to work. Most time spent tweaking detection sensitivity.","updated":"2018-07-21T09:09:28-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1652969127","userName":"Stglennlenn","userUrl":"https://itunes.apple.com/us/reviews/id146838461","version":"2.1.6","score":1,"title":"Bad Purchase and expensive monthly fee","text":"Tried the free 30-day trial with unlimited recording and live streaming. After several months, the devise keeps going offline and the video is really poor. The recordings it captures doesn't even let us play on our cellphones. I tried downloading the recordings on my phone and it sometimes doesn't work. What a waste of money and now down the drain :( really frustrated with this crappy devise!","updated":"2017-06-21T21:40:56-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6429434811","userName":"Livethelife117","userUrl":"https://itunes.apple.com/us/reviews/id158116518","version":"2.7.2","score":1,"title":"App is garbage","text":"After updating months, maybe even over a year ago I have a time delay when ever I try to look at the cameras. ( the most crucial time you need to see if someone comes to the door)And this is with a paid subscription, they haven’t come out with an update for a very long time. Cameras are good but I wouldn’t waste money buying them if the app lags behind and","updated":"2020-09-14T13:57:33-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5139329295","userName":"Wowotoe","userUrl":"https://itunes.apple.com/us/reviews/id38369219","version":"2.6.6","score":5,"title":"Need Apple Watch app","text":"Good product and the app! I installed on my international Airbnb properties and work great. Now we just need an Apple Watch app to get notification and preview when the phone is not around.","updated":"2019-11-14T17:44:23-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5602523222","userName":"kuna needs to improve","userUrl":"https://itunes.apple.com/us/reviews/id116980308","version":"2.6.6","score":2,"title":"Worked and now doesn’t","text":"As others have stated this worked for a while but all of a sudden issues and unable to get recordings or live feeds. It’s been 3\nMonths since the latest version update and I expect they should have fixed this by now. Get the problem fixed ASAP.","updated":"2020-03-01T09:17:40-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1972939763","userName":"doubblebb","userUrl":"https://itunes.apple.com/us/reviews/id537292466","version":"2.2.3","score":1,"title":"I want to like it...","text":"It’s so close to being a great app and system. When it works it’s great. Unfortunately, it doesn’t work 80% of the time. It just says “connecting...” without ever connecting. If there were never any connection issues I would give it five stars, but it currently rates at one star. I spent a lot of money on three camera fixtures and three companion fixtures so I hope they resolve the issues before I have to change systems.","updated":"2017-12-05T10:05:46-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5660906730","userName":"Lewis_Sr","userUrl":"https://itunes.apple.com/us/reviews/id365554075","version":"2.6.6","score":2,"title":"Stopped working","text":"I initially had one camera that worked fine. I recently added another one so I had to delete the app and reconnect. After I did that neither camera can pick up my WiFi signal. I even brought it in the same room with the router and it still wouldn’t connect.","updated":"2020-03-14T12:03:31-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5519045800","userName":"Lessie is Online","userUrl":"https://itunes.apple.com/us/reviews/id25627251","version":"2.6.6","score":5,"title":"Slow response? Reinstall the app","text":"Thanks to the reviewer who recommended reinstalling the app. I’m back to enjoying the great features at a quick response rate.","updated":"2020-02-11T17:30:32-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"4478260503","userName":"Chipard","userUrl":"https://itunes.apple.com/us/reviews/id232203212","version":"2.6.1","score":3,"title":"Maybe a little more work in the software needed","text":"I love the concept but I have not found the unit completely flawless. I have had people that should have been picked up and wasn’t. Once in a while no notifications. \nBut to me still better than having nothing.","updated":"2019-07-17T23:04:35-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1457660818","userName":"Yona177","userUrl":"https://itunes.apple.com/us/reviews/id26806324","version":"1.4.2","score":3,"title":"Interface Layout","text":"The light button is on the bottom left when no specific camera is selected. However the sound alarm button is there when you select a specific camera. It should be consistent so the alarm isn't sounded accidentally.","updated":"2016-09-28T23:32:50-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6595326838","userName":"dc josh","userUrl":"https://itunes.apple.com/us/reviews/id105764728","version":"2.7.2","score":1,"title":"It was a good idea, but lack of support has killed it","text":"The whole Kuna thing was a great idea (I even backed their Kickstarter!) but it just has not proved out.  App features are increasingly nonfunctional and since iOS 14 I can’t even get live video through the app.  They’ve also never delivered on promises like an open API for smarthome functionality.  Buy something else, this is a dead product.","updated":"2020-10-31T16:10:46-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3671257597","userName":"Kberke01","userUrl":"https://itunes.apple.com/us/reviews/id258072718","version":"2.4.4","score":2,"title":"Live feed is so frustrating!","text":"In theory, it’s great! When it works....\nI’ll get a notification right away when there’s movement in my yard, but good luck getting a good live feed. App crashes way too often, live feed gives me the circle of death... waiting.... waiting.... waiting. It’s a good thing this app isn’t meant to scare off unwanted individuals. Enter sarcasm here... \nNot really impressed.","updated":"2019-01-19T16:33:44-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5456571926","userName":"Paul 1290","userUrl":"https://itunes.apple.com/us/reviews/id397363023","version":"2.6.6","score":2,"title":"App Extremely Slow","text":"The camera work great. I have 3 cameras and a flood light. Love the cameras but the app is getting to be painful. Very slow. Takes multiple tries for it to load and then when it does it freezes up. I would not purchase these again.","updated":"2020-01-27T16:29:28-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3569025094","userName":"Frostrated","userUrl":"https://itunes.apple.com/us/reviews/id25032780","version":"2.4.4","score":4,"title":"Excellent","text":"Does a great job of securing our home. The app is very good. Only thing that doesn’t work is the badge icon. I would rather see the number next to the icon rather than have to use the lock screen notification.","updated":"2018-12-24T16:06:23-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5802010360","userName":"NoT2ImpressedwThis","userUrl":"https://itunes.apple.com/us/reviews/id662133634","version":"2.7.2","score":1,"title":"Worst upgrade","text":"After most recent upgrade, my motion detection and recording no longer work. Yes, I have an active subscription. I no longer have notifications of motion and it doesn’t even record when there is motion. I’ve tried change settings, removed app and reinstalled and nothing works. I’m now looking upgrade to a different company.","updated":"2020-04-12T11:42:32-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1404149883","userName":"Bobalatate","userUrl":"https://itunes.apple.com/us/reviews/id20225312","version":"1.3.6","score":1,"title":"Too many notifications","text":"Like others have reported, the cameras keep going offline and online. Every time this happens, I get a notification. With 3 cameras, I'm getting constant 'offline/online' notifications. Super annoying. \n\nUntil Kuna can fix their cameras to not drop off the network, they need to add an option to disable offline/online notifications while keeping motion notifications.","updated":"2016-07-02T07:18:40-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1509621689","userName":"ISZYMEK","userUrl":"https://itunes.apple.com/us/reviews/id189099581","version":"1.4.6","score":1,"title":"Very disappointed","text":"I send an email with the description of the problem I am having with the app on December 13 and I have not heard anything back from the tech support. I wanted to call the support line but I just learned that there is no phone number to call. Great idea for a security system but the execution is very poor. The live picture on the app is half gray or green. I am going to return the product asap...😕😕😕","updated":"2016-12-26T13:10:59-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1201683365","userName":"Marxanth","userUrl":"https://itunes.apple.com/us/reviews/id34824455","version":"1.1.6","score":3,"title":"Needs work","text":"New device.. New app so I won't be too harsh. It works although it timed out for no reason a few times. The object detection needs work, I constantly got alerts from a moving tree branch so I just turned the alerts off. That kinda defeats the purpose. Why isn't there a dusk to dawn timer for the light?","updated":"2015-05-23T16:11:14-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5985644504","userName":"123Abc!23","userUrl":"https://itunes.apple.com/us/reviews/id895909535","version":"2.7.2","score":1,"title":"If I could return it I would","text":"When you have headphones plugged in, the sound still plays out loud from the speaker and not the headphones even though it’s connected. Like other people have been saying idk what update this app did but it created more problems than fixing it. I’d go with best if I were you way better than this crap","updated":"2020-05-23T17:30:56-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"4918849639","userName":"MiklaDfar","userUrl":"https://itunes.apple.com/us/reviews/id130831087","version":"2.6.4","score":1,"title":"Save your money... constantly dropping feed","text":"I have three of these lights/cameras. Will not buy again and cannot recommend until Kuna fixes the dropped video feeds that many complain about. Kuna will blame your local network, yet NONE of my other wireless camera feeds drop out. \n\nHard to claim it is a security camera if you cannot count on it to give you consistent information.","updated":"2019-10-10T08:24:07-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5523108470","userName":"Alexkim1","userUrl":"https://itunes.apple.com/us/reviews/id136616260","version":"2.6.6","score":1,"title":"Extremely slow. Many people saying so. Why??","text":"Every time it gets slow I should delete the app and reinstall. A few weeks later it lags again and I should delete and reinstall again. Even if you delete all the video data on the app nothing reduced in the iphone memory usage. Good hardware poor software.","updated":"2020-02-12T15:03:25-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5824414010","userName":"Skizzotrobz","userUrl":"https://itunes.apple.com/us/reviews/id38206665","version":"2.7.2","score":1,"title":"Crashes constantly","text":"I’ve had Kuna products for a long time now and really like them. But for the last few months the app has been terrible. It crashes over and over to the point I can’t even view the videos that are recorded. What’s the point of having these cameras if I can’t even view the videos?","updated":"2020-04-17T04:45:02-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"2711316431","userName":"Mobiusav","userUrl":"https://itunes.apple.com/us/reviews/id218479918","version":"2.3.6","score":1,"title":"Incredibly Glitchy","text":"My camera barely even works. It’s successfully connected to WiFi but it rarely records video. I am able to view video sometimes but other times it just freezes up or doesn’t even let me view my camera feed.\n\nI don’t understand how something so expensive could be so bad. Next time, I will do research before buying a security camera.","updated":"2018-06-17T03:56:10-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"2658252071","userName":"Farleyprof","userUrl":"https://itunes.apple.com/us/reviews/id38193171","version":"2.3.6","score":1,"title":"Do not switch network!!!!!!","text":"Upgraded routers and Kuna Light is the only device that refuses to connect. Support is outsourced to India and folks are nice but only Level 1 and Level 2 support is only via email. They keep telling me light is out of warranty when this is not a warranty issue. It appears that mesh networks cause issues. I am very competent technically but have given up. Ring support is a 100 times better.","updated":"2018-06-07T18:10:40-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6217928747","userName":"lupemctavish","userUrl":"https://itunes.apple.com/us/reviews/id29797513","version":"2.7.2","score":1,"title":"Like others, awesome until it was horrible","text":"The camera and app worked great. Then we upgraded our WiFi and the light wouldn’t connect. We spent hours and hours trying everything. The response from customer service? Sorry! You are welcome to buy a new one. ** No thanks. ** Fool me Ince. Fantastic idea. Great promise. Nice look. Bad execution. Bad customer service. Buyer beware.","updated":"2020-07-19T15:24:21-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"2684436069","userName":"Matsegubbbbbben","userUrl":"https://itunes.apple.com/us/reviews/id225454294","version":"2.3.6","score":2,"title":"Constant problems - not reliable!","text":"When it works it is great. BUT that is approximately 70-75% of the time.\n\nI was given a replacement for one camera which evidently had a Bluetooth connection problem.  My 2nd camera has the same problem and Kuna is not replacing that one since it is 17 months old!! Buyer beware.","updated":"2018-06-12T17:44:17-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3339308988","userName":"dkhenssi","userUrl":"https://itunes.apple.com/us/reviews/id752399352","version":"2.4.2","score":5,"title":"Awesome","text":"This app is very great at tracking when people are at my door. I love the automated messages! They are so cute. Set up was so easy. And overall, security is in check","updated":"2018-10-24T12:27:20-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1518891187","userName":"Vakir","userUrl":"https://itunes.apple.com/us/reviews/id108626824","version":"2.0.4","score":5,"title":"Much improved!","text":"Thanks for improving the app - I can now finally view clips through force touching the notifications.","updated":"2017-01-09T19:23:25-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3415877526","userName":"miswit","userUrl":"https://itunes.apple.com/us/reviews/id10560707","version":"2.4.4","score":1,"title":"Doesn’t retain light settings","text":"The app no longer saves light settings. It turns off after midnight no matter what I set it to. If I change the settings to on by default, all the settings reset to the default when I save. Terrible. I might as well ditch this piece of crap and by a non-camera lamp that actually turns on a dusk. Also, I want my subscription fee back.","updated":"2018-11-13T22:13:18-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3101523918","userName":"Jurassicmark32","userUrl":"https://itunes.apple.com/us/reviews/id42654847","version":"2.4.0","score":1,"title":"Terrible Service","text":"Just about the worst camera service I’ve had. The app notifies you way after the event or misses it all together!!! There is no badges so either in notification or not. The “AI” in the service is about the worst. I would have given it a zero if the Maximus didn’t look so good. Very disappointing. Will be trashing this thing after the 6 months free service.","updated":"2018-08-22T19:57:45-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"4422426266","userName":"Brian5932x","userUrl":"https://itunes.apple.com/us/reviews/id325655481","version":"2.6.0","score":3,"title":"Is anybody listening ?","text":"Like many people are saying,\nNo notifications & recordings cannot be deleted. \nIt was working fine before this latest update\nDid anyone test it before this update was launched ?","updated":"2019-07-06T19:21:31-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"4564261622","userName":"cdf62372","userUrl":"https://itunes.apple.com/us/reviews/id101842371","version":"2.6.3","score":1,"title":"Useless","text":"Horrible app, useless motion sensors. Even at 100% sensitivity doesn’t “see” my husband walk under the camera and leave in the truck parked in front of the camera every morning.  At least I was able to cancel the useless subscription and get my money back. It’s works well as a light...about the only good thing I can say about it.","updated":"2019-08-03T15:52:53-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"4440840982","userName":"It use to be great","userUrl":"https://itunes.apple.com/us/reviews/id187453592","version":"2.6.0","score":4,"title":"Last update cancels deletion","text":"Images have to be deleted one at a time since the last update… Hope this bug gets fixed 😉","updated":"2019-07-10T19:10:47-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5365623385","userName":"ryfull32","userUrl":"https://itunes.apple.com/us/reviews/id440936727","version":"2.6.6","score":3,"title":"Pretty good","text":"Works well just really slow sometimes to connect i also would love it if it worked on the Apple Watch","updated":"2020-01-05T13:05:59-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1692895298","userName":"NoAds","userUrl":"https://itunes.apple.com/us/reviews/id24402843","version":"2.1.7","score":5,"title":"Perfect so far...","text":"No software and hardware issues so far. The upgrade service is worth it.  Great experience all around.  Even works well on my iPad.","updated":"2017-07-21T21:42:04-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1414974829","userName":"Expensiveguy","userUrl":"https://itunes.apple.com/us/reviews/id40321360","version":"1.3.7","score":5,"title":"Follow up review.","text":"Ok they sent me tech support and it was my bad.  I love it. Wish night vision was better but I will buy 2 more.  Wish I could delete my older post.","updated":"2016-07-18T17:56:59-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6497861541","userName":"monschnu","userUrl":"https://itunes.apple.com/us/reviews/id30448340","version":"2.7.2","score":1,"title":"Trash","text":"Had this since Jan 2017 and suddenly I can no longer log into the app at all. Says it does not recognize my email. Tried creating a new account says invalid email when trying to create a new account with a new email. My ring is much better than this junk.","updated":"2020-10-03T18:42:38-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"2830860720","userName":"Barrymadickner","userUrl":"https://itunes.apple.com/us/reviews/id474878486","version":"2.3.6","score":1,"title":"Unreliable. Poor delivery.","text":"This product is unreliable at best. The camera product does not record reliably regardless of detection settings. Picture quality itself is okay for this price point. I have a reliable, modern WiFi Access Point and this device shows a good to excellent connection but it fails to capture 80% of all detected events","updated":"2018-07-03T17:25:06-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1378686906","userName":"idesigncs","userUrl":"https://itunes.apple.com/us/reviews/id37599052","version":"1.3.2","score":1,"title":"Keeps Logging Out and Audio/Video Skips","text":"The latest release of the iOS app logs out the user intermittently. I am also experiencing issues with lagged audio/video. I have a top-tier speed package in my home and all of my devices on the network respond perfectly. However, the cameras constantly skip/stutter (especially when they start to record an event).","updated":"2016-05-14T14:56:43-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5548900429","userName":"Nina41200000","userUrl":"https://itunes.apple.com/us/reviews/id145930294","version":"2.6.6","score":1,"title":"Please help!","text":"I have the Kuna doorbell. It has been blinking red for the past week. I have restarted the set up process, but WiFi will not come up. It says it’s searching, but nothing will show up. The WiFi is in close range, and it worked fine for a few months. I can’t get it to work.","updated":"2020-02-18T09:46:29-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5451465949","userName":"t158","userUrl":"https://itunes.apple.com/us/reviews/id155763819","version":"2.6.6","score":5,"title":"Just purchase for my vacation home jan 2020","text":"It was very affordable and works so far like a charm.  My Internet speed 150 meg.","updated":"2020-01-26T07:54:35-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5429985173","userName":"concernedhomeowner11","userUrl":"https://itunes.apple.com/us/reviews/id30293359","version":"2.6.6","score":1,"title":"Needs work","text":"We loved our Kuna products for years! Recently it takes lengthy times to see photos or live stream, receive any notifications or look at them! Considering other security products as these are not as good as they once were.","updated":"2020-01-20T23:04:34-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1531339275","userName":"brucevan","userUrl":"https://itunes.apple.com/us/reviews/id23321147","version":"2.0.6","score":1,"title":"Kuna get your server fixed","text":"Kuna, your system went down today at 7:20 pmPST. Not good. Camera completely disabled and caused me to turn around and go back home to make sure my home was safe. You can at least email your customers to let them know when the system is down. Really regretting my annual subscription.","updated":"2017-01-26T19:58:40-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5488275655","userName":"monikabritt","userUrl":"https://itunes.apple.com/us/reviews/id26164519","version":"2.6.6","score":1,"title":"What in the heck happened??!?","text":"I don’t know what has happened over the last update, but the app is not working as well as it used to.  Takes a long time for the cameras to even come up.  Totally useless right now\nPlease fix!!\n\n2 months ago it was working great","updated":"2020-02-04T12:50:18-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3247707388","userName":"Or0213","userUrl":"https://itunes.apple.com/us/reviews/id34712495","version":"2.4.0","score":1,"title":"Kuna not working properly!","text":"My Kuna is not working. I can only hear in the live feed. Image is frozen! Just had a suspicious person in my yard I couldn’t see anything! Had to download the video to see this person! This was a waste of time! I’m paying for this service and this could of been a bad situation! FIX ASAP!","updated":"2018-09-30T06:02:31-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1522079308","userName":"jamesvanbibber","userUrl":"https://itunes.apple.com/us/reviews/id167420227","version":"2.0.5","score":1,"title":"HATE the new app upgrade","text":"Completely non-user friendly and three times slower than the previous verson(even after power cycling the light/camera and deleting and redownloading the app.....please give us back the former version or let users decide which one they want by taking a vote and posting the results","updated":"2017-01-14T08:39:15-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3157735350","userName":"Osobad_1","userUrl":"https://itunes.apple.com/us/reviews/id196806865","version":"2.4.0","score":1,"title":"Not worth the money","text":"I have excellent WiFi connections and still takes on average 10 seconds for it to notify you...it was better two weeks ago, but now your lucky if it notifies you at all...\nGo somewhere else, for the price of these you should expect better, don’t settle for these","updated":"2018-09-05T17:51:50-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1652675251","userName":"Islulu","userUrl":"https://itunes.apple.com/us/reviews/id151099559","version":"2.1.6","score":1,"title":"Broken Again","text":"Save your money and don't buy this device. The service is off line again and your only support is email and it takes two days to respond. It makes me think that this is being ran out of someone's basement. Very unprofessional. Call or emailing support is lost in a black hole.","updated":"2017-06-21T15:30:31-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1378195037","userName":"lungulescua","userUrl":"https://itunes.apple.com/us/reviews/id41988964","version":"1.3.2","score":3,"title":"Keeps logging out","text":"The app was good until the last update. The connection speed was improved but the app keeps asking for the login passcode several times a day.\nPlease fix!!!","updated":"2016-05-13T18:17:43-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1555943964","userName":"weatherbygoode","userUrl":"https://itunes.apple.com/us/reviews/id36372164","version":"2.0.7","score":4,"title":"Good App but Major Battery Drainer","text":"The app works really well and is fairly user friendly. The background app refresh however destroys my cell battery and I am torn on how to proceed.","updated":"2017-03-02T08:40:46-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1456982769","userName":"Baileybbcdgnbki","userUrl":"https://itunes.apple.com/us/reviews/id332061977","version":"1.4.2","score":4,"title":"Alert changed","text":"With the new update the alert is just a generic text tone. This is not acceptable. Please change it back to the way it was.","updated":"2016-09-27T18:16:39-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1435251241","userName":"BearNPuma","userUrl":"https://itunes.apple.com/us/reviews/id10490669","version":"1.4.0","score":4,"title":"Love most of it","text":"I love the features and ease of use, just wish they would install a back button in landscape mode.","updated":"2016-08-18T16:42:26-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"4662114488","userName":"Cazador1","userUrl":"https://itunes.apple.com/us/reviews/id138232344","version":"2.6.3","score":5,"title":"Issue resolved","text":"Jarret was really helpful he was able to fix my issue very communicative 👍 five stars 🌟","updated":"2019-08-23T15:27:58-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1392176108","userName":"Kunauser","userUrl":"https://itunes.apple.com/us/reviews/id508640297","version":"1.3.6","score":5,"title":"Great","text":"Still needs a manual record button added","updated":"2016-06-10T09:03:52-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1533683015","userName":"Ldicaprio10","userUrl":"https://itunes.apple.com/us/reviews/id137795816","version":"2.0.6","score":2,"title":"Unusable video","text":"I find this hardly usable.\nIf I get a notification it usually happened minutes ago. Watching my yard live is a joke. Recorded videos of the delivery man is not reliable. Video is recorded too late, its too choppy.\n\nAfter so many attempts this is no longer a product I'm excited to share or recommend to my friends.\n\nAfter a year of having this I've nearly given up hoping that the kuna team can get this tweaked and working smoother.","updated":"2017-01-30T08:54:57-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3143225637","userName":"pmr2030","userUrl":"https://itunes.apple.com/us/reviews/id497651052","version":"2.4.0","score":1,"title":"Stay away!!!!","text":"Stay away get a Ring or something else. Being a local company made me buy this “regret” I bought one from a non dealers which I didn’t know now I can’t even get it fixed 2 month old and it stopped working..camera and audio is not that great also..","updated":"2018-09-01T20:13:00-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3060017338","userName":"Munstah09","userUrl":"https://itunes.apple.com/us/reviews/id105537970","version":"2.4.0","score":1,"title":"Integration with Alexa is for LIGHT only!!!","text":"Wasted money, looks nice and works but without full integration I have to use different phone based apps when I want control over all systems with voice.  App needs further development to integrate with Alexa as does Wyze and Ring in being able to view via spot or Fire TV.","updated":"2018-08-13T13:01:50-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6589723301","userName":"Itsjusmebrandy","userUrl":"https://itunes.apple.com/us/reviews/id401983114","version":"2.7.2","score":3,"title":"iPhone 12","text":"Ok please fix bug to play video on iPhone 12... ever since hubby and I upgraded we can hear it but video doesn’t play","updated":"2020-10-30T04:38:20-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1521350531","userName":"iCajunT","userUrl":"https://itunes.apple.com/us/reviews/id162615584","version":"2.0.5","score":2,"title":"Don't like the update","text":"You can get to the recordings but the buttons on the main screen: sound alarm, hold to talk, & play message are gone. Those are useful buttons that should remain when you login.","updated":"2017-01-13T08:17:02-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3535525694","userName":"Mac Rob","userUrl":"https://itunes.apple.com/us/reviews/id104046205","version":"2.4.4","score":2,"title":"Sloooooow","text":"You guys really need to fix your app. The hardware is fine but opening a live feed of the cam takes way too long. By the time I get an alert and try and open it, the person is long gone.","updated":"2018-12-15T18:04:00-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6281745047","userName":"johnny the only one","userUrl":"https://itunes.apple.com/us/reviews/id902734172","version":"2.7.2","score":1,"title":"Stop working","text":"At first it worked fine but after it stop working.\nI was getting false alarms, I would walk in front of the cámara and it would not work.\nNow I can’t use my phone to see outside.\nDeleting the app from my phone.","updated":"2020-08-04T23:32:03-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5988958602","userName":"Truly objective","userUrl":"https://itunes.apple.com/us/reviews/id18656244","version":"2.7.2","score":1,"title":"The app is more unreliable than the fixture","text":"This light didn’t last 4 years. They wouldn’t give me discount buying a new one. Instead they offered to sell me a refurbished one at $150 when you can buy a new one for $160. Go figure.","updated":"2020-05-24T12:00:45-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"4705938003","userName":"Doris Mullins","userUrl":"https://itunes.apple.com/us/reviews/id679913592","version":"2.6.3","score":1,"title":"Junk","text":"This camera is junk. I have 2 and I paid for services to be able to see people coming and going. I could not see for the first could months. I complained to the company, they put me back on line. Them it happened again.","updated":"2019-08-31T18:09:50-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3236473619","userName":"Tiffany.l.g","userUrl":"https://itunes.apple.com/us/reviews/id37107240","version":"2.4.0","score":2,"title":"Was great. Now.....","text":"Now that iOS 12 is released, an update is needed. The sound plays on my love video and on the recorded video, but the picture doesn’t move. Very aggravating and defeats the purpose of having security cameras outside of my home.","updated":"2018-09-27T08:46:36-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"2264511744","userName":"Ojihs","userUrl":"https://itunes.apple.com/us/reviews/id146381134","version":"2.3.1","score":2,"title":"Glitches, offline and doesn’t track all movement","text":"Kuna often gets off line and does not track all motions on its recordings. It needs a software update immediately for its poor service","updated":"2018-03-02T17:08:05-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1674785350","userName":"Malvadia","userUrl":"https://itunes.apple.com/us/reviews/id143737990","version":"2.1.5","score":1,"title":"Has Not Improved","text":"I have had this light over a year and instead of improving detection has gotten worse over time. The new AI Smart Detection is not detecting at all and I really wish I could downgrade the app to before they rolled out this disaster. CS used to be very good but that has also gone down hill.","updated":"2017-07-08T20:17:44-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5617253014","userName":"blink1181","userUrl":"https://itunes.apple.com/us/reviews/id42005248","version":"2.6.6","score":3,"title":"Kuna app loading problems","text":"App used to be great now it takes for ever to load!!! Is frustrating.","updated":"2020-03-04T17:35:35-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3259948193","userName":"Cobra1427","userUrl":"https://itunes.apple.com/us/reviews/id158078186","version":"2.4.1","score":2,"title":"Glitchy","text":"Daily it goes offline then online and repeat all day all night I will have 3 dozen messages on my phone. For sure easy to set up and quality is good you can even zoom in.","updated":"2018-10-03T11:15:43-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"2095762089","userName":"Y3ll0W A514N","userUrl":"https://itunes.apple.com/us/reviews/id228744224","version":"2.3.0","score":1,"title":"Live video rarely works.","text":"The live video feed rarely works. When you click it, it only shows loading circle and never plays the live video.\n\nInternet speed was not an issue since I was on high speed wifi @ 100mbps, or full bars of LTE.","updated":"2018-01-16T12:40:39-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1563765702","userName":"Vinny Apolinario","userUrl":"https://itunes.apple.com/us/reviews/id49189556","version":"2.0.8","score":1,"title":"Doesn't work most of the time","text":"Don't buy this! It works nice 5% of the day and them goes off line! My internet is really good and near the device so te problem is kuna! The app there's not many option! Get a Ring Doorbell and it work way better for you! I just trash $180! Not worth it!","updated":"2017-03-13T11:04:15-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1256658491","userName":"Johnarogers","userUrl":"https://itunes.apple.com/us/reviews/id22798640","version":"1.1.13","score":5,"title":".","text":"Great product and wonderful customer service.","updated":"2015-09-12T14:19:16-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5950342375","userName":"babyvics","userUrl":"https://itunes.apple.com/us/reviews/id166521096","version":"2.7.2","score":1,"title":"Waste of money.","text":"Settings don’t work. Random camera goes offline when WiFi is working fine. Videos often fail to load. Don’t recommend. Ring is probably better.","updated":"2020-05-15T15:05:26-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1522349622","userName":"Dmguth3","userUrl":"https://itunes.apple.com/us/reviews/id326987569","version":"2.0.5","score":2,"title":"Latest update has poor video quality","text":"Seems the images or recordings have much less video clarity.   Does not feel like an improvement.","updated":"2017-01-14T19:00:54-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1848631664","userName":"Machtkampf_","userUrl":"https://itunes.apple.com/us/reviews/id26097703","version":"2.2.1","score":3,"title":"Good product, average app","text":"I’ve have been using Kuna Light for over A year. Works great especially if paired with Google Wi-Fi.\n\nIt is amazing that still to this date the app does not support Bluetooth headphones.","updated":"2017-10-14T09:04:31-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1533160992","userName":"Dfun916","userUrl":"https://itunes.apple.com/us/reviews/id146905722","version":"2.0.6","score":4,"title":"Slight lag, but not bad.","text":"Make sure you have a strong connection, I thought it was not working but I just needed to reset router..","updated":"2017-01-29T13:42:42-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3245263163","userName":"wastafalia","userUrl":"https://itunes.apple.com/us/reviews/id629307377","version":"2.4.0","score":5,"title":"Good products","text":"Nice app, nice camera, interface, good graphics, easy to configuration with my wife","updated":"2018-09-29T15:06:45-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1669106820","userName":"Jusanadamexican","userUrl":"https://itunes.apple.com/us/reviews/id241555829","version":"2.1.6","score":1,"title":"Meh","text":"It's okay and works fine for a door system when I initially got it during the indiegogo/ gofundme phase. But since then there hasn't been any improvements and detection has gotten worst overtime....for the money, it's kind of way overpriced. You're probably better off getting a trail cam.","updated":"2017-07-04T19:10:08-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3251959883","userName":"KatinQ8","userUrl":"https://itunes.apple.com/us/reviews/id25011375","version":"2.4.0","score":3,"title":"Buffering","text":"I just started using the new iPhone Xs. The cameras are constantly buffering. While I can hear sound, the video feed is frozen. Please update","updated":"2018-10-01T07:34:51-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1520747983","userName":"AndDown","userUrl":"https://itunes.apple.com/us/reviews/id43762498","version":"2.0.5","score":1,"title":"Don't like the new update","text":"The recording feature has a bug - it's not recording. Also, with the previous version, I could modify the alerts for all the cameras from one site. Now I have to open each camera to do any changes.","updated":"2017-01-12T12:37:41-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1470260765","userName":"Ca-los","userUrl":"https://itunes.apple.com/us/reviews/id86541326","version":"1.4.3","score":5,"title":"Best update ever","text":"Keep it coming, love the Halloween effects.  Having a blast with them.  Regardless, big fan of Kuna.","updated":"2016-10-20T20:41:29-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"4425599416","userName":"scanmt","userUrl":"https://itunes.apple.com/us/reviews/id1044532854","version":"2.6.0","score":3,"title":"Not deleting all","text":"My app is also failing to delete ALL recordings also. Have to delete individually which is very time consuming.","updated":"2019-07-07T08:48:55-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1848812855","userName":"pOtTs000","userUrl":"https://itunes.apple.com/us/reviews/id42447611","version":"2.2.1","score":1,"title":"Too many false alarms","text":"Goes off a lot for false alarms. Seems AI Smart Detection would solve this but only available in highest plan. Was going to by another Kuna but opted for another brand camera all together. I’ll hold on to this one for now but will likely phase this one out soon also.","updated":"2017-10-14T10:47:43-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"4820512107","userName":"Memphis8330","userUrl":"https://itunes.apple.com/us/reviews/id116559815","version":"2.6.3","score":2,"title":"Failed on IOS 13!","text":"Updated to the new Apple software and now my live feed doesn’t even work. Kuna you need to be ahead in this. You are falling behind","updated":"2019-09-21T16:23:21-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1377406844","userName":"NickFro","userUrl":"https://itunes.apple.com/us/reviews/id39161509","version":"1.3.1","score":1,"title":"Bugged","text":"The app was working fine until the most recent revision, which logs me out every time I leave the app. This makes it impossible to instantly check on a notification. Having to login to see who's at the door doesn't make any sense.","updated":"2016-05-12T04:17:35-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1925500019","userName":"Habbie43","userUrl":"https://itunes.apple.com/us/reviews/id220721706","version":"2.2.3","score":5,"title":"Easy","text":"Easy to use and setup.  Recommend!","updated":"2017-11-16T08:42:42-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1683788374","userName":"ConboyCraig","userUrl":"https://itunes.apple.com/us/reviews/id258256895","version":"2.1.7","score":4,"title":"Need to fix deletion of recordings","text":"Great app, except the delete all recordings function doesn't... Well... Function.","updated":"2017-07-15T14:19:45-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1530262797","userName":"chewbaka1973","userUrl":"https://itunes.apple.com/us/reviews/id42520108","version":"2.0.6","score":1,"title":"Live view no longer works","text":"After the last update live view no longer works. Recording fine. Notifying fine. Playback fine. Live view nothing. Just a frozen picture. Please fix immediately!!!!!","updated":"2017-01-25T06:36:32-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6406226026","userName":"Mendoza_Itunes","userUrl":"https://itunes.apple.com/us/reviews/id41400931","version":"2.7.2","score":1,"title":"Cannot see recordings","text":"Ever since I upgraded to paid service, I have been unable to view recordings. Always getting message “Recording is processing...”. Super annoying!  Please fix!!","updated":"2020-09-07T17:52:15-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3477538208","userName":"Aalexqqq","userUrl":"https://itunes.apple.com/us/reviews/id134331187","version":"2.4.4","score":1,"title":"Crashes a lot","text":"App keeps crashing when I switch to full screen mode and at times when I want to watch live video it goes into settings instead !  I have latest firmware on light and iPhone","updated":"2018-11-30T06:26:08-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6085507697","userName":"Topdogflorida","userUrl":"https://itunes.apple.com/us/reviews/id26547726","version":"2.7.2","score":1,"title":"Stopped working with Alexa","text":"Alexa doesn’t control the lights anymore. It stopped working several weeks ago. They still haven’t figured out how to fix it. Seriously???","updated":"2020-06-16T20:16:13-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"2974379151","userName":"ReadThisASAP!","userUrl":"https://itunes.apple.com/us/reviews/id303212164","version":"2.3.8","score":2,"title":"What’s going on?","text":"When I save my videos to my iphone camera roll I can’t send them in text messages. What’s the point of saving videos if you can’t send them? FIX THIS ASAP PLEASE!!!","updated":"2018-07-26T16:31:23-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"4550040008","userName":"NotMicrosoft","userUrl":"https://itunes.apple.com/us/reviews/id111663236","version":"2.6.3","score":1,"title":"Video dropped before I could review.","text":"Got alarms while driving by the time I could safely review them Kuna had deleted them. Their suggestion, pay the subscription cost. Looking into replacement system. A big DON’T buy.","updated":"2019-08-01T03:39:05-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3256149096","userName":"r8938sl","userUrl":"https://itunes.apple.com/us/reviews/id37179211","version":"2.4.0","score":1,"title":"Doesn’t not play video on iOS12 and iPhoneX","text":"Video does not play on live and recorded footage.  For recorded footage, you have no option but to download the. On your device for viewing. Only sound is heard and no live video footage playing on my device.","updated":"2018-10-02T10:20:25-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3123228078","userName":"Xthomgunx","userUrl":"https://itunes.apple.com/us/reviews/id166718564","version":"2.4.0","score":1,"title":"Doesn’t work.","text":"Trying to sell subscriptions but doesn’t work when installed anyway. And I don’t want a subscription. Depends too much on a mobile device. Doesn’t work first as a basic light.","updated":"2018-08-27T22:00:11-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"2672783423","userName":"dkaaz76","userUrl":"https://itunes.apple.com/us/reviews/id606788489","version":"2.3.6","score":3,"title":"Fairly easy to use","text":"Camera could be better","updated":"2018-06-10T11:56:34-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1746273429","userName":"BeebopOh","userUrl":"https://itunes.apple.com/us/reviews/id6148558","version":"2.1.9","score":1,"title":"Not as expected","text":"The app is so botchy and has constant connectivity issues. When it records something you are unable to view the live feed. I have yet to see any updates that improved the app.","updated":"2017-08-24T14:15:09-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1526908880","userName":"Djrtvvixdr","userUrl":"https://itunes.apple.com/us/reviews/id157973606","version":"2.0.5","score":1,"title":"Bad Upgrade!!","text":"Video takes hours before it shows up on iphone, and  my latest video says \"Recording is processing. Please try again.\" Since 7:13 PM, it's now 11:07 PM!! No issues prior to this last 'improvement/upgrade'. Worthless NOW!!!","updated":"2017-01-20T20:09:54-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5099123765","userName":"tennis meme","userUrl":"https://itunes.apple.com/us/reviews/id30090172","version":"2.6.4","score":1,"title":"Timed out while loading","text":"unable to view recordings keeps saying timed out while loading, evennthough I have high speed internet cable.","updated":"2019-11-07T06:46:16-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3316609841","userName":"Effen penguin great!","userUrl":"https://itunes.apple.com/us/reviews/id155770794","version":"2.4.1","score":1,"title":"Poor software","text":"Open issue for 2 months still not resolved.  Explain to me how a camera on the front porch cant record any deliveries placed directly below the camera.  No recording and no alerts/notifications.  Its a glorified LED light.","updated":"2018-10-18T11:12:53-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5811372464","userName":"Marcy109875","userUrl":"https://itunes.apple.com/us/reviews/id405177904","version":"2.7.2","score":1,"title":"Terrible app","text":"As a security app, this is app is terrible. Slow to load, and most of the time it crashes when you open it.","updated":"2020-04-14T11:22:37-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5236926573","userName":"Panoyiotis","userUrl":"https://itunes.apple.com/us/reviews/id42351537","version":"2.6.6","score":2,"title":"ABT needs updating","text":"The camera work whenever they want to. This app needs a fix. The app use to work great now it’s flawed.","updated":"2019-12-05T09:00:18-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1965475303","userName":"thesmyle","userUrl":"https://itunes.apple.com/us/reviews/id306475617","version":"2.2.3","score":3,"title":"Used a lot of space","text":"I was going through some of my apps and was shocked to see the app take 5gb of storage!!!! Wow!!!\n\nDelete and reinstall but wow.","updated":"2017-12-02T11:33:25-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"4416034945","userName":"Surp","userUrl":"https://itunes.apple.com/us/reviews/id32624892","version":"2.6.0","score":3,"title":"Cannot delete recordings","text":"Normally a great app, but with the latest update, I cannot delete any recordings.","updated":"2019-07-05T13:19:37-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5512410136","userName":"bpeet75","userUrl":"https://itunes.apple.com/us/reviews/id155877169","version":"2.6.6","score":1,"title":"Recordings do not save","text":"Spend the extra money for the Ring. This app has very limited options and functionality.","updated":"2020-02-10T03:43:26-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"4360766393","userName":"Jail this app creator","userUrl":"https://itunes.apple.com/us/reviews/id141225266","version":"2.5.2","score":2,"title":"Ok","text":"The lights and the app are just Ok. Could have a lot more function I think. Does have Apple Watch support which is extremely lame for a security device.","updated":"2019-06-23T16:24:26-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3152525730","userName":"Fitz9451","userUrl":"https://itunes.apple.com/us/reviews/id195954477","version":"2.4.0","score":2,"title":"Unreliable","text":"False notifications, sometimes no notifications, works on my older iPad but not on newer iPad Pro. Needs work.","updated":"2018-09-04T06:54:52-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1568748325","userName":"Lrs1844","userUrl":"https://itunes.apple.com/us/reviews/id323776416","version":"2.0.8","score":4,"title":"Overall Very Pleased","text":"I felt compelled to write this review to help balance the other reviews because this is truly an awesome product for the price. Figure you'll spend around $100 for a nice lamp and another $100 for a good outdoor camera, the price balances out since this camera is $150-$180 for Kuna depending on style. Now, this is the App Store so I'll quickly summarize the product, but not sure if other folks give it a bad rap due to \"operator error\" or maybe they just received faulty products. This camera is a breeze to set up and connect to wifi. It has a great wide angle and the functions work consistently; the app lets you adjust the sensitivity threshold and even after your free premium trial ends, assuming you live in a relatively safe area, you don't need to buy the monthly subscription (although at $4/month you can hardly complain if you want to subscribe). The app lets you download the clips of folks coming to your door (they only store on the app for so long so you want to download to be sure you save them) and record longer lengths up to 2 minutes of activity manually. I would like to see the ability to record to your own server in future models and not just their cloud service. The app has a few prerecorded messages which are fine (I do really really wish it let you pre-record your own) and they even put fun ones on there for holidays (Christmas, etc.). Occasionally if you aren't connected to strong wifi where you are, the camera signal strength cuts out but that's reasonable. Otherwise picture is clear and great for the price and audio is super sensitive (you could be 20+ feet away and still pick up some audio as I did just this afternoon). You can control light on/off settings, snooze settings, etc. Could the app be more powerful/feature loaded? Yes, absolutely, but again, for the price this is an awesome product and there aren't others offered like it. I'm in love with my kuna and definitely prefer it to the ring doorbell.","updated":"2017-03-20T09:21:02-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5621691813","userName":"Snipehunter42","userUrl":"https://itunes.apple.com/us/reviews/id38428665","version":"2.6.6","score":2,"title":"Unreliable","text":"Works sometimes. Only sometimes.","updated":"2020-03-05T17:44:41-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5477744767","userName":"Frequent Ancestry User","userUrl":"https://itunes.apple.com/us/reviews/id103979974","version":"2.6.6","score":1,"title":"Too Slow","text":"Too slow to be of any use.  Each update to the app seems to introduce more bugs.","updated":"2020-02-02T00:10:14-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6299889286","userName":"Not the Greastest Bank WFargo.","userUrl":"https://itunes.apple.com/us/reviews/id667405840","version":"2.7.2","score":1,"title":"DON’T BUY THIS JUNK IMO","text":"Horrible Customer Service. English is terrible and incomprehensible. \nMotion detection works part time. Ai premium service can’t even pick up ATV with People in them. Subscription Rates are Ridiculous !!! BUY ELSEWHERE","updated":"2020-08-09T13:27:31-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1569625462","userName":"SotoStar","userUrl":"https://itunes.apple.com/us/reviews/id243698401","version":"2.0.8","score":1,"title":"Kuna porch light","text":"This is a very good looking light , fairly easy to install but now the bad part. The light never connected to my wi-fi and the router is less than 6 feet away. Hopefully I can get customer support or a new light .","updated":"2017-03-21T17:41:14-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3245025715","userName":"datguy1310","userUrl":"https://itunes.apple.com/us/reviews/id229573461","version":"2.4.0","score":2,"title":"Slow","text":"When I go to live feed it’s always buffering. Kind of slow for me I can hear but it’s not live footage.","updated":"2018-09-29T13:18:25-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1991893608","userName":"That one dude joe","userUrl":"https://itunes.apple.com/us/reviews/id496933000","version":"2.2.3","score":1,"title":"Frequent disconnection crashes","text":"I find myself Re-connecting to Wi-Fi and the App About once every 2 to 3 weeks. That is if the app doesn’t time out before it connects correctly. One star","updated":"2017-12-12T17:39:26-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1529222549","userName":"Mr. M9","userUrl":"https://itunes.apple.com/us/reviews/id537473541","version":"2.0.5","score":1,"title":"Poor update/software","text":"Bad job on the most recent update.  I will be shopping for something else that actually works when I want playback.","updated":"2017-01-23T21:05:29-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"2123825302","userName":"y2krebel","userUrl":"https://itunes.apple.com/us/reviews/id424954531","version":"2.3.0","score":2,"title":"Alerts Hit or Miss","text":"The alerts don’t work consistently is my main gripe and primary reason I purchased the light/camera.","updated":"2018-01-24T19:56:09-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6390461580","userName":"Crashintomee","userUrl":"https://itunes.apple.com/us/reviews/id238285241","version":"2.7.2","score":1,"title":"SORRY I WASTED MY MONEY!","text":"What a useless app and device.  CONSTANT problems.  When it does work it is inconsistent - sometimes it detects a person walking up to the dorm, sometimes it DOESN’T!  Sorry I wasted my money DONT’T WATE YOURS!","updated":"2020-09-03T04:12:04-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3516510241","userName":"Bruce (Iceman)","userUrl":"https://itunes.apple.com/us/reviews/id216889880","version":"2.4.4","score":2,"title":"App very slow","text":"App is very slow by time it alerts me that someone is at the front door they have departed","updated":"2018-12-10T11:04:37-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1526841688","userName":"Shinaniganz","userUrl":"https://itunes.apple.com/us/reviews/id155580539","version":"2.0.5","score":1,"title":"Buggy experience","text":"Disappointing app that often does not respond to commands or gets stuck loading the live video and recordings.","updated":"2017-01-20T18:17:30-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1518091579","userName":"F7zzuy","userUrl":"https://itunes.apple.com/us/reviews/id153237664","version":"1.4.6","score":1,"title":"Poor Motion Detection/Poor Customer Service","text":"The motion detection is bad and the customer service is even worse. Kuna should really care more about its products and customers! Very disappointed.","updated":"2017-01-08T13:12:29-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3228595845","userName":"williambacky84","userUrl":"https://itunes.apple.com/us/reviews/id513235781","version":"2.4.0","score":1,"title":"App just spins when trying to load video","text":"Cannot see who is at my door because the app just sits there spinning. This needs to be fixed!!","updated":"2018-09-25T06:20:49-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1531324241","userName":"575KING","userUrl":"https://itunes.apple.com/us/reviews/id37053756","version":"2.0.6","score":1,"title":"No Live view! What Happened???","text":"The Kuna app was updated today and now I have no live view and no recordings. This thing was working perfectly and not nothing. Please fix!!!","updated":"2017-01-26T19:32:23-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5716251147","userName":"LoveyLambie","userUrl":"https://itunes.apple.com/us/reviews/id352428392","version":"2.7.2","score":2,"title":"Eh","text":"Lights work but can’t get the camera to connect.","updated":"2020-03-26T06:35:21-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"4425211023","userName":"elacy30","userUrl":"https://itunes.apple.com/us/reviews/id558884031","version":"2.6.0","score":1,"title":"75 percent of the time it works.","text":"I have two camera’s the Kuna and the Ring,  both are  pointing in the same direction , however the kuna only records like about 75 percent If the time.","updated":"2019-07-07T07:07:05-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5356167722","userName":"88888HK","userUrl":"https://itunes.apple.com/us/reviews/id108126215","version":"2.6.6","score":1,"title":"Unreliable","text":"Product is unreliable most of time it does not capture 80% of the action. Regret buying these.","updated":"2020-01-03T08:42:44-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1531916606","userName":"Security view","userUrl":"https://itunes.apple.com/us/reviews/id249363492","version":"2.0.6","score":1,"title":"Not good","text":"You used to get a two hour play back but they took that away so now this is basically worthless to me ,  do not buy","updated":"2017-01-27T17:09:22-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1530965235","userName":"Dead kidd","userUrl":"https://itunes.apple.com/us/reviews/id161013110","version":"2.0.6","score":1,"title":"Live","text":"Live no longer works with current update nor will it let me access the recorded files please fix","updated":"2017-01-26T06:27:54-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1481203012","userName":"Detroit_313","userUrl":"https://itunes.apple.com/us/reviews/id153022171","version":"1.4.5","score":1,"title":"Needs updating","text":"Worked fine until Halloween day, haven't been the same since.","updated":"2016-11-08T19:22:21-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1811791745","userName":"Derrick517","userUrl":"https://itunes.apple.com/us/reviews/id245084358","version":"2.2.0","score":1,"title":"App","text":"Can’t see any live video or notifications through the app on my 📲, if I walk past I here the chime, but cannot see anything with the app.","updated":"2017-09-26T16:52:38-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6288753047","userName":"Anthill2","userUrl":"https://itunes.apple.com/us/reviews/id311170116","version":"2.7.2","score":1,"title":"The app is impossible to use","text":"Fonts too small and too faint for old people to see.","updated":"2020-08-06T17:43:56-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1531300937","userName":"Kuna user","userUrl":"https://itunes.apple.com/us/reviews/id87638360","version":"2.0.6","score":1,"title":"What just happened!","text":"Everything is offline..both units less than 3 weeks and it's not working (app issues)\nIm I the only one?\nFIX IT!","updated":"2017-01-26T18:51:07-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6327304030","userName":"jikel","userUrl":"https://itunes.apple.com/us/reviews/id11954272","version":"2.7.2","score":1,"title":"Piece of crap","text":"It does not work well. Slow to load, looses recording before the period it say I will and barely detects motion. It is a nice light tho","updated":"2020-08-16T13:01:53-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"4532011194","userName":"Hot girl 1021","userUrl":"https://itunes.apple.com/us/reviews/id238957385","version":"2.6.2","score":1,"title":"Not satisfied","text":"I have had people who should have been detected. Also it picks up late. I’m not sure if this was worth the purchase","updated":"2019-07-28T07:25:55-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1518833611","userName":"Bcubed55","userUrl":"https://itunes.apple.com/us/reviews/id173003891","version":"2.0.4","score":1,"title":"Step Backwards","text":"Is it just me or did they take away the ability to switch between cameras in Landscape by swiping??","updated":"2017-01-09T17:34:02-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1532449887","userName":"Zat N.","userUrl":"https://itunes.apple.com/us/reviews/id308682385","version":"2.0.6","score":1,"title":"Latest version doesn't work","text":"I cannot see live view nor check recordings.","updated":"2017-01-28T10:59:18-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1865637047","userName":"DV1991","userUrl":"https://itunes.apple.com/us/reviews/id27645561","version":"2.2.1","score":1,"title":"Does not open after iOS update","text":"Would give 2-3 stars if app actually worked.","updated":"2017-10-21T19:02:34-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3037083799","userName":"oh jay won","userUrl":"https://itunes.apple.com/us/reviews/id479103381","version":"2.4.0","score":2,"title":"kuna not working","text":"trying to reinstall Kuna program for secutiry light setup, no help from kuna","updated":"2018-08-08T12:25:58-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1537435058","userName":"Bac327........","userUrl":"https://itunes.apple.com/us/reviews/id3291967","version":"2.0.6","score":1,"title":"Frustrated!","text":"The camera detection has been offline most of the day. Off, on, off, on.","updated":"2017-02-04T19:29:31-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3255110563","userName":"hoanghuy2013","userUrl":"https://itunes.apple.com/us/reviews/id149199851","version":"2.4.0","score":4,"title":"Please update app Kuna for Apple Watch","text":"Please update app Kuna for Apple Watch. Thanks !","updated":"2018-10-02T04:19:00-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1874943575","userName":"Byteking","userUrl":"https://itunes.apple.com/us/reviews/id144792292","version":"2.2.1","score":1,"title":"No live Video!","text":"With the recent iOS update I can get video footages but cannot access live video.","updated":"2017-10-25T15:56:31-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5365807705","userName":"Tevy Jett","userUrl":"https://itunes.apple.com/us/reviews/id156827854","version":"2.6.6","score":1,"title":"Horrible","text":"Horrible product. Horrible customer service. Horrible accountability. Morally corrupt company at best.","updated":"2020-01-05T14:11:41-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6497773065","userName":"kunates","userUrl":"https://itunes.apple.com/us/reviews/id845207470","version":"2.7.2","score":1,"title":"Kuna cloud is dead?","text":"When they will recover the system","updated":"2020-10-03T18:07:10-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5166425020","userName":"motan2012","userUrl":"https://itunes.apple.com/us/reviews/id805784107","version":"2.6.6","score":1,"title":"Junk","text":"Total waste of money","updated":"2019-11-18T16:12:48-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3934758551","userName":"iamgman","userUrl":"https://itunes.apple.com/us/reviews/id105961208","version":"2.5.1","score":1,"title":"Notifications","text":"1.  Need to add “Snooze notification” to 3D Touch menu. \n2.  Need to bring back 12 hrs in “Snooze notification”","updated":"2019-03-27T17:00:08-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5256095837","userName":"designmom","userUrl":"https://itunes.apple.com/us/reviews/id564668343","version":"2.6.6","score":2,"title":"Please Update!","text":"Kuna App is glitching like crazy.  Please work on this!","updated":"2019-12-10T06:45:46-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1374060387","userName":"palabrajot","userUrl":"https://itunes.apple.com/us/reviews/id26827112","version":"1.3","score":2,"title":"Bright idea, needs polish.","text":"I really like my Kuna, but there are a few things which keep me from loving it, and it has everything to do with the service and the software.\nFirst, for a subscription to be worth it, it will have to use better discretion in issuing alerts. On a really windy day, I'll get a dozen alerts in a hour from the shadows cast by swaying tree branches or a potted plant alone. There is an option in settings to turn down the sensitivity, but if you dial that back too far, then it won't be triggered by the mailman. An algorithm which is able to distinguish human forms or faces would make it smarter than the average $20 motion detecting floodlight, and that would add crucial value to the device.\n\nSecondly, maybe a premium subscription option would give the option to record constantly, and offer a log of motion-activated events before rolling it off of their servers after fifteen days or a month, just like professional surveillance systems do. I would consider that valuable because...\n\nThirdly, Kuna misses some trigger-worthy events. I'll sometimes walk right past it and get no notification, or the mailman won't set it off, and for a security service, that's kind of unsettling.\n\nFourth, the lag can be rough, especially when using the intercom. Often, I'll try to talk to people who come to my door with the intercom function, but by the time I've received a notification, they've already walked out of earshot.\n\nLast, and this seems like the easiest fix, it doesn't work with my Bluetooth headphones. I have to assume that's the case with all BT speakers and Kuna's software, which is a rough deal for me, because I'm often in a high-noise environment, and that iPhone speaker is just not going to cut it.\n\nAll that having been said, I think the Kuna is a great concept, the camera is great, the feed is okay most of the time. If I had only one wish, it would be for the device to record directly to a storage device that is on-site for the end user. Of course, that would mean cutting Kuna away from the responsibilities of maintaining support for their cameras, but it would also mean cutting them out of potential subscription revenues.  So I can't see that happening. I just hope they can remain solvent for the life of this fixture, because without them, the hardware is pretty much worthless.","updated":"2016-05-05T16:28:28-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1527563832","userName":"Stamps tip","userUrl":"https://itunes.apple.com/us/reviews/id123647867","version":"2.0.5","score":1,"title":"Used to be great","text":"First light I purchased in September has failed and new app is glitchy and unreliable.","updated":"2017-01-21T16:26:04-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1528434066","userName":"Armditti","userUrl":"https://itunes.apple.com/us/reviews/id177478990","version":"2.0.5","score":4,"title":"Great product","text":"Love this light!","updated":"2017-01-22T18:56:55-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"4965213827","userName":"rodomack","userUrl":"https://itunes.apple.com/us/reviews/id700312411","version":"2.6.4","score":1,"title":"Junk","text":"Do not buy this product. Its junk","updated":"2019-10-18T03:21:45-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1617598281","userName":"ATLkeith","userUrl":"https://itunes.apple.com/us/reviews/id28378481","version":"2.1.3","score":4,"title":"Love the Kuna cameras, and the app. Some areas for improvement","text":"We love our Kuna door cameras--we have three of them, plus several companion lights. They work amazingly well: the fact that they're wired into power means that, although you deal with some extra hassle at installation time, they're tidy and neat and reliably powered after that.  \n\nWe had Logitech Alert cameras (and the associated app) before the Kunas, and the Kuna experience is night-and-day better: much more reliable, higher video quality. \n\nThere are a few areas for improvement that keep me from giving this 5 full stars, although it is a product I can recommend.\n\n- First, while it's nice that there are Apple Watch notifications for the Kuna app (whenever motion is detected), it would be great if these contained the image that set off the motion detector. It's frustrating to have to pull out the phone to check whether it's a \"false alarm\" or not.\n\n- Second, the motion detector itself could use some improvement. Sometimes it doesn't seem to notice motion, other times it fires with mere changes in lighting.  (I realize this is tough to get right, and it's nice the vendor provides a mechanism to set the sensitivity of the motion detection.)\n\n- Finally, there's no HomeKit support in the current version of the hardware, and it doesn't seem likely there will be.  I understand that early adopters sometimes get left behind, but that doesn't make it less frustrating.\n\nStill:  if you're looking for hard-wired (power) home security cameras, the Kuna is a great choice.  The app itself is solid, and getting even better with later releases.  We are very happy with our purchase, and can recommend these products.  With a few improvements (to Apple Watch support and motion detection)--this would easily be a 5-star product.","updated":"2017-05-18T18:51:03-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"4416781491","userName":"Maalea","userUrl":"https://itunes.apple.com/us/reviews/id112030062","version":"2.6.0","score":1,"title":"Recording will not clear","text":"Recordings will not clear/erase on the iPhone/iPad app","updated":"2019-07-05T17:28:11-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1529118568","userName":"Firemikemjojmo","userUrl":"https://itunes.apple.com/us/reviews/id37172870","version":"2.0.5","score":1,"title":"Me","text":"App stinks and camera is just as bad.","updated":"2017-01-23T17:57:17-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1599256817","userName":"Rebecca Parks","userUrl":"https://itunes.apple.com/us/reviews/id105882541","version":"2.1.1","score":1,"title":"Worst app support ever!!","text":"Loved the camera system initially. Not soon after installation, I bought the $60 membership. That way my videos would be saved for 30 days.  Not so!  My videos were only saved for seven days, as though I had not purchased a premium membership, let alone a membership at all! Upon calling support, it was a joke.  It was only one guy manning the phones who happened to be filling in for his friend. He tried very hard to solve the problem but as he was not a Kuna technical supporter, he would have to contact Kuna and call me back with possible fixes. He called me back a couple of times but the problem was never solved. \n\nThis was so unfortunate to me because there was a video which I desperately needed to review and send to law-enforcement. This was within 10 days of the event. Sadly enough, the video was long gone as it was outside the seven days that Kuna by default saves your videos.\n\nI had previously told law-enforcement that in regard to this incident, I had full video and audio of everything that happened in regard to the robbery at my house.  Imagine my surprise when the video was unavailable to me from both cameras that covered the entire front of my home.\n\nI have not heard a word from Kuna and my videos are still being saved for only seven days.  If seven days of history is all you need, then this app is for you. But if you pay for something and you get nothing, especially when you thought you had gotten something, it is very unnerving.\n\nI live alone and depend upon the cameras to keep me safe. Had I known it was only a seven day hold, I would have extracted the videos and saved them to my hard drive.  The incident happened on the morning of April 8, 2017. And when I was going to make copies of the videos for the police department 10 days later, they were not there. I knew that I had until May 8, 2017 to review the videos and submit them.   I am so disheartened and severely affected by this situation. I think when people get cameras, it is for security purposes and then when the support system fails, what good are the cameras?","updated":"2017-04-27T17:03:33-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"8013374580","userName":"Done played out","userUrl":"https://itunes.apple.com/us/reviews/id413868618","version":"2.9.2","score":1,"title":"Sham cams","text":"Folks they Don’t work at all unless you buy the plan.at first yes they work .once your trial runs out they stop your cams from working until you buy a plan. Don’t waste you hard earned cash . My mistake was buying four cam light . Now they are just lights useless trash . Replaced them with blink cams they work like pros and cost way less. I had great hope for kuna cams glad I don’t have their company stocks.","updated":"2021-11-11T11:38:35-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"8073877853","userName":"taichiyang","userUrl":"https://itunes.apple.com/us/reviews/id115551688","version":"2.9.4","score":5,"title":"iOS 15 problems","text":"Camera and microphone are usually very reliable but since IOS15 I’m receiving no sound from kuna with iPhone 8. Newer phones work so I believe it’s an Apple update problem. Hopefully a new update will arrive soon. I’ve had these devices for years and they have always worked well.\n\nUpdate 11/28/21 new Kuna app software fixed all problems since IOS15. Everything works now. The apple orange light that signifies an app that is using the Mike or camera now works as well. It appears it was an app software problem not apples IOS 15. Thanks Kuna software team for the fix.","updated":"2021-11-28T12:10:10-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7467423271","userName":"WJS_11","userUrl":"https://itunes.apple.com/us/reviews/id4043161","version":"2.8.2","score":2,"title":"No innovation lately","text":"This app & company was way ahead of the competition. They were one of the first with residential vehicle and people detection. However, there hasn't been much improvement lately and the service itself seems to be declining. \n\nThe app on-launch often takes several seconds to load the camera views. Glitchy and pixelated video is common. When a camera is triggered by an event, that camera will often not open, defeating the purpose most likely due to the event being record. The \"AI\" detection is often confused by tree shadows moved by the wind, leading to useless alerts and video clips. There's always lag when speaking with someone; once you are done speaking the visitor cannot be heard because the mic takes a few seconds to open so the beginning of what is said is missed. \n\nThis is not a Wi-Fi issue; my home is saturated with two access-points, both close to the cameras' locations. No issue with bandwidth either; 300/50 Mb. I've tried two other, similar camera products without issues like these. It's unfortunate because I like having the look of regular exterior lights with built-in camera security. Sai-Wai, the CEO & co-founder and his team have become complacent and perhaps lazy.","updated":"2021-06-15T06:20:14-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"7860075526","userName":"lolatroubleshaeshae","userUrl":"https://itunes.apple.com/us/reviews/id1275245326","version":"2.9.0","score":5,"title":"I don’t know what’s going on.","text":"My cameras are not catching people with the sensitivity all the way up. It’s been slow. Glitchy. I can’t use the app away from my home with out it freezing. I pay $30.00 a month for absolute control. And now it’s saying i have to sign out of the app and restart it to get back in. So when I do that. It does the same thing. Tells me I have to restart the app. So I deleted the app. And now it won’t even download to my iPhone 11 pro. What is the reason this is happening? Please fix this. Issue for us I can’t be the only one having these issues. And you are going to loose a lot of customers if it doesn’t get fixed. Because what’s the point in having these effects and abilities if you can’t use them. There’s no point in it. I don’t feel safer at all. No security","updated":"2021-09-29T20:02:13-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5372926985","userName":"Dubd02","userUrl":"https://itunes.apple.com/us/reviews/id43332225","version":"2.6.6","score":2,"title":"Flawed","text":"Update: Get a different company! These lights look the best to me but they’re not reliable.\n\nIt’s a nice looking light unfortunately the technology is flawed. Never worked 100 percent properly.cars go by and it doesn’t pick them up or people walk by it doesn’t always catch them. If it worked all the time it would be great. It hasn’t showed me video playback for about a week. I reset the light at the breaker and the playback just says it’s recording. I bought this light instead of Ring Floodlight because I liked the look but the Ring app and technology can’t be as flawed as this.","updated":"2020-01-07T09:30:59-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6604767005","userName":"Hauli","userUrl":"https://itunes.apple.com/us/reviews/id11932207","version":"2.7.2","score":1,"title":"50% Alexa Integration. No Camera","text":"Come on Kuna! Give us some camera integration to view on Amazon Echo Show, a TV App, a TV Browser, multi cam in browser, or something, anything.","updated":"2020-11-03T06:45:43-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6547953764","userName":"Mentallabour","userUrl":"https://itunes.apple.com/us/reviews/id433081027","version":"2.7.2","score":1,"title":"Return your camera and delete this trash app!","text":"Terrible security devices, no wonder they are on sale. BS model where you have to pay monthly just to even see any recorded footage. Total waste of money, total waste of templated code with this app as well. This company should delete itself.","updated":"2020-10-18T05:18:25-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6497863139","userName":"OfcrJ","userUrl":"https://itunes.apple.com/us/reviews/id215372624","version":"2.7.2","score":1,"title":"Won’t let me log in","text":"My username and password are correct as I can log in via the website, but the app says the password is wrong and won’t let me reset the password because it says the email is wrong. Then it won’t let me sign up with my email because it says something is wrong! I know whats wrong - YOUR HORRIBLE APP AND THE TECHS THAT CAN’T GET IT RIGHT! Think I’m going to change back to regular porch lights and scrap this garbage.","updated":"2020-10-03T18:43:17-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6391177806","userName":"Defeated by a Robot!","userUrl":"https://itunes.apple.com/us/reviews/id335866270","version":"2.7.2","score":1,"title":"2 hour storage of new videos??","text":"So I knew you’d have to pay to look backward or to save needed videos but now it’s changed to a 2 hour window. So if you thought you hear something last night while you were asleep, the video won’t be there to check because it happened more than two hours ago. Do yourself a favor, get RING system OR 500 bucks buy a CCTV camera system at Costco with 8 cameras and no monthly subscription! This system is for suckers. I’m embarrassed I recommended it to friends. Not fair to change the rules without warning. I hope to file a class action lawsuit. In a word , CHINA. They don’t care. It was about getting your money and info.Now they spy on us and slow down our networks. Throw it in the garbage OR retrofit a small camera in side.","updated":"2020-09-03T08:20:52-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"6194575233","userName":"joe f 3","userUrl":"https://itunes.apple.com/us/reviews/id971748867","version":"2.7.2","score":1,"title":"Bad Customer service","text":"I bought a light a month ago and the camera went out. Contacted customer service and they told me to do the same steps that is on there help page. It didn’t work and they said I would have to replace it. They asked if it was still under warranty because they cover for up to a year if I can provided a receipt. It was only a month old and I bought it from amazon so I was able to. They didn’t cover the warranty because it was a 3rd party from amazon. This company does not back up there warranty!! \n\nAlso, I got an email from there news letter about a sale going on. The light I needed was out of stock and there customer service would not give me a discount I could use later with my situation. \n\nAs far as the app goes, it is delayed and doesn’t always give a notification when someone is near your house even if you put it to the highest motion detection. Instead it will capture the tree blowing in the wind rather then the person at your front door. \n\nMy suggestion is to look for something else like a ring or nest.","updated":"2020-07-13T16:20:00-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5893147391","userName":"Nicknameyname","userUrl":"https://itunes.apple.com/us/reviews/id48842869","version":"2.7.2","score":1,"title":"Unreliable product - 43% failure rate (3/7 failures) after 3 years","text":"Here is the summary of this message:  Kuna/Maximus makes an unreliable product that they don’t stand behind, and I’m going to post reviews on any site that will let me review your product, including the site where I bought them, and the Apple App Store.\n\nThe facts of my relationship with Kuna/Maximus:  I purchased quantity (5) Kuna smart security lights in March 2017 (see Amazon receipt attached .  October 2017, one of the lights failed and was replaced under warranty.  March 2020 a second light failure, and after refusing the “buy another” resolution proposed by Kuna customer support I was offered me a discounted refurbished unit which I purchased.  April 2020 my third light failure, and the \"buy another\" resolution was offered and adhered to.\n\nTotals:\n\n5 original units\n+1 warranty replacement\n+1 discounted replacement\n7 total units\n3 failures\n\n3 failures out of 7 total lights = 42.8% failure rate.\n\nBefore you start with possible theories to make yourselves feel better, the lights were installed by a licensed electrician and were caulked with outdoor silicone between the structure and the light by him to further shed water.  I have a receipt and believe the lights were installed in accordance with the manufacturer’s instructions.\n\nAfter a brief failure analysis (I’m an engineer) I’ve discovered the following:\n\nHousing:\n\nThe water shedding design of the Kuna smart security light housing is weak.  The speaker grille is NOT//NOT covered on the interior with a membrane, although the speaker does have a polymer grommet between the housing cover and the speaker.  The camera gimbal mount does NOT//NOT have gasketing or water prevention sealing.  The mounting post channels also do NOT//NOT have gasketing or sealing incorporated into the design.  These unsealed and unprotected openings will allow moisture to contact the electronics.\n\nElectronics:\n\nI was surprised, but then not surprised to find that NONE of the electronics or connectors were potted.  All that is between the electronics and the environment is the thin plastic housing, which is probably an ABS thermoplastic to improve injection molding efficiency at manufacturing.\n\nOpinion:  While it is impossible for me to know the true motivations for Kuna/Maximus, I believe these lights are not intended to last and are designed to last just a little bit longer than the manufacturers warranty.  I’ve designed and installed outdoor electronics systems, and none with a 43% failure rate after 3 years.  Kuna is quick to offer a “buy another” solution instead of offering a product that is designed to last.  I will be purchasing no more products from Kuna/Maximus.","updated":"2020-05-02T06:20:57-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"4509872954","userName":"Kevin in NJ","userUrl":"https://itunes.apple.com/us/reviews/id16857799","version":"2.6.2","score":2,"title":"Good camera, won’t buy another","text":"It is a good camera to have, the app is easy to use on my iPhone. Microphone works great, the speaker is great.\n\nThe sticky point? It’s the part of having a camera that we each really need, the ability to look back without feeling we have to live on our app.\n\nLook, I don’t jump on my app with every detection. I’m ok with a spider, bird, dog, or mailman that stops by. I’d go wonkers looking all day. I want the “luxury” of checking out what happened during the day in one sitting. \n\nOops, it didn’t say it in the box that your footage can be removed within about 4 hours without a subscription. Fear not concerned home owner, you can monitor your app throughout the day and easily download events. OR you can buy a subscription! Wait for it...\n\nThe $7.49 per month-to-month ($90 per year) to look back gives you only 7 days. $4.99 per month ($60 per year) if you pay the annual subscription. And that’s for one camera. \n\nReally? Really?\n\nNow if I bought 4 cameras (nice up-sale) the Kuna “steal the deal” price is $14.99 monthly or $9.99 on an annual subscription. Didn’t say that on the box. Do the math\n\nFear not, you can downgrade at anytime. How does that work when I pay a year in advance?\n\nBottom line, I love the camera, but the subscription is too much for too little.\n\nSuggestion: make money with ads on your app with the free subscription and 7 days of storage. Paying $4.99 per month gives me a month with ads. $9.99 per month for your 4 cameras, no ads. But that won’t happen, or will it? What’s your mission, Kuna?","updated":"2019-07-24T03:06:24-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"5132972371","userName":"June Grass","userUrl":"https://itunes.apple.com/us/reviews/id33313620","version":"2.6.6","score":1,"title":"Deceptive Advertising","text":"Beware if buying the Smart Security Light from Costco, the packaging is deceptive on what is included in the bundle. On the box in big highlighted lettering is printed “FREE UPGRADE TO 6 MONTHS OPTIONAL PREMIUM SERVICE”. However, once you open the package, install the light, and start the setup process, you find that the code to redeem is expired and customer service will not honor it. It should have been identified on the outside of the box that the free service was a limited time offer.","updated":"2019-11-13T09:45:42-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3891274305","userName":"Rach112614","userUrl":"https://itunes.apple.com/us/reviews/id12526281","version":"2.4.5","score":2,"title":"Missing features","text":"Kuna has been promoting a custom greetings feature. I struggled to find it so I emailed them and they sent me a link for instructions. I read the instructions and still couldn’t find it in the app. They finally said oh this feature is only for android users. (Why would you not offer that for iPad users?!)","updated":"2019-03-16T22:54:03-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3410333068","userName":"Roooooobert--1120","userUrl":"https://itunes.apple.com/us/reviews/id461328396","version":"2.4.3","score":2,"title":"Camera","text":"It works good. Need to improve the sensitivity on how it records. There is times people walked past and it doesn’t record and I am paying for the iCloud service. The constant circle in the center of the screen has got to go. I’m paying 100/100 Internet. So I know it’s not on my end it is the software that is in the camera. Otherwise works well","updated":"2018-11-12T08:23:57-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1378664374","userName":"J-Fibe","userUrl":"https://itunes.apple.com/us/reviews/id122854075","version":"1.3.2","score":3,"title":"Latest update made the app inconvenient","text":"As others have mentioned, the last update on (5/12/16) caused the app to constantly sign out.  So when you do get an alert there is motion near a camera and then try to open the app to view what's going on - you are prompted to login to you account.  The only thing it does remember is your username.\n\nThe problem for me is I never use passwords I can remember, I let Lastpass do that hardwork for me.  In a few seconds I can securely lookup the passwords I need but with Kuna's new login problem it is just annoying to do every time.  \n\nIs there no way to integrate Apple's TouchID with the Kuna app?","updated":"2016-05-14T13:33:28-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3260360073","userName":"jsemmens","userUrl":"https://itunes.apple.com/us/reviews/id42200049","version":"2.4.1","score":1,"title":"Horrible picture quality","text":"It’s advertised as 1080 video but that’s misleading. It’s not. Even with 100/100 Mbps internet, excellent Wifi connection the picture quality is horrible.","updated":"2018-10-03T14:25:35-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3242520406","userName":"Hadjisahn","userUrl":"https://itunes.apple.com/us/reviews/id10019946","version":"2.4.0","score":4,"title":"Roku App Please!","text":"I want to pop up the cameras from my Roku and be able to get an alert during Hulu just pop up in the corner.  Please make this happen, other than that, great product. Holiday sound effects are awesome.","updated":"2018-09-28T23:41:55-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"3236749627","userName":"Upback","userUrl":"https://itunes.apple.com/us/reviews/id263573782","version":"2.4.0","score":4,"title":"Seems like they fixed it.","text":"It has always been buggy but after this last update it is awful, please try and fix it, it is now much more delayed with notifications and on the live screen it is black on android and green on IOS for a few minutes and when it eventually comes on the live feed is very choppy. They can’t blame bad WiFi on this either because I have 400 mbps and a excellent bandwidth where my Kuna is installed. Hope they can fix these problems. Update 9/25/18, Now after another so called update to fix the iPhone XS, the live feed is absolutely horrible on Android and iOS and unusable. I will update if it is ever fixed.\n\nUPDATE 9/27/18, it seems like they fixed the problems and the app is now working great, the live stream is great again, thank you.","updated":"2018-09-27T10:23:38-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"2987746880","userName":"mamprey","userUrl":"https://itunes.apple.com/us/reviews/id287422075","version":"2.3.8","score":1,"title":"Great idea poorly executed, hopefully Ring or Blink acquires them. Bad customer service.","text":"Started out great. Good camera quality and audio is above average. Great for security because people can’t tell it is a camera. Once I needed to reset the WiFi it all went wrong. After only a week the WiFi will not attempt to connect and the led lights stopped working. Customer service has been horrible. Language barriers prevented good customer service via phone and the hours are horrible. The email customer service has been just as bad. They only answer after every three days and now wants to question my very strong WiFi network as the problem when the led lights won’t even work to show it is attempting to connect. I will be returning the device for something else on Amazon. I understand defective products happen but customer service response has been horrible.","updated":"2018-07-29T08:09:39-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1879380943","userName":"jeff10471","userUrl":"https://itunes.apple.com/us/reviews/id225983791","version":"2.2.1","score":1,"title":"Live Feed Useless","text":"Live feed is terrible and utterly useless. About 90% of the time, live feed is mostly green screen and highly distorted. It also takes a long time for live feed to refresh, only to see a green screen most of the time. I've tried switching internet channels, rebooting and I even bought a high speed router, but nothing works. I am getting between 30-100 Mbps outside at the lights and still poor live feed. Without good live feed this system is useless to me. What does not make sense is that recording works fine. The lights also periodically go offline requiring a reboot. The lights look nice and easy to install, but I am ready to take them down and return them.","updated":"2017-10-27T14:00:16-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1568762008","userName":"Wangmeister","userUrl":"https://itunes.apple.com/us/reviews/id42042480","version":"2.0.8","score":4,"title":"Good product, app needs fixes","text":"First of all, this is a great product. We've been really happy with our Kuna Light and the motion detection works well and doesn't have too many false alarms. In terms of the app, I've used both the Android and iOS versions of the app and the Android version is less buggy and more reliable when it comes to notifications and playback. The iOS app needs some work as it frequently has weird issues like notifications not appearing (or disappearing right after they are received) and I have playback issues a lot of the time. If I try to stream the recorded videos from the app itself they often just spin and never load. If I download them, the download is fast and the videos plays fine outside of the app. Overall, the app is good and has a nice interface but I'd really like to see it reach the same level of reliability as the Android counterpart.","updated":"2017-03-20T09:51:34-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1534486192","userName":"BW88227733","userUrl":"https://itunes.apple.com/us/reviews/id29158711","version":"2.0.6","score":1,"title":"Broken Firmware","text":"1-31 Opened box. Set up. Worked great. Updated firmware ( I know better). Now useless. Useless. Back to Amazon.","updated":"2017-01-31T16:37:19-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"},{"id":"1532494853","userName":"DSCme","userUrl":"https://itunes.apple.com/us/reviews/id36388314","version":"2.0.6","score":1,"title":"Horrible","text":"Most recent update breaks everything.  \nI can see my Kuna devices but the configurations do not work. \n\nLight setting is not recognized- not mater how you set it, it goes dusk-till-dawn. \n\nMotion detection is stuck at 50%. In the app you can change to 100% or 10% and you get the same result. \n\nCustomer service does not respond to any requests.  Just check Amazon Reviews. \n\nWhen they work - they're great. But the problem is they usually do not work.","updated":"2017-01-28T13:08:08-07:00","url":"https://itunes.apple.com/us/review?id=951258324&type=Purple%20Software"}]