[{"id":"8133484571","userName":"Nanner72","userUrl":"https://itunes.apple.com/us/reviews/id524031219","version":"2.5.4","score":3,"title":"Lost connection","text":"Have used gogogate2 for many years and it has worked perfect but somehow I have lost the connection. I thought I could delete current set up and start again but I am now lost on how to do it. Can anyone help?","updated":"2021-12-15T10:35:44-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"1900366705","userName":"505to714","userUrl":"https://itunes.apple.com/us/reviews/id31637774","version":"2.08","score":4,"title":"Works great","text":"Installed in about 20 min, works great so far, the only criticism I have is the wires that come with the unit are VERY short so if the electrical outlet is far from your push button panel, you will run into problems, I suggest mounting it on the roof next to your motor. I stuck mine on the wall and since it only comes with one set of double sided tape, I’m afraid to rip it off the wall and reinstall it. I don’t want to damage the unit pulling it off. I wish the lights didn’t flash continuously, but I will say I tried a different product before this and it sucked so this product was a good buy.","updated":"2017-11-05T16:55:22-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"7124297641","userName":"Ibmiguy","userUrl":"https://itunes.apple.com/us/reviews/id238307120","version":"2.5.3","score":4,"title":"Difficult setup, but works great afterwards","text":"I give functionality 5 stars and setup 3 stars.   Setup is very difficult because it either works or doesn’t after going through setup.  You don’t know if you made a mistake until the end.  My suggestion for setup, go very slow and double check each step before moving on.  If you make a mistake or think you made a mistake, factory reset and start over.  Be patient.","updated":"2021-03-20T08:04:40-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"3926072164","userName":"westladt","userUrl":"https://itunes.apple.com/us/reviews/id32854790","version":"2.4","score":1,"title":"Great hardware. Poor app.","text":"As stated by another reviewer:\n\nHardware works well. But app is definitely due for some very simple updates. Like allowing more than one person to receive notifications. Also custom notifications if the garage door is left open. Maybe the ability to send a one time access pass to people without them having to sign up and download the app. Many possibilities.\n\nI spent 1 hour hacking together an app for myself with some of these features. Seems like it would be useful to the developer to spend a small amount of extra time and add these useful features.","updated":"2019-03-25T10:53:44-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"1965543847","userName":"Pleasefixtourapp","userUrl":"https://itunes.apple.com/us/reviews/id202546919","version":"2.08","score":2,"title":"No more alerts for users, USB antenna, and pulse","text":"I had the original gogogate and my wife and I could both receive alerts. Now, only the Admin can get the alerts!\nThe tiny USB antenna would not work inside the gate box when the cover was on. I had to use the old USB external antenna for the wi-fi to see it.\nI use my gogogate for a gate. It seems you have made it more like a gogogarage! I can’t push a button to stop the gate so it can be locked open. I have to use the remote!!\nSorry guys, you totally messed up by changing the features from your original gogogate!","updated":"2017-12-02T12:14:35-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"4042751196","userName":"654abc","userUrl":"https://itunes.apple.com/us/reviews/id26770617","version":"2.4","score":1,"title":"Wouldn’t work at all","text":"Could not get the unit to allow my iPhone to join its WiFi network, therefore could not set it up at all.  At first, the unit would not present its WiFi network for me to choose from.  I attempted resetting the unit by holding down the black button.  Then it did display the GoGoGate network for  a couple or three attempts, but it presented me with an error saying cannot joint the network.  Finally the network name stopped appearing in the list of network names to join.  \n\nToo many other choices out there to fool with something like this.  It is going back today.","updated":"2019-04-21T10:39:02-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"2344962825","userName":"gonzalezjk","userUrl":"https://itunes.apple.com/us/reviews/id15824002","version":"2.3.1","score":5,"title":"Just perfect","text":"This product was very easy to install and it Always works no matter what.  You had to configure the option to be able to open it when your phone is not connected in the same WiFi network but they tell you how in the instructions.  I’m about to buy another one for my town house.","updated":"2018-03-25T06:07:17-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"2464135284","userName":"schlips","userUrl":"https://itunes.apple.com/us/reviews/id43616336","version":"2.3.1","score":5,"title":"Just right but no CarPlay support 👎","text":"Always works for me, never have had any issues. The value proposition of the camera is okay, but not great. More work needs to be done there (pinch to zoom, full screen).\n\nIf another garage door app integrates with CarPlay before Gogogate does or Gogogate decides to not pursue that opportunity then we are totally moving to that new solution.","updated":"2018-04-24T18:54:47-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"6026072817","userName":"poconoed","userUrl":"https://itunes.apple.com/us/reviews/id563225770","version":"2.4","score":1,"title":"GoGoGate2","text":"Installed GoGoGate2 works very well. But at first configuration was hard. \n\nInstalled a wireless IP Camera Foscam FI9821P Camera work great with it own app, but very slow and delay with GoGoGate app.\n\nGoGoGate2 app need an update to fix the delay that cameras connected to it.\n\nFYI. When garage door is open. Bottom of the app shows\n\n“GARAGE” door was still open\n\nUpdate 6/2/20\n\nGogogate2 having problems with date. Works fine when on WiFi at home. But when away or on date app on iPhone not working. “ Gogogate times out not found”. Reset Gogogate2 and WiFi three times and still having the same problem. Not sure does the app need new update. \n\niPhone iso was updated to 13.5.1 and it seem to stopped working. \n\nNot sure is it the gogogate2 app on phone or the unit it’s self.","updated":"2020-06-02T07:26:51-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"1499498775","userName":"I heart Inversions","userUrl":"https://itunes.apple.com/us/reviews/id86908685","version":"2.0.4","score":3,"title":"Works decently but can be improved","text":"The app works pretty well and does what it's supposed to do. However, there are a few annoying bugs and UI elements that can be improved. \n\nIn terms of bugs, the most glaring one that I've seen is that if you've changed your account password on the web admin page, the app would stop working and complain that the password was wrong. However, there is no way that I could see to change the password that the app uses to log in. To resolve this, I had to delete and re-add the device. From there, I noticed that if you don't put in the device ID, the validation logic for that field says that you've entered in a device ID that was over twenty characters long. \n\nAs for UI improvements, there are numerous (but then again, I'm a UX snob). For one, why do I need to go look up my device ID when I'm trying to log into my account? It should just be recorded as part of it. Next, with respect to opening and closing doors, there's this kludgey element where you swipe left/right and up/down to activate the action. Now, swipe gestures are great and all, but there are simpler things that fit better for this purpose.","updated":"2016-12-10T10:05:36-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"2580955334","userName":"Yaxe12","userUrl":"https://itunes.apple.com/us/reviews/id31358958","version":"2.3.1","score":5,"title":"Great device","text":"This device is awesome, we are able to control our commercial gates remotely without any fancy setup. Highly recommend.","updated":"2018-05-22T04:39:40-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"6002230311","userName":"Ak30882","userUrl":"https://itunes.apple.com/us/reviews/id784362033","version":"2.4","score":1,"title":"Total trash!","text":"Was painful to install. App setup requires professional skills. In less than two years, two out of three relays on the device are dead!! Contacted support and they had nothing to offer. If you’re outside the one year warranty, all they offer by means of support is a 15% discount on the next piece of trash!","updated":"2020-05-27T15:06:12-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"6110166816","userName":"6969Grob","userUrl":"https://itunes.apple.com/us/reviews/id545660033","version":"2.5.1","score":1,"title":"Still broken.","text":"This thing is junk. I never was able to get it to work.  A year + later tried again and now it won’t even attempt to connect to WiFi.  Where’s the green light???  Tried installing new software on the sd card and it’s 7 GB ? Seriously??","updated":"2020-06-22T17:21:25-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"2435457344","userName":"hodoubleg","userUrl":"https://itunes.apple.com/us/reviews/id140846179","version":"2.3.1","score":4,"title":"Gets the job done","text":"I would really like to see a widget for the iPhone. Also, maybe an animation of a gate instead or a garage door.","updated":"2018-04-17T20:47:06-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"3669940072","userName":"Adm Sandecker","userUrl":"https://itunes.apple.com/us/reviews/id35302890","version":"2.4","score":4,"title":"Really needs Car Play support","text":"Please add Car Play support would love to get rid of garage door remote. Surprised this isn’t offered.","updated":"2019-01-19T08:36:04-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"7054913814","userName":"TheMidniteCoder","userUrl":"https://itunes.apple.com/us/reviews/id22461235","version":"2.5.2","score":1,"title":"No longer works","text":"If you need to set your device up again, it just times out. Product no longer works. It looks like it has been abandoned.","updated":"2021-03-01T18:20:10-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"6028805255","userName":"mbd_int","userUrl":"https://itunes.apple.com/us/reviews/id43807483","version":"2.4","score":1,"title":"Broken app","text":"Everything worked fine for several years but after recent iOS updates App no longer connects to GoGoGate:\n- via LTE\n- via AppleWatch\n\nIt only works in local WiFi and even then when you switch WiFi networks you lose connection again. \n\nThe App is in bad need of update - it has been a year since last update!","updated":"2020-06-02T23:54:58-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"6468273341","userName":"Weaver6697","userUrl":"https://itunes.apple.com/us/reviews/id219525409","version":"2.5.2","score":4,"title":"Add Carplay","text":"Great app but would like to see an integration with Apple Carplay.","updated":"2020-09-25T14:03:47-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"1510952512","userName":"Jlsjlsonhuyt","userUrl":"https://itunes.apple.com/us/reviews/id30345491","version":"2.0.4","score":3,"title":"App works but set up is not so good","text":"As noted.  The app works pretty well but I'd like to see the ability to customize the alerts (such as the amount of time the door is left open before an alert is sent).   Additionally the writing on a iPhone 6 is near impossible to read within the admin screens.  No for setup - A not so handy quick start was included.  Do yourself a favor and toss it in the trash and go online for the real instructions.   One big issue I was running into was the wifi password.  I entered what I thought was the correct wifi password.  The system didn't return any error message stating wrong wifi password.  I tried to go into admin functions and it wouldn't go and never turned me onto the fact I used the wrong password.   After resetting the system twice I finally caught on and entered the correct password and every thing went as described in the online instructions I had to search for.  Fix install problems and I'd happily give it five stars.","updated":"2016-12-28T13:56:18-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"1194897680","userName":"HRB811","userUrl":"https://itunes.apple.com/us/reviews/id20928398","version":"1.05","score":3,"title":"Remote software","text":"Works pretty well-functional, clever.  It does need some UI improvement; the backdrop photo is an open garage door--whether the door is open or closed, confusing and large, at about 80% of the screen.  The open-close button could be easily twice the size that it is, since that's the primary purpose of the app.  Also, be nice to control the visual-light warning apart from the audio-tone warning when remotely triggering the doors.","updated":"2015-05-09T14:48:35-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"1550296570","userName":"tribum","userUrl":"https://itunes.apple.com/us/reviews/id37540283","version":"2.0.4","score":4,"title":"Great Device!","text":"I had the original GoGoGate but decided to upgrade since this one will tie into my home automation setup.  The first one didn't have that option.  What I'm really excited about is the surveillance camera option....(however I don't like the fee for the app!).\nI have lots of expensive tools and a boat in my garage and this device will make sure the garage door stays closed when I'm not home!  I gave it 4 stars since the app is still a bit clunky.","updated":"2017-02-22T14:31:59-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"1206174513","userName":"Shelby0831","userUrl":"https://itunes.apple.com/us/reviews/id121260192","version":"1.05","score":1,"title":"Not Worth It","text":"I have had the Gogogate for over a year with only a few network issues. Would like to upgrade to gogogate2 but refused to pay the $49 a year to grant more than 10 people access to my gate. By the time I get family members and weekly service companies like lawn care and pool service I am at 12 so now I have to pay $49 a year just to use the app make it a 1 time fee in lot of 10 and maybe you could justified it but year after year this gets expensive I have had my gate for over 10 years that would be all most $500 just so people could use my gate.","updated":"2015-06-02T03:21:19-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"1703991086","userName":"Mike87389","userUrl":"https://itunes.apple.com/us/reviews/id114720779","version":"2.0.4","score":4,"title":"Software is buggy","text":"All in all this works great but there are bugs to be fixed. Installation is extremely easy. \n\n1.  All though I have set users as LTE and wifi the LTE is not working correctly for other users except the admin. Not sure if it takes time to sync but it says \"not connected\" from LTE for users outside of the admin \n\n2.  I get notifications saying the door is open even though it's not \n\n3.  When I check to \"remember me\" on the admin page it doesn't sometimes (random)\n\n4.  To enable \"remote access\" with the key can take some time but will eventually work\n\n5.  Do other users that have full access get notifications of the door being opened or is this only for admin?","updated":"2017-07-29T16:07:14-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"1336131764","userName":"drjdawg","userUrl":"https://itunes.apple.com/us/reviews/id30525001","version":"1.1.1","score":3,"title":"Needs Update Home Screen","text":"I would like to see all three garage door statuses on the home screen. Notifications are not long in the the iPhone Notification Center. Door still open notification is limited to two announcements, 10 minutes in and 20 minutes. Would like to see some flexibility and options in door still open notifications.","updated":"2016-02-20T14:57:18-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"4012883170","userName":"iSeeker98","userUrl":"https://itunes.apple.com/us/reviews/id150138918","version":"2.4","score":3,"title":"I like it. Setup not easy","text":"This took a while to set up, not the physical install but the setup process. It is not intuitive and the instructions are lacking in detail at points. \n\nAlso, i can’t find anywhere in the app that tells me if there is a firmware update. \n\nIt does work once installed and it does work with Amazon Alexa – although I’ve never found a use for the voice control. I set this up with IFTTT to close every night at 11 PM As a precaution so the garage is not left all night open if in fact it is open","updated":"2019-04-14T12:32:32-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"1665477302","userName":"Aniz mom","userUrl":"https://itunes.apple.com/us/reviews/id15959681","version":"2.0.4","score":1,"title":"So unsure at this point","text":"Maybe once I actually get it up and running I will raise my rating. I am fairly good at figuring out how to add new electronics items to my phone, computer etc but this one is a pain. So far I have spent about 5 hours and I think it connected. But app wasn't clear so deleted and went to start over now I'm not having any luck. It's a good thing I have an actual gate Opener or I'd be stuck at home. It's the weekend so am waiting till mon to hear back from customer support. 😆.","updated":"2017-07-01T18:46:58-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"1242821479","userName":"KenKohler","userUrl":"https://itunes.apple.com/us/reviews/id146544322","version":"1.07","score":5,"title":"Love it","text":"I installed the app a couple of weeks ago & I love it. I wish it supported my Vivotek camera but I realize they can't support every camera out there.  I had a problem that corrupted the SD card and tech support thru email was very fast and thorough.","updated":"2015-08-13T23:15:45-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"1190377378","userName":"annie511","userUrl":"https://itunes.apple.com/us/reviews/id31000140","version":"1.0.3","score":4,"title":"Fantastic","text":"Gogogate 2 very easy in install, directions clear. Only took 5 minutes to set up and 5 minutes to install. 5 more minutes to install on 3 more phones!\nOnly suggestion I would make is to develop a today view widget and a watch widget.\n\nGreat item!!!","updated":"2015-04-30T13:36:24-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"1355559425","userName":"Jason Rehfeld","userUrl":"https://itunes.apple.com/us/reviews/id12850117","version":"1.1.1","score":5,"title":"Works flawlessly","text":"Works well, easy to install and connect to existing wifi.","updated":"2016-03-29T14:23:18-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"1192486486","userName":"Jeffreici","userUrl":"https://itunes.apple.com/us/reviews/id32728900","version":"1.04","score":5,"title":"Very cool","text":"Love the app and the technology.  It's very useful to be able to open the garage door remotely.  Very simple to install.  I can't wait for the Homekit update","updated":"2015-05-04T15:40:56-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"1709033587","userName":"Toshibo","userUrl":"https://itunes.apple.com/us/reviews/id106698538","version":"2.0.4","score":4,"title":"Crashing","text":"Please make iPad compatible!","updated":"2017-08-01T23:13:36-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"1402564695","userName":"marcoU2","userUrl":"https://itunes.apple.com/us/reviews/id85557373","version":"2.0.2","score":1,"title":"Apple Watch no longer working after recent update","text":"Help! Apple Watch no longer works since the most recent update!","updated":"2016-06-29T12:56:11-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"1403008834","userName":"Jputaztec","userUrl":"https://itunes.apple.com/us/reviews/id85142446","version":"2.0.2","score":1,"title":"Apple Watch Crashing","text":"It doesn't work on Apple Watch now after update, which is the entire reason why I bought it.","updated":"2016-06-30T07:50:23-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"1316083512","userName":"Dr Jurgen k","userUrl":"https://itunes.apple.com/us/reviews/id15734784","version":"1.1.1","score":1,"title":"Review of new app","text":"I shouldn't have updated my old version.  This one constantly hangs and is not responsive on my iPhone 5s.","updated":"2016-01-13T17:55:46-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"6055832651","userName":"TheTobic","userUrl":"https://itunes.apple.com/us/reviews/id363129529","version":"2.5.1","score":5,"title":"Update:Remote access issues still happening","text":"Update June 9 2020:  as expected, the firmware and app were updated. I had to reload the unit from scratch. But, we are back to working again! Still a great and solid unit.    \n\nPrevious review: Been rock solid for several years. This week, noon. Remote access broken.  Then a firmware patch, remote Access still broken.  Am sure they are working on it.  But in the mean time, I can’t operate my unit","updated":"2020-06-09T11:35:00-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"1415090998","userName":"iRay1","userUrl":"https://itunes.apple.com/us/reviews/id147496031","version":"2.0.3","score":3,"title":"Gogogate2","text":"Easier to setup then original gogogate. I like the optional hardwired sensor. \n\nI don't like the app!!! On 1st gogogate it was a button. You click, garage door moves, click again it stops, click again it goes opposite of 1st direction! JUST LIKE HAVING OEM REMOTE IN YOUR HAND! Gogogate 2 uses a slide up to open & slide down to close. So full open or close. Can't open part way for ventilation. If you have gogogate 2 at multiple locations you switch can between them but all locations pop up as an alpha numeric code! Gotta memorize which house is which😣.","updated":"2016-07-18T21:43:27-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"3947604483","userName":"maniacalyeti","userUrl":"https://itunes.apple.com/us/reviews/id41073452","version":"2.4","score":2,"title":"Works okay but could use some modern features","text":"It works okay but it’s missing:\nEither HomeKit support (preferred) since you no longer need hardware to make that happen it could be added via a firmware update. \n\nOr\n\nAt least Siri shortcuts support so you unlock your garage/gate with just your voice in the car rather than having to open an app. \n\nAlso the interface is a little ugly and gimmicky. Why not just have a list of gates/doors and an open button. Next to each. No need for each one to take up the whole screen. And why swipe up and down? Just make it a friggin button!\n\nFinally why do you need a random code to set this up? Can’t it just be set up with a username/password and then that’s all you need? Just makes this whole thing seem second rate.","updated":"2019-03-30T11:18:27-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"},{"id":"3911483825","userName":"Med dement","userUrl":"https://itunes.apple.com/us/reviews/id112933756","version":"2.4","score":1,"title":"Nope not this one","text":"Lots of choices on control of garage doors out there. This one has No support  and after 3 hours and 11 set ups. It’s in a box back to amazon very unpredictable on set up network and if you set it up and later move it you get to start all over.  No paper at all. I will pass on this one. \n\nMed","updated":"2019-03-22T02:57:15-07:00","url":"https://itunes.apple.com/us/review?id=964757967&type=Purple%20Software"}]