[{"id":"3252658531","userName":"BriSprad","userUrl":"https://itunes.apple.com/us/reviews/id13675035","version":"3.2.4","score":3,"title":"Good but could do more","text":"I love my BloomSky and Storm. It’s a lot fun to keep track of weather this way. The app is good but I feel could be better. Like other reviews, I would love a way to see all my data through the app. The website is nice but not iOS friendly. Also, I would love to see a high and low for each day, maybe with each thumbnail for the time lapse. Often, the predicted high ends up being lower than my current temp-just looks weird to me. \n\nJust a few suggestions! Thanks for a fun and interactive way to look at weather.","updated":"2018-10-01T11:51:02-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"2278466387","userName":"PhilsfanLar","userUrl":"https://itunes.apple.com/us/reviews/id43235735","version":"3.2.0","score":4,"title":"Would like to see more detailed data","text":"I have a Sky and Storm and enjoy the daily time lapses, as well as seeing the time lapses of others. I would like to see more detailed data in the app on my devices without having to log in to the dashboard. I created a Weather Underground account and linked my BloomSky, which allows me to easily see more data, but I would rather not have to check two places. I have found customer support to be very good at responding to a couple of issues I had with my devices initially.","updated":"2018-03-06T15:51:07-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"5080317406","userName":"Geofa","userUrl":"https://itunes.apple.com/us/reviews/id42199877","version":"3.3.3","score":5,"title":"Problems with the latest update","text":"With the release of the latest iOS update a few months ago I would get dropped to the desktop when trying to view a video. With the latest update I get dropped by merely scrolling half way down the app. I give 5 stars because it has been wonderful hardware as one of the first users and I am hopeful this will soon be fixed-thanks!","updated":"2019-11-03T08:58:16-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"2031125695","userName":"Boucher15","userUrl":"https://itunes.apple.com/us/reviews/id41449658","version":"3.1.9","score":3,"title":"Needs work","text":"Good app, not great. The best feature of the BloomSky Weather Station is the camera and time lapse. The app design does not present the image or time lapse well. The sliding temp and stats overlay covers the bottom quarter of the image. Why? I have to pull it down the see the full pic. The time lapse has the player controls also covering the bottom part of the image before it disappears. Also, display the battery level as a percent rather then an icon that looks like a battery.  Let’s clean that up and have the app match the station in quality.","updated":"2017-12-26T22:22:43-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"3166534714","userName":"Ibphd","userUrl":"https://itunes.apple.com/us/reviews/id30951105","version":"3.2.4","score":2,"title":"slider","text":"the slider is useless. scrolling through the day makes it a random image generator, assuming it works at all.\n\n9/8/18\nSlider functions better after the latest update. However, a few caveats; once u touch the slider your finger must remain; difficult to go to a specific spot. It would be nice to have a way to go to a specific image, time stamps would suffice. However, the app is basic and I may be asking too much. Thus, i export to another program to view my images. There are other problems but “nuff said”. I hate whiners, the entire Atlanta ocean, any animal named Fluffy and cauliflower, not necessarily in that order.","updated":"2018-09-08T01:04:50-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"5791104642","userName":"Scdftrdfbjjhgg","userUrl":"https://itunes.apple.com/us/reviews/id210800481","version":"3.3.7","score":3,"title":"Stopped Working After Update","text":"My Bloomsky has been faithfully working now for a couple years.  Concurrent with this last update which I just installed,  my station has lost connectivity to my wifi.  Can not get it to reconnect.  Wifi and all other clients are working normally.","updated":"2020-04-10T06:34:30-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"7569959793","userName":"John/.?","userUrl":"https://itunes.apple.com/us/reviews/id1213983279","version":"3.3.12","score":5,"title":"New and Improved!","text":"There are many negative reviews of this app and the products but they are mostly a year old or more. For me, this app has worked flawlessly! Their products seem to have been greatly improved in quality.","updated":"2021-07-12T18:43:15-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"8121698303","userName":"GV Jay","userUrl":"https://itunes.apple.com/us/reviews/id114472566","version":"3.3.12","score":2,"title":"Falls very short","text":"The Bloomsky hardware is brilliant. The app falls far short. Daily lots of information is gathered but there’s no way to review, study or compare it. Even simple 24 hour temp hi/low, rainfall and wind speed aren’t easily accessible. Yes, there’s the (poor) dashboard but far too much work to use. \nIt seems Bloomsky is highly influenced by  hardware engineers. That’s the tough part and it’s been done very well. Now, PLEASE get the easier app written up to par. \nPlease….","updated":"2021-12-12T01:51:45-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"5836444407","userName":"Lgdunn","userUrl":"https://itunes.apple.com/us/reviews/id337981750","version":"3.3.7","score":2,"title":"PROVE US WRONG!","text":"We have both sky and storm, and this is the 3rd wind vein we have had, we had it replaced, but communication between company and us have fallen flat.... we spent a lot of money on the system, and it doesn’t WORK... WE DINE WHAT WE WAS TOLD TO DO AND THE WIND VEIN STILL DOEST SPIN, WE ARE OVER IT AND ITS BEEN MONTHS NOW...WE wish the company would have a better product or replace things... we like the products, but have lost faith in the company... PROVE US WRONG!","updated":"2020-04-19T17:27:34-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"6815913052","userName":"k7ktp","userUrl":"https://itunes.apple.com/us/reviews/id132565239","version":"3.3.10","score":1,"title":"Needs a lot of work and better support","text":"I was one who supported this endeavor when being developed.\nNow since it took me two years to install both units, there’s no longer support for the units.\nThe sky unit seems to be working ok, however the Storm unit fails in most of all.\nThe unit at times will transmit wind speed. But the rain gauge is a total failure.\nI live in Oregon and we get a lot of rain, but this unit does not count the amount of rain it has collected.\nCalled support and they failed to give very little assistance. I even offered to purchase a replacement.\nBut due to Covid they refused to do anything.\nFor what I paid out for this new system I would have expected something that works.","updated":"2020-12-31T15:53:14-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"2450319936","userName":"mightymolar","userUrl":"https://itunes.apple.com/us/reviews/id35349954","version":"3.2.2","score":3,"title":"Buggy WiFi connection","text":"Been using the BloomSky unit for two years. I get a new router and suddenly I cannot connect again. Customer Service/Support web page is very “thin”... oh well","updated":"2018-04-21T09:24:18-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"5120105584","userName":"Josefdz","userUrl":"https://itunes.apple.com/us/reviews/id34601468","version":"3.3.3","score":1,"title":"Works only for few days.","text":"I have bought in total around 15 BloomSky. How many I have right now running? Zero! The longest that I had a unit running was one year and then stopped working. I had all of them running with solar panels. I called them and got replace two in total. Those stopped working after 7 months. I guess they are not made to last long. Good concept, but not reliable.","updated":"2019-11-10T11:58:05-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"6055424474","userName":"steevil","userUrl":"https://itunes.apple.com/us/reviews/id37623861","version":"3.3.8","score":1,"title":"Sad state","text":"Between the under developed software and poor customer service I’m really unimpressed with the service. The app is never updated, time lapse notification never worked, they splash their logo all over the photos and videos. I bought this, take your logo off of my media. Rain sensor on both units died ... idk. It was cool for less than a year.","updated":"2020-06-09T09:20:01-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1762117979","userName":"alang1203","userUrl":"https://itunes.apple.com/us/reviews/id194189370","version":"3.1.9","score":5,"title":"Update","text":"The latest update does not allow the temperature, data t be moved down.  This happened once before.","updated":"2017-08-30T11:04:54-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"3483307134","userName":"MSD SR","userUrl":"https://itunes.apple.com/us/reviews/id40857186","version":"3.2.5","score":5,"title":"Great  device.","text":"I look forward to seeing the video each day. It's a cool device and this is my second one.","updated":"2018-12-01T17:39:15-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"5441301412","userName":"lolopuff","userUrl":"https://itunes.apple.com/us/reviews/id24018345","version":"3.3.4","score":1,"title":"Terrible UI","text":"Storm device set up and no user manual- Expectations are everyone understands the language of technology. Included instructions were scanty 1/4 page, 2 sided - primarily pictures. and no follow-up in the box where to go for more. Full instructions should be included!!!","updated":"2020-01-23T20:51:19-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"7445919118","userName":"kipsvet","userUrl":"https://itunes.apple.com/us/reviews/id42547537","version":"3.3.12","score":3,"title":"Not real accurate","text":"Temperature is close but not right on about-5 to +5 degrees at times hard to get a good place that view more of area","updated":"2021-06-09T12:06:49-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"6630906269","userName":"iamasoul","userUrl":"https://itunes.apple.com/us/reviews/id195958167","version":"3.3.10","score":4,"title":"“We’ve only just begun”","text":"Looking forward to future enhancements.","updated":"2020-11-10T13:57:26-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"3002608643","userName":"Sunflare98","userUrl":"https://itunes.apple.com/us/reviews/id38541937","version":"3.2.3","score":1,"title":"It's worthless don't waste your money","text":"Works as a webcam for the sky. That's about it. No historical weather data at all. Limited forecast data. Rain gauge is not reliable. Real time data is virtually non-existent. Time lapse video of the sky is good - when it decides to work. Horrible waste of money. Don't waste yours.","updated":"2018-08-01T13:15:49-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"5826468438","userName":"Data missing","userUrl":"https://itunes.apple.com/us/reviews/id230784520","version":"3.3.7","score":3,"title":"WiFi quit connecting","text":"Love my BloomSky but cannot get it to connect to the network.  What happened?","updated":"2020-04-17T14:12:16-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"2599727184","userName":"Fraggboy","userUrl":"https://itunes.apple.com/us/reviews/id36265956","version":"3.2.3","score":2,"title":"App doesn’t show rain rate.","text":"The latest app doesn’t show the rain rate correctly. Also, when you try to organize your favorites, it has a mind of its own and changes them.","updated":"2018-05-26T10:17:42-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1336247925","userName":"ChrisgriceIdbl","userUrl":"https://itunes.apple.com/us/reviews/id186289965","version":"2.1.12","score":2,"title":"Good start/ but need options","text":"This is a good start the view is good, temp is great. Need a way to add sensors, wind speed, direction, is pressure rising or falling or steady? Rain fall accumulation? I don't see any additional ports or option for expanding the system in the future. The app is ok it's not cool that everyone has to signup to view my station or camera as I've found most just don't. While this is cool I will primarily rely on my Davis gear for really weather tracking. Hopefully this is just the beginning because I like where this is headed.","updated":"2016-02-20T20:11:06-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"3869422732","userName":"N1MIE-Chip","userUrl":"https://itunes.apple.com/us/reviews/id3150730","version":"3.2.8","score":4,"title":"Good App","text":"I like the app. I like the hardware. I would like an iPad specific version of the app. That oughtn’t be that tough.","updated":"2019-03-11T06:20:30-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"7957767317","userName":"Ryan Paris","userUrl":"https://itunes.apple.com/us/reviews/id206096697","version":"3.3.12","score":1,"title":"Total Loss","text":"There is nothing intuitive or easy about this weather station. It will not reconnect to the wifi.","updated":"2021-10-26T19:48:05-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"5768967633","userName":"Yldbyl","userUrl":"https://itunes.apple.com/us/reviews/id125551555","version":"3.3.6","score":1,"title":"Missing Data","text":"Now not only does the wind gusts not get pushed to Weather Underground, all of the Storm data is absent from the Bloomsky UI in their own app.","updated":"2020-04-05T19:40:16-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"5763146494","userName":"d47m122","userUrl":"https://itunes.apple.com/us/reviews/id33290081","version":"3.3.6","score":1,"title":"Just crashes","text":"Just crashes when trying to view my bloom sky. :/","updated":"2020-04-04T14:40:37-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"3097128215","userName":"jegomez","userUrl":"https://itunes.apple.com/us/reviews/id24857669","version":"3.2.4","score":1,"title":"Must be a snooper","text":"Requires that you create an account. To look at the weather ?!?!","updated":"2018-08-21T18:14:57-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1248576233","userName":"Phreatic Ramblings","userUrl":"https://itunes.apple.com/us/reviews/id144331615","version":"2.0.0","score":4,"title":"Patience will pay-off","text":"I had a nice chat with a BloomSky representative today as she picked my brain about how to make the app better for educational use.  Based on what she told me, many improvements to the app are are in the works, with a few larger changes in the coming months.  As it stands, I mostly use the app to view my personal weather station and I love the daily time-lapse videos.  For this purpose the app is fine, and I have no trouble reading the text.  My 70yr old dad did have a bit of trouble, however.  I can see how asking for clearer/larger fonts in the future is a legitimate gripe.\n\n Trying to find other stations on the Bloomsky network without mapped or GPS tagged locations is kind of hard, so I just wait for an interesting station to get shared on twitter. \n\nWhy the 4 stars?  I have faith that many small issues will be addressed, and as the new promised rain gauge and wind sensors will make the unit and app a bona-fide awesome weather station.   As an educator it sometimes takes practice (and itterations) to make perfect.","updated":"2015-08-25T16:59:37-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1376405242","userName":"Jeff12","userUrl":"https://itunes.apple.com/us/reviews/id30046593","version":"2.2.6","score":4,"title":"Great Product, App Improvement Ideas","text":"I'm very pleased with my BloomSky station, however I find that the app is very basic. I understand that the emphasis of BloomSky is on the great time-lapse photos the station is able to capture, however I think most people who buy a weather station are equally excited about the weather details as they are capturing the great images of it. Essentially, I wish the app had more options for exploring the weather measurements that the station is capable of obtaining. Things to consider would be graphical data for past measurements. Ideally these could all be over-layed on the same graph (see WeatherUnderground's interface). Possibly a forecast graph could be included as well. Sunrise and sunset times for the station's location would be a neat aspect to include too.\n\nOverall I am very pleased with the product and the app. I just think adding a bit more weather details to the app would be neat.","updated":"2016-05-10T05:04:45-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1290900280","userName":"jsegal2","userUrl":"https://itunes.apple.com/us/reviews/id100390942","version":"2.1.3","score":4,"title":"Cool and useful, want more functionality","text":"If you travel or check the weather in different areas, give it a go. I’m a weather geek, so this is right up my alley. The app still has some issues, but I've been using it from the early on and it's been getting more stable with each update. There has been a pretty consistent addition of new features- the addition of the map view made the app way more convenient to use and was a huge feature improvement, not sure why it took so long to include in the app. Would like to see faster load times, but it's not terrible as is. The time-lapse view for each location is way cool, but I'd like to be able to scroll through the video rather than have to restart each time I want to view it again.  \nBottom line- solid start for a new idea, looking forward to seeing what they can do given time.","updated":"2015-11-23T22:48:31-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1316938803","userName":"Jenny_4_Cupcakes","userUrl":"https://itunes.apple.com/us/reviews/id144207287","version":"2.1.9","score":5,"title":"Great app - didn’t think I would use it but love it","text":"I was originally dubious about this app, since I didn’t think I needed real-time weather reporting. However, I’ve found that I’ve been using it a lot — looking up temperature in the nearby open-space preserve where I go running; checking out the weather where my friends are vacationing (and being super envious!); planning for a trip to the city; even exploring other countries and catching a glimpse of what the sky there looks like. I love the sky time lapses; I’ve even posted them on Facebook when there’s a particularly amazing sunset or storm. It’s also nice to know the actual temperature, rather than what other weather apps predicted would be the average temperature four hours ago in my general area. Fun for kids and great for people with pets! :)","updated":"2016-01-15T11:03:44-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1545398745","userName":"volutabrum maximus","userUrl":"https://itunes.apple.com/us/reviews/id110467957","version":"3.1.6","score":4,"title":"Great App","text":"This is a great little App.  It has improved quite a bit since I first started using it.  I love the ability to explore other BloomSky stations and favorite/follow them.  I think the ability to view the cam pictures of the last week as quite cool.  The weather buzz feature is a nifty way to share local weather events with station followers.  But the App could be better... I think it needs to display wind chill/heat index.  Wind chill and heat index is import weather info.  And while the cam history is nice I'd really like to see some past weather data history/graphs.  I know, I know that's what the dashboard is for but its not exactly small device friendly and it seems to be down an awful lot.  But that's for a different review, I guess, this is about the \nApp.  And finally... optimizing it for the IPad would be nice.","updated":"2017-02-15T20:51:58-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1638705685","userName":"Techadopter","userUrl":"https://itunes.apple.com/us/reviews/id29570252","version":"3.1.7","score":1,"title":"Pretty much worthless","text":"BloomSky storm wind and rain monitoring. According to AccuWeather, wind speeds are 25 mph. According to storm wind speed is zero.   Visual check of the storm shows that it's spinning wildly and yet still reporting zero mph wind speeds. \n\nMy point?  Storm is an expensive, unreliable piece of plastic.\n\nUpdate:\nI just received this note from the developer:\n\nBloomSky Inc responded to your review of\n\nBloomSky Weather\nBloomSky Inc\n\"Hi Tech, We'd like a chance to help troubleshoot the issues your experiencing, please contact our tech support team if you have not already done so. It's likely that the problem lies in the hardware, not in the app itself.\"\n\nDo you want to update your review?\n\nYou can also contact the developer.\n\nResponse:  the link to respond to the developer takes one to a list of FAQ's but it does not provide a way to actually connect with the developer. FAIL\n\nUpdate 2:\n\nMy storm quit working completely earlier this year. I contacted support and was told they couldn't see my unit in their system so they couldn't troubleshoot. My response was that that was why I had contacted them for support in the first place. After two rounds of that nonsense, I gave up. \n\nStorm has been upgraded to a worthless piece of plastic.","updated":"2017-06-09T06:47:45-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1498449290","userName":"n1mie","userUrl":"https://itunes.apple.com/us/reviews/id29329866","version":"3.1.0","score":4,"title":"Mixed Feelings","text":"I like this app but I have some mixed feelings about places where it leaves me wanting more. First there isn't an iPad app, or a Watch app. There ought to be both frankly. Second the AppleTV app is a complete dud. I can't get it to show me anything except something in CA with false or missing data. No video, can't get my locale even after it's been added. Third, as for this app here, well I'd like to be able to look at trends of data from my device over a day, a week, maybe a month or more. I like the videos, they are cool, but the hard data collected by the instruments would be much more valuable long term.","updated":"2016-12-08T18:34:22-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1376793226","userName":"59psi","userUrl":"https://itunes.apple.com/us/reviews/id36788935","version":"2.2.6","score":4,"title":"Pretty cool cost effective station","text":"Granted there's no hardware required to use this app. I find having my own weather station that's reporting to weather underground to be very cool. It's easy to setup and so far has been reliable. \n\nI would like the time lapses to have a few more frames to add a little more motion to the day, especially for win detection. \n\nIf there was a way to add a rain gauge as well as a wind speed and direction indicator then this would be near perfect. The little water sensor pad today takes quite a while to dry out after being wet. Unless it's dried out its not going to generate a second alert.","updated":"2016-05-10T23:52:02-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1256716937","userName":"Skidoctor","userUrl":"https://itunes.apple.com/us/reviews/id130238534","version":"2.0.1","score":5,"title":"When your weather station calls","text":"Bloomsky is a work in progress and it is too cool when from the other side of the world you can reach out and take a peek at what is happening at home. When your weather station sends you an SMS that it is raining you know that this really is really a first step in really being remotely connected to the weather in your location. This is truly a unique product that allows you to remotely view a location and observe what is happening over a period of time.","updated":"2015-09-12T17:47:42-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1389068621","userName":"brucem142","userUrl":"https://itunes.apple.com/us/reviews/id42131907","version":"2.2.6","score":5,"title":"Excellent","text":"BloomSky is an amazing device for weather buffs. I had a problem with my first one and James from the support group was fantastic in helping solve the problem. He offered to replace it, which he did.  After receiving a new BloomSky I was still having a problem getting it to connect to my wi-fi. Made a phone call and James helped again. I have a Verizon Fios router that handles both 2.4 and 5 MHz. He helped to connect it and now works fine. Highly recommend this device.","updated":"2016-06-04T17:14:52-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1410609543","userName":"CircusDog","userUrl":"https://itunes.apple.com/us/reviews/id17758599","version":"2.2.6","score":1,"title":"Doesn't work, support non-existent","text":"I got one of the bloomsky weather stations for my birthday.  Barely any instructions in the box-- just says to download the app, tell it to add the device, and follow the instructions on screen.\n\nThe instructions tell you to put your wifi password into the app and it should find the device and connect everything up.  This never worked for me, despite multiple hard resets and confirming that my home network was configured properly, etc.   There are no configuration settings visible on the device itself or in the app, so it's very difficult to determine why it didn't work\n\nApparently, this failure to connect is quite common, because the app connected me to a page on their website that described different failures and presented a form to fill out, saying that technical support would contact me within 24-48 hours and resolve the problem. I never heard from them despite several attempts to contact them.  \n\nI returned my unit and recommend that others avoid this device and app.","updated":"2016-07-12T17:38:16-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1343688429","userName":"ajvpharmd","userUrl":"https://itunes.apple.com/us/reviews/id42046655","version":"2.2.1","score":5,"title":"Nifty way to view the weather, consistently improved.","text":"Really fun to be able to search and view weather stations with built in webcams.  Their app is consistently updated with new features and bug fixes and the developers actually listen to feedback.  \n\nI hope they'll expand (maybe a search filter) to also show weather stations outside of their network which also have webcams.","updated":"2016-03-06T04:09:42-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1297961805","userName":"VagabondTom","userUrl":"https://itunes.apple.com/us/reviews/id482130739","version":"2.1.5","score":5,"title":"Way better than a sun or raindrop symbol!","text":"This app provides you with realtime pictures of the sky at your favorite outdoor places. Now I now what the sky looks like before I leave for my favorite hiking trailhead. Way better than the weather apps that just give you a picture of a sun, cloud or rain drop. I can now check the app and make my own opinions about the weather before I head outside. A must have for any outdoor enthusiasts!\nAwesome app!","updated":"2015-12-08T18:54:47-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1442440270","userName":"the76Chick","userUrl":"https://itunes.apple.com/us/reviews/id40059870","version":"3.0.3","score":5,"title":"Hated The Temperature Graph- Now You Can Move It!","text":"I love this app. I have been with them almost since the start. Many frustrations along the way. Almost gave up when they added temp graph- thus blocking the \"view.\" Now, however, you can swipe it out of your way. I think it's great they listened to customers and am glad I stuck it out. It is the most relaxing calming app I have - I use it all the time. Love to watch sunrises and sunsets!","updated":"2016-08-31T12:58:14-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1249068453","userName":"r0yalewichees3","userUrl":"https://itunes.apple.com/us/reviews/id48841751","version":"2.0.0","score":4,"title":"Still in progress","text":"I don't have a problem seeing the grey on white font, and I think viewing the timelapse is easier with this version. I have had a problem with my battery indicator reading full when the device hasn't been charged in more than a week.\n\nI also have been in contact with the company, and they are receptive to what is good/bad about their product/app. \n\nI like the app overall, more so now that I've had some days to get used to it.","updated":"2015-08-26T18:47:02-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1307709384","userName":"iheartmobile","userUrl":"https://itunes.apple.com/us/reviews/id25825602","version":"2.1.8","score":5,"title":"Really cool way to get your weather!","text":"My friends have these BloomSky weather stations set up, and through the app I can directly follow their weather stations!  So when I check the weather in Palo Alto, I see a picture of the actual sky captured from my friend's backyard, paired with the real-time temperature, humidity, etc. I'm following other user's weather stations in Yosemite, Tahoe, Brazil, Colorado. Last night's Yosemite time-lapse was AMAZING!!","updated":"2015-12-28T14:25:44-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1434680512","userName":"RodAmes","userUrl":"https://itunes.apple.com/us/reviews/id13932983","version":"3.0.3","score":4,"title":"New app is fine","text":"I originally said I didn't like the new app. After using it, my complaints are no longer completely valid. You can easily move the temperature overlay out of the way. Getting to the time lapse video isn't that much of an issue. I'd like a unique iPad version, but that isn't much of an issue either. As long as they continue to improve the app, I'm good with that.","updated":"2016-08-17T17:14:33-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1331760299","userName":"thewxobserver","userUrl":"https://itunes.apple.com/us/reviews/id4208914","version":"2.1.12","score":4,"title":"Great start but needs improvement","text":"The app does just what is says it will do. Post weather information with a great view of the sky. Received a camera and it was easy to add to the network. Would like to see more share features to social media. It would be great to use the camera as a webcam with wunderground since I already a weather station posting data there.","updated":"2016-02-12T03:35:59-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1420642181","userName":"SoCalCos","userUrl":"https://itunes.apple.com/us/reviews/id105547105","version":"3.0.0","score":4,"title":"Nice update, but please don't overlap the image with the graph","text":"I like the update. It looks fresh and clean. The only thing I don't like is the temperature graph over the bottom of the image. The reason most of us bought the Bloomsky is because of the live weather image. Please don't ruin it by adding graphic elements over it. \n\nBut please keep up the great work. It is a great product that I love. Thank you.","updated":"2016-07-26T20:02:19-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1506460198","userName":"BurnsNvictoria","userUrl":"https://itunes.apple.com/us/reviews/id100174066","version":"3.1.2","score":5,"title":"I love my BLOOMSKY!","text":"I now have 2 BloomSky weather stations! I loved the first one so much, I had to get another. \nWe have one at our ranch and another at our main house to monitor weather conditions at both locations. The accuracy is spot on! \n The units are very easy to set up, even when your are not a techie!  \nI highly recommend BloomSky!","updated":"2016-12-21T19:43:12-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1330519172","userName":"pat B 01027","userUrl":"https://itunes.apple.com/us/reviews/id112006572","version":"2.1.11","score":4,"title":"Fun","text":"Camera is actually very good and set up was pretty easy. I have Apple Time Capsule and so a few extra step in setting up the unit - app works but often says unit offline when it is online so refresh button or something would be great. Looking forward to updates. Customer service was AWESOME - called and they called back to help answer questions","updated":"2016-02-09T14:25:17-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1318497141","userName":"flushhed","userUrl":"https://itunes.apple.com/us/reviews/id375295580","version":"2.1.9","score":5,"title":"Great app, but..","text":"If you want to see a time lapse in your local town and you don't live in a big city, chances are, you're out of luck. One camera that produces the time lapses costs over $200 dollars. The app is actually a really great idea and the design is flawless, but with a price tag like that, it may take a while to kick off.","updated":"2016-01-18T08:15:32-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1246167430","userName":"Snapshotdc","userUrl":"https://itunes.apple.com/us/reviews/id101363483","version":"2.0.0","score":4,"title":"Good and Getting Better","text":"Innovative weather hardware where the sky is the limit. The user interface is clean and intuitive if a bit buggy for now but that's to be expected when the focus has been on hardware and not as much on UI. Strongly believe that once the API is released that devs will be giving other weather apps a run for their money.","updated":"2015-08-20T17:10:16-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1326274461","userName":"Fire Bear","userUrl":"https://itunes.apple.com/us/reviews/id8804501","version":"2.1.10","score":3,"title":"Great app, lots of places to watch through search, but...","text":"I enjoy this app, using the search feature, I've found many awesome places to watch, I only have one issue. The latest update doesn't appear to allow for watching the time-lapse over data, rather, only on Wifi. I would like to have the option to watch on cell data, or, in Wifi.","updated":"2016-02-01T14:19:08-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1638659484","userName":"JosephToubes","userUrl":"https://itunes.apple.com/us/reviews/id35223719","version":"3.1.7","score":5,"title":"Not sure what the corrections were in the updated version, but..","text":"Spelling is better.  The IFTTT link in the setup gives a 404 page.  That is it goes to a page or link that doesn't exist.   The app works well with the Sky1, Sky2 and Storm .   I'd like to see some features such as  wind chill; heat index along with what is presently there.","updated":"2017-06-09T05:54:46-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1290729454","userName":"OutdoorEnthus","userUrl":"https://itunes.apple.com/us/reviews/id85652401","version":"2.1.3","score":5,"title":"Great App for Outdoor People!","text":"I love the fact that I can view real-time weather on my app before I head out the door to my desired location for hiking, bike riding, running, etc. Time to say bye-bye to annoying inaccurate weather icons!\n\nI really like how I can travel around the world by checking out people's BloomSky devices.","updated":"2015-11-23T12:36:13-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1324482360","userName":"Blueman615","userUrl":"https://itunes.apple.com/us/reviews/id101039292","version":"2.1.10","score":5,"title":"Infectious Real-Time weather facts!","text":"I have friends and relatives in quite a few different states and without asking them the famous question \"how is the weather\" I can see for myself in both real time and time lapse history. The Technology from this company is growing and exciting to see! Great job guys!","updated":"2016-01-29T11:13:37-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1290391897","userName":"Sharethrucloud","userUrl":"https://itunes.apple.com/us/reviews/id278677131","version":"2.1.3","score":4,"title":"Not perfect but very unique","text":"Bloomsky does not report weather as you would expect, to see the scenery of a destination in real time worth a lot of numbers, words or icons. Once I saved a couple favorite spots, checking whether becomes a different experience altogether. Definitely a unique weather reporting network to check out.","updated":"2015-11-22T18:24:46-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1331202455","userName":"Omnis Audis","userUrl":"https://itunes.apple.com/us/reviews/id31792166","version":"2.1.12","score":3,"title":"Cute","text":"Not sure I'd call it a weather app. More like temperature and sky camera app. It's cute. I like seeing my view while I am at work. Wish it snapped pictures for another hour, to get more of sunset. And wish it told you if atmosphere pressure was going up or down, so you could know if a front is moving in. \n\nAll that to say, it's not bad, but not great either. Hence the 3 stars.","updated":"2016-02-10T23:57:51-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1580130457","userName":"postmaster","userUrl":"https://itunes.apple.com/us/reviews/id32448532","version":"3.1.6","score":2,"title":"Not well thought I've all...app or hardware.","text":"Can't reboot Bloomsky device from app. No graphs of temp, pressures, etc. to show trends. You have to go to their website and login to your dashboard. Wordpress support is non/ existent. Camera is the only thing good by with the time lapse and the fish eye limits good viewing across canyons and long mountain views so that you see the sky as if you are in a bowl. Should have options for a different lens. Not well thought out overall.","updated":"2017-04-03T20:37:40-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1301527026","userName":"Somerandomdork","userUrl":"https://itunes.apple.com/us/reviews/id36227971","version":"2.1.7","score":5,"title":"Weather geeks geek out!","text":"If you're into weather and more importantly hyper local/crowd sourced weather you'll love this app. Plus it's free, there is no need to own a BloomSky to enjoy what the app offers. If you're a frequent Truckee/Tahoe visitor you will be happy to see so many devices already in operation throughout the are.","updated":"2015-12-16T11:03:40-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1590527293","userName":"ECKohns","userUrl":"https://itunes.apple.com/us/reviews/id85611392","version":"3.1.6","score":5,"title":"This thing is great!!","text":"I have had it just for a day but it is everything I wanted in a local weather app the off support and the camera are important to me and the data looks really accurate so far with no work involved.","updated":"2017-04-16T15:43:42-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1330810345","userName":"RetiredFFphotog","userUrl":"https://itunes.apple.com/us/reviews/id212474032","version":"2.1.12","score":1,"title":"Why does this require an account???","text":"As someone who has, and uses, multiple weather and nature related apps, I was exited to read that a nearby National Park had some new cameras installed. To see the time lapse videos, they said, just download this app. I did. After being presented with a log in/sign up page, I promptly deleted the app. I have no use for most apps that require you to have an account in order to use them. On top of that, I can't even connect to the developers web site.","updated":"2016-02-10T04:55:18-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1271128765","userName":"tomagain748","userUrl":"https://itunes.apple.com/us/reviews/id13669799","version":"2.1.0","score":5,"title":"Great new version","text":"I had several usability issues with the previous version and sent my comments to bloomsky. Updated today and WOW! All my suggestions rolled out! So pleasant to use now. Thanks Bloomsky for listening to your users and moving fast to implement. Great work!","updated":"2015-10-13T11:03:13-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1525832648","userName":"That_Mann","userUrl":"https://itunes.apple.com/us/reviews/id291671608","version":"3.1.6","score":3,"title":"Theirs no way to report sky devices.","text":"I've seen some people place there sky devices indoors and totally ruining the data. There needs to be a way to report these devices that are put indoors. It should notify the owner of the device that they should move there device to a suitable location.","updated":"2017-01-19T08:11:42-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1331377375","userName":"The Fishing Weatherman","userUrl":"https://itunes.apple.com/us/reviews/id491887201","version":"2.1.12","score":5,"title":"Quick and Easy!","text":"A quick and easy way to check the weather for the locations you want.  Intuitive interface makes the info clean, clear and simple.","updated":"2016-02-11T07:44:38-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1352986441","userName":"AZ Packer Backer","userUrl":"https://itunes.apple.com/us/reviews/id37026445","version":"2.2.2","score":5,"title":"Love It!","text":"Received weather station and set it up in one hour.  Had a couple of problems getting the weather station to link up with my router.  But, finally got it linked.  So far working flawlessly!","updated":"2016-03-24T17:00:43-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1349042903","userName":"Danwakeem","userUrl":"https://itunes.apple.com/us/reviews/id233581528","version":"2.2.1","score":4,"title":"Very cool app but need UI tweaks","text":"My dad got one of these for the house yesterday and it is very cool! I think this is a very interesting approach to monitoring the weather. This app is pretty nice but could definitely use some tweaking in the UI. \n\nAlso an API would be really nice to have so we can hook it into our businesses website and app.","updated":"2016-03-16T23:09:22-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1426162729","userName":"Kdfyimbgjjh","userUrl":"https://itunes.apple.com/us/reviews/id27519983","version":"3.0.1","score":5,"title":"Great app, great company!","text":"Originally three stars because the temperature blocked part of the picture taken by the weather cam. Updated app fixed that-which means this company LISTENS to its customers & takes care of problems. Keep the momentum going, Bloomsky!","updated":"2016-08-03T20:14:56-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1357380162","userName":"lurkingrue","userUrl":"https://itunes.apple.com/us/reviews/id3625800","version":"2.2.4","score":2,"title":"Software design lets down hardware","text":"The device is nice, but each iteration of the app gets worse.  Now they placed an annoying banner across the top that gives you useless info about places you don't care about... Why do they keep making it harder to get the info you want?  The designers have a bad case of \"we-know-better\"-itis, and keep forcing bad design down the users throats","updated":"2016-04-02T05:25:01-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1327106320","userName":"Stevo12s","userUrl":"https://itunes.apple.com/us/reviews/id111703799","version":"2.1.11","score":5,"title":"Great customer service","text":"Had trouble getting the data to upload but their customer service got it working quickly.","updated":"2016-02-03T04:39:08-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1342794841","userName":"xaxnar","userUrl":"https://itunes.apple.com/us/reviews/id36779782","version":"2.2.1","score":3,"title":"Mixed Results","text":"Having a personal weather station is fun - and getting a time lapse movie of the day is a nice bonus. This app needs some more polishing, as does the hardware. When it works, it's good. When it doesn't... I've had a hardware issue and trying to address it through this app is a bit of a pain.","updated":"2016-03-04T16:17:57-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1351429843","userName":"Iceintakeone","userUrl":"https://itunes.apple.com/us/reviews/id33262482","version":"2.2.2","score":5,"title":"Bloom sky","text":"I received my BloomSky set up was easy and painless.  I've always had an interest in the weather and Bloom Sky makes everyone a local weather person.  Amazing HD forecasts, accurate and love the end of day timeline video.","updated":"2016-03-21T15:42:54-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1476866813","userName":"Firemedic501","userUrl":"https://itunes.apple.com/us/reviews/id28173433","version":"3.0.10","score":4,"title":"App works well, could use a few things","text":"The app is good, but seriously could use a \"Reset your device\" control.  I get messages that the device needs to be restarted, I would love to do it from the app.\n\nOther than that, works great!","updated":"2016-11-01T09:24:11-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1487916061","userName":"Zombiiiiez","userUrl":"https://itunes.apple.com/us/reviews/id100406581","version":"3.0.11","score":2,"title":"Bad update","text":"I've been using the app for a while and haven't had any problems until this latest update...  when I updated the app all my favorite BloomSky stations disappeared.. I tried adding them back.. they no long have a time lapse video and also the app keeps crashing now..  will update review once this problem goes away.....","updated":"2016-11-20T06:11:37-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1247072726","userName":"SpaceCadetSr.","userUrl":"https://itunes.apple.com/us/reviews/id253082072","version":"2.0.0","score":3,"title":"name of Town or city / country","text":"developer - just signed on to your app / can you routinely require name of town, city / state and country if out of locality for each feed - as its baffling otherwise / even here on the SF peninsula - we don't know street names of all 20 odd towns to and including SF to SJ / please make it a priority / thx - friendly user U-joe / Luck !","updated":"2015-08-22T13:18:13-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1269681955","userName":"RippedOff1","userUrl":"https://itunes.apple.com/us/reviews/id6851159","version":"2.1.0","score":5,"title":"Great app and weather station","text":"I love features of the weather station and the app.  The maps are interesting to see what the weather differences are in your area. Knowing the temperature,  humidity, and UV index is handy for planning your day.","updated":"2015-10-10T08:43:58-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1225134263","userName":"Wisjshbseehdhdj","userUrl":"https://itunes.apple.com/us/reviews/id214676306","version":"1.0.5","score":5,"title":"Best weather app!!","text":"When I received the weather station, it was super easy to set up! I was a little skeptical at first, but I was amazed at how accurate the weather was. I measured it with a CEM thermometer and its spot on! I give it a 10/10!!","updated":"2015-07-10T09:55:57-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1324549676","userName":"Sierra_N","userUrl":"https://itunes.apple.com/us/reviews/id438068753","version":"2.1.10","score":5,"title":"Love the clean new design","text":"I open up the app to a list of my favorite locations now.  And therein a way to apply to put a bloomsky anywhere in the U.S now.  Community weather reporting at its finest. Can’t wait for the NWS to catch on.","updated":"2016-01-29T14:53:21-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1303716093","userName":"Olgeek62","userUrl":"https://itunes.apple.com/us/reviews/id247820062","version":"2.1.8","score":5,"title":"BloomSky Weather Station","text":"Excellent application, simple and easy to use. It may need translation in some more common foreigners languages, and some access to statistics to time lapsed recording to the users. It works great!","updated":"2015-12-20T20:04:51-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1292579117","userName":"InordinaryMisfit","userUrl":"https://itunes.apple.com/us/reviews/id200188759","version":"2.1.4","score":4,"title":"Nice app, could use more control features over the device","text":"I would like to see more controls for the device. Possibly more ways to support the integration of the data to the web.","updated":"2015-11-27T16:36:15-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1244759952","userName":"marrrrrine","userUrl":"https://itunes.apple.com/us/reviews/id466330547","version":"2.0.0","score":5,"title":"New version","text":"It's a good start to improve the app, new UI looks good. although it still has some problems. hope it could be better","updated":"2015-08-17T20:26:58-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1486422500","userName":"PS-IN-INDY","userUrl":"https://itunes.apple.com/us/reviews/id41821866","version":"3.0.10","score":5,"title":"Fantastic!","text":"I love my BloomSky (& the app)!\nGreat device, gives super accurate weather info at my home, and gives great info from other devices around my city and the world!!","updated":"2016-11-17T19:42:01-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1568320414","userName":"EarthSci","userUrl":"https://itunes.apple.com/us/reviews/id37784634","version":"3.1.6","score":3,"title":"A good start","text":"I enjoy the app for monitoring current weather in my backyard, but the forecasts lack detail and historical data isn't available through the app. For that you have to go to a website which isn't mobile friendly.","updated":"2017-03-19T21:28:10-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1584033713","userName":"DR 4725","userUrl":"https://itunes.apple.com/us/reviews/id100802908","version":"3.1.6","score":5,"title":"You've Got My Support!","text":"There is no other way to put it. A fantastic device. From the app to the device, tremendous job! Thank You to everyone at bloomsky for your vision and passion.","updated":"2017-04-08T12:17:32-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1341778582","userName":"Mr Calves","userUrl":"https://itunes.apple.com/us/reviews/id23551221","version":"2.2.1","score":5,"title":"It's not just weather","text":"This app is fun and educational too.  I enjoy seeing how the weather and sky look all over the world and my own back yard!  Join the BloomSky social network","updated":"2016-03-02T17:24:48-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1330879172","userName":"Austin Kately21","userUrl":"https://itunes.apple.com/us/reviews/id455119197","version":"2.1.12","score":1,"title":"Deleted already","text":"I couldn't get past \"add location.\" App says once you select a location it will show up on the page. Took me to a map showing where I am - cool - but it just goes back to the \"add location\" page or shows me pictures of the sky in several nearby towns, though none are my town. \nNeeds some work to be idiot-proof, I guess. Meanwhile, I'll stick with Weather Nerd.","updated":"2016-02-10T07:27:53-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1246182719","userName":"Holygral","userUrl":"https://itunes.apple.com/us/reviews/id16154259","version":"2.0.0","score":1,"title":"Made device worthless","text":"Totally ruined a good product, old interface was perfect, new interface is complicated, not user friendly  and the white lettering on sky with white clouds is totally useless, time lapse time is so small it is useless. Someone needs fired over this, I stopped using mine since this update, made a great product useless. Anyone want to buy a used worthless weather station?","updated":"2015-08-20T17:54:02-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1512132507","userName":"JCG1005","userUrl":"https://itunes.apple.com/us/reviews/id227424760","version":"3.1.3","score":3,"title":"What happened to Instagram?","text":"For whatever reason, Instagram isn't available for me as a sharing option. Without that, this is not fulfilling its purpose. Hopefully an update will be released soon.","updated":"2016-12-30T09:14:01-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1335116805","userName":"K Geyer","userUrl":"https://itunes.apple.com/us/reviews/id157297280","version":"2.1.12","score":5,"title":"Interesting way to see whats going on","text":"Interesting way to see whats going on in your favorite places weather wise and easy to use.","updated":"2016-02-18T17:39:02-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1438512353","userName":"rodlebod","userUrl":"https://itunes.apple.com/us/reviews/id36382729","version":"3.0.3","score":5,"title":"Bloomsky","text":"I still don't like having to move the graph out of the way or sliding to view the most current time lapse. Other than that, great app.","updated":"2016-08-24T07:33:33-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1197963449","userName":"xyzzy347","userUrl":"https://itunes.apple.com/us/reviews/id5906689","version":"1.0.2","score":1,"title":"Only crashes","text":"Worked ok until I upgraded to the latest version. First time I ran it, my phone reset (Apple gray screen). After that, it just quits as soon as it opens (shows the current photo and immediately crashes before I can do anything). FIX PLEASE! Since they don't have a web UI for the BloomSky, a bad app makes the product completely useless.","updated":"2015-05-15T21:42:41-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1339079591","userName":"RileyOnTheBay","userUrl":"https://itunes.apple.com/us/reviews/id103951408","version":"2.1.12","score":5,"title":"Awesome!","text":"Great app. that allows you to find many local weather stations. Great way to see what the \"live\" weather is and what the day's weather was via time-lapse...","updated":"2016-02-26T10:37:05-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1569480188","userName":"No1Bartman","userUrl":"https://itunes.apple.com/us/reviews/id155917301","version":"3.1.6","score":5,"title":"Getting better","text":"There are a few things I would like to see done better but so far so good","updated":"2017-03-21T09:56:32-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1478092697","userName":"Mrjoseg","userUrl":"https://itunes.apple.com/us/reviews/id9330549","version":"3.0.10","score":5,"title":"Cool product","text":"This is a cool product and easy to use.  It's cool to be able to see the weather where I'm going and back home!","updated":"2016-11-03T17:27:48-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1330059165","userName":"Bhartzer","userUrl":"https://itunes.apple.com/us/reviews/id255256262","version":"2.1.11","score":5,"title":"Great device","text":"Love it already. Fairly easy setup. Difficult part was deciding on where to place it and mount it. Decided on a ground mound at first until I can mount it in a pole.","updated":"2016-02-08T16:44:51-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1543906356","userName":"Mugatu2001","userUrl":"https://itunes.apple.com/us/reviews/id187623889","version":"3.1.6","score":5,"title":"A serious upgrade","text":"Love the new 3.0 and hear more improvements are on its way in upcoming updates. Can't wait!","updated":"2017-02-13T14:46:40-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1532499190","userName":"Zigfire66","userUrl":"https://itunes.apple.com/us/reviews/id260927908","version":"3.1.6","score":4,"title":"It's getting there","text":"The app has steadily improved. When my storm goes on line next week I'll be interested to see if it give the temp and wind chill numbers. Wait and see.","updated":"2017-01-28T13:21:54-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1523507263","userName":"Wastintime","userUrl":"https://itunes.apple.com/us/reviews/id102593842","version":"3.1.5","score":1,"title":"Not to be trusted","text":"The app isn't that bad, but it almost never works when you need it to.  So you have to go to the website which works fine, buuut both tend have images that say they're 5 minutes old, but are really several days old and horrible representations of the current weather.","updated":"2017-01-16T06:55:20-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1636684570","userName":"gxxxxr","userUrl":"https://itunes.apple.com/us/reviews/id26983693","version":"3.1.6","score":4,"title":"It works well...","text":"I'd wish the would be a way to get photos on demand... that would be very useful when setting up the device.","updated":"2017-06-07T11:34:29-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1413512669","userName":"BetterBets","userUrl":"https://itunes.apple.com/us/reviews/id25152228","version":"2.2.6","score":2,"title":"Really?","text":"I have tried for weeks to get this to work properly. I've looked online for solutions and have had some success. The phone # on the help page reports as \"Non-Existent.\" After about an hour I give up. It worked for one whole day, once.","updated":"2016-07-16T15:50:42-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1428202763","userName":"applefan24","userUrl":"https://itunes.apple.com/us/reviews/id34477010","version":"3.0.2","score":4,"title":"Neat but needs more","text":"I got the app and am thinking about getting the device. I was hoping it could be a one stop weather app. Would love it to have a radar overlay.","updated":"2016-08-06T16:26:36-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1642270037","userName":"SCHESBH","userUrl":"https://itunes.apple.com/us/reviews/id42094862","version":"3.1.7","score":1,"title":"App is dead","text":"Whatever you did with this app it is now dead. I have had your system for months with no issues until today. Now cannot even access anything as the app hangs after you enter your email and password. Even reset my password and no difference","updated":"2017-06-12T13:57:18-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1245200198","userName":"Owen DeLong","userUrl":"https://itunes.apple.com/us/reviews/id23192081","version":"2.0.0","score":3,"title":"Bring back the old UI","text":"The new version is a step in the wrong direction. The UI is confusing and makes it harder to get the indoor data. \n\nThe promised units functionality for pressure appears to be missing. \n\nIt does make it easier to find nearby units, but that could have been added to the old UI without much difficulty. \n\nAlso, I liked the previous black background and color scheme better than the new one.","updated":"2015-08-18T18:36:03-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1330866332","userName":"safetyobc","userUrl":"https://itunes.apple.com/us/reviews/id33455013","version":"2.1.11","score":5,"title":"Awesome App and service","text":"This is a really cool weather app. It gives you current weather readings, future info and a really cool time lapse videos.","updated":"2016-02-10T06:57:44-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1270865279","userName":"chevyman142000","userUrl":"https://itunes.apple.com/us/reviews/id21996462","version":"2.1.0","score":3,"title":"Push notifications are still not working in iOS 9","text":"Push notifications are still not working in iOS 9.","updated":"2015-10-12T19:46:06-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1388582806","userName":"shortscaptain","userUrl":"https://itunes.apple.com/us/reviews/id26880170","version":"2.2.6","score":5,"title":"Fabulous idea","text":"Great for pilots who are tired relying on the outdated and slow Flight Service Station method. It's not legal for pilots but it is live. Thank You Thank You","updated":"2016-06-03T19:43:13-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1356677433","userName":"skinnybones2013","userUrl":"https://itunes.apple.com/us/reviews/id41789606","version":"2.2.4","score":5,"title":"Great app but...","text":"Love the app. It is fun to see whether all across the country.\nAnd love the new updates! This app is awesome!\n\nWould love to see an iPad app as well as an Apple Watch app.","updated":"2016-03-31T20:50:44-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1336132886","userName":"IreneSans","userUrl":"https://itunes.apple.com/us/reviews/id219806921","version":"2.1.12","score":5,"title":"Bloomriffic!","text":"I love this Bloomsky app- I downloaded it months before I ordered my very own. I am fascinated by this product! Great job Bloomsky, keep it up!","updated":"2016-02-20T15:00:54-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1462884936","userName":"CasaKarl","userUrl":"https://itunes.apple.com/us/reviews/id20299214","version":"3.0.7","score":4,"title":"Happy","text":"I like the concept - further development would enhance info and usefulness - can't seem to get time lapse images to work","updated":"2016-10-07T17:48:04-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1418723812","userName":"ModernDayMountainMan","userUrl":"https://itunes.apple.com/us/reviews/id19873186","version":"3.0.0","score":2,"title":"Newest update is garbage","text":"Bring back the old version, where we can see the entire live view. The new favorites page is not as good as the old one. The new update is not good. The old version would be a 5 star rating.","updated":"2016-07-23T21:21:17-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1309133129","userName":"Laker18","userUrl":"https://itunes.apple.com/us/reviews/id29208738","version":"2.1.8","score":5,"title":"Unreal!","text":"This is a must buy for any weather nerd. The app works flawlessly. I just wish they would add an anemometer and rain gauge.","updated":"2015-12-31T09:37:11-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1353890166","userName":"Judist63","userUrl":"https://itunes.apple.com/us/reviews/id430447015","version":"2.2.2","score":5,"title":"Awesome!","text":"Love this app! Love seeing in real time what the weather is in different towns around me and even far away!","updated":"2016-03-26T07:24:57-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1333606355","userName":"CalebSl8r","userUrl":"https://itunes.apple.com/us/reviews/id25637276","version":"2.1.12","score":5,"title":"So fun","text":"This is a super fun app to see weather across the country! I love checking in on my favorite locations!","updated":"2016-02-15T16:36:57-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1627839839","userName":"Jason7200","userUrl":"https://itunes.apple.com/us/reviews/id200432489","version":"3.1.6","score":3,"title":"Decent app","text":"I wish there was a way you could pause the time lapse and look at individual photos","updated":"2017-05-29T08:32:19-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1313004410","userName":"American Shorthair","userUrl":"https://itunes.apple.com/us/reviews/id40389941","version":"2.1.8","score":4,"title":"Cool concept and good execution","text":"Found two stations in my area - nice. Will spend some more time on it see if it keeps my interest.","updated":"2016-01-07T21:29:40-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1245194549","userName":"juliodefoz","userUrl":"https://itunes.apple.com/us/reviews/id138649788","version":"2.0.0","score":1,"title":"Great device! Terrible app update.","text":"Too minimalistic and not functional, neither intuitive. Sure it looks great, but fonts are too small. Everything is hard to find and use. If you want a great device, buy one unit, but the app still has a lot to improve.","updated":"2015-08-18T18:19:10-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1650534269","userName":"ambanmba","userUrl":"https://itunes.apple.com/us/reviews/id22489785","version":"3.1.7","score":2,"title":"Still a work in progress","text":"Works for images from Sky, but flakey with Storm data.\n\nStill missing many obvious features like viewing history, etc.","updated":"2017-06-19T20:26:44-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1552611466","userName":"GreenLightning8083","userUrl":"https://itunes.apple.com/us/reviews/id426428323","version":"3.1.6","score":4,"title":"Good, but room for improvement","text":"This is a great app! I can see the weather so easily! The iPad app doesn't look very good. Please improve!","updated":"2017-02-25T16:57:27-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1419093348","userName":"Dudeman44","userUrl":"https://itunes.apple.com/us/reviews/id5786284","version":"3.0.0","score":4,"title":"How about an iPad version?","text":"I like the looks of the new app, but I'm very surprised that it STILL is an iPhone only app. It looks anemic on an iPad, let alone an iPad Pro.","updated":"2016-07-24T09:40:11-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1330560814","userName":"His weatherman","userUrl":"https://itunes.apple.com/us/reviews/id491657262","version":"2.1.12","score":4,"title":"Bloom sky","text":"Bloom sky is a neat way to check out the actual weather instead of looking at the numbers.","updated":"2016-02-09T16:44:03-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1489273479","userName":"RiverchaseOne","userUrl":"https://itunes.apple.com/us/reviews/id481073480","version":"3.0.11","score":1,"title":"Awful less than 1 star","text":"Pure crap works when it wants to. Since all data lives on company servers they should notify you when you have a problem.  Either overwhelmed or less than capable staff it doesn't matter.","updated":"2016-11-22T18:04:01-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1331087581","userName":"the_dan_pratt","userUrl":"https://itunes.apple.com/us/reviews/id34092749","version":"2.1.12","score":4,"title":"Dedicated iPad Version?","text":"The app does what it's supposed to do. I just wish they would release a universal app that includes native support for iPad.","updated":"2016-02-10T18:34:59-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1368869665","userName":"drjdawg","userUrl":"https://itunes.apple.com/us/reviews/id30525001","version":"2.2.5","score":4,"title":"Nice ecosystem","text":"My only issue with the app is that I've had some premature completely stopped working. I'm running ISO 9.3.1 on iPhone 6s Plus","updated":"2016-04-25T19:02:46-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1339579563","userName":"joncohen","userUrl":"https://itunes.apple.com/us/reviews/id85109358","version":"2.1.12","score":3,"title":"Time lapse","text":"Wish it didn't cut off before and after sunset...","updated":"2016-02-27T08:36:40-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1244798128","userName":"Bloom sky owner","userUrl":"https://itunes.apple.com/us/reviews/id101806077","version":"2.0.0","score":1,"title":"Horrible","text":"This new version is useless.  Your favorites are buried as is your own device. You want to see your weather great they added two more clicks so it's harder to find.   Please go back to the old version this one is horrible","updated":"2015-08-17T22:27:59-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1245688054","userName":"James' Apple Account","userUrl":"https://itunes.apple.com/us/reviews/id43728343","version":"2.0.0","score":2,"title":"Great product but HATE the UI","text":"The old UI needed work but the new UI is terrible!  Would like to see heat index on the dashboard as this is a simple calculation using humidity and air temp. In areas where is over 100 it's a big deal.","updated":"2015-08-19T19:11:24-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1325901702","userName":"Mitme101","userUrl":"https://itunes.apple.com/us/reviews/id256551943","version":"2.1.10","score":1,"title":"Worthless","text":"I guess it doesn't work in Alaska. It shows my location on a map, but definitely no real time anything. Maybe a tutorial or information where it works would be nice.","updated":"2016-01-31T21:33:12-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1266953858","userName":"b-e-a-utiful girls","userUrl":"https://itunes.apple.com/us/reviews/id39620836","version":"2.0.1","score":1,"title":"So close and yet so far away","text":"I bought this for my lake house. Solar, wifi, camera, weather all bundled. I thought wow.\n\nThey have all of the components but yet are missing the mark. There is no way to get a live video feed.  The snapshots are nice but I can't see back until it gives them to me at end of day. \n\nI really hope they upgrade the software because the hardware surely could do this. \n\nSo close, yet so far away. Fingers crossed still","updated":"2015-10-04T10:05:44-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1287097281","userName":"CBray07","userUrl":"https://itunes.apple.com/us/reviews/id199753220","version":"2.1.3","score":2,"title":"Ok performance","text":"Needs to have some software updates and some more features. Hard to use the app. Also privacy would be good.","updated":"2015-11-15T10:44:03-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1386112668","userName":"I@n Colg@n","userUrl":"https://itunes.apple.com/us/reviews/id201952732","version":"2.2.6","score":5,"title":"App-solutely Fan-tastic","text":"I'm a weatherbug and this app is really cool. It will be fun to add a weather unit and utilize all the features!","updated":"2016-05-29T17:57:56-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1340090335","userName":"Donman","userUrl":"https://itunes.apple.com/us/reviews/id9624803","version":"2.1.12","score":4,"title":"Very cool but could be even better","text":"I was very fortunate to be selected for the BloomSky network expansion promotion so I got my unit for the cost of shipping, but I would have paid full price in any case. The unit itself is beautifully designed, solid construction, and works flawlessly. Setup was quick and simple. Took less than 5 minutes to get connected to my home network and immediately started recording weather data and photos.\n\nThe app itself is clean and simple. Being able to quickly view the current weather stats and sky view from my iPhone is very cool, and the end-of-day timeless of the sky from my home is now something I look forward to every evening. I'd give it five stars except for an obvious omission which I'm hoping they add in a future version - it doesn't display any graphs of the weather data it's collecting, making it far less useful than it otherwise could be. That was something so obvious I just assumed they would be there, so their absence was a real disappointment. I can view the last recorded sample of temp, pressure, etc. but unless I remember what they were the last time I checked I don't know which way they're changing and by how much. BloomSky is obviously collecting all this data so it would be a simple matter of adding a few graphs the the app to display it to the user. \n\nStill, it's a great start of what I hope will be a continuing evolution in personal weather data collection and dissemination. Kudos to the BloomSky team for creating such a cool product and service!","updated":"2016-02-28T06:53:50-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1327336719","userName":"Jlilybean85","userUrl":"https://itunes.apple.com/us/reviews/id410324265","version":"2.1.10","score":1,"title":"Not user friendly","text":"It opens telling you to add favorite locations but, for the life of me, I can't figure out how to add a favorite location. It's not user friendly at all and I deleted it after a week.","updated":"2016-02-03T15:19:16-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1326664740","userName":"Perrydutch","userUrl":"https://itunes.apple.com/us/reviews/id490559051","version":"2.1.10","score":5,"title":"Mrs.","text":"Great app. I will share this app with those who would appreciate it.","updated":"2016-02-02T07:29:00-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1323172650","userName":"Orenlova","userUrl":"https://itunes.apple.com/us/reviews/id226404449","version":"2.1.9","score":2,"title":"Doesn't have all cities.","text":"I live in Buffalo and all they had were cities an hour away which are lesser known cities than Buffalo.","updated":"2016-01-27T02:46:57-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1318696921","userName":"502Palletproject","userUrl":"https://itunes.apple.com/us/reviews/id468192704","version":"2.1.9","score":1,"title":"Crashes","text":"I just crashes over and over again. Guess after they get you to log into FB and mines all your contacts they are done...","updated":"2016-01-18T18:27:14-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1254564225","userName":"WJB59","userUrl":"https://itunes.apple.com/us/reviews/id119521468","version":"2.0.1","score":1,"title":"App crashes","text":"I was interested in the product but the App crashes each time I try to \"Sign up\"\n\nIt's hard to be encouraged about a promising device if the App doesn't even work.","updated":"2015-09-07T16:06:28-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1350842948","userName":"wanna see a cookie","userUrl":"https://itunes.apple.com/us/reviews/id466560746","version":"2.2.2","score":1,"title":"Awful","text":"Not many locations to view live sky are available. Instantly had to give email so now they can presumably spam me . Deleted right away.","updated":"2016-03-20T10:53:44-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1350792909","userName":"sabruui","userUrl":"https://itunes.apple.com/us/reviews/id43454692","version":"2.2.2","score":1,"title":"Uninstalled right away","text":"You do not need my Facebook or any personal information to just show me the weather. Come on, guys. You have a decent idea here but your info greediness destroyed it.","updated":"2016-03-20T08:52:30-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1625617601","userName":"Pojitonov","userUrl":"https://itunes.apple.com/us/reviews/id190291481","version":"3.1.6","score":2,"title":"Bad Ux","text":"App is terrible.\nTo install the device you need to sit on the roof several hours to adjust the view. Where is the live preview for instalayion?","updated":"2017-05-27T03:36:54-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1515805977","userName":"SwampLynx","userUrl":"https://itunes.apple.com/us/reviews/id40484590","version":"3.1.4","score":1,"title":"Non-Existing Customer Service","text":"App may be great for all I know, but my unit has been dead for three months and BloomSky refuses to return my email to get my device replaced.","updated":"2017-01-05T04:43:14-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1342610757","userName":"JUSST4NOW","userUrl":"https://itunes.apple.com/us/reviews/id163421625","version":"2.2.1","score":1,"title":"Where do I find the notifications/messages?","text":"If I don't see the notification/message once it's sent, I can't find it after that.","updated":"2016-03-04T07:22:38-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1333019812","userName":"Spudly2000","userUrl":"https://itunes.apple.com/us/reviews/id234446091","version":"2.1.12","score":5,"title":"Great App","text":"I love this app!  Cool sky views! Love the time lapse videos... Oh and the weather is great too!","updated":"2016-02-14T11:21:31-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1338226301","userName":"Katiebugs22331144557668","userUrl":"https://itunes.apple.com/us/reviews/id295912618","version":"2.1.12","score":1,"title":"Ridiculous","text":"honestly it's terrible I got this app to see my areas weather and you don't even have one so why bother have this app","updated":"2016-02-24T19:20:39-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1251852769","userName":"YesMMMMMMMMM","userUrl":"https://itunes.apple.com/us/reviews/id140538303","version":"2.0.1","score":1,"title":"Crashes","text":"This thing is a joke. Looks like a demo it does not work and crashes even before sign up. Deleted don't waste time.","updated":"2015-09-01T18:32:29-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1245138880","userName":"KColvin","userUrl":"https://itunes.apple.com/us/reviews/id21099659","version":"2.0.0","score":1,"title":"What have you done?","text":"You ruined  a perfectly fine app. Please go back to the original, this \"update\" just isn't worthy of Bloomsky.","updated":"2015-08-18T15:12:29-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1319169184","userName":"Bodle 7","userUrl":"https://itunes.apple.com/us/reviews/id329449754","version":"2.1.9","score":1,"title":"Bug fixes.","text":"I highly suggest that you fix your app of all bugs before you go advertising the app all over Instagram.","updated":"2016-01-19T18:28:53-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1198112727","userName":"Joshua Mallow","userUrl":"https://itunes.apple.com/us/reviews/id202902066","version":"1.0.2","score":1,"title":"Good start","text":"Recent update causes app to crash on open. Making the BloomSky device completely useless. 😞","updated":"2015-05-16T04:53:44-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1319625342","userName":"Renovate My Plate","userUrl":"https://itunes.apple.com/us/reviews/id23705837","version":"2.1.9","score":1,"title":"Lightning crashes...","text":"I couldn't even search a city! It just kept crashing. Not worth the effort!","updated":"2016-01-20T16:04:01-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1319606903","userName":"Donkey kong's friend","userUrl":"https://itunes.apple.com/us/reviews/id49401531","version":"2.1.9","score":1,"title":"Crashes","text":"Crashes and why even require a login for a weather app? That's stupid.","updated":"2016-01-20T15:01:50-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1342081043","userName":"Tgs2401","userUrl":"https://itunes.apple.com/us/reviews/id33066640","version":"2.2.1","score":1,"title":"Not intuitive","text":"Where are the real time videos advertised. Does not work.","updated":"2016-03-03T06:49:04-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1348168748","userName":"OmarYousif","userUrl":"https://itunes.apple.com/us/reviews/id31418142","version":"2.2.1","score":1,"title":"Slow and boring.","text":"Someone told me this app was cool, it's not. \n\nSuper boring to see fisheye time lapse videos of yesterday's weather. Don't bother.","updated":"2016-03-15T03:24:06-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1325930787","userName":"BoneheadPST","userUrl":"https://itunes.apple.com/us/reviews/id459941142","version":"2.1.10","score":1,"title":"Misleading","text":"No mention of in app purchases. Doesn't have any cameras in my area.  Useless for my needs.","updated":"2016-01-31T22:51:00-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1363942957","userName":"Chris Pt","userUrl":"https://itunes.apple.com/us/reviews/id37410803","version":"2.2.4","score":2,"title":"Spammy ticker :(","text":"Why this loud ticker at the top of the screen now?","updated":"2016-04-15T10:22:23-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1337673223","userName":"Why_1","userUrl":"https://itunes.apple.com/us/reviews/id180723446","version":"2.1.12","score":1,"title":"I don't sign up to try apps","text":"Why would I sign up just to try it and see if I like it.  Bogus.","updated":"2016-02-23T15:26:07-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1351355969","userName":"dogstar88","userUrl":"https://itunes.apple.com/us/reviews/id43144279","version":"2.2.2","score":1,"title":"Waste of time","text":"Not gonna give you personal info to look at the weather. DEEEEEELEEEETE!!!!","updated":"2016-03-21T11:34:35-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1319630819","userName":"Mikeinob","userUrl":"https://itunes.apple.com/us/reviews/id287220615","version":"2.1.9","score":1,"title":"Don't bother","text":"All I can get it to do is crash!","updated":"2016-01-20T16:22:08-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1573352294","userName":"RMSmithJr","userUrl":"https://itunes.apple.com/us/reviews/id170255163","version":"3.1.6","score":1,"title":"Device Failure","text":"One star is too kind. \n\nMultiple resets attempted\n\n= multiple failures experienced.  \n\nMy money, paid last August, has been scammed?","updated":"2017-03-26T12:48:37-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1245149743","userName":"Rasmusse","userUrl":"https://itunes.apple.com/us/reviews/id127589319","version":"2.0.0","score":1,"title":"Ugh... Why?!?!?!?","text":"Horrible UI update","updated":"2015-08-18T15:51:21-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1260403361","userName":"Reconjoe78247","userUrl":"https://itunes.apple.com/us/reviews/id25872538","version":"2.0.1","score":5,"title":"Owner","text":"Super love it","updated":"2015-09-20T13:14:36-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1652771063","userName":"Jkldtx","userUrl":"https://itunes.apple.com/us/reviews/id106473319","version":"3.1.8","score":1,"title":"Orders","text":"We're is my tripod?","updated":"2017-06-21T18:06:33-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"5540328855","userName":"FredBikeRider","userUrl":"https://itunes.apple.com/us/reviews/id198780493","version":"3.3.4","score":1,"title":"Great hardware, terrible software","text":"The app will not show a table of the Storm’s wind data, which makes the storm essentially useless. The website shows a table of all the Storm’s data, but does not show the current webcam picture.\n\nBoth the app and website have dead links (very sloppy).\n\nLinking the BloomSky to wunderdround.com does not work at all.\n\nPhone support is non-existent. There is email support, but it takes them about a week to get back to you for each question you ask.\n\nUnless these guys clean up their act, I will be very surprised if they are in business two years from now.","updated":"2020-02-16T11:23:16-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1329958247","userName":"Fartingbusdriver","userUrl":"https://itunes.apple.com/us/reviews/id9856227","version":"2.1.11","score":5,"title":"WoW","text":"Just wowed!","updated":"2016-02-08T10:57:39-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1255325826","userName":"GeneK2000","userUrl":"https://itunes.apple.com/us/reviews/id279233000","version":"2.0.1","score":1,"title":"Art in the making...","text":"The new version of the app is terrible.  I have no problem with change as long as it's for the better. This app is a step backwards in every way. Try reading small, light gray text on a white background, for example, on an iPhone 5 sized screen... it's horrible. Or how about the indoor unit readings being drastically inaccurate, i.e., the actual temp and humidity are 75 and 55 respectively, yet the app is showing 80 and 0... what!?  The UI and UX are just plain BAD.  BloomSky, what were you thinking and do you even use your own products??  There is no longer a simple \"drag down\" to update the data. In fact, I don't see how to update the data at all.  Likewise, there doesn't seem to be a way to update the outdoor station's location, as was the simple GPS update with the old app.  Should I go on?  Wow, what a disappointment. Sad, very sad.  Please get your act together BloomSky and to echo another reviewer, please go back to the old app immediately.\n\nUpdate 9/10/15: The bugs in the new app have been addressed at an amazing pace which speaks to the investment the company and the employees as a team are making on behalf of it's product and customers. I'm impressed with the team's overall commitment and sincere desire to listen to their customers and improve the app. The hardware is rock solid and as the app progresses, things are definitely looking up... thank-you BloomSky!","updated":"2015-09-09T12:31:32-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"},{"id":"1374010316","userName":"My bloomsky","userUrl":"https://itunes.apple.com/us/reviews/id485598771","version":"2.2.6","score":5,"title":"Views of the valley isle & haleakala","text":"Awesome app local weather and from  around the world come follow me","updated":"2016-05-05T13:17:36-07:00","url":"https://itunes.apple.com/us/review?id=978094420&type=Purple%20Software"}]