[{"id":"4080851605","userName":"BostonFrank","userUrl":"https://itunes.apple.com/us/reviews/id38006045","version":"2.5.0","score":3,"title":"Shortcuts and widget; finally!","text":"They finally added support for Siri shortcuts and a widget! Without those things you have to fumble for your phone to try and adjust your air-conditioner and it’s a pain! \n\nUnfortunately they still don’t appear to have anyone who knows anything about user interface design. Wasted space, fonts so small you can barely read them, features buried deep in menus and unintuitive overall. I’m especially confused as to why I need my current temperature displayed out to 6 decimal points.","updated":"2019-04-30T06:14:48-07:00","url":"https://itunes.apple.com/us/review?id=980554024&type=Purple%20Software"},{"id":"6867782651","userName":"LambdaEnt","userUrl":"https://itunes.apple.com/us/reviews/id87434848","version":"2.7.2","score":2,"title":"Great product - App design is awful.","text":"The product is wonderful. The app is ridiculous. \n\nI’ve had the product for several years, and it is a game changer. I bought my split-ductless system before app access was a thing. The Ambi changed all that. \n\nBut there hasn’t been a single noticeably visual update to the app since then.\n\nType is small. I don’t mean just a little small, but ludicrously small. Some words are truncated because they didn’t leave enough room — how did you not notice this?  Many items are in 5 or 7 point type... or smaller! Seriously, who thought this was a good idea? I just have minor astigmatism. I can’t imagine what people with real visual impairment must think. It’s poor judgement at best, discriminatory at the outset.\n\nI have complained for several years. I get the same corporate-speak response every time. I fail to understand why such a simple thing has not been addressed. \n\nThere is a reason Apple (and Google) made user selectable font-sizing. The Ambi team needs to get on board.","updated":"2021-01-13T23:29:57-07:00","url":"https://itunes.apple.com/us/review?id=980554024&type=Purple%20Software"},{"id":"3639789148","userName":"1407LA","userUrl":"https://itunes.apple.com/us/reviews/id189544753","version":"2.4.6044","score":5,"title":"Ambi Climate","text":"Ambi Climate is an A.I. enabled smart air-conditioning remote control. With a mini split air conditioning unit, the remote bypasses the traditional remote and speaks to the air-conditioner directly via infrared. The artificial intelligence allows you to select seven different comfort levels that over a week span learns your comfort levels based on your personal feedback including humidity, temperature, time of day etc. based on all of those conditions it will predict your most optimal comfort level and it adjust on its own. Great product and sleek design.","updated":"2019-01-11T19:49:03-07:00","url":"https://itunes.apple.com/us/review?id=980554024&type=Purple%20Software"},{"id":"6973610454","userName":"waishuny","userUrl":"https://itunes.apple.com/us/reviews/id48757254","version":"2.7.3","score":3,"title":"When is Apple HomeKit coming?","text":"It’s been so long and there’s still no compatibility with Apple HomeKit. It’s very inconvenient to find the app just to control the AC.","updated":"2021-02-09T06:20:07-07:00","url":"https://itunes.apple.com/us/review?id=980554024&type=Purple%20Software"},{"id":"5572806221","userName":"joebraidwood","userUrl":"https://itunes.apple.com/us/reviews/id12903550","version":"2.6.6","score":5,"title":"Incredible platform","text":"Had a few issues but support very responsive and the broader features of this app are fantastic!","updated":"2020-02-23T21:35:00-07:00","url":"https://itunes.apple.com/us/review?id=980554024&type=Purple%20Software"},{"id":"5407016693","userName":"Kkositkun","userUrl":"https://itunes.apple.com/us/reviews/id22445358","version":"2.6.4","score":2,"title":"Too many bugs","text":"Was pretty good when I fist got it, but lately the AI Smart features seem to never work, and when it does takes for ever to respond and find myself having to use manual mode most of the time.   Need a major overall to fix all the bugs.","updated":"2020-01-15T07:02:58-07:00","url":"https://itunes.apple.com/us/review?id=980554024&type=Purple%20Software"},{"id":"5510464472","userName":"Braaaaamsss","userUrl":"https://itunes.apple.com/us/reviews/id175247862","version":"2.6.5","score":2,"title":"Why so complex?","text":"All we want is control the ac from the iPhone or Alexa. Also the only smart functionality required is a thermostat that works ...\n\nSo many things are wrong with this app. Never really managed to make it work like expected.","updated":"2020-02-09T17:28:03-07:00","url":"https://itunes.apple.com/us/review?id=980554024&type=Purple%20Software"},{"id":"7577633764","userName":"mikeisthenameiuse","userUrl":"https://itunes.apple.com/us/reviews/id947585507","version":"2.7.4","score":2,"title":"Device works, but software is poorly made","text":"* Can't set temperatures using Siri * Does not work with iPad in landscape mode * MacOS-only Ambibridge Manufactureris not an acceptable substitute for official Homekit support","updated":"2021-07-14T19:28:01-07:00","url":"https://itunes.apple.com/us/review?id=980554024&type=Purple%20Software"},{"id":"3480108210","userName":"dougc84","userUrl":"https://itunes.apple.com/us/reviews/id36241643","version":"2.4.6041","score":2,"title":"It works, but lots of room for improvement","text":"I'm a fan of AmbiClimate.  I've been following them since their 2.0 Kickstarter, and finally picked up a unit on sale to control my home office's mini split with heat pump.\n\nSetting up the device was... troublesome.  It didn't want to connect to my wifi at first, but it's been solid ever since.  Customer service with Ambi is very good - I received an email after a couple of failed attempts with suggestions and how to contact them for support.  Nice touch, guys.  I also ended up having to pair a different remote with a similar numbering scheme, because mine wasn't listed, and, when doing the manual pairing, I didn't get heat functionality at all.\n\nHowever, since this is a review about the app: there is a tremendous amount of data and customization here - everything from graphs comparing your temperature to the outside temperature and humidity levels, how long your equipment has been on and in which mode, how you've tweaked the comfort setting, etc.  You can configure timers/schedules, geofencing, all kinds of stuff.  It's very powerful and will provide most people - especially those with AC-only units - all the options they need.\n\nBut Ambi missed the mark in quite a few places.  For starters, even on my XSMax, the fonts and UI elements are TINY.  Like... hard to tap on tiny.  It doesn't look good - it looks like a cheap app built by a for-hire developer for $100.  It definitely isn't, but the UI misses the mark.  That chart isn't necessary on the landing page for each device either - it makes the content look even smaller and messier.  And, on the charts - they are really difficult to read and understand.  A legend would be more useful than throwing two nearly-identical colors next to each other with two nearly-identical badge names in-line.\n\nContinuing with the UI, the navigation buttons at the bottom conflict with the X/XS swipe bar - I'll often switch apps or go home on accident.  The sub-navigation from each button is WAY too small and I routinely hit the wrong option, and some of the navigation options aren't exactly intuitive until you understand them.  One example is AC Controls vs. AI Controls (and why do I get different options for each at different times?).  Another is Deployments (which is very useful, but... should be named something different, like Activity Log).\n\nHowever, the biggest gripes I have are with features that provide a lot of complexity, but have overlooked simple things.\n\nFirst: Away mode.  If you have an A/C-only unit, away mode will probably work just fine for you.  However, in the situation where you have both A/C and Heat, and you live in a climate where you can have one day that has a high of 45F, and the next day it's 85F, away mode defeats its own purpose.  You can only set a singular breakpoint for temperature.  Why can't we specify a heating and cooling point (i.e. if the temperature drops below 65, turn on the heat, or if above 78, turn on the A/C)?  I'm not looking forward to the spring and having to adjust this setting every day.  Nest and Ecobee have figured this out.  Let's get this working.\n\nSecond: Turning off the device.  My unit is cranky: it forgets everything except for the last setting you had it on.  That includes the LED off feature, which also turns off the bell/chime every time the temperature is changed.  So, if AmbiClimate decides to power off the unit, I'm greeted to constant beeps and chirps when the unit is turned back on until I grab the old remote, hit the LED off button (which puts it into manual mode), go into the app, and reenable whatever mode I was on.  It's frustrating, as I continue to need my old remote, which I hoped to not have to do.  It would be nice if there was a \"don't turn off\" option somewhere in the menu.  I'm smart enough that I could open up my unit and desolder the buzzer, but I really don't want to do that, especially when dealing with 120v.\n\nThird: Smart Home Integration.  Yes, Ambi provides an API, but they have released no official smart home integrations like they said they would.  On top of that, because OAuth is needed (instead of just a simple API key), writing an unofficial integration is exponentially more difficult than sending basic HTTP POST requests.  Come on, Ecobee and Lifx can provide simple API keys, why can't Ambi?  And, honestly, a SmartThings integration would solve 75% of the issues I have, as I could customize the behavior much more.\n\nFourth: A dashboard widget.  Every other smart home app has one.  It wouldn't take much - just a simple temp/humidity/comfort view with maybe some buttons (hidden at first, but would be shown when tapping Show More) to say if you're too cold or too hot.  This would allow things to be seen and allow some basic interaction without having to unlock your phone or open the app up at all.\n\nFifth: With all the free space on the home page of each device, I would love to see what the current settings are - temperature and mode.  I have to go to AC or AI controls to see this information, which is very unintuitive.\n\nLast: Location awareness.  Sometimes I'm kicked to manual mode if I haven't left my house in a day.  I work from home, in the room with the AmbiClimate, and it's just annoying.  The last update said it \"fixed user getting kicked out of geolocation zone,\" but that's absolutely not true.\n\nAll that said, it's really not a bad app - it just needs a few weeks of solid work to make it something that's a joy to use, instead of working around its quirks and missing features.  Right now, it's functionally solid, but not an app I really want to use if I don't have to.","updated":"2018-11-30T22:54:32-07:00","url":"https://itunes.apple.com/us/review?id=980554024&type=Purple%20Software"},{"id":"4193613586","userName":"ptemi","userUrl":"https://itunes.apple.com/us/reviews/id38733202","version":"2.5.0","score":1,"title":"Stopped working... again","text":"The app stopped working again......","updated":"2019-05-22T18:53:23-07:00","url":"https://itunes.apple.com/us/review?id=980554024&type=Purple%20Software"},{"id":"4269219584","userName":"Ches Martin","userUrl":"https://itunes.apple.com/us/reviews/id100893304","version":"2.5.0","score":4,"title":"Pleased with the product, app is adequate","text":"I’d call this 3-3.5 stars for the app itself, rounding up for overall product and support.\n\n+ Gets the job done\n+ Siri Shortcuts, Today widget \n+ Broad range of platform integrations\n+ Developer API, already enables useful 3rd party extensions like AmbiBridge\n\n- UI/UX design needs improvement\n- HomeKit support is through a 3rd party bridge\n- Needs iPad display optimization\n\nAs with many smart home / IoT products, some patience is required at the beginning.\n\nI concur with other reviews that app ergonomics could stand to improve, particularly that key functions have small and awkwardly placed buttons. But most people who buy a product like this aren’t going to open the app much for day-to-day usage after the first week—Siri Shortcuts, Google Assistant, and Alexa skills have the main voice assistant / smart speaker bases covered; for quieter moments, the Today view widget handles the essentials, and Siri Shortcuts or IFTTT button widgets could go the extra mile if needed. The Apple Home app and its Control Center widget become another option with the third-party AmbiBridge app running on a nearby Mac.\n\nThat said, since the intended primary model of usage is not to set specific temperatures but to guide and train Ambi, it’s not a perfect fit for the assistants’ conception of thermostat control in their baseline smart home functionality. Custom commands may be needed in routines—macros like IFTTT applets and Shortcuts can be helpful, see below*.\n\nAnd back to the app: what you are still going to use it for regularly is reviewing stats, and that also needs work. History chart view responsiveness is sluggish (on an iPhone XS), cramped, and decidedly non-native feel. The Deployments log is useful for troubleshooting but could be designed more elegantly.\n\nThe app is not universal for iPad and does not rotate to landscape at all. An iPad makes a nice home automation control center, and Ambi Climate is the eyesore among the apps I flip between for this purpose.\n\nNonetheless it does what it needs to do, just needs polish. I’m happy with the overall product experience.\n\nPraise for the support: my remotes are physically identical to a model that was in the database, with a one-letter model number variation. I expected it would work, but it didn’t, and the IR learning mode left some capabilities of my AC unavailable. Support was very responsive, and within 24 hours they had a newly developed remote profile pushed to my device. It took a couple rounds of tweaking to get right, but communication was timely and helpful.\n\n* For those who find the “Tell Ambi” voice command sequences awkward for Alexa and Google Assistant: with some grunt work, IFTTT integration gives the means for custom phrases (matching your recorded Siri Shortcuts phrases is sensible).","updated":"2019-06-05T14:11:04-07:00","url":"https://itunes.apple.com/us/review?id=980554024&type=Purple%20Software"},{"id":"1732127245","userName":"Johnhizaa","userUrl":"https://itunes.apple.com/us/reviews/id42712069","version":"1.7.5957","score":1,"title":"Cr-app","text":"Will not let me even register and says I failed registration and when I input again, it then states my e-mail already registered.  Then on top of that, I can't enter my e-mail and chosen password as I receive messages of failed login.  Horrible if you can't even get loaded into the system.  The ambi 2 is a non-start for me.  👎. I waited almost 3 months for it to arrive.","updated":"2017-08-17T14:33:29-07:00","url":"https://itunes.apple.com/us/review?id=980554024&type=Purple%20Software"},{"id":"1642797579","userName":"Akiphone","userUrl":"https://itunes.apple.com/us/reviews/id30284482","version":"1.6.10","score":5,"title":"Working very well","text":"Top notch tech support and very helpful. The app and gadget turns your non-smart A/C into a very smart climate control system, that can be controlled from anywhere. Works great.","updated":"2017-06-13T01:20:20-07:00","url":"https://itunes.apple.com/us/review?id=980554024&type=Purple%20Software"}]