[{"id":"1387354209","userName":"g.bach","userUrl":"https://itunes.apple.com/us/reviews/id202285055","version":"1.8","score":3,"title":"Lacks ONE important feature","text":"I'm glad to see this app allows users to update their UE Roll's firmware. Hopefully some future update will add ONE FEATURE THAT'S PAINFULLY LACKING—the ability to skip forward/backward to next/previous tracks directly from the speaker. And this seems like a simple fix:  double-tap (or hold) \"+\" to skip forward to next track; double-tap (or hold) \"–\" to skip backward to previous track. Until then I'll just quietly brood and listen to this otherwise wonderful speaker.","updated":"2016-06-01T07:14:40-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1447607680","userName":"Nocbug","userUrl":"https://itunes.apple.com/us/reviews/id122436004","version":"1.8","score":4,"title":"Love This App","text":"First let me say wow! What an awesome sound from the ue ROLL 2. I just purchased my second ue ROLL 2 and after pairing them together I couldn't believe the sound coming out of those little speakers. The sound quality is comparable to the Bose wave radio. So why not five stars you might ask, well it took me about three tries to get the two speakers to pair. So maybe and update would improve the reliability of pairing the two speakers quicker. Another feature that would be nice, would be, if I could film a video on my phone while the music's playing. I have the iPhone 6s Plus, as soon as I turn on the camera, The music stops playing. I suppose this is to prevent conflicts with the microphone on my phone. Would it be possible for the \"ue Roll app\" to add a feature where the microphone on my phone could be temporarily switched off while taking a video? Overall I think it's a wonderful app and a great product.","updated":"2016-09-10T10:42:46-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1617268047","userName":"Iknowyouare","userUrl":"https://itunes.apple.com/us/reviews/id36544461","version":"1.8","score":1,"title":"Disappointed","text":"Love my UE Boom 2 so was thrilled when I was given a UE Roll 2 for Mother's day .. well first we discover that we can't \"double up\" a boom with a roll! And this app doesn't work! I have d/l'd it more than once.. my iPhone, hubby's and 2 iPads trying anything to connect. ONCE I got the app to recognize the ue roll but then the info \" disappeared\". Yes I rebooted. Yes I deleted and got the app again. A few times.( and turned off every other Bluetooth item so it would have no competition).\nIf you have a roll or roll 2.. just turn on your Bluetooth and the roll.. press it's Bluetooth button (the little circle) till you hear it twirp and then your device will find the speaker and connect. Too bad I can't control power up from the iPhone/iPad like the app allows for the Boom and really really sad I can't double up!","updated":"2017-05-18T07:08:35-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1567712142","userName":"Venton O'Spleen","userUrl":"https://itunes.apple.com/us/reviews/id31278205","version":"1.8","score":1,"title":"I don't get it","text":"Ok, the speaker is connected via Bluetooth. Music is playing. It sounds great. I love the speaker but the app believes the speaker is turned off and won't do anything. The only way I've been able to get the app to work has been to shut off and restart my phone.  Then it recognizes the speaker about half the time. I tried setting up the alarm last night. I set the time and selected a dozen songs. I was awake when the alarm went off but all I heard was a very, very faint chirping noise. At least fifteen minutes after it was supposed to start it suddenly started playing music at maximum volume. I shut that off and have not been able to access the alarm function since.","updated":"2017-03-19T00:55:29-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1739724520","userName":"Madameconstant","userUrl":"https://itunes.apple.com/us/reviews/id42278997","version":"1.8","score":2,"title":"Got a new iPhone now it won't connect","text":"So, I've loved my UE Roll up until I just updated my iphone. For some reason the Bluetooth won't even show up on my phone as an option and I've tried everything from a soft reset of my phone and UERoll, deleting and downloading the app again, and hard reset. Nothing will help! On my app, the only setting I can even change is the messages. Everything else on the app settings shows it unavailable to be changed. Please fix it or update whatever is causing it not to connect!","updated":"2017-08-22T11:09:46-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1409669643","userName":"That 💋Gurl","userUrl":"https://itunes.apple.com/us/reviews/id324611444","version":"1.8","score":3,"title":"I want to love it because I think its cute 🙃","text":"I was loving my new little speaker until after I downloaded the new upgrade on the app and now the app will not connect to the speaker anymore that's no fun because it is difficult to turn on/off button \nI have long fingernails 💅🏾 LOL \nAlso I'm dying to get a floaty the company said they are no more floaty's available boo-hoo on me 😡","updated":"2016-07-11T05:27:03-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"3413916627","userName":"Wrigleyfilms","userUrl":"https://itunes.apple.com/us/reviews/id190605501","version":"1.8","score":1,"title":"iPhone XS Max compatibility","text":"I recently upgraded to the xs max and now my Speaker will not connect to my phone. It turns on through the app and after trying to connect from Bluetooth it says “cannot power on UE roll, turn the speaker on manually” this wouldn’t be an issue if the app didn’t already turn the speaker on. When going to the Bluetooth settings the speaker doesn’t even show up. Which leads me to believe it’s not compatible with my new phone. Which is saddening because I love this speaker. It’s the only speaker I’ve ever bought and I use it all the time. Please fix this issue.","updated":"2018-11-13T08:10:52-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1546859850","userName":"Desert Ratski","userUrl":"https://itunes.apple.com/us/reviews/id33415450","version":"1.8","score":4,"title":"Updated Review: Works fine now!","text":"I had left a bad review prior to getting in touch customer service (duh), and I was helped quite effectively by a young man with an accent who was truly dismayed when my first try at his remedy failed. The second try was successful and now my phone quickly recognizes the speaker and there's been no problem in the ensuing few weeks since I first called them. Love the speaker AND the customer service!","updated":"2017-02-17T22:02:45-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1651055944","userName":"Coolradiation","userUrl":"https://itunes.apple.com/us/reviews/id25229877","version":"1.8","score":1,"title":"After a year","text":"The ue rolls are great. Love them when paired. But that's not what the review is for. This app is consistently unable to find speakers or pair them. Often when I turn one on it won't see the second, or they're both connected but won't link. I now am getting used to trying to get them set up on the walk to the beach, so they can play music once there, because it can take so much time. The last time it saw one speaker but not the other, both fully charged, I restarted the program and it couldn't find the either speaker. It needs a new update","updated":"2017-06-20T06:12:26-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1437527426","userName":"Graysick","userUrl":"https://itunes.apple.com/us/reviews/id118476137","version":"1.8","score":5,"title":"Great App/Product","text":"A lot of people are leaving bad reviews because they're having issues connecting to the PRODUCT.  The app is great.  Many of the issues people are having can likely be attributed to user error.  You should definitely download the app if you have the Roll.  Allows you to install latest firmware and set alarms etc","updated":"2016-08-22T15:40:49-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"2013798031","userName":"JimmyShaw.net","userUrl":"https://itunes.apple.com/us/reviews/id250594717","version":"1.8","score":4,"title":"Great speaker and app","text":"I have had no problem connecting to my Roll 2 but am disappointed that I can't pair the roll with my boom 2 speakers. I bought this speaker for its small size.  I'd love a similar sounding speaker that is a little smaller.  The main reason I got the roll 2 is to use for my son's Halloween costume so we could add sound accent to it but a slightly smaller one would allow fir it to be worn easier.","updated":"2017-12-20T22:26:48-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1571982165","userName":"Reymon17","userUrl":"https://itunes.apple.com/us/reviews/id558507279","version":"1.8","score":5,"title":"Fantastic app and app not connecting solved!","text":"I love this app so far but I had problems connecting my speaker to the app and I found a way for the app to recognize my speaker all we have to do is turn off Bluetooth and speaker and then turn ur phones power or restart and once done reconnect speaker to Bluetooth and launch the app and kaboom problem solved ur welcome 😊","updated":"2017-03-24T20:28:50-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1667743036","userName":"Joey rizzle","userUrl":"https://itunes.apple.com/us/reviews/id120393809","version":"1.8","score":5,"title":"People connect","text":"Give us the option to delete other people from this device! Every time im home i have to tell people to disconnect from the speaker otherwise i hear all their audio 😡 Im literally fighting for a connection every time it turns on. Other than that great product.","updated":"2017-07-03T17:01:34-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1519873773","userName":"Philranger13","userUrl":"https://itunes.apple.com/us/reviews/id37488766","version":"1.8","score":4,"title":"Works Great!!","text":"My speakers work great.  I love that I can connect two together and really crank out the sound.  The only thing that I could use to make it better is the iPad app needs a landscape format. I use the speakers in my classroom and connect to my iPad which is usually in landscape mode.  It would be a bit easier to use.   Otherwise I dig the products.","updated":"2017-01-11T05:54:11-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1399756862","userName":"Terrance Mckenna","userUrl":"https://itunes.apple.com/us/reviews/id421439646","version":"1.8","score":1,"title":"Problem","text":"My stereo is having trouble pairing to the app, it used to connect and i was able to use all of the features the app has to offer. Now im only able to play my music and use it as a normal bluetooth speaker. If i try to open the app it will not recognize my speaker and i cannot use the equalizer, access the settings, or use the remote control. Ive tried just about everything and the speaker is still not able to pair to the app. Very sad to see this happen for such a high quality speaker.","updated":"2016-06-24T13:39:51-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"2212806218","userName":"Euphoniman","userUrl":"https://itunes.apple.com/us/reviews/id37061159","version":"1.8","score":5,"title":"No more demons!","text":"I used to be scared that demons would come out of my shower head. I had an idea of using my phone to play music but I couldn’t take it in the shower so the music was bugging my fam. I used the waterproofness of the UE Roll to take it in the shower! Now I don’t even think about the demons lurking in our water pipes!","updated":"2018-02-15T18:15:53-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1678004090","userName":"Monkey on demand 🙈🙉🙊","userUrl":"https://itunes.apple.com/us/reviews/id327557927","version":"1.8","score":4,"title":"On and off button","text":"I love this speaker. It's in a very convenient size with great sound. I just wish that the app would let me turn on the speaker instead of having to go to the speaker itself and do it. I know it sounds as if I'm just being lazy but if you think about it, it's way more convenient.","updated":"2017-07-11T06:01:07-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1496443984","userName":"Bokashi","userUrl":"https://itunes.apple.com/us/reviews/id334038727","version":"1.8","score":4,"title":"Missing voice only preset for equalizer","text":"I love using the MEGABOOM, so I got a ROLL because it is easier for while I am traveling. Generally it is great, but my megaboom has a pre-set equalizer option for when I listen to audiobooks. There is no preset option for this on the roll and I'm not savvy enough to get it set as well as it sounds on the megaboom.","updated":"2016-12-05T04:56:13-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1390746547","userName":"Lushow70","userUrl":"https://itunes.apple.com/us/reviews/id223042187","version":"1.8","score":1,"title":"Everything was cool, until...","text":"I've had the UE ROLL speaker for a few months and everything was cool with it until a couple of days ago that the app would not connect to the speaker. I can hear the sounds and music I play with my IPad but cannot make the app work. I tried everything and cannot make it work. It's frustrating...! Iwant to use it as my alarm like I was until a couple of days ago and it will not show the alarm or any features on the app.","updated":"2016-06-07T20:54:46-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"2114174717","userName":"Doodle controller","userUrl":"https://itunes.apple.com/us/reviews/id420747914","version":"1.8","score":4,"title":"Love the alarm feature","text":"Great app but I have a small wish list of features for you to add. \n\nAdd a force touch feature to the app icon. I only open the app to set the alarm and power the device on and if you had a force touch menu with those things it would be perfect.","updated":"2018-01-21T23:24:20-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1975453811","userName":"Leatherbird","userUrl":"https://itunes.apple.com/us/reviews/id417198994","version":"1.8","score":1,"title":"Better results when SKIPPING this app","text":"The early days of this app were very promising and it was fun to use. But in the year since it was last updated, it’s completely fallen apart. Using the app to connect to a UE ROLL or ROLL 2 is terribly ineffective. You’ll find yourself being startled when (if) it actually works. The ROLL and ROLL 2 are still great products though. For best results DELETE the app (Or skip the download entirely), and simply connect manually through the IOS Bluetooth settings.","updated":"2017-12-06T10:10:03-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"2322930020","userName":"bprime0","userUrl":"https://itunes.apple.com/us/reviews/id49254906","version":"1.8","score":3,"title":"So no power option?","text":"The main reason I downloaded this app was the ability to turn my speaker on/off without having to physically do it... So now, for some reason, I can’t. That function is now gone. I love your speakers, but this app is almost useless now.","updated":"2018-03-19T05:06:44-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"2467789274","userName":"shsrkyj428","userUrl":"https://itunes.apple.com/us/reviews/id776992784","version":"1.8","score":2,"title":"Speaker","text":"After having the original ue roll for a long time now it has taken a fair bit of abuse. Nothing major dropped a few times and went for a swim last year never had an issue until today, when I dropped it on the floor from about 4 feet high the speakers broke and now don’t work. I’m kinda disappointed about that. Thank you have a good day","updated":"2018-04-25T14:44:35-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"4295373440","userName":"HeyNeenz","userUrl":"https://itunes.apple.com/us/reviews/id38507361","version":"1.8","score":1,"title":"No update on 3 years","text":"A little attention to this app would be nice. At the very least, optimize the screen to fit the newer phones! It doesn’t connect all the time so it will occasionally need to be re-paired with the iPhone. \n\nI still really like the speaker itself. I do wish there were forward, back and pause buttons on the speaker itself. A waterproof speaker but you still need your phone to control it.","updated":"2019-06-10T06:44:50-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1460160850","userName":"AzHellion","userUrl":"https://itunes.apple.com/us/reviews/id338547170","version":"1.8","score":5,"title":"Love the speaker, love the App","text":"The app perfectly matches the UE roll 2, simply and simply amazing. The sound quality from the speaker is unreal, durability is insane. The App is very simple and quick to navigate, the power on from device is a cool little trick","updated":"2016-10-03T01:05:37-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1828083677","userName":"Commuter/Mt biker","userUrl":"https://itunes.apple.com/us/reviews/id242250769","version":"1.8","score":5,"title":"I use it all the time","text":"Great app. I use it to double up two speakers. \nMany other Bluetooth speakers don't have that ability. \nWorks well to turn on and off also.","updated":"2017-10-04T22:51:33-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"2054794678","userName":"Benosam123","userUrl":"https://itunes.apple.com/us/reviews/id563614402","version":"1.8","score":3,"title":"Not as good as it used to be","text":"I used to be able to turn on my Bluetooth speaker with the app but I can’t anymore. And when I turn the speaker on manually, the app recognizes that a speaker is connected but you are not able to turn the speaker off","updated":"2018-01-03T18:50:39-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"3154733940","userName":"Doctor “T\"","userUrl":"https://itunes.apple.com/us/reviews/id241236147","version":"1.8","score":3,"title":"Alarm problem","text":"You can’t keep the alarm consistent and won’t let you save the alarm you just made. All I ask for is just Acknowledgment that you saved your alarm. But overall app is really efficient and smooth.","updated":"2018-09-04T22:33:38-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"3331667538","userName":"snowmalinois","userUrl":"https://itunes.apple.com/us/reviews/id556058844","version":"1.8","score":5,"title":"UE roll","text":"Once it has updated it connect immediately and the sound quality is amazing I can’t wait to get the replacement for the UE Roll","updated":"2018-10-22T10:44:01-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1397629191","userName":"MrGoFast","userUrl":"https://itunes.apple.com/us/reviews/id328517140","version":"1.8","score":3,"title":"Lacks some major features...","text":"Wish UE should make a firmware update to use double tap \"+\" to skip forward a track and double tap \"-\" to go back a track on the speaker and speakerphone capabilities ASAP! \nOther than that, app works alright.","updated":"2016-06-20T10:40:02-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1536483940","userName":"MjWolf95","userUrl":"https://itunes.apple.com/us/reviews/id185185337","version":"1.8","score":2,"title":"Block Party","text":"The block party portion of the app, or double up, consistently reports issues. I have deleted and reinstalled the app, I've even restored my phone and set up as new. I am still having issues with this service. Sad to see this from such a high quality audio company.","updated":"2017-02-03T12:48:40-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"2080084276","userName":"washington.matt","userUrl":"https://itunes.apple.com/us/reviews/id116903272","version":"1.8","score":3,"title":"What happened to the in-app power button?","text":"Latest update removed the in-app power button, unless I’m missing something...\nPlease bring back the power button.","updated":"2018-01-11T17:50:46-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1397733202","userName":"Unknown321123","userUrl":"https://itunes.apple.com/us/reviews/id117763236","version":"1.8","score":2,"title":"Not Reliable","text":"I had my speaker for a few months and loved it. I decided to buy another so I could pair them both. I got them both paired and then after a few days neither of them would connect to Bluetooth. Good sound quality, but not reliable.","updated":"2016-06-20T16:44:23-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"7094408056","userName":"Listening_guy","userUrl":"https://itunes.apple.com/us/reviews/id216152083","version":"1.8","score":1,"title":"Haven’t been able to open this app for a year","text":"App used to work with my UE Roll 2 speaker. Now it hasn’t gotten an update in 4 years and no longer opens (app attempts to open and immediately crashes).\n\nDisappointed in the lack of basic support for this app","updated":"2021-03-12T05:04:36-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"2235820102","userName":"zieglish","userUrl":"https://itunes.apple.com/us/reviews/id37109721","version":"1.8","score":4,"title":"Awesome speakers","text":"Love the quality. Sound and ability to get the, wet at the beach or pool.  The only downfall I could give ( 4 stars) is not on the speaker( 5 stars on the hardware)  but on he app that not compatible with iPad.  But def a blue tooth speaker to get.","updated":"2018-02-22T09:08:25-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1474028399","userName":"Sissy2344","userUrl":"https://itunes.apple.com/us/reviews/id118550153","version":"1.8","score":3,"title":"Issues","text":"It worked perfectly fine for awhile then started acting up, took (hours) to pair and whenever I use the UE roll app to pair both speakers it says \"not paired to iPhone\" even when it is causing the speakers not to pair together.","updated":"2016-10-27T14:56:35-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1722431973","userName":"AbbyLynn96","userUrl":"https://itunes.apple.com/us/reviews/id230635402","version":"1.8","score":3,"title":"I can't","text":"I have tired charging my speaker while trying to listen to music, but the speaker always turns off. Has anyone else had this problem?","updated":"2017-08-10T20:51:29-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1414083500","userName":"4mydeb","userUrl":"https://itunes.apple.com/us/reviews/id103773368","version":"1.8","score":1,"title":"Great with just one....but 2!!?!?!","text":"Not reliable at all. Can connect one with no problem but 2 is not reliable at all! When they are both connected there is breaking in the music, one goes in and out, they don't stay connected and then won't connect at all! Horrible and wish I had only purchased one.","updated":"2016-07-17T09:24:58-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1591304187","userName":"Weebo313","userUrl":"https://itunes.apple.com/us/reviews/id449178392","version":"1.8","score":5,"title":"Ue Roll2","text":"I love the app and that it gives you all the basic controls and functionality from the app..... great sound","updated":"2017-04-17T15:18:42-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"5812568836","userName":"Milanamobile","userUrl":"https://itunes.apple.com/us/reviews/id359845171","version":"1.8","score":2,"title":"Can’t get UE ROLL To connect to my Bluetooth UEBoom 3","text":"Just received my UE Boom 3. Wanted to connect to Btooth to use the EQ abilities and no luck. I’ve deleted the the app and reinstalled still no luck.  Any tips as to how I might get this working I would greatly appreciate it.","updated":"2020-04-14T17:38:43-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1995151907","userName":"Envinyanta","userUrl":"https://itunes.apple.com/us/reviews/id31680376","version":"1.8","score":1,"title":"App doesn’t work","text":"It hasn’t been updated in a year and it freezes and crashes when you try to run it with the phone connected to the speaker via Bluetooth. I don’t know if it’s because of iOS 11 or something else but they need to update their app.","updated":"2017-12-13T23:38:54-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"6177445379","userName":"nina_reviews","userUrl":"https://itunes.apple.com/us/reviews/id1188144922","version":"1.8","score":1,"title":"It doesn’t support the original mini booms","text":"I have a mini boom and it still works and everything but I need the app sometimes to check how much percent my speaker has but I can’t do that since it doesn’t have an app for it.","updated":"2020-07-09T09:50:54-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1425464455","userName":"TommyCMike","userUrl":"https://itunes.apple.com/us/reviews/id125956553","version":"1.8","score":2,"title":"Needs work","text":"Great idea for an app, however it needs work. The app won't recognize my speaker after just 1 day. Don't advertise the app on the package if it doesn't work correctly. This would be lights out if the app worked","updated":"2016-08-02T20:12:45-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"2345166264","userName":"Ruger41mag","userUrl":"https://itunes.apple.com/us/reviews/id548208684","version":"1.8","score":4,"title":"Great app","text":"This is afresh app for the UE Roll to control it and to make dj parties with it for fun and entertainment. I just wish they would make a update so you can use it with the Apple Watch.","updated":"2018-03-25T07:17:18-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1544547020","userName":"Bob & Staca","userUrl":"https://itunes.apple.com/us/reviews/id17100944","version":"1.8","score":1,"title":"Doesn't work with other UE devices","text":"Have a Boom 2 and a Roll 2 that worked fine together until this update. Now, different devices cannot be paired together. This update made things worse for me. Tech Support said they \"might fix this in the next update\". Thanks for nothing, Ultimate Ears!","updated":"2017-02-14T14:18:12-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"4492968200","userName":"goose not happy","userUrl":"https://itunes.apple.com/us/reviews/id785501098","version":"1.8","score":2,"title":"UE2","text":"I’m having the same problem.... won’t let me double up speakers... when volume is at its highest it’s all static and no crisp sound. Sometimes the apt works sometimes not . Love the speakers but getting frustrated!!!","updated":"2019-07-20T11:16:14-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"6936565160","userName":"Peter Traveler","userUrl":"https://itunes.apple.com/us/reviews/id4434168","version":"1.8","score":1,"title":"Remove this from the App Store","text":"If this isn’t going to be maintained and won’t work with the latest iOS updates (it crashes upon attempted launch), it should be removed from the App Store.","updated":"2021-01-31T06:38:23-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"4757066319","userName":"Henry Ford 2","userUrl":"https://itunes.apple.com/us/reviews/id105837093","version":"1.8","score":1,"title":"connection after phone update","text":"My phone shows the speaker as available however the app doesn’t locate the speaker can’t use the speaker until fix is made. I loved using this speaker was awesome.","updated":"2019-09-10T05:36:31-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1886753916","userName":"2e32","userUrl":"https://itunes.apple.com/us/reviews/id42676969","version":"1.8","score":1,"title":"Double-Up doesn’t work","text":"So for about 1 month the double up featured worked fine. My speakers then started to fade in and out by themselves when doubled up and finally about a week after that now they will not double up. UE fix this please.","updated":"2017-10-30T20:40:45-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"3701425094","userName":"Fer2girl","userUrl":"https://itunes.apple.com/us/reviews/id190907273","version":"1.8","score":1,"title":"The app won’t recognize my iPhone.","text":"I downloaded the app a few days ago and I’ve been trying to get it to recognize my speaker but it won’t. I restarted my phone and disconnected and reconnected the speaker the app but nothing works.","updated":"2019-01-27T08:46:01-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1351734072","userName":"Bigtrain818","userUrl":"https://itunes.apple.com/us/reviews/id37122999","version":"1.7","score":3,"title":"Works just fine so far... But no Apple Watch support","text":"I have been using the roll in my shower and the app seems to function ok, I haven't had any problems with it so far. I did notice that it doesn't have Apple Watch support. I think this would be a great feature. The remote power on feature with your watch is the killer feature this is missing in my opinion. You can already control or play music from your watch why not power on your speaker and change EQ from watch. Honestly all the things the that the app can do today features and all you could don on the watch.","updated":"2016-03-22T06:53:18-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1575138013","userName":"Isaia717","userUrl":"https://itunes.apple.com/us/reviews/id41203296","version":"1.8","score":2,"title":"Keeps crashing when I try to set alarm","text":"Love the app, very useful, but I  really need the speaker for an alarm and it is not allowing me to set one due to it continuously crashing and exiting out.","updated":"2017-03-28T21:54:44-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1575889386","userName":"AA Manhattan","userUrl":"https://itunes.apple.com/us/reviews/id42681295","version":"1.8","score":4,"title":"New update destroyed this app","text":"Can no longer maintain connection   Please fix","updated":"2017-03-29T20:32:08-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1468023200","userName":"A generic name is taken","userUrl":"https://itunes.apple.com/us/reviews/id482833393","version":"1.8","score":5,"title":"Why all the hate??","text":"The speaker is amazing and the app is too. Haters gonna hate.","updated":"2016-10-16T16:07:07-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"6637886197","userName":"Yadian Alba","userUrl":"https://itunes.apple.com/us/reviews/id267241969","version":"1.8","score":1,"title":"App crash","text":"My app is crashing every time I try to open it. After I updated to the latest iOS 14.2, this is been happening.","updated":"2020-11-12T11:44:04-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1556419545","userName":"Driftin s14","userUrl":"https://itunes.apple.com/us/reviews/id171045637","version":"1.8","score":1,"title":"App not working","text":"Used one morning for an alarm, worked flawless and was an amazing feature... now the next day the app will not recognize that the speaker IS paired looks like it's been a long existing issue with UE apps.     Unreliable!!","updated":"2017-03-03T02:11:03-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1416197719","userName":"JC-Berkeley","userUrl":"https://itunes.apple.com/us/reviews/id209331082","version":"1.8","score":2,"title":"Unreliable bluetooth","text":"Sound is great when connected.  However, every other time I have to restart the pairing process.  Must be a fixable bug.  Hire a consultant!","updated":"2016-07-20T10:11:56-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"5732140628","userName":"Jwedge1","userUrl":"https://itunes.apple.com/us/reviews/id159875719","version":"1.8","score":1,"title":"UE Roll does not work","text":"Upgraded my iPad now EU Roll does not connect via Bluetooth ...iPad can not find it. Looked and app is very old. Don’t tell me my nice EU Roll no longer supported.\n\nI will go to my grave screaming agains UE...very shameful you guys.\nJose DaCunha","updated":"2020-03-29T11:46:53-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"2148165438","userName":"Retro-Classic-Rover","userUrl":"https://itunes.apple.com/us/reviews/id19643764","version":"1.8","score":1,"title":"iPhone X Update?","text":"Will this app ever get updated for iPhone X? Does anyone at UE/Logi own an iPhone X? Are the developers proud of their app being looking old and left behind?\n\nYeah, I think it’s time to go with a different company. This (cr)app is more than likely abandoned!\n\n💩💩💩","updated":"2018-01-30T20:54:09-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"2390274993","userName":"15 nelson","userUrl":"https://itunes.apple.com/us/reviews/id677167335","version":"1.8","score":5,"title":"Ue roll","text":"I wish the ue roll update this year.","updated":"2018-04-06T04:34:55-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"2915793134","userName":"Lou966","userUrl":"https://itunes.apple.com/us/reviews/id403165928","version":"1.8","score":1,"title":"App not working","text":"The app is not working at all. Have uninstalled and installed back so many times and nothing. Hope this can be fixed please.","updated":"2018-07-16T00:31:34-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"6731634528","userName":"lu790456","userUrl":"https://itunes.apple.com/us/reviews/id344600142","version":"1.8","score":2,"title":"App issue","text":"Speaker still connects. App does not open/work anymore","updated":"2020-12-08T11:46:52-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"3635783957","userName":"Lix740","userUrl":"https://itunes.apple.com/us/reviews/id147627842","version":"1.8","score":1,"title":"Can’t seem to pair it with my iPhone XS Max","text":"I loved my UE Roll, but since I got my new iPhone XS Max it doesn’t seem to pick it up. I’ve tried deleting and re-installing the app but to no avail. Any other options?","updated":"2019-01-10T18:19:28-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1951399615","userName":"Bowen_Ormond","userUrl":"https://itunes.apple.com/us/reviews/id662896806","version":"1.8","score":1,"title":"Can’t Use The App","text":"The speaker works fine. That’s not the problem. The app just doesn’t recognize that I’m connected to the speaker so I can’t do anything with the app. Kinda useless tbh.","updated":"2017-11-26T16:09:16-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1603858542","userName":"EvilSRT","userUrl":"https://itunes.apple.com/us/reviews/id289921209","version":"1.8","score":5,"title":"Amazing","text":"Works great and comes in handy","updated":"2017-05-03T02:25:59-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"2219500941","userName":"Poyavision","userUrl":"https://itunes.apple.com/us/reviews/id436064898","version":"1.8","score":1,"title":"Doesn’t work properly with iOS 11","text":"Dear developers Before updating to iOS 11 i could turn on/off the UE Roll2 by the phone without pushing it’s buttons. Solve the issue please.","updated":"2018-02-17T13:50:32-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"2517718689","userName":"Copper wombat","userUrl":"https://itunes.apple.com/us/reviews/id115600995","version":"1.8","score":2,"title":"Yo fix this","text":"The remote control function in the app doesn't work for iPhone 7's and newer.","updated":"2018-05-07T15:27:37-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"8017380122","userName":"Wont connect!","userUrl":"https://itunes.apple.com/us/reviews/id478191121","version":"1.8","score":1,"title":"Won’t connect","text":"Even when I’m following the directions to a T, the darn thing won’t connect","updated":"2021-11-12T15:08:51-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"3862846680","userName":"TARhodes","userUrl":"https://itunes.apple.com/us/reviews/id31814332","version":"1.8","score":1,"title":"Always drops","text":"The app doesn’t work, the speakers are impossible to sync, when it does it connects with wonderboom. Very frustrating","updated":"2019-03-09T14:24:17-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"2047973234","userName":"ReeseRicky","userUrl":"https://itunes.apple.com/us/reviews/id33939072","version":"1.8","score":2,"title":"Won’t connect to iPhone X","text":"Loved it with my 6...it won’t pair with my X.  I’ve tried everything.  Please fix","updated":"2018-01-01T12:21:27-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1916317855","userName":"96aman96","userUrl":"https://itunes.apple.com/us/reviews/id229264066","version":"1.8","score":1,"title":"App crash","text":"The app hasn't been updated in months and iOS 11 broke the alarm functionality. \nPlease fix it.","updated":"2017-11-12T11:24:51-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1386003256","userName":"Dustin_UT","userUrl":"https://itunes.apple.com/us/reviews/id179234794","version":"1.8","score":1,"title":"App doesn't recognize the Roll is connected","text":"My roll is connected and plays music, but the app won't connect to it...","updated":"2016-05-29T11:13:31-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"7194355897","userName":"Frontsideair","userUrl":"https://itunes.apple.com/us/reviews/id478569451","version":"1.8","score":1,"title":"Instant crash","text":"It crashes, please issue an update","updated":"2021-04-07T07:08:31-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1468552502","userName":"Buzzfeedlovah","userUrl":"https://itunes.apple.com/us/reviews/id431287042","version":"1.8","score":1,"title":"Doesn't work anymore","text":"Doesn't connect anymore please fix","updated":"2016-10-17T15:39:34-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"2086682099","userName":"selina27","userUrl":"https://itunes.apple.com/us/reviews/id254625296","version":"1.8","score":1,"title":"cant connect after I change iPhone X","text":"how to solve the problem:(","updated":"2018-01-13T17:47:49-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"7151383874","userName":"dnuoforp","userUrl":"https://itunes.apple.com/us/reviews/id23468031","version":"1.8","score":1,"title":"Crashes","text":"Won’t launch","updated":"2021-03-27T09:54:46-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1806192591","userName":"viccarious","userUrl":"https://itunes.apple.com/us/reviews/id38745216","version":"1.8","score":1,"title":"Can’t turn on with app on ios11","text":"Can no longer turn it on with the app after ios11 upgrade - pls fix","updated":"2017-09-23T15:23:56-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"3046038381","userName":"O0jh","userUrl":"https://itunes.apple.com/us/reviews/id531375324","version":"1.8","score":1,"title":"IOS 11 broke remote power capability","text":"It seems like obsolete products don’t need any more attention..","updated":"2018-08-10T10:53:36-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"5772767696","userName":"HfsZxgfrer","userUrl":"https://itunes.apple.com/us/reviews/id514819524","version":"1.8","score":1,"title":"CRASHING","text":"The app keeps crashing! every time I open it.....","updated":"2020-04-06T14:29:25-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"6717496449","userName":"SofZarf","userUrl":"https://itunes.apple.com/us/reviews/id36648428","version":"1.8","score":1,"title":"Stopped working","text":"The app stopped working","updated":"2020-12-04T12:19:47-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"2903514044","userName":"spicychillies","userUrl":"https://itunes.apple.com/us/reviews/id86048453","version":"1.8","score":2,"title":"Bluetooth Smart","text":"Please fix it for iPhone X. Thank-you 🙏🏼","updated":"2018-07-13T20:16:26-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1586452941","userName":"hansjim","userUrl":"https://itunes.apple.com/us/reviews/id15546393","version":"1.8","score":1,"title":"Buggy app","text":"Linking two UE Rolls is like pulling teeth . \n\nVery buggy and doesn't always work on the first\nor fifth or sixth time for that matter . \n\nNot too impressed but Logitech has really gone downhill . \n\nAudio quality is pretty good though.","updated":"2017-04-11T13:40:22-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1390565316","userName":"Z-1975","userUrl":"https://itunes.apple.com/us/reviews/id36610214","version":"1.8","score":1,"title":"Bad app","text":"Doesn't connect reliably.   Ridiculous.  Fix this please.","updated":"2016-06-07T11:35:19-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1406654332","userName":"Aaronduck11","userUrl":"https://itunes.apple.com/us/reviews/id512607793","version":"1.8","score":5,"title":"Best speaker app ever","text":"Awesome for parties!","updated":"2016-07-06T15:00:30-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"4877434796","userName":"omgpliable","userUrl":"https://itunes.apple.com/us/reviews/id30254034","version":"1.8","score":2,"title":"Would be dope if app was updated. Been a while","text":"Blah","updated":"2019-10-03T03:47:45-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1542487990","userName":"Xpojoe","userUrl":"https://itunes.apple.com/us/reviews/id412596960","version":"1.8","score":5,"title":"Boss","text":"It's boss.","updated":"2017-02-11T15:50:13-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1249937905","userName":"DanMan1292","userUrl":"https://itunes.apple.com/us/reviews/id42162870","version":"1.0","score":5,"title":"APP PROBLEM FIX!!","text":"For anyone having the issue I have had for the past 24 hours, being that the app would connect but not allow using any features. I called the support system and apparently you have to reset the ROLL after every update. To do this, disconnect the roll from the phone and hold the roll's power button+volume minus for 10 seconds. This should result in the power shutting off. Upon power on the Bluetooth button will flash to indicate a fresh reboot and requirement to reconnect a device. After reconnection, the app should work like before. I hope this helps everyone reading this for this issue.","updated":"2015-08-28T15:57:35-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1231971910","userName":"GoodEyePhotography","userUrl":"https://itunes.apple.com/us/reviews/id85269108","version":"1.0","score":2,"title":"UE Roll speaker is great, app is not","text":"When I first got my UE Roll speaker I installed the UE Roll app and connected no problem. After I used the app to update the speaker's firmware, however - the app only \"sees\" the speaker when the speaker is powered off. The app can remotely see the battery life when the speaker is off, and it can remotely power ON the speaker - but once the speaker is on, the app thinks it's no longer connected. Mind you, the phone still plays fine to the speaker, I can control the volume with my iPhone volume buttons as well as my watch \"now playing\" app – but I can't use any other features of the App like equalizer, double up, and presumably future firmware updates.\n\nI've tried uninstalling/reinstalling the app as well as repairing the Bluetooth speaker — problem is unchanged. \n\nI called Logitech customer support three times and each time got mysteriously disconnected... Yay. \n\nSo... Super happy with the speaker, but the app and customer service is frustrating beyond reason. Hope an update to the app fixes this.","updated":"2015-07-23T11:20:22-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1266389818","userName":"Donz0411","userUrl":"https://itunes.apple.com/us/reviews/id206533585","version":"1.1","score":3,"title":"Trouble charging","text":"Just downloaded this app since I had to connect the device. App really doesn't offer anything and for what I will use it for is fine. Turns on and off no problem. The sound from the speaker is great. I like it very much, but the speaker came 40% charged. I used it for a half hour and tried charging it. It's at 30%. It has been turned off to charge. Tried with it turned on as well but won't charge. The battery in the app doesn't show it charging. Maybe I'm doing something wrong but charging a device should be a simple process.","updated":"2015-10-03T08:55:29-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1362437738","userName":"Govols74n","userUrl":"https://itunes.apple.com/us/reviews/id125792412","version":"1.7","score":3,"title":"Not working","text":"App no longer works with my UE ROLL. It worked for 4 days and now absolutely nothing. Cant utilize the equalizer or volume and power controls. Keeps telling me to make sure that my phone is connected to the UE Roll. Well, it is. I have disconnected and reconnected over and over. Have uninstalled the app, have told my phone to forget the bluetooth signal.....and upon reinstalling everything it still doesnt recognize that the speaker is connected.\n\nEdit: had to do a factory reset on the UE ROLL, re pair to the iphone and it is working again for now. Will update in a week or so.","updated":"2016-04-12T07:13:07-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1322773657","userName":"Sirlancelot321","userUrl":"https://itunes.apple.com/us/reviews/id123930361","version":"1.7","score":3,"title":"Great, but has stability issues/is a little bit buggy","text":"Wireless powering on is great, EQ is decent for what the speaker is. My biggest issue is with the alarm. Any time I try and navigate to the alarm page the App crashes. It's very frustrating. Also Block Party occasionally won't let other devices connect for some reason. Aside from those things, the app pretty great!","updated":"2016-01-26T08:13:14-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1241546959","userName":"Xoomin","userUrl":"https://itunes.apple.com/us/reviews/id86781528","version":"1.0","score":5,"title":"Great Optional Config Panel","text":"The app is a perfect little settings config panel for tweaking the EQ. \n\nYou don't need to download it if you don't want to. \n\nI was apprehensive reading all the negative reviews but they seem to be related to setup RT*M issues. As long as you pair with your phone before using it there is no confusion. It won't walk you through going to Bluetooth settings to press the connect button, but if you don't need that help, Kudos and enjoy a great product. \n\nThe manufacturers made a mistake by triggering the suggested download on pairing, making the average user assume you NEED this app. If you WANT this app for config changes or firmware updates, download it. \n\nIt's simple, fast, and looks great.","updated":"2015-08-11T11:32:48-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1252254751","userName":"sam-vilde","userUrl":"https://itunes.apple.com/us/reviews/id178600317","version":"1.0","score":2,"title":"Fix, please","text":"Just got the speaker (love it). Based on these reviews (especially from GoodEyePhotography) there's no way I'm updating the firmware and risking losing any functionality. I like that you can power on/off the speaker from the app. Please fix whatever is broken, according to all the reviews here so that it becomes useful.\n\nEDIT: boy am I dumb. I said I wasn't going to update the firmware, but then two weeks later I did it anyway. And guess what? Now the app is useless, even though I disconnected and rebooted. Sigh. Fix please.","updated":"2015-09-02T16:23:13-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1372664521","userName":"Piano Quartz","userUrl":"https://itunes.apple.com/us/reviews/id29479254","version":"1.7","score":4,"title":"Add a Today screen widget!","text":"This app has the basics covered, even if it's a bit janky here and there (a randomly different font for the continue button, really?). \n\nA feature like remote power, though, really would work better as a widget (or as some have said, a watch app). It would be great to see an update that added this.","updated":"2016-05-02T21:27:09-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1362048998","userName":"Paterowell","userUrl":"https://itunes.apple.com/us/reviews/id135000969","version":"1.7","score":1,"title":"This app needs to be updated!!!","text":"The speaker is great, but the app is worthless. It worked well when it worked, but as soon as my phone updated its iOS, the app won't recognize the speaker. Now, you can't use the remote on/off, EQ settings, alarm, double up, etc. None of the features work. I have called customer service and they acknowledged that they needed to update the app, but I can see this same problem from some of the reviews in January 2016. Very disappointing.","updated":"2016-04-11T10:57:01-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1280737343","userName":"Jondoe2003","userUrl":"https://itunes.apple.com/us/reviews/id86567585","version":"1.5","score":3,"title":"Hold power button and volume down","text":"If you have trouble connecting. Disconnect via Bluetooth (forget the device) then hold those two and the speaker will reset. Seems to be working now. \n\nAlways have trouble with the alarm--it doesn't always play music even though that's selected.","updated":"2015-11-01T19:45:25-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1272761060","userName":"Jwho82742","userUrl":"https://itunes.apple.com/us/reviews/id34595079","version":"1.1","score":5,"title":"Works well","text":"The app downloaded opened and worked perfectly. It remotely updates my device, and acts as a remote control. I've had no trouble with anything, but have not tried to double up feature. Nice job UE!","updated":"2015-10-16T17:02:49-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1329155317","userName":"eaglebtc","userUrl":"https://itunes.apple.com/us/reviews/id22559399","version":"1.7","score":2,"title":"Fails to recognize the speaker even after unpair/repair!","text":"I bought a ROLL about a month ago.  Great sound, fantastic design, Bluetooth is reliable.  But the app has a MAJOR issue.\n\nWhy can't it detect my speaker when it is paired correctly with the phone and playing music normally?  \n\nI programmed an alarm at  5AM two weeks ago, and thanks to the app I can't turn it off.  The speaker goes BOOP-BOOP-BOOP over and over again.","updated":"2016-02-06T22:49:38-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1279589897","userName":"univision","userUrl":"https://itunes.apple.com/us/reviews/id16572040","version":"1.5","score":4,"title":"Works great now","text":"After the update, everything is working fine. I can now turn on/off my speaker from the app and change the EQ. I'm a bit hesitant to update the software though, because the last time I did the app couldn't find the speaker","updated":"2015-10-30T13:06:31-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1274795596","userName":"taffinito","userUrl":"https://itunes.apple.com/us/reviews/id39009749","version":"1.5","score":1,"title":"Terrible App","text":"Can’t connect to Roll without displaying “We’re having trouble finding your UE speaker” over and over and over and over. Can’t update software on Roll because app if flakey. Does not display proper battery level. Have to reconnect Bluetooth overtime speaker turns off.\n\nReinstalled app from scratch….no effect. It’s been this bad for at least 4 months. See other reviews; this is not an isolated case.","updated":"2015-10-20T22:01:48-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1320837005","userName":"Omegasupreme1","userUrl":"https://itunes.apple.com/us/reviews/id104502542","version":"1.7","score":3,"title":"Needs a real update","text":"The app was working well but now it will not stay connected to the device.  Also the volume can't be controlled from the plus or minus volume buttons on the device anymore.  Please fix these issues.","updated":"2016-01-22T22:27:18-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1327644521","userName":"Bran_Dino_Bruh","userUrl":"https://itunes.apple.com/us/reviews/id413333053","version":"1.7","score":3,"title":"Hmmm...","text":"Power button isn't showing up for me on my app. Not sure if it's bc of the versioning the app, or the fact I connected it to my iPad first. Someone help plz","updated":"2016-02-04T04:47:41-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1357732117","userName":"TheBen12","userUrl":"https://itunes.apple.com/us/reviews/id379431782","version":"1.7","score":4,"title":"Works well enough","text":"This app is well made and works fine, but the design isn't very inspired. In my experience, though, it is far better than the competition.","updated":"2016-04-02T20:57:06-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1381565388","userName":"Aliameagan205","userUrl":"https://itunes.apple.com/us/reviews/id321293086","version":"1.7","score":1,"title":"Ugh! the most frustrating purchase","text":"I really want to like these. They worked great for the first two weeks then it all fell to crap! Don't double up when I need them for my store. Wasting so much of my time. App not working properly and even after refreshing etc. Its horrible because I just want them to work according to their directions.","updated":"2016-05-20T12:51:02-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1260564839","userName":"Rjp90","userUrl":"https://itunes.apple.com/us/reviews/id133826789","version":"1.0","score":5,"title":"Future idea!! *BRILLIANT*","text":"Have a microphone option that we can talk into our phones and the sound be projected out of the speaker","updated":"2015-09-20T21:11:39-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1320719216","userName":"djhidan","userUrl":"https://itunes.apple.com/us/reviews/id432354928","version":"1.7","score":4,"title":"bugged","text":"it usually works fine but recently I can't power on the speaker through the app no more","updated":"2016-01-22T17:37:32-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1295620288","userName":"Sillysteve1487","userUrl":"https://itunes.apple.com/us/reviews/id290156340","version":"1.6","score":5,"title":"Pretty good","text":"This app does everything it's supposed to do without any issues ☺️","updated":"2015-12-04T02:07:18-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1379190420","userName":"Mac Slick","userUrl":"https://itunes.apple.com/us/reviews/id179986193","version":"1.7","score":1,"title":"Doesn't work","text":"The app failed to keep up with new versions of the operating system. The app no longer recognizes either of my speakers and therefore is useless. Have to revert to connecting through apples Bluetooth settings which makes it like any other Bluetooth speaker.","updated":"2016-05-15T12:13:49-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1370175817","userName":"junipash","userUrl":"https://itunes.apple.com/us/reviews/id207701106","version":"1.7","score":1,"title":"Useless","text":"The UE Roll is great and connects to Bluetooth fine but this app is crap. Doesn't recognize the speaker that is connected and playing music. Fix this please UE. I recommend this speaker a lot but this does really take away some convenient features it could have.","updated":"2016-04-28T07:20:19-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1280280316","userName":"KevinnnV","userUrl":"https://itunes.apple.com/us/reviews/id42566088","version":"1.5","score":4,"title":"Ayy","text":"Works and sounds great. Only problem is the layout of the app is pretty dull, and wish there was a sleep timer for the speaker.","updated":"2015-10-31T23:45:25-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1328668819","userName":"Andy1845","userUrl":"https://itunes.apple.com/us/reviews/id222268968","version":"1.7","score":5,"title":"Best app ever used daily/nightly","text":"Use app everyday and my blue ue roll all of the time everywhere I go it's amazing thank you UE🤘","updated":"2016-02-06T02:26:17-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1243271194","userName":"Spankyscolts","userUrl":"https://itunes.apple.com/us/reviews/id85013531","version":"1.0","score":1,"title":"App fizzes out","text":"At first the app was great! Except it lacked the color that was displayed in the App Store pic but after an update it is absolutely unusable in fact I've deleted it altogether ! The speaker is awesome but the app disappoints on every level .. How did you manage to break it ? It worked great for awhile","updated":"2015-08-14T20:19:59-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1320846497","userName":"thegraygrey","userUrl":"https://itunes.apple.com/us/reviews/id175713861","version":"1.7","score":3,"title":"Won't Connect To App","text":"It plays music fine but when I try to set an alarm or do anything through the app it says the UE BOOM's not connected.","updated":"2016-01-22T22:51:46-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1324621735","userName":"Omgitsmelol12","userUrl":"https://itunes.apple.com/us/reviews/id160874534","version":"1.7","score":3,"title":"Kinda","text":"App powers it on successfully but says failed to power on. Speaker works fine but once it's on the app becomes useless.","updated":"2016-01-29T18:13:47-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1284834763","userName":"wogzintheusa","userUrl":"https://itunes.apple.com/us/reviews/id23120567","version":"1.5","score":4,"title":"Really solid speaker","text":"... And this pretty useful app makes it even better.","updated":"2015-11-10T13:49:07-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1376109151","userName":"Daimone24","userUrl":"https://itunes.apple.com/us/reviews/id473293644","version":"1.7","score":1,"title":"Needs a real update","text":"The ue roll app needs a update it was working fine a coupe days ago when I got it, now it won't connect to the Bluetooth anymore and the app doesn't work please fix this problem.","updated":"2016-05-09T14:12:08-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1339822472","userName":"AZ_Realtor","userUrl":"https://itunes.apple.com/us/reviews/id210020936","version":"1.7","score":2,"title":"Cool - when it worked","text":"Worked great for an hour. Would never recognize speaker again. Useless app from that point forward.","updated":"2016-02-27T19:57:55-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1250218999","userName":"LONNIEJ2","userUrl":"https://itunes.apple.com/us/reviews/id24172548","version":"1.0","score":1,"title":"Worked the first couple times.","text":"I don't know what's up with this app but it needs some work. It just doesn't see the speaker even though it's connected. Great speaker but this software has some bugs.","updated":"2015-08-29T06:01:19-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1313998771","userName":"BIGMAC214","userUrl":"https://itunes.apple.com/us/reviews/id136930977","version":"1.6","score":2,"title":"App won't turn speaker on","text":"The app won't turn on the speaker after the new update, however I can still turn it off via the app.","updated":"2016-01-09T16:41:51-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1378634815","userName":"Shucks the fart","userUrl":"https://itunes.apple.com/us/reviews/id310676530","version":"1.7","score":1,"title":"Needs update","text":"Older iPhones may have no trouble using this app to connect, but newer ones (6 and higher) will have strong difficulty. Don't get this app until they do a huge overhaul of it.","updated":"2016-05-14T11:51:04-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1366236091","userName":"Dgordon11","userUrl":"https://itunes.apple.com/us/reviews/id27310509","version":"1.7","score":1,"title":"Don't bother","text":"Wow. What a PoC. Will not connect to the unit via my 6s+. And why would I need an alarm when I have one on the phone already? Would have liked to use the equalizer to try to get a bit of bass in the Roll but oh well.","updated":"2016-04-20T11:06:28-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1370510868","userName":"mattgelgota","userUrl":"https://itunes.apple.com/us/reviews/id7839433","version":"1.7","score":1,"title":"App must work to get stars.","text":"If your app doesn't work at all, your app gets no stars.\n\nMy UE roll connects and plays on my devices but the app can't connect with the roll so it can't be controlled through the app.","updated":"2016-04-28T23:36:57-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1262265967","userName":"approcker","userUrl":"https://itunes.apple.com/us/reviews/id28279910","version":"1.1","score":1,"title":"Awful app","text":"This app is so glitchy and does not recognize the connected speaker half the time. Bought two speakers for this purpose and does not even work. What a waste","updated":"2015-09-24T14:27:59-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1244344105","userName":"Animal1959","userUrl":"https://itunes.apple.com/us/reviews/id184798832","version":"1.0","score":1,"title":"Crashes 6th Gen iPod Touch","text":"Upon launch on iPod Touch 6th generation the app just returns to the previous screen.  If you multi-task you can see the app “open” with a all black screen.\n\nIt’s working fine on iPhone 6+.\n\nThoughts???","updated":"2015-08-16T23:28:23-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1377076625","userName":"Rbrto.fl","userUrl":"https://itunes.apple.com/us/reviews/id133573490","version":"1.7","score":1,"title":"Useless app","text":"Love my new speaker but this app fails to realize that my speaker is connected. Have tried pretty much every possible troubleshoot I can and no luck. Update and maybe 5 stars?","updated":"2016-05-11T12:10:29-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1359079364","userName":"bennybrew","userUrl":"https://itunes.apple.com/us/reviews/id424916302","version":"1.7","score":1,"title":"App/speaker major issues","text":"New speaker downloaded app, speaker would never turn on again after connecting.","updated":"2016-04-05T14:25:32-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1306739492","userName":"Chbjhbjvbjcvbbdc.","userUrl":"https://itunes.apple.com/us/reviews/id359011594","version":"1.6","score":5,"title":"Apple Watch","text":"Needs and Apple Watch expansion!","updated":"2015-12-26T18:46:19-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1245337393","userName":"Hasonjensley","userUrl":"https://itunes.apple.com/us/reviews/id12525210","version":"1.0","score":1,"title":"Good speaker, crap app","text":"When using the app speaker sometimes doesn't connect, can't use the double up feature at all! Useless!!!","updated":"2015-08-19T01:36:34-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1241374033","userName":"tqmcguire","userUrl":"https://itunes.apple.com/us/reviews/id33821078","version":"1.0","score":1,"title":"Needs Work","text":"On iPod touch 6th generation, the app immediately crashes back to the home screen when launching.","updated":"2015-08-11T04:34:38-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1365905221","userName":"Stephaniebaker22","userUrl":"https://itunes.apple.com/us/reviews/id181796574","version":"1.7","score":1,"title":"Please Fix","text":"The app doesn't work at all. It says it's not connected even though it is.","updated":"2016-04-19T17:49:13-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1244226701","userName":"ITwasJOE","userUrl":"https://itunes.apple.com/us/reviews/id103666743","version":"1.0","score":1,"title":"Doesn't work!!","text":"Great speaker. The app worked the very first time. I've been unable to get it to work since.","updated":"2015-08-16T17:33:05-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1235446443","userName":"lyunghk","userUrl":"https://itunes.apple.com/us/reviews/id109682152","version":"1.0","score":1,"title":"Unable to detect speaker","text":"It worked for about a month, then now it is unable to detect the speaker, no colored UE Roll icon","updated":"2015-07-30T07:07:26-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1374386876","userName":"minh-nguyen","userUrl":"https://itunes.apple.com/us/reviews/id163191567","version":"1.7","score":1,"title":"Doesn't work with iOS 9.3.1","text":"Please fix","updated":"2016-05-06T07:12:46-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1259063963","userName":"Aaron Harpole","userUrl":"https://itunes.apple.com/us/reviews/id27270885","version":"1.0","score":1,"title":"Love my speakers but not this app","text":"The speakers are great but this app fails to talk to my speaker.","updated":"2015-09-17T23:06:01-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1357164413","userName":"CarlosM88","userUrl":"https://itunes.apple.com/us/reviews/id463951849","version":"1.7","score":1,"title":"Does not detect","text":"App doesn't detect the speakers","updated":"2016-04-01T19:30:47-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1403028704","userName":"Nw_4wheeler","userUrl":"https://itunes.apple.com/us/reviews/id163430016","version":"1.8","score":1,"title":"Never pairs speakers.","text":"I don't know if it is the app or the sparklers. They have been used half a dozen times. Use to work great then this app was updated. Used to Power on, open app, pair, bam stereo! Now all I do is f**k with them for 10 minutes and give up! Never works.","updated":"2016-06-30T08:26:58-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"4349959150","userName":"Marcelo787","userUrl":"https://itunes.apple.com/us/reviews/id203033198","version":"1.8","score":5,"title":"Logitech U2 Roll","text":"Tengo dos, en diferentes pisos que simultáneamente escucho. Y se escuchan con muy buena calidad. #musiclover","updated":"2019-06-21T16:54:09-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1459935529","userName":"Jesse071","userUrl":"https://itunes.apple.com/us/reviews/id384628171","version":"1.8","score":5,"title":"@UE","text":"You guys should add a microphone or megaphone feature, where you talk on your phone like if it was a microphone and then you can hear yourself on the speaker.","updated":"2016-10-02T15:42:50-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"},{"id":"1238675634","userName":"qsang7","userUrl":"https://itunes.apple.com/us/reviews/id303098824","version":"1.0","score":1,"title":"not working","text":"on ipod touch 6 @ios 8.3","updated":"2015-08-05T20:15:27-07:00","url":"https://itunes.apple.com/us/review?id=987657806&type=Purple%20Software"}]